
//&После("ДоработатьЗапросОтработанногоВремени")
//Процедура УВМ_ДоработатьЗапросОтработанногоВремени() 
//	
//	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.НачисленияУдержанияОбъединенные.Элементы.НачисленияУдержания.Запрос;
//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
//			"0 КАК ИнвалидностьПроцентПотериТрудоспособности",
//			"0 КАК ИнвалидностьПроцентПотериТрудоспособности, МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение КАК ПодразделениеВСтруктуре");
//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
//	        "ОбщиеЗапросыНачисленияУдержания КАК Данные",
//			"ОбщиеЗапросыНачисленияУдержания КАК Данные
//			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&НачалоПериода {(&НачалоПериода)}) КАК увмКадроваяИсторияСотрудников
//			|	ПО Данные.Организация = увмКадроваяИсторияСотрудников.ГоловнаяОрганизация
//			|		И  Данные.Сотрудник = увмКадроваяИсторияСотрудников.Сотрудник
//			|		И  Данные.ФизическоеЛицо = увмКадроваяИсторияСотрудников.ФизическоеЛицо   
//			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия	
//			|	ПО увмКадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция");
//	СхемаКомпоновкиДанных.НаборыДанных.НачисленияУдержанияОбъединенные.Элементы.НачисленияУдержания.Запрос = ТекстЗапроса;
//	
//	Поля = СхемаКомпоновкиДанных.НаборыДанных.НачисленияУдержанияОбъединенные.Элементы.НачисленияУдержания.Поля;
//	Если Поля.Найти("ПодразделениеВСтруктуре") = Неопределено Тогда
//		НовоеПоле = Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
//		НовоеПоле.Поле = "ПодразделениеВСтруктуре";
//		НовоеПоле.ПутьКДанным = "ПодразделениеВСтруктуре";
//		НовоеПоле.Заголовок = "Структура";
//	КонецЕсли;	

//	Поля = СхемаКомпоновкиДанных.НаборыДанных.НачисленияУдержанияОбъединенные.Элементы.НачисленияУдержанияДокумента.Поля;
//	Если Поля.Найти("ПодразделениеВСтруктуре") = Неопределено Тогда
//		НовоеПоле = Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
//		НовоеПоле.Поле = "ПодразделениеВСтруктуре";
//		НовоеПоле.ПутьКДанным = "ПодразделениеВСтруктуре";
//		НовоеПоле.Заголовок = "Структура";
//	КонецЕсли;	

//	Поля = СхемаКомпоновкиДанных.НаборыДанных.НачисленияУдержанияОбъединенные.Поля;
//	Если Поля.Найти("ПодразделениеВСтруктуре") = Неопределено Тогда
//		НовоеПоле = Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
//		НовоеПоле.Поле = "ПодразделениеВСтруктуре";
//		НовоеПоле.ПутьКДанным = "ПодразделениеВСтруктуре";
//		НовоеПоле.Заголовок = "Структура";
//	КонецЕсли;	
//	
//КонецПроцедуры

//&ИзменениеИКонтроль("ПриКомпоновкеОтчета")
//Процедура УВМ_ПриКомпоновкеОтчета(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

//	Если Не СтандартнаяОбработка Тогда
//		Возврат
//	КонецЕсли;

//	КлючВарианта = ЗарплатаКадрыОтчеты.КлючВарианта(КомпоновщикНастроек);

//	Если КлючВарианта = "Т51" Тогда
//		ЗарплатаКадрыОтчеты.ПриКомпоновкеРезультатаТ51(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
//	ИначеЕсли КлючВарианта = "Т49" Тогда
//		ЗарплатаКадрыОтчеты.ПриКомпоновкеРезультатаТ49(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
//	ИначеЕсли ЗарплатаКадрыОтчеты.ЭтоКлючВариантаОтчетаРасчетныйЛисток(КлючВарианта) Тогда
//		ЗарплатаКадрыОтчеты.ПриКомпоновкеРезультатаРасчетныйЛисток(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
//	ИначеЕсли КлючВарианта = "РегламентированнаяФормаСправкаПоДСВ" Тогда
//		ПриКомпоновкеВариантаСправкаПоДСВ(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//	Иначе

//		НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
//#Вставка
//		ВыбранноеПолеКомпоновкиДанных = НастройкиОтчета.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//		ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
//		ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ПодразделениеВСтруктуре");

//		ГруппировкаКомпоновкиДанных = НастройкиОтчета.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
//		ГруппировкаКомпоновкиДанных.Использование = Ложь;
//		ПолеГруппировкиКомпоновкиДанных = ГруппировкаКомпоновкиДанных.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
//		ПолеГруппировкиКомпоновкиДанных.Использование = Ложь;
//		ПолеГруппировкиКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ПодразделениеВСтруктуре");
//#КонецВставки
//		МакетКомпоновкиДанных = ЗарплатаКадрыОтчеты.МакетКомпоновкиДанных(СхемаКомпоновкиДанных,
//		НастройкиОтчета, ДанныеРасшифровки);

//		Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ДанныеДокумента") Тогда
//			НаборыВнешнихДанных = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.ДанныеДокумента;
//		Иначе
//			НаборыВнешнихДанных = ЗарплатаКадрыОтчеты.НаборыВнешнихДанныхАнализНачисленийИУдержаний();
//		КонецЕсли;

//		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
//		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, НаборыВнешнихДанных, ДанныеРасшифровки, Истина);

//		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
//		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

//		СтандартнаяОбработка = Ложь;

//	КонецЕсли;

//КонецПроцедуры

