
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаТрансляции 	   = Параметры.ДатаТрансляции;
	Объект 		   	   = Параметры.Объект;
	Источник 		   = Параметры.Источник;
	Организация 	   = Параметры.Организация;
	ПоставленоВОчередь = Параметры.ПоставленоВОчередь;
	Приемник 		   = Параметры.Приемник;
	Протокол 		   = Параметры.Протокол;
	Статус 			   = Параметры.Статус;
	
	Период 		   = ?(ЗначениеЗаполнено(ДатаТрансляции), ДатаТрансляции, ПоставленоВОчередь);
	ТекстЗаголовка = НСтр("ru = '%1 от %2'");
	ТекстЗаголовка = СтрШаблон(ТекстЗаголовка, Статус, Период); 
	
	Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПротоколОткрытие(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Протокол) Тогда
		Текст = Новый ТекстовыйДокумент;
		Текст.УстановитьТекст(Протокол);
		Текст.Показать(Заголовок + " (" + НСтр("ru = 'Протокол'") + ")");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

//Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Код процедур и функций

#КонецОбласти