#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	

	ОбновитьСоставЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьСоставЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ДополнительныеПараметрыПечати",
		Новый Структура("Ссылка", Объект.Ссылка), Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
 	// СтандартныеПодсистемы.ПодключаемыеКоманды
 	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
 	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
 	// СтандартныеПодсистемы.ПодключаемыеКоманды
 	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
 	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	
	ОбновитьСоставЭлементовФормы();
	
	Если Объект.ПолеАдреса И НЕ Элементы.ПолеАдреса.Доступность Тогда
		Объект.ПолеАдреса = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ОбновитьСоставЭлементовФормы()
	
	Заголовок = ПолучитьЗаголовок(Объект);
	
	Если Объект.ТипЗначения.СодержитТип(Тип("Строка")) И Объект.ТипЗначения.Типы().Количество() = 1 Тогда
		Элементы.ПолеАдреса.Видимость = Истина;
	Иначе
		Элементы.ПолеАдреса.Видимость = Ложь;               
	КонецЕсли;
	
	Если Объект.ТипЗначения.СодержитТип(Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения")) И Объект.ТипЗначения.Типы().Количество() = 1 Тогда
		Элементы.Свойство.Видимость = Истина;
	Иначе
		Элементы.Свойство.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЗаголовок(Объект)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Заголовок = Строка(Объект.Наименование);
	Иначе
		Заголовок = НСтр("ru = 'Дополнительный параметр печати (создание)'");
	КонецЕсли;
	
	Возврат Заголовок;
	
КонецФункции

#КонецОбласти