
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СрокХраненияИсторииДиалоговИИ = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_СрокХраненияИсторииДиалоговИИ");
	Если СрокХраненияИсторииДиалоговИИ = 0 Тогда
		СрокХраненияИсторииДиалоговИИ = 30;
	КонецЕсли;
	
	РегламентноеЗадание = НайтиРегламентноеЗадание("бит_УдалениеИсторииВзаимодействияСИИ");
	Если РегламентноеЗадание <> Неопределено Тогда
		УдалениеИсторииВзаимодействияСИИИспользование = РегламентноеЗадание.Использование;
		УдалениеИсторииВзаимодействияСИИРасписание    = РегламентноеЗадание.Расписание;
		УстановитьДоступностьПредставлениеРасписания();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УдалениеИсторииВзаимодействияСИИИспользованиеПриИзменении(Элемент)
	
	ЗаписатьРегламентноеЗадание();
	
КонецПроцедуры

&НаСервере
Процедура СрокХраненияИсторииДиалоговИИПриИзмененииНаСервере()
	
	Константы.бит_СрокХраненияИсторииДиалоговИИ.Установить(СрокХраненияИсторииДиалоговИИ);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура СрокХраненияИсторииДиалоговИИПриИзменении(Элемент)
	
	СрокХраненияИсторииДиалоговИИПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалениеИсторииВзаимодействияСИИНастроитьРасписание(Команда)
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(УдалениеИсторииВзаимодействияСИИРасписание);
	Диалог.Показать(Новый ОписаниеОповещения("УдалениеИсторииВзаимодействияСИИРасписаниеЗавершение", ЭтотОбъект));
	
КонецПроцедуры

// Процедура обработчик оповещения "УдалениеИсторииВзаимодействияСИИНастроитьРасписание".
// 
// Параметры:
//  Расписание - РасписаниеРегламентногоЗадания.
//  ПараметрыВыполнения - Структура.
// 
&НаКлиенте
Процедура УдалениеИсторииВзаимодействияСИИРасписаниеЗавершение(Расписание, ПараметрыВыполнения) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалениеИсторииВзаимодействияСИИРасписание    = Расписание;
	УдалениеИсторииВзаимодействияСИИИспользование = Истина;
	ЗаписатьРегламентноеЗадание();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьРегламентноеЗадание()
	
	РегламентноеЗадание = НайтиРегламентноеЗадание("бит_УдалениеИсторииВзаимодействияСИИ");
	Если РегламентноеЗадание <> Неопределено Тогда
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Использование", УдалениеИсторииВзаимодействияСИИИспользование);
		ПараметрыЗадания.Вставить("Расписание", УдалениеИсторииВзаимодействияСИИРасписание);
		
		РегламентныеЗаданияСервер.ИзменитьЗадание(РегламентноеЗадание, ПараметрыЗадания);
		УстановитьДоступностьПредставлениеРасписания();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиРегламентноеЗадание(ИмяПредопределенного)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Метаданные", ИмяПредопределенного);
	Отбор.Вставить("Предопределенное", Истина);
	
	РезультатПоиска = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	Возврат ?(РезультатПоиска.Количество() = 0, Неопределено, РезультатПоиска[0]);
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьПредставлениеРасписания()
	
	Элементы.УдалениеИсторииВзаимодействияСИИНастроитьРасписание.Доступность = УдалениеИсторииВзаимодействияСИИИспользование;
	Если УдалениеИсторииВзаимодействияСИИИспользование Тогда
		РасписаниеПредставление = Строка(УдалениеИсторииВзаимодействияСИИРасписание);
		Представление = ВРег(Лев(РасписаниеПредставление, 1)) + Сред(РасписаниеПредставление, 2);
	Иначе
		Представление = "";
	КонецЕсли;
	Элементы.УдалениеИсторииВзаимодействияСИИНастроитьРасписание.Заголовок = Представление;
	
КонецПроцедуры

#КонецОбласти