
//++dar 31.05.24 (183874)
&НаКлиенте
Процедура Подключаемый_РабочееМестоПриСоздании(Элемент, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	РабочееМестоПриСозданииНаСервере();
КонецПроцедуры                         

&НаСервере
Процедура РабочееМестоПриСозданииНаСервере()
	НовоеРМ = УВМ_ОбщиеДоработки.СоздатьНовоеРабочееМесто(Объект.Организация, Объект.Подразделение, Объект.Должность);
	Объект.РабочееМесто = НовоеРМ;
КонецПроцедуры
//--dar 31.05.24 (183874)

&НаСервере
&После("ПриСозданииНаСервере")
Процедура УВМ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++dar 25.06.25 (255715)
	Если Объект.Дата >= УВМ_ОбщиеДоработки.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		СвойстваПоля_Руководитель = Новый Структура;
		СвойстваПоля_Руководитель.Вставить("АвтоОтметкаНезаполненного", Истина);
		УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_Руководитель", "ПозицияГруппа", Истина, , , , СвойстваПоля_Руководитель);
	КонецЕсли;
	//--dar 25.06.25 (255715)
	
	//++dar 07.08.25 (255715)
	ЗаполнитьРуководителяСотрудника(Объект.ФизическоеЛицо);
	//--dar 07.08.25 (255715)
КонецПроцедуры

&НаКлиенте
&После("ИзмениласьПозицияПриИзменении")
Процедура УВМ_ИзмениласьПозицияПриИзменении(Элемент)
	//++dar 07.08.25 (255715)
	Если Объект.ИзменитьПодразделениеИДолжность Тогда
		Объект.УВМ_Руководитель = Неопределено;
	КонецЕсли;
	//--dar 07.08.25 (255715)
КонецПроцедуры

&НаКлиенте
&После("СотрудникПриИзменении")
Процедура УВМ_СотрудникПриИзменении(Элемент)
	//++dar 07.08.25 (255715)
	ЗаполнитьРуководителяСотрудника(Объект.ФизическоеЛицо);
	//--dar 07.08.25 (255715)
КонецПроцедуры

//++dar 07.08.25 (255715)
&НаСервере
Процедура ЗаполнитьРуководителяСотрудника(Физлицо)
	
	Если Объект.ИзменитьПодразделениеИДолжность Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Физлицо) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.УВМ_Руководитель = УВМ_ОбщиеДоработки.РуководительСотрудника(Физлицо);
	
КонецПроцедуры
//--dar 07.08.25 (255715)
