//Добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
//конец добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
Процедура ПКО_Справочник_Сотрудники_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ДанныеДляПодбораСотрудников.Должность КАК Должность,
	                      |	ДанныеДляПодбораСотрудников.МестоВСтруктуреПредприятия КАК Подразделение
	                      |ИЗ
	                      |	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудников
	                      |ГДЕ
	                      |	ДанныеДляПодбораСотрудников.Сотрудник = &Сотрудник
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДанныеДляПодбораСотрудников.Начало УБЫВ");    
	Запрос.УстановитьПараметр("Сотрудник", ДанныеИБ.Ссылка);
	         
	ВыборкаДолжность = Запрос.Выполнить().Выбрать();
	Должность = Справочники.Должности.ПустаяСсылка();
	Если ВыборкаДолжность.Следующий() Тогда
		Должность 		= ВыборкаДолжность.Должность;
		Подразделение 	= ВыборкаДолжность.Подразделение;
	КонецЕсли;
	
	ДанныеXDTO.Вставить("Должность", Должность);    	
	
	УИДОбъектаXDTO = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ПубличныйИдентификаторПоСсылкеОбъекта(
							КомпонентыОбмена.УзелКорреспондента, Подразделение);	
	ДанныеXDTO.Вставить("Подразделение", УИДОбъектаXDTO);

	
КонецПроцедуры

//Добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
//конец добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
Процедура ПКО_Справочник_СтруктураПредприятия_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	
	МассивПодразделений = Новый Массив;
	МассивПодразделений.Добавить(ДанныеИБ.Ссылка);
	
	ТекСоответствие = РуководителиПодразделений.ДанныеРуководителей(МассивПодразделений);  
	
	Руководитель = Неопределено;
	Если ТипЗнч(ТекСоответствие) = Тип("Соответствие") Тогда
	
		ЗначениеСоответствияПодразделений = ТекСоответствие.Получить(ДанныеИБ.Ссылка);
		Если ЗначениеСоответствияПодразделений <> Неопределено Тогда
			Руководитель = ЗначениеСоответствияПодразделений.Руководитель; 
		КонецЕсли;
		
	КонецЕсли;      
	
	Если Руководитель <> Неопределено Тогда
		
		Если ДанныеXDTO.Свойство("AdditionalInfo") И ТипЗнч(ДанныеXDTO.AdditionalInfo)=Тип("Структура") Тогда
			ДополнительныеДанные = ДанныеXDTO.AdditionalInfo;
		Иначе
			ДополнительныеДанные = Новый Структура;
		КонецЕсли;
		
		УИДОбъектаXDTO = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ПубличныйИдентификаторПоСсылкеОбъекта(
							КомпонентыОбмена.УзелКорреспондента, Руководитель);
		
		ДополнительныеДанные.Вставить("Руководитель", УИДОбъектаXDTO); 
		ДанныеXDTO.Вставить("AdditionalInfo", ДополнительныеДанные);
		
	КонецЕсли;  

КонецПроцедуры

//Добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
//конец добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
&Вместо("ДобавитьПКО_Справочник_Сотрудники_Отправка")
Процедура АБ_ДобавитьПКО_Справочник_Сотрудники_Отправка(ПравилаКонвертации)	
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Справочник_Сотрудники_Отправка";
	ПравилоКонвертации.ОбъектФормата     = "Справочник.Сотрудники";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_Сотрудники_Отправка_ПриОтправкеДанных";
    ПравилоКонвертации.ОбъектДанных      = Метаданные.Справочники.Сотрудники;
	ПравилоКонвертации.ПространствоИмен  = "http://v8.1c.ru/edi/AB_edi_stnd/EnterpriseData/1.17";

	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, "http://v8.1c.ru/edi/AB_edi_stnd/EnterpriseData/1.17");
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование",   "Наименование");
	ДобавитьПКС(СвойстваШапки, "", 				 "Должность", 1, "Справочник_Должности_Отправка", "http://v8.1c.ru/edi/AB_edi_stnd/EnterpriseData/1.17");
	ДобавитьПКС(СвойстваШапки, "ФизическоеЛицо", "Владелец",   , "Справочник_ФизическиеЛица_Отправка", "http://v8.1c.ru/edi/AB_edi_stnd/EnterpriseData/1.17");
	ДобавитьПКС(СвойстваШапки, "", 				 "Подразделение",); //уид 
		
КонецПроцедуры

//Добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
//конец добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
&После("ВыполнитьПроцедуруМодуляМенеджера")
Процедура АБ_ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры)
	
	Если ИмяПроцедуры = "ПКО_Справочник_СтруктураПредприятия_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_СтруктураПредприятия_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_Сотрудники_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_Сотрудники_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	КонецЕсли;
		
КонецПроцедуры

//Добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
//конец добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
&После("ПОД_Справочник_Сотрудники_Отправка_ПриОбработке")
Процедура АБ_ПОД_Справочник_Сотрудники_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Справочник_Сотрудники_Отправка = Истина;
КонецПроцедуры

//Добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
//конец добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
&После("ДобавитьПКО_Справочник_СтруктураПредприятия_Отправка")
Процедура АБ_ДобавитьПКО_Справочник_СтруктураПредприятия_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ПравилаКонвертации.Найти("Справочник_СтруктураПредприятия_Отправка", "ИмяПКО");
	ПравилоКонвертации.ПриОтправкеДанных            = "ПКО_Справочник_СтруктураПредприятия_Отправка_ПриОтправкеДанных";
КонецПроцедуры

//Добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
//конец добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
&После("ПКО_Справочник_ФизическиеЛица_Отправка_ПриОтправкеДанных")
Процедура АБ_ПКО_Справочник_ФизическиеЛица_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	
	АБ_СоздатьПользователя = УправлениеСвойствами.ЗначениеСвойства(ДанныеИБ.Ссылка, "АБ_СоздатьПользователяВ1СДокументооборот");
	
	Если АБ_СоздатьПользователя = Истина Тогда
		
		Если ДанныеXDTO.Свойство("AdditionalInfo") И ТипЗнч(ДанныеXDTO.AdditionalInfo)=Тип("Структура") Тогда
			ДополнительныеДанные = ДанныеXDTO.AdditionalInfo;
		Иначе
			ДополнительныеДанные = Новый Структура;
		КонецЕсли;
						
		ДополнительныеДанные.Вставить("АБ_СоздатьПользователя", Истина); 
		ДанныеXDTO.Вставить("AdditionalInfo", ДополнительныеДанные);
		
	КонецЕсли;
	
КонецПроцедуры
