
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Объект") Тогда	
		Отказ = Истина;
		Возврат;	
	КонецЕсли; 
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Отчет);	
	
	фПолноеИмяОтчета = бит_ОбщегоНазначения.ПолучитьИмяОбъектаПоИмениФормы(ЭтаФорма.ИмяФормы, Истина);
	
	фЗагружатьНастройки   = Истина;
	
	РежимФормирования = бит_ОтчетыСервер.РежимыОтчетов(фПолноеИмяОтчета);
	
	Отчет.Документ = Параметры.Объект;
	
	Для каждого Элемент Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ВРег(Элемент.ЛевоеЗначение) = ВРег("Документ") Тогда  
			Элемент.Использование = Истина;
			Элемент.ПравоеЗначение = Параметры.Объект;
		КонецЕсли; 
	КонецЦикла;
	
	ЭтаФорма.АвтоЗаголовок = Ложь;
	
	ЭтаФорма.Заголовок = Параметры.Объект;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	бит_ОтчетыКлиент.СформироватьОтчет(ЭтаФорма, Элементы.ОсновнаяКоманднаяПанель, РежимФормирования.Расшифровки);
	
КонецПроцедуры

#КонецОбласти
