
&НаСервереБезКонтекста
&ИзменениеИКонтроль("ОписаниеПолейСписка")
Функция УВМ_ОписаниеПолейСписка(Настройки)

	ОписаниеПолей = Новый Соответствие;
	ПоляОписания = "Получать, ИспользоватьПривилегированныйРежим, ПутьКДанным";

	ОписаниеПолей.Вставить("Наименование",					Новый Структура(ПоляОписания, Ложь,   Ложь,   "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("Сотрудник",						Новый Структура(ПоляОписания, Ложь,   Ложь,   "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("ПометкаУдаления",				Новый Структура(ПоляОписания, Истина, Ложь,   "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("Код",							Новый Структура(ПоляОписания, Истина, Ложь,   "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("ФизическоеЛицо",				Новый Структура(ПоляОписания, Истина, Ложь,   "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("Организация",					Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("ВАрхиве",						Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("УточнениеНаименования",			Новый Структура(ПоляОписания, Истина, Ложь,   "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("ГоловнойСотрудник",				Новый Структура(ПоляОписания, Истина, Ложь,   "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("Предопределенный",				Новый Структура(ПоляОписания, Истина, Ложь,   "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("Филиал",						Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("Подразделение",					Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("Должность",						Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("ДолжностьПоШтатномуРасписанию",	Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("КоличествоСтавок",				Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("КоличествоСтавокПредставление",	Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("ВидДоговора",					Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("Начало",						Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("Окончание",						Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("МестоВСтруктуреПредприятия",	Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("Пиктограмма",					Новый Структура(ПоляОписания, Истина, Ложь,   "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("ВидЗанятости",					Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
#Вставка
	// + СБит 2024-10-14
	ОписаниеПолей.Вставить("УВМ_ЦФО",						Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
	ОписаниеПолей.Вставить("УВМ_ГруппаФОТ",					Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
	// - СБит 2024-10-14
#КонецВставки

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.РабочиеМестаОхраныТруда") Тогда
		МодульРабочиеМестаОхраныТруда = ОбщегоНазначения.ОбщийМодуль("РабочиеМестаОхраныТруда");
		МодульРабочиеМестаОхраныТруда.ДополнитьОписаниеПолейРабочимМестом(ЗначениеПараметраОрганизация(Настройки), ОписаниеПолей, ПоляОписания);
	КонецЕсли;

	Возврат ОписаниеПолей;

КонецФункции
