
&НаСервере
Процедура УВМ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++dar 29.10.23 (151735)
	//Создание реквизита для заполнения Дивизиона
	УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_Дивизион", Элементы.ФинансовыйУчетГруппа, Истина);
	//--dar 29.10.23 (151735)                                                               
	
	//++dar 11.10.24 (206878)
	УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_ЦФО", Элементы.ФинансовыйУчетГруппа, Истина);
	УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_ГруппаФОТ", Элементы.ФинансовыйУчетГруппа, Истина);
	//--dar 11.10.24 (206878)

КонецПроцедуры
