#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ бит_ум_УчетМигрантовСервер.ПолучитьЛицензию(Истина) Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;	
	
	Объект.Ответственный = Пользователи.ТекущийПользователь();
	Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Объект.НалоговыйПериод = Год(Макс(ТекущаяДата(), '20150101'));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодВзаиморасчетовСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.ПериодВзаиморасчетов", "ПериодВзаиморасчетовСтрокой", Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВзаиморасчетовСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.ПериодВзаиморасчетов", "ПериодВзаиморасчетовСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВзаиморасчетовСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.ПериодВзаиморасчетов", "ПериодВзаиморасчетовСтрокой", Направление, Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВзаиморасчетовСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВзаиморасчетовСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПлатежей

&НаКлиенте
Процедура СписокПлатежейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя <> "СписокПлатежейПометка" И Поле.Имя <> "СписокПлатежейСформированныйДокумент" Тогда
		ПоказатьЗначение(, Объект.СписокПлатежей.НайтиПоИдентификатору(ВыбраннаяСтрока).Квитанция);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.СписокПлатежей.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");

		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьСписокПлатежей", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ЗаполнитьСписокПлатежейНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьДокументыНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросЗаполнитьСписокПлатежей(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьСписокПлатежейНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокПлатежейНаКлиенте()
	
	ДлительнаяОперация = НачатьЗаполнениеСпискаПлатежей();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения =
		НСтр("ru = 'Выполняется заполнение табличной части обработки ""Сформировать авансовые платежи НДФЛ"".'");
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьСписокПлатежейНаКлиентеЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокПлатежейНаКлиентеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗагрузитьПодготовленныеДанные(Результат.АдресРезультата);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2'"),
			ОбщегоНазначенияКлиент.ДатаСеанса(), Результат.ПодробноеПредставлениеОшибки));
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		Для Каждого СообщениеПользователю Из Результат.Сообщения Цикл
			СообщениеПользователю.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(,Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаполнениеСпискаПлатежей()
	
	ПараметрыПроцедуры = Новый Структура("Организация, НалоговыйПериод, Период, ПериодВзаиморасчетов");
	ЗаполнитьЗначенияСвойств(ПараметрыПроцедуры, Объект);	
	
	Объект.СписокПлатежей.Очистить();
	
	ТаблицаСписокПлатежей = Объект.СписокПлатежей.Выгрузить();
	ТаблицаСписокПлатежей.Очистить();

	ПараметрыПроцедуры.Вставить("ТаблицаСписокПлатежей", ТаблицаСписокПлатежей);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение табличной части обработки ""Сформировать авансовые платежи НДФЛ""'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.бит_ум_СформироватьАвансовыеПлатежиНДФЛ.ПодготовитьДанныеДляЗаполнения", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные(АдресРезультата)

	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;                           

	Если СтруктураДанных.Свойство("ТаблицаСписокПлатежей") Тогда
		Объект.СписокПлатежей.Загрузить(СтруктураДанных.ТаблицаСписокПлатежей);
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("СформированныеДокументы") Тогда
		
		Для Каждого СтрокаМассива Из СтруктураДанных.СформированныеДокументы Цикл
			
			Объект.СписокПлатежей[СтрокаМассива.НомерСтроки - 1].СформированныйДокумент = СтрокаМассива.СформированныйДокумент;
			Объект.СписокПлатежей[СтрокаМассива.НомерСтроки - 1].Пометка = Ложь;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументыНаКлиенте()
	
	ДлительнаяОперация = НачатьФормированиеДокументовНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения =
		НСтр("ru = 'Выполняется формирование документов ""Авансовый платеж по НДФЛ"".'");
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("СформироватьДокументыЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ОповеститьОбИзменении(Тип("ДокументСсылка.АвансовыйПлатежИностранцаПоНДФЛ"));
		ЗагрузитьПодготовленныеДанные(Результат.АдресРезультата);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2'"),
			ОбщегоНазначенияКлиент.ДатаСеанса(), Результат.ПодробноеПредставлениеОшибки));
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		Для Каждого СообщениеПользователю Из Результат.Сообщения Цикл
			СообщениеПользователю.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(,Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НачатьФормированиеДокументовНаСервере()
	
	ПараметрыПроцедуры = Новый Структура("Организация, НалоговыйПериод, Ответственный");
	ЗаполнитьЗначенияСвойств(ПараметрыПроцедуры, Объект);
	ПараметрыПроцедуры.Вставить("ТаблицаСписокПлатежей", Объект.СписокПлатежей.Выгрузить());
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование документов ""Авансовый платеж по НДФЛ""'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.бит_ум_СформироватьАвансовыеПлатежиНДФЛ.СформироватьДокументыАвансовыйПлатежИностранцаПоНДФЛ", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

#КонецОбласти