
#Область СлужебныйПрограммныйИнтерфейс

// Определяет доступность объекта
// Параметры:
//  ПроверочнаяТаблица	 - ДокументТабличнаяЧасть - табличная часть проверяемого документа.
//  НаименованиеТаблицы	 - Строка	 -  наименование табличной части.
// 
// Возвращаемое значение:
//  Булево - доступность объекта.
//
Функция ДоступЗапрещен(ПроверочнаяТаблица, НаименованиеТаблицы, Запись = Ложь) Экспорт
	
	// ++ЕРП
	Возврат Ложь;
	// --ЕРП
		
КонецФункции

// Проверяет, используется ли ограничение доступа на уровне записей.
//
// Возвращаемое значение:
//  Булево - если Истина, тогда доступ ограничивается на уровне записей.
//
Функция ОграничиватьДоступНаУровнеЗаписей() Экспорт
	
	Результат = бит_УправлениеДоступомБФСлужебныйПовтИсп.КонстантаИспользоватьРазделениеДоступаНаУровнеЗаписей();
	  
	Возврат Результат;
	
КонецФункции

Функция ДанныеПозицийПоЗаявке(Заявка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПозиций.ЦФО КАК ЦФО,
		|	ДанныеПозиций.СтатьяОборотов КАК СтатьяОборотов
		|ИЗ
		|	ЖурналДокументов.бит_кзн_Позиции КАК ДанныеПозиций
		|ГДЕ
		|	ДанныеПозиций.ДокументПланирования = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Конструктор параметра "ПроверочнаяТаблица" функции "ДоступЗапрещен"
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ПроверочнаяТаблицаПоУмолчанию()
	
	ПроверочнаяТаблица = Новый ТаблицаЗначений;
	ПроверочнаяТаблица.Колонки.Добавить("НомерСтроки",    ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ПроверочнаяТаблица.Колонки.Добавить("ЦФО",            Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ПроверочнаяТаблица.Колонки.Добавить("СтатьяОборотов", Новый ОписаниеТипов("СправочникСсылка.бит_СтатьиОборотов"));
	ПроверочнаяТаблица.Колонки.Добавить("Проект",         Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	Возврат ПроверочнаяТаблица;
	
КонецФункции

#КонецОбласти


