///////////////////////////////////////////////////////////////////////////////////////////////////////
// Описание API по стандарту "OpenAPI" лежит в макете бит_ОписаниеСервисаМобильногоПриложения.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

// Обработчик метода GET /v1/service_info/.
// Информация о конфигурации 1С и версии API и тд.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле, см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ИнформацияОСервисе(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/service_info/'; en = 'approval/v1/service_info/'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		Данные = ИнформацияОСервисеПолная();
		Ответ  = СформироватьОтветJSON(Данные);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода ServiceInfo.
                                   |Результат: %1';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the ServiceInfo method.
                                   |Result: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода ServiceInfo.
                               |Описание ошибки: %1';
                               |en = 'HTTP service bit_ApprovalServiceNew. ServiceInfo method error.
                               |Error description: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка получения версии сервиса 1С.'; en = 'Error getting 1C service version.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода GET /v1/ping/.
// Диагностический метод проверки доступности сервера и API.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле, см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ПроверкаСоединения(Запрос)
	
	Попытка
		Ответ = СформироватьОтветJSON("pong");
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ИмяСобытия = НСтр("ru = 'approval/v1/ping/'; en = 'approval/v1/ping/'", ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода Ping.';
			                      |en = 'HTTP service bit_ApprovalServiceNew. Call the Ping method.'");
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода Ping.
                               |Описание ошибки: %1';
                               |en = 'HTTP service bit_ApprovalServiceNew. Ping method error.
                               |Error description: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка проверки подключения к 1С.'; en = 'Error checking connection to 1C.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода GET /v1/object_types/.
// Возвращает список с описанием объектов визирования настроенных в регистре сведений
//  "бит_ОбъектыМобильногоВизирования", а также настройки фильтрации по реквизитам для списка.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле, см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ОбъектыМобильногоВизирования(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/object_types/'; en = 'approval/v1/object_types/'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		Данные = ПолучитьТипыОбъектовВизирования();
		Ответ  = СформироватьОтветJSON(Данные);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода ObjectTypes.
                                   |Результат: %1';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the ObjectTypes method.
                                   |Result: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода ObjectTypes.
                               |Описание ошибки: %1';
                               |en = 'HTTP service bit_ApprovalServiceNew. Error of the ObjectTypes method.
                               |Error description: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);

		ТекстОшибки           = НСтр("ru = 'Ошибка получения списка видов документов.';
                                     |en = 'Error getting list of document types.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода GET /v1/additional_measurements/.
// Возвращает список назначенных дополнительных измерений (аналитики) используемых в бюджетировании и казначействе.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле, см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ДополнительныеИзмерения(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/additional_measurements'; en = 'approval/v1/additional_measurements'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		Данные = ПолучитьНазначенияДополнительныхИзмерений();
		Ответ  = СформироватьОтветJSON(Данные);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода AssignmentOfAdditionalMeasurements.';
                                  |en = 'HTTP service bit_ApprovalServiceNew. Call the AssignmentOfAdditionalMeasurements method.'");
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода AssignmentOfAdditionalMeasurements.
                               |Описание ошибки: %1';
                               |en = 'HTTP service bit_ApprovalServiceNew. Error of AssignmentOfAdditionalMeasurements method.
                               |Error description: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения); 
		
		ТекстОшибки           = НСтр("ru = 'Ошибка получения списка дополнительных измерений.';
		                             |en = 'Error getting list of additional dimensions.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции
 
// Обработчик метода POST /v1/objects/.
// Возвращает актуальную информацию по запрошенным объектам визирования.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле, см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция РеквизитыОбъектовВизирования(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/objects'; en = 'approval/v1/objects'", ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ПолучитьОбъекты(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода Objects.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the Objects method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода Objects.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. Error of the Objects method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка получения списка дополнительных измерений.';
		                             |en = 'Error getting list of additional dimensions.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода POST /v1/decisions/.
// Установка решений по визам.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле, см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция РешенияПоВизам(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/decision_list'; en = 'approval/v1/decision_list'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = УстановитьРешения(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода DecisionList.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the DecisionList method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода DecisionList.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. Error of the DecisionList method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка при установки решений по визам.';
		                             |en = 'Error installing visa solutions.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода POST /v1/object_file_data/.
// Возвращает все вложения объекта визирования.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле, см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ВложенияОбъекта(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/object_file_data'; en = 'approval/v1/object_file_data'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = бит_МобильноеПриложениеПереопределяемый.ПолучитьДанныеФайлаОбъекта(ДанныеЗапроса.Name,
		                                                                                   ДанныеЗапроса.ID);
		Ответ = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода ObjectFileData.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the ObjectFileData method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'Ошибка метода GetObjectFileData.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'GetObjectFileData method error.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка получения вложенных файлов.'; en = 'Error receiving attached files.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода POST /v1/refresh_token/.
// Регистрация и обновление информации об устройстве пользователя.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле, см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ЗарегистрироватьУстройство(Запрос)
		
	ИмяСобытия = НСтр("ru = 'approval/v1/refresh_token'; en = 'approval/v1/refresh_token'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ЗарегистрироватьМобильноеУстройство(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода RefreshToken.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the RefreshToken method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода RefreshToken.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. Error of the RefreshToken method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка регистрации или обновления устройства пользователя в базе.';
		                             |en = 'Error registering or updating user device in the database.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода POST /v1/measurements_for_objects/.
// Возвращает значения доп. измерений (аналитик) по запрошенным документам.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле, см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ЗначенияАналитикОбъектов(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/measurements_for_objects'; en = 'approval/v1/measurements_for_objects'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ПолучитьОбъектыСДопИзмерениями(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода AssignmentOfAdditionalMeasurementsForObjects.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the AssignmentOfAdditionalMeasurementsForObjects method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода AssignmentOfAdditionalMeasurementsForObjects.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. Error of AssignmentOfAdditionalMeasurementsForObjects method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка получения доп. измерений объектов визирования.';
		                             |en = 'Error receiving additional measurements of sighting objects.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода POST /v1/tasks/.
// Возвращает список с задач от/для пользователя.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ЗадачиПользователя(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/tasks'; en = 'approval/v1/tasks'", ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		Результат     = ПолучитьЗадачи();
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода Tasks.
                                   |Результат: %1';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the Tasks method.
                                   |Result: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода Tasks.
                               |Описание ошибки: %1';
							   |en = 'HTTP service bit_ApprovalServiceNew. Tasks method error.
                               |Error description: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка получения списка задач.'; en = 'Error getting task list.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода POST /v1/task/{Action}/.
// Применить действие к задаче (Создать, Обновить, Принять, Выполнить).
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ДействиеСЗадачей(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/task'; en = 'approval/v1/task'", ОбщегоНазначения.КодОсновногоЯзыка());
	Action     = Запрос.ПараметрыURL.Получить("Action");
	Ответ      = Неопределено;
	Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода Task.
                               |Действие: %1';
                               |en = 'HTTP service bit_ApprovalServiceNew. Call the Task method.
                               |Action: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Action);
		ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
	КонецЕсли;
	
	Если СтрСравнить(Action, "accept") = 0 Тогда
		Ответ = ПринятьЗадачуЗапрос(Запрос);
	ИначеЕсли СтрСравнить(Action, "perform") = 0 Тогда
		Ответ = ВыполнитьЗадачуЗапрос(Запрос);
	ИначеЕсли СтрСравнить(Action, "update") = 0 Тогда
		Ответ = ОбновитьЗадачуЗапрос(Запрос);
	ИначеЕсли СтрСравнить(Action, "create") = 0 Тогда
		Ответ = СоздатьЗадачуЗапрос(Запрос);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода POST /v1/objects_for_approval/.
// Возвращает список объектов визирования, доступных пользователю для согласования, с учетом отбора,
// со всеми реквизитами.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ОбъектыВизирования(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/objects_for_approval'; en = 'approval/v1/objects_for_approval'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ПолучитьОбъектыВизирования(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода GetObjectsForApproval.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the GetObjectsForApproval method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода GetObjectsForApproval.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. Call the GetObjectsForApproval method.
                               |Parameters: %1
                               |Result: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка получения списка объектов визирования.';
		                             |en = 'Error getting list of sighting objects.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода GET /v1/users/.
// Возвращает список пользователей.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ПользователиПрограммы(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/users'; en = 'approval/v1/users'", ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		Результат = ПолучитьПользователей();
		Ответ     = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода Users.
                                   |Результат: %1';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the Users method.
                                   |Result: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода Users.
                               |Описание ошибки: %1';
                               |en = 'HTTP service bit_ApprovalServiceNew. Error of the Users method.
                               |Error description: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка получения списка пользователей.'; en = 'Error getting list of users.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода POST /v1/approval_decisions/.
// Возвращает список видов решений согласования.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ВидыРешений(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/approval_decisions'; en = 'approval/v1/approval_decisions'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ВидыРешенийСогласования(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода ApprovalDecisions.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the ApprovalDecisions method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода ApprovalDecisions.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. Error of ApprovalDecisions method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка получения списка видов решений согласования.';
		                             |en = 'Error getting list of types of approval decisions.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода POST /v1/object_table/.
// Возвращает табличные части объектов в формате HTML.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ТабличныеЧасти(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/object_table'; en = 'approval/v1/object_table'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = СформироватьТабличнуюЧастьHTML(ДанныеЗапроса);
		Ответ         = СформироватьОтветHTML(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода GetObjectTable.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the GetObjectTable method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода GetObjectTable.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. GetObjectTable method error.
                               |Parameters: %1
                               |Error Description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка получения табличных части(ей) объекта.';
		                             |en = 'Error getting table part(s) of the object.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода GET /v1/internal_object_table/.
// Возвращает табличную часть объекта.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ТабличнаяЧасть(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/internal_object_table'; en = 'approval/v1/internal_object_table'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ДанныеТабличнойЧасти(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода GetInternalObjectTable.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the GetInternalObjectTable method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода GetInternalObjectTable.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. Error of the GetInternalObjectTable method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка получения табличной части.'; en = 'Error retrieving table part.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода POST /v1/internal_object_table/.
// Устанавливает новые значения в строки табличной часть объекта.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция СохранитьТабличнуюЧасть(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/internal_object_table'; en = 'approval/v1/internal_object_table'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = УстановитьДанныеТабличнойЧасти(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода SetInternalObjectTable.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the SetInternalObjectTable method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода SetInternalObjectTable.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. Error of the SetInternalObjectTable method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка редактирования табличной части.';
		                             |en = 'Error editing the table section.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода POST /v1/approval_history/.
// Возвращает историю визирования объекта.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ИсторияВизированияОбъекта(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/approval_history'; en = 'approval/v1/approval_history'",
	    ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ИсторияВизирования(ДанныеЗапроса.Id, ДанныеЗапроса.Name);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода GetApprovalHistory.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the GetApprovalHistory method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода GetApprovalHistory.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. GetApprovalHistory method error.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка чтения истории визирования.';
		                             |en = 'Error reading sighting history.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода POST /v1/budget_balances/.
// Возвращает остатки по бюджету.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция ОстаткиПоБюджету(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/budget_balances'; en = 'approval/v1/budget_balances'",
	    ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ПолучитьОстаткиПоБюджету(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода BudgetBalances.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the BudgetBalances method.
	                               |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода BudgetBalances.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. BudgetBalances method error.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка получения остатков по бюджету.';
		                             |en = 'Error receiving budget balances.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода POST /v1/history_approval/.
// Получение архива объектов визирования.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция АрхивОбъектовВизирования(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/history_approval'; en = 'approval/v1/history_approval'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ПолучитьИсториюВизированияОбъектов(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода HistoryApproval.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the HistoryApproval method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода HistoryApproval.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. HistoryApproval method error.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка получения данных архива.';
		                             |en = 'Error retrieving archive data.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода POST /v1/Get_Statuses/.
// Возвращает варианты статусов объектов мобильного визирования.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция СтатусыОбъектовВизирования(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/Get_Statuses'; en = 'approval/v1/Get_Statuses'",
	    ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON = Запрос.ПолучитьТелоКакСтроку();
		Результат  = ПолучитьСтатусы();
		Ответ      = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода GetStatuses.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the GetStatuses method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода GetStatuses.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. The error of the GetStatuses method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка получения вариантов статусов объектов.';
		                             |en = 'Error getting object status options.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Обработчик метода POST /v1/object/.
// Получение объекта визирования по ссылке.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция РеквизитыОбъектаВизирования(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/object'; en = 'approval/v1/object'", ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ПолучитьОбъектПоИдентификатору(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода Object.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the Object method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода Object.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. Object method error.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка получения объекта визирования по ссылке.';
		                             |en = 'Error getting the target object by reference.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Визирование

Функция ПолучитьТипыОбъектовВизирования()
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыВизирования.ОбъектСистемы КАК ОбъектСистемы,
	|	ОбъектыВизирования.ОбъектСистемы.Наименование КАК Наименование,
	|	ОбъектыВизирования.ОбъектСистемы.ИмяОбъектаПолное КАК ИмяОбъектаПолное,
	|	ОбъектыВизирования.Синоним КАК Синоним,
	|	ДопАналитики.Аналитика КАК Аналитика
	|ИЗ
	|	РегистрСведений.бит_ОбъектыМобильногоВизирования КАК ОбъектыВизирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НазначениеДополнительныхАналитик КАК ДопАналитики
	|		ПО ОбъектыВизирования.ОбъектСистемы = ДопАналитики.Объект
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Аналитика)
	|ПО
	|	ОбъектСистемы";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаОбъектСистемы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ФильтрПоОтображениюОстатков = бит_МобильноеПриложениеПереопределяемый.ТипыОбъектовДляОтображенияОстатков();
	ФильтрПоОтображениюТабЧастей = бит_МобильноеПриложениеПереопределяемый.ТипыОбъектовДляОтображенияТабличныхЧастей();
	
	Пока ВыборкаОбъектСистемы.Следующий() Цикл
		
		ОбъектСистемы = Новый Структура;
		ОбъектСистемы.Вставить("Name");
		ОбъектСистемы.Вставить("Title");
		ОбъектСистемы.Вставить("Synonim");
		ОбъектСистемы.Вставить("ShowBudgetBalances");
		ОбъектСистемы.Вставить("ShowTabularSection");
		ОбъектСистемы.Вставить("Properties");
		ОбъектСистемы.Вставить("ObjectFilter");
		ОбъектСистемы.Вставить("AdditionalPropsFilter");
		
		ИмяОбъекта = ВыборкаОбъектСистемы.ИмяОбъектаПолное;
		ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "Документ.", "ДокументСсылка.");
		ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "Справочник.", "СправочникСсылка.");
		
		ОбъектСистемы.Name = ИмяОбъекта;
		ОбъектСистемы.Title = ВыборкаОбъектСистемы.Наименование;
		// N.B. Отказаться от строкового варианта для проверки, перейти на метаданные.
		ОбъектСистемы.ShowBudgetBalances = ФильтрПоОтображениюОстатков.Найти(ИмяОбъекта) <> Неопределено;
		ОбъектСистемы.ShowTabularSection = ФильтрПоОтображениюТабЧастей.Найти(ИмяОбъекта) <> Неопределено;
		
		ДопАналитики = Новый Массив;
		ВыборкаДЗ    = ВыборкаОбъектСистемы.Выбрать();
		Пока ВыборкаДЗ.Следующий() Цикл
			Синоним = ВыборкаДЗ.Синоним;
			Если ЗначениеЗаполнено(ВыборкаДЗ.Аналитика) Тогда
				АналитикаСсылка = ВыборкаДЗ.Аналитика;
				УИДСтрока       = XMLСтрока(АналитикаСсылка);
				// N.B. Разименовать в запросе.
				АналитикаСтруктура = Новый Структура("Id, Description", УИДСтрока, СокрЛП(АналитикаСсылка.Наименование));
				ДопАналитики.Добавить(АналитикаСтруктура);
			КонецЕсли;
		КонецЦикла;
		ОбъектСистемы.Synonim    = Синоним;
		ОбъектСистемы.Properties = ДопАналитики;

		ОбъектСистемы.ObjectFilter = бит_МобильноеПриложениеПереопределяемый.ФильтрРеквизитовОбъекта(
		                              ВыборкаОбъектСистемы.ОбъектСистемы);
									  
		ОбъектСистемы.AdditionalPropsFilter = ФильтрыДопРеквизитовОбъекта(ВыборкаОбъектСистемы.ИмяОбъектаПолное);
		
		Результат.Добавить(ОбъектСистемы);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ФильтрыДопРеквизитовОбъекта(ИмяОбъектаПолное)
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(ИмяОбъектаПолное) Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		ВидСвойств  = "ДополнительныеРеквизиты";
		ВладелецСвойств = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяОбъектаПолное).ПустаяСсылка();
		ОбъектМетаданных = ВладелецСвойств.Метаданные();
		ТабличнаяЧасть = ОбъектМетаданных.ТабличныеЧасти.Найти(ВидСвойств);
		Если НЕ ТабличнаяЧасть = Неопределено Тогда
			СвойстваОбъекта = УправлениеСвойствами.СвойстваОбъекта(ВладелецСвойств, Истина, Ложь);
			Для каждого Свойство Из СвойстваОбъекта Цикл
				УИДСтрока = XMLСтрока(Свойство.Ссылка);
				Описание = СокрЛП(Свойство.Наименование);
				ДопРеквизит = Новый Структура("Id, Description", УИДСтрока, Описание);
				Результат.Добавить(ДопРеквизит);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОбъекты(ДанныеЗапроса)
	
	Если НЕ ТипЗнч(ДанныеЗапроса) = Тип("Массив") Тогда
		Возврат "";
	КонецЕсли;
	
	ВсеСсылки = Новый Массив;
	ОбъектыПоТипам = Новый Массив;
	УстановитьПривилегированныйРежим(Истина);
	// Получение ссылок запрашиваемых объектов.
	Для каждого Строка Из ДанныеЗапроса Цикл
		ТипОбъекта     = Строка.ObjectType;
		Идентификаторы = Строка.IDsArray;
		ТекущиеСсылки  = Новый Массив;
		Для каждого Строка Из Идентификаторы Цикл
			Ссылка = ПолучитьСсылку(ТипОбъекта, Строка);
			Если ЗначениеЗаполнено(Ссылка) Тогда
				ВсеСсылки.Добавить(Ссылка);
				ТекущиеСсылки.Добавить(Ссылка)
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		// Группировка объектов по типам.
		ТекущиеОбъекты = Новый Структура("ТипОбъекта, Ссылки", ТипОбъекта, ТекущиеСсылки);
		ОбъектыПоТипам.Добавить(ТекущиеОбъекты);
	КонецЦикла;
	
	// Получение сведений о прикрепленных файлах.
	ПрикрепленныеФайлы = ПолучитьИнформациюФайлов(ВсеСсылки);
	
	// Заполнение результата.
	ЗапросПлатежнойПозиции = бит_МобильноеПриложениеПереопределяемый.ЗапросПлатежнойПозиции();
	Результат = Новый Массив;
	Для каждого ТекущиеОбъекты Из ОбъектыПоТипам Цикл
		ДанныеОбъектов = Новый Массив;
		
		РеквизитыОбъектов = РеквизитыОбъектов(ТекущиеОбъекты.Ссылки, Истина, Истина);
		ДоступныеВизы = ПолучитьДоступныеВизыОбъектов(ТекущиеОбъекты.Ссылки);
		Для каждого СтрокаТаблицы Из РеквизитыОбъектов Цикл
		
			ДанныеОбъекта = Новый Структура;
			ДанныеОбъекта.Вставить("ID",                XMLСтрока(СтрокаТаблицы.ОбъектВизирования));
			ДанныеОбъекта.Вставить("Date",              Формат(СтрокаТаблицы.Дата, "ДЛФ=D"));
			ДанныеОбъекта.Вставить("Number",            СтрокаТаблицы.Номер);
			ДанныеОбъекта.Вставить("Company",           Строка(СтрокаТаблицы.Организация));
			ДанныеОбъекта.Вставить("Department",        СтрСоединить(СтрокаТаблицы.ЦФОСмешанная, ", "));
			ДанныеОбъекта.Вставить("TurnoverItem",      СтрСоединить(СтрокаТаблицы.СтатьяОборотовСмешанная, ", "));
			ДанныеОбъекта.Вставить("Partner",           Строка(СтрокаТаблицы.Контрагент));
			ДанныеОбъекта.Вставить("Amount",            Строка(СтрокаТаблицы.СуммаДокумента));
			ДанныеОбъекта.Вставить("Currency",          Строка(СтрокаТаблицы.ВалютаДокумента));
			ДанныеОбъекта.Вставить("ManagerialPurpose", Строка(СтрокаТаблицы.НазначениеПлатежаУпр));
			ДанныеОбъекта.Вставить("PaymentPurpose",    Строка(СтрокаТаблицы.НазначениеПлатежа));
			ДанныеОбъекта.Вставить("Status",            Строка(СтрокаТаблицы.Статус));
			ДанныеОбъекта.Вставить("ResponsiblePerson", Строка(СтрокаТаблицы.Ответственный));
			ДанныеОбъекта.Вставить("Scenario",          Строка(СтрокаТаблицы.Сценарий));
			ДанныеОбъекта.Вставить("Comment",           СтрокаТаблицы.Комментарий);
			ДанныеОбъекта.Вставить("OverBudget",        ?(ЗначениеЗаполнено(СтрокаТаблицы.СверхБюджета),СтрокаТаблицы.СверхБюджета,Ложь));
			ДанныеОбъекта.Вставить("BasisForecast",     Неопределено);
			ДанныеОбъекта.Вставить("Executor",          "");
			ДанныеОбъекта.Вставить("PaymentDate",       "");
			ДанныеОбъекта.Вставить("AdditionalProps",   ДополнительныеРеквизитыОбъекта(СтрокаТаблицы.ОбъектВизирования));
			
			ДоступныеВизыОбъекта = ДоступныеВизы[СтрокаТаблицы.ОбъектВизирования];
			Если ДоступныеВизыОбъекта = Неопределено Тогда
				ДоступныеВизыОбъекта = Новый Массив;
			КонецЕсли;
			ДанныеОбъекта.Вставить("AvailableVisas", ДоступныеВизыОбъекта);
			
			бит_МобильноеПриложениеПереопределяемый.ДополнитьДанныеОбъекта(ДанныеОбъекта, СтрокаТаблицы, ЗапросПлатежнойПозиции);
			
			// Данные о файлах.
			Файлы = ПрикрепленныеФайлы[СтрокаТаблицы.ОбъектВизирования];
			ДанныеОбъекта.Вставить("Files", Новый Массив);
			Если ЗначениеЗаполнено(Файлы) Тогда
				Для каждого ДанныеФайла Из Файлы Цикл
					ИнформацияОФайле = Новый Структура;
					ИнформацияОФайле.Вставить("Name",        ДанныеФайла.Наименование);
					ИнформацияОФайле.Вставить("DateChanged", ДанныеФайла.ДатаМодификацииФайла);
					ИнформацияОФайле.Вставить("ID",          ДанныеФайла.ИдФайла);
					ИнформацияОФайле.Вставить("VersionID",   ДанныеФайла.ИдВерсии);
					ИнформацияОФайле.Вставить("Ext",         ДанныеФайла.Расширение);
					ИнформацияОФайле.Вставить("Size",        ДанныеФайла.Размер);
					ДанныеОбъекта.Files.Добавить(ИнформацияОФайле);
				КонецЦикла;
			КонецЕсли;
			
			ДанныеОбъектов.Добавить(ДанныеОбъекта);
		
		КонецЦикла;
		
		ДанныеПоТипам = Новый Структура("ObjectType, ObjectsArray", ТекущиеОбъекты.ТипОбъекта, ДанныеОбъектов);
		Результат.Добавить(ДанныеПоТипам);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

// Функция устанавливает решения по указанным объектам.
//
// Параметры:
//   Objects - Массив из Структура- объекты визирования.
//   Decision - Строка.
//
// Возвращаемое значение:
//  Строка - список Id документов с пустыми комментариями, если установлена необходимость заполнения Комментария.
//
Функция УстановитьРешения(ДанныеЗапроса)
	
	Результат = Новый Массив;
	Решение = Справочники.бит_ВидыРешенийСогласования.ПустаяСсылка();

	УстановитьПривилегированныйРежим(Истина);
	// N.B. Решение = Справочники.бит_ВидыРешенийСогласования.ПолучитьСсылку(Новый УникальныйИдентификатор(Decision));
	Если ЗначениеЗаполнено(ДанныеЗапроса.Decision) Тогда
		Решение = Справочники.бит_ВидыРешенийСогласования.НайтиПоНаименованию(ДанныеЗапроса.Decision);
		Если Решение.Пустая() Тогда
			ТекстСообщения = НСтр("ru = 'Решение ""%1"" не найдено.'; en = 'Solution ""%1"" not found.'");
			Результат = СтрШаблон(ТекстСообщения, ДанныеЗапроса.Decision);
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	// Инициализация таблицы документов.
	ТаблицаДокументы = Новый ТаблицаЗначений;
	ТаблицаДокументы.Колонки.Добавить("Выполнять",           Новый ОписаниеТипов("Булево"));
	ТаблицаДокументы.Колонки.Добавить("ЕстьНеустановленные", Новый ОписаниеТипов("Булево"));
	ТаблицаДокументы.Колонки.Добавить("Ссылка");
	ТаблицаДокументы.Колонки.Добавить("ТипДокумента");
	ТаблицаДокументы.Колонки.Добавить("Организация",         Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДокументы.Колонки.Добавить("Комментарий",         Новый ОписаниеТипов("Строка"));
	ТаблицаДокументы.Колонки.Добавить("Id",                  Новый ОписаниеТипов("Строка"));
	ТаблицаДокументы.Колонки.Добавить("ПолноеИмяОбъекта",    Новый ОписаниеТипов("Строка"));
	
	// Разбор полученных данных и заполнение таблицы документов.
	Если Решение.Пустая() Тогда
		
		// Очистка решения.
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		Для каждого Модель Из ДанныеЗапроса.Objects Цикл
			МенеджерКоллекции = бит_ОбщегоНазначения.ПолучитьМенеджер(Модель.CollectionName);
			МенеджерОбъекта   = МенеджерКоллекции[Модель.ObjectName];
			Ссылка            = МенеджерОбъекта.ПолучитьСсылку(Новый УникальныйИдентификатор(Модель.ID));
			Если ЗначениеЗаполнено(Ссылка) Тогда
				
				ПараметрыПринятияРешения = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыПринятияРешения();	
				ПараметрыПринятияРешения.ОбъектВизирования         = Ссылка;
				ПараметрыПринятияРешения.ИДВизы                    = Модель.VisasID;
				ПараметрыПринятияРешения.Решение                   = Решение;
				ПараметрыПринятияРешения.ДатаУстановкиРешения      = ТекущаяДатаСеанса();
				ПараметрыПринятияРешения.ПроводитьПослеУтверждения = бит_ВизированиеСервер.ПриниматьКУчетуПослеУтверждения(Ссылка);
				
				Если НЕ Обработки.бит_КонсольОперативногоВизирования.СогласованиеПоВизеДоступно(Ссылка,
					Модель.VisasID,
					ТекущийПользователь) Тогда 
					ТекстСообщения = НСтр("ru='Визы были изменены другим пользователем, согласование невозможно.';
					                      |en='Visas have been changed by another user, can`t set desition.'");
					Результат = ТекстСообщения;
					Возврат Результат; 
				КонецЕсли;
				
				РешениеУстановлено = Обработки.бит_КонсольОперативногоВизирования.УстановитьРешениеПоВизе(ПараметрыПринятияРешения);
				Если РешениеУстановлено Тогда
					Результат = "Ок";
					Возврат Результат; 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Для каждого Модель Из ДанныеЗапроса.Objects Цикл
			МенеджерКоллекции = бит_ОбщегоНазначения.ПолучитьМенеджер(Модель.CollectionName);
			МенеджерОбъекта   = МенеджерКоллекции[Модель.ObjectName];
			Ссылка            = МенеджерОбъекта.ПолучитьСсылку(Новый УникальныйИдентификатор(Модель.ID));
			
			Если ЗначениеЗаполнено(Ссылка) Тогда
				МетаОбъект                      = Ссылка.Метаданные();
				НоваяСтрока                     = ТаблицаДокументы.Добавить();
				НоваяСтрока.Выполнять           = Истина;
				НоваяСтрока.ЕстьНеустановленные = Истина;
				НоваяСтрока.Ссылка              = Ссылка;
				НоваяСтрока.ТипДокумента        = ТипЗнч(Ссылка);
				НоваяСтрока.Комментарий         = Модель.Comment;
				НоваяСтрока.Id                  = Модель.Id;
				НоваяСтрока.ПолноеИмяОбъекта    = Ссылка.Метаданные().ПолноеИмя();
				
				Если бит_РаботаСМетаданными.ЕстьРеквизит("Организация", МетаОбъект) Тогда
					НоваяСтрока.Организация = Ссылка.Организация;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; // Массив для обработки.
		
		// Проверяем установлен ли комментарий, либо создана ли задача.
		СПустымиКомментариями = Новый Массив;
		Для каждого Строка Из ТаблицаДокументы Цикл
			Если НеобходимКомментарийЗадачаПолнаяПроверка(Строка.Организация, Строка.ПолноеИмяОбъекта, Решение) Тогда
				Если НЕ ЗначениеЗаполнено(Строка.Комментарий) Тогда
					Виза = ПолучитьТекущуюВизу(Строка.Ссылка);
					Если НЕ ЕстьЗадачиПоДокументу(Строка.Ссылка, Виза) Тогда
						СПустымиКомментариями.Добавить(Новый Структура("Id", Строка.Id));
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если СПустымиКомментариями.Количество() > 0 Тогда
			Возврат СПустымиКомментариями;
		КонецЕсли;
		
		ОбъектыВизирования = ТаблицаДокументы.ВыгрузитьКолонку("Ссылка");
		ДоступныеВизы = ИдентификаторыДоступныхВизОбъектов(ОбъектыВизирования);
		// Выполнение установки решений.
		Для каждого СтрокаДанных Из ТаблицаДокументы Цикл
			ДоступныеВизыОбъекта = ДоступныеВизы[СтрокаДанных.Ссылка];
			Если ДоступныеВизыОбъекта = Неопределено Тогда
				ДоступныеВизыОбъекта = Новый Массив;
			КонецЕсли;
			
			ПараметрыПринятияРешения = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыПринятияРешения();
			Для каждого ВизаОбъекта Из ДоступныеВизыОбъекта Цикл
				ПараметрыПринятияРешения.ОбъектВизирования         = СтрокаДанных.Ссылка;
				ПараметрыПринятияРешения.ИДВизы                    = ВизаОбъекта;
				ПараметрыПринятияРешения.Решение                   = Решение;
				ПараметрыПринятияРешения.Комментарий               = СтрокаДанных.Комментарий;
				ПараметрыПринятияРешения.ДатаУстановкиРешения      = ТекущаяДатаСеанса();
				ПараметрыПринятияРешения.ПроводитьПослеУтверждения = бит_ВизированиеСервер.ПриниматьКУчетуПослеУтверждения(СтрокаДанных.Ссылка);
				
				Обработки.бит_КонсольОперативногоВизирования.УстановитьРешениеПоВизе(ПараметрыПринятияРешения);
			КонецЦикла;
		КонецЦикла;
		
		Результат = "Ок";
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат;
	
КонецФункции

Функция ПолучитьТекущуюВизу(ДокументСсылка)
	
	ДоступныеПустые = ПолучитьДоступныеВизыОбъекта(ДокументСсылка);
	
	ТекущаяВиза = Неопределено;
	Если ДоступныеПустые.Количество() > 0 Тогда
		ТекущаяВиза = ДоступныеПустые[0];
	КонецЕсли;
	
	Возврат ТекущаяВиза;
	
КонецФункции

Функция ЗарегистрироватьМобильноеУстройство(ДанныеЗапроса)
	
	Токен                   = ДанныеЗапроса.Token;
	ИдентификаторУстройства = ДанныеЗапроса.DeviceId;
	ОперационнаяСистема     = ДанныеЗапроса.OS;
	ТекПользователь         = Пользователи.ТекущийПользователь();
	
	УстановитьПривилегированныйРежим(Истина);
	МобУстройство   = Справочники.бит_МобильныеУстройства.НайтиПоРеквизиту("ИД", ИдентификаторУстройства);
	Если НЕ ЗначениеЗаполнено(МобУстройство) Тогда
		// Создаем новое мобильное устройство.
		МобУстройствоОб       = Справочники.бит_МобильныеУстройства.СоздатьЭлемент();
		МобУстройствоОб.ИД    = ИдентификаторУстройства;
		МобУстройствоОб.Токен = Токен;
		
		Если НЕ Метаданные.Перечисления.бит_МобильныеОперационныеСистемы.ЗначенияПеречисления.Найти(ОперационнаяСистема)= Неопределено Тогда
			ОС = Перечисления.бит_МобильныеОперационныеСистемы[ОперационнаяСистема];
		Иначе
			ОС = Перечисления.бит_МобильныеОперационныеСистемы.android;
		КонецЕсли;
		
		МобУстройствоОб.ОперационнаяСистема = ОС;
		МобУстройствоОб.Наименование = Строка(ОС) + " " + Строка(ИдентификаторУстройства);
		МобУстройствоОб.ДатаРегистрации = ТекущаяДатаСеанса();
		МобУстройствоОб.УстановитьНовыйКод();
		
		УстройствоСоздано = бит_ОбщегоНазначения.ЗаписатьСправочник(МобУстройствоОб,"","Ошибки",Истина);
		
		Если УстройствоСоздано Тогда
			МобУстройство = МобУстройствоОб.Ссылка;
		КонецЕсли;
	Иначе
		// Устройство было создано ранее. Обновим информацию.
		МобУстройствоОб                     = МобУстройство.ПолучитьОбъект();
		МобУстройствоОб.Токен               = Токен;
		МобУстройствоОб.ПометкаУдаления     = Ложь;
		МобУстройствоОб.ОперационнаяСистема = ОС; // Для поддержки HarmonyOS, ранее их определяло как Android.
		бит_ОбщегоНазначения.ЗаписатьСправочник(МобУстройствоОб, "", "Ошибки", Истина);
		УстройствоСоздано = Истина;
	КонецЕсли;
	
	УстройствоНазначено = Ложь;
	Если ЗначениеЗаполнено(ТекПользователь) Тогда
		Если УстройствоСоздано Тогда
			
			// Назначим устройство пользователю.
			МенеджерЗаписи = РегистрыСведений.бит_УстройстваПользователей.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Пользователь    = ТекПользователь;
			МенеджерЗаписи.Устройство      = МобУстройство;
			МенеджерЗаписи.ДатаПодключения = ТекущаяДатаСеанса();
			
			Попытка
				МенеджерЗаписи.Записать();
				УстройствоНазначено = Истина;
			Исключение
				
				ИмяСобытия = НСтр("ru = 'Регистрация устройства пользователя из мобильного приложения';
                                  |en = 'Registering a user''s device from a mobile application'",
                                  ОбщегоНазначения.КодОсновногоЯзыка());
				ТекстСообщения = НСтр("ru = 'Ошибка назначения устройства пользователю.
                                       |Описание ошибки: %1';
                                       |en = 'Error assigning device to user.
                                       |Error description: %1'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	РезультатСтруктура = Новый Структура("code, message, error");
	
	Если УстройствоСоздано И УстройствоНазначено Тогда
		РезультатСтруктура.code    = "200";
		РезультатСтруктура.error   = "0";
		РезультатСтруктура.message = НСтр("ru = 'New device created and assigned to user.';
		                                   |en = 'New device created and assigned to user.'");
	ИначеЕсли НЕ УстройствоСоздано Тогда
		РезультатСтруктура.code    = "500";
		РезультатСтруктура.error   = "1";
		РезультатСтруктура.message = НСтр("ru = 'Cannot create device.'; en = 'Cannot create device.'");
	ИначеЕсли НЕ УстройствоНазначено Тогда
		РезультатСтруктура.code = "500";
		Если НЕ ЗначениеЗаполнено(ТекПользователь) Тогда
			РезультатСтруктура.error   = "2";
			РезультатСтруктура.message = НСтр("ru = 'Cannot find the user.'; en = 'Cannot find the user.'");
		Иначе
			РезультатСтруктура.error   = "3";
			РезультатСтруктура.message = НСтр("ru = 'Cannot assign device to user.'; en = 'Cannot assign device to user.'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатСтруктура;
	
КонецФункции

// Функция получает объекты визирования.
//
// Параметры:
//  Пользователь	 - Строка	 - Пользователь для которого получаем список объектов визирования.
//  ИменаОбъектов	 - Строка	 - Имена типов объектов визирования, которые анализируем.
// 
// Возвращаемое значение:
//  Массив - массив структур.
//
Функция ПолучитьОбъектыВизирования(ДанныеЗапроса)
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Objects",    "");
	ПараметрыЗапроса.Вставить("DateStart",  Дата('00010101'));
	ПараметрыЗапроса.Вставить("DateFinish", Дата('00010101'));
	
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ДанныеЗапроса);
	
	ИменаОбъектов    = ПараметрыЗапроса.Objects;
	НачалоПериода    = ПараметрыЗапроса.DateStart;
	ОкончаниеПериода = ПараметрыЗапроса.DateFinish;
	
	ПараметрыСеанса.бит_ИдентификаторСеанса = Новый УникальныйИдентификатор;
	
	ТипыОбъектов = Новый СписокЗначений();
	Если ТипЗнч(ИменаОбъектов) = Тип("Строка") И НЕ ПустаяСтрока(ИменаОбъектов) Тогда
		ПолученныеТипы = бит_ОбщегоНазначенияКлиентСервер.ПолучитьТипыИзСтроки(ИменаОбъектов);
		Если ПолученныеТипы.Количество()=0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		ТипыОбъектов.ЗагрузитьЗначения(ПолученныеТипы);
	КонецЕсли;
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(Новый ТаблицаЗначений, Новый УникальныйИдентификатор);
	МатрицаДоступа = Обработки.бит_КонсольОперативногоВизирования.МатрицаДоступа();
	
	ПараметрыПолучения = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыЗаполненияТаблицыВизирования();
	ПараметрыПолучения.МатрицаДоступа           = МатрицаДоступа;
	ПараметрыПолучения.ВыводитьВТаблицуЗначений = Истина;
	ПараметрыПолучения.ЭтоМобильноеПриложение   = Истина;
	ПараметрыПолучения.Отбор.ТипОбъекта         = ТипыОбъектов;

	// Отборы по дате.
	НастраиваемыеОтборы = Новый Структура;
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		НачалоПериода = СтрокаВДату(НачалоПериода);
		ЭлементОтбора                = Обработки.бит_КонсольОперативногоВизирования.НовыйЭлементВнешнегоОтбора();
		ЭлементОтбора.ЛевоеЗначение  = "Дата";
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = НачалоПериода;
		// АПК:1297-выкл Строковый параметр.
		ЭлементОтбора.Представление  = "НачалоПериода";
		// АПК:1297-вкл
		НастраиваемыеОтборы.Вставить("НачалоПериода", ЭлементОтбора);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОкончаниеПериода) Тогда
		ОкончаниеПериода = КонецДня(СтрокаВДату(ОкончаниеПериода));
		ЭлементОтбора                = Обработки.бит_КонсольОперативногоВизирования.НовыйЭлементВнешнегоОтбора();
		ЭлементОтбора.ЛевоеЗначение  = "Дата";
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = ОкончаниеПериода;
		// АПК:1297-выкл Строковый параметр.
		ЭлементОтбора.Представление  = "ОкончаниеПериода";
		// АПК:1297-вкл
		НастраиваемыеОтборы.Вставить("ОкончаниеПериода", ЭлементОтбора);
	КонецЕсли;
	Если ЗначениеЗаполнено(НастраиваемыеОтборы) Тогда
		ПараметрыПолучения.Отбор.ВнешниеОтборы = НастраиваемыеОтборы;
	КонецЕсли;
	
	// РМВ.
	Обработки.бит_КонсольОперативногоВизирования.ЗаполнитьТаблицуВизирования(ПараметрыПолучения, АдресВХранилище);
	
	Результат = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ТаблицаОбъектовВизирования = Результат.РезультатТаблицаЗначений;
	ОбъектыВизирования = Новый Массив;
	Если ТаблицаОбъектовВизирования.Количество() > 0 Тогда
		УстановитьПривилегированныйРежим(Истина);
		// Получение сведений о прикрепленных файлах.
		ВсеСсылки = ТаблицаОбъектовВизирования.ВыгрузитьКолонку("ОбъектВизирования");
		ВсеСсылки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВсеСсылки);
		ПрикрепленныеФайлы = ПолучитьИнформациюФайлов(ВсеСсылки);
		ЗапросПлатежнойПозиции = бит_МобильноеПриложениеПереопределяемый.ЗапросПлатежнойПозиции();
		Для каждого СтрокаТаблицы Из ТаблицаОбъектовВизирования Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ОбъектВизирования) Тогда
				Продолжить;
			КонецЕсли;
			ДанныеОбъекта = ЗаполнитьОбъектВизирования(СтрокаТаблицы, ПрикрепленныеФайлы, ЗапросПлатежнойПозиции);
			ОбъектыВизирования.Добавить(ДанныеОбъекта);
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ОбъектыВизирования;
	
КонецФункции

Функция ЗаполнитьОбъектВизирования(СтрокаТаблицы, ПрикрепленныеФайлы, ЗапросПлатежнойПозиции, ЭтоЗадача = Ложь)
	
	СтрВизы = "";
	ВизаИД = "";
	Для каждого Виза Из СтрокаТаблицы.ВизаСмешанная Цикл
		СтрВизы = СтрВизы +?(ПустаяСтрока(СтрВизы),"",", ")+ Строка(Виза);
		Если ЗначениеЗаполнено(Виза) И ПустаяСтрока(ВизаИД) Тогда
			ВизаИД = XMLСтрока(Виза);
		КонецЕсли;
	КонецЦикла;
	
	МетаОбъект = СтрокаТаблицы.ОбъектВизирования.Метаданные();
	Имена      = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(МетаОбъект.ПолноеИмя());
	
	МодельОбъекта = Новый Структура("ID, ObjectName, CollectionName");
	МодельОбъекта.ID             = XMLСтрока(СтрокаТаблицы.ОбъектВизирования);
	МодельОбъекта.ObjectName     = Имена.ИмяОбъекта;
	МодельОбъекта.CollectionName = Имена.ИмяКоллекции;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Company",           Строка(СтрокаТаблицы.Организация));
	ДанныеОбъекта.Вставить("Department",        СтрСоединить(СтрокаТаблицы.ЦФОСмешанная, ", "));
	ДанныеОбъекта.Вставить("TurnoverItem",      СтрСоединить(СтрокаТаблицы.СтатьяОборотовСмешанная, ", "));
	ДанныеОбъекта.Вставить("Partner",           Строка(СтрокаТаблицы.Контрагент));
	ДанныеОбъекта.Вставить("Amount",            Формат(СтрокаТаблицы.СуммаДокумента, "ЧГ="));
	ДанныеОбъекта.Вставить("Currency",          Строка(СтрокаТаблицы.ВалютаДокумента));
	ДанныеОбъекта.Вставить("ManagerialPurpose", Строка(СтрокаТаблицы.НазначениеПлатежаУпр));
	ДанныеОбъекта.Вставить("PaymentPurpose",    Строка(СтрокаТаблицы.НазначениеПлатежа));
	ДанныеОбъекта.Вставить("OverBudget",        ?(ЗначениеЗаполнено(СтрокаТаблицы.СверхБюджета),СтрокаТаблицы.СверхБюджета,Ложь));
	ДанныеОбъекта.Вставить("Status",            Строка(СтрокаТаблицы.Статус));
	ДанныеОбъекта.Вставить("ResponsiblePerson", Строка(СтрокаТаблицы.Ответственный));
	ДанныеОбъекта.Вставить("Scenario",          Строка(СтрокаТаблицы.Сценарий));
	ДанныеОбъекта.Вставить("Comment",           СтрокаТаблицы.Комментарий);
	ДанныеОбъекта.Вставить("Date",              ?(ЭтоЗадача, СтрокаТаблицы.Дата, Формат(СтрокаТаблицы.Дата, "ДЛФ=D")));
	ДанныеОбъекта.Вставить("Number",            СтрокаТаблицы.Номер);
	ДанныеОбъекта.Вставить("AdditionalProps",   ДополнительныеРеквизитыОбъекта(СтрокаТаблицы.ОбъектВизирования));
	ДанныеОбъекта.Вставить("UseInternalTables", ИспользоватьВнутреннююТаблицу(СтрокаТаблицы.ОбъектВизирования));
	ДанныеОбъекта.Вставить("BasisForecast",     Неопределено);
	ДанныеОбъекта.Вставить("Executor",          "");
	ДанныеОбъекта.Вставить("PaymentDate",       "");
	
	бит_МобильноеПриложениеПереопределяемый.ДополнитьДанныеОбъекта(ДанныеОбъекта, СтрокаТаблицы, ЗапросПлатежнойПозиции, ЭтоЗадача);
	
	ОбъектВизирования = Новый Структура;
	ОбъектВизирования.Вставить("Visas",             СтрВизы);
	ОбъектВизирования.Вставить("VisasID",           ВизаИД);
	ОбъектВизирования.Вставить("ObjectModel",       МодельОбъекта);
	ОбъектВизирования.Вставить("ObjectInfo",        ДанныеОбъекта);
	ОбъектВизирования.Вставить("ApplicationReestr", Неопределено);
	ОбъектВизирования.Вставить("Files",             Новый Массив);
	
	Если бит_МобильноеПриложениеПереопределяемый.ЭтоРеестр(СтрокаТаблицы.ОбъектВизирования) Тогда
		бит_МобильноеПриложениеПереопределяемый.ДополнитьДаннымиРеестраПлатежей(ОбъектВизирования, СтрокаТаблицы);
	КонецЕсли;
	
	// Данные о файлах.
	ПрикрепленныеФайлыОбъекта = ПрикрепленныеФайлы[СтрокаТаблицы.ОбъектВизирования];
	Если ТипЗнч(ПрикрепленныеФайлыОбъекта) = Тип("Массив") Тогда
		Для каждого ДанныеФайла Из ПрикрепленныеФайлыОбъекта Цикл
			ИнформацияОФайле = Новый Структура;
			ИнформацияОФайле.Вставить("Name",        ДанныеФайла.Наименование);
			ИнформацияОФайле.Вставить("DateChanged", ДанныеФайла.ДатаМодификацииФайла);
			ИнформацияОФайле.Вставить("ID",          ДанныеФайла.ИдФайла);
			ИнформацияОФайле.Вставить("VersionID",   ДанныеФайла.ИдВерсии);
			ИнформацияОФайле.Вставить("Ext",         ДанныеФайла.Расширение);
			ИнформацияОФайле.Вставить("Size",        ДанныеФайла.Размер);
			ОбъектВизирования.Files.Добавить(ИнформацияОФайле);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ОбъектВизирования;
	
КонецФункции

// Функция получает историю визирования.
//
// Параметры:
//  ПараметрыОбъекта - Структура - структура параметров объекта.
// 
// Возвращаемое значение:
//  Массив - массив структур.
//
Функция ПолучитьИсториюВизированияОбъектов(ДанныеЗапроса)
	
	ИменаОбъектов    = ДанныеЗапроса.Objects;
	НачалоПериода    = ДанныеЗапроса.DateStart;
	ОкончаниеПериода = ДанныеЗапроса.DateFinish;
	Статусы          = ДанныеЗапроса.Status;
	
	ТекПользователь  = Пользователи.ТекущийПользователь();
	НачалоПериода    = СтрокаВДату(НачалоПериода);
	ОкончаниеПериода = КонецДня(СтрокаВДату(ОкончаниеПериода));
	
	ПараметрыСеанса.бит_ИдентификаторСеанса = Новый УникальныйИдентификатор;
	
	СписокТипов = Новый СписокЗначений;
	Если ТипЗнч(ИменаОбъектов) = Тип("Строка") И НЕ ПустаяСтрока(ИменаОбъектов) Тогда
		
		ПолученныеТипы = бит_ОбщегоНазначенияКлиентСервер.ПолучитьТипыИзСтроки(ИменаОбъектов);
		Если ПолученныеТипы.Количество()=0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Для каждого ТекТип Из ПолученныеТипы Цикл
			СписокТипов.Добавить(ТекТип);
		КонецЦикла;
	
	КонецЕсли;
	
	СписокСтатусов = Новый СписокЗначений;
	Если ТипЗнч(Статусы) = Тип("Строка") И НЕ ПустаяСтрока(Статусы) Тогда
		
		ПолученныеТипы =СтрРазделить(Статусы, ",", Ложь);
		Если ПолученныеТипы.Количество() = 0 Тогда
			СписокСтатусов.Добавить(Статусы);
		КонецЕсли;
		
		Для каждого ТекТип Из ПолученныеТипы Цикл
			СписокСтатусов.Добавить(ТекТип);
		КонецЦикла;
	
	КонецЕсли;
	
	ОбъектыВизирования = Новый Массив;
	АдресВХранилище    = ПоместитьВоВременноеХранилище(Новый ТаблицаЗначений, Новый УникальныйИдентификатор);
	МатрицаДоступа     = Обработки.бит_КонсольОперативногоВизирования.МатрицаДоступа();
	ПараметрыПолучения = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыЗаполненияТаблицыВизирования();
	ПараметрыПолучения.МатрицаДоступа           = МатрицаДоступа;
	ПараметрыПолучения.ВыводитьВТаблицуЗначений = Истина;
	ПараметрыПолучения.ЭтоМобильноеПриложение   = Истина;
	ПараметрыПолучения.РежимАрхива              = Истина;
	
	Если СписокТипов.Количество() > 0 Тогда
		ПараметрыПолучения.Отбор.ТипОбъекта = СписокТипов;
	КонецЕсли;
	
	НастраиваемыеОтборы = Новый Структура;
	Если СписокСтатусов.Количество() > 0 Тогда
		ЭлементОтбора                = Обработки.бит_КонсольОперативногоВизирования.НовыйЭлементВнешнегоОтбора();
		ЭлементОтбора.ЛевоеЗначение  = "Статус.Наименование";
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = СписокСтатусов;
		// АПК:1297-выкл Строковый параметр.
		ЭлементОтбора.Представление  = "ОтборПоСтатусам";
		// АПК:1297-вкл
		НастраиваемыеОтборы.Вставить("СтатусНаименование", ЭлементОтбора);
	КонецЕсли;
	
	// Отборы по дате последнего решения.
	ЭлементОтбора                = Обработки.бит_КонсольОперативногоВизирования.НовыйЭлементВнешнегоОтбора();
	ЭлементОтбора.ЛевоеЗначение  = "ДатаКрайняя";
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = НачалоПериода;
	// АПК:1297-выкл Строковый параметр.
	ЭлементОтбора.Представление  = "НачалоПериода";
	// АПК:1297-вкл
	НастраиваемыеОтборы.Вставить("НачалоПериода", ЭлементОтбора);
	
	ЭлементОтбора                = Обработки.бит_КонсольОперативногоВизирования.НовыйЭлементВнешнегоОтбора();
	ЭлементОтбора.ЛевоеЗначение  = "ДатаКрайняя";
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = ОкончаниеПериода;
	// АПК:1297-выкл Строковый параметр.
	ЭлементОтбора.Представление  = "ОкончаниеПериода";
	// АПК:1297-вкл
	НастраиваемыеОтборы.Вставить("ОкончаниеПериода", ЭлементОтбора);
	
	ПараметрыПолучения.Отбор.ВнешниеОтборы = НастраиваемыеОтборы;
	
	// РМВ.
	Обработки.бит_КонсольОперативногоВизирования.ЗаполнитьТаблицуВизирования(ПараметрыПолучения, АдресВХранилище);

	РезультатОбработки = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ТаблицаДокументов  = РезультатОбработки.РезультатТаблицаЗначений;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получение сведений о прикрепленных файлах.
	ВсеСсылки = ТаблицаДокументов.ВыгрузитьКолонку("ОбъектВизирования");
	ВсеСсылки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВсеСсылки);
	ПрикрепленныеФайлы = ПолучитьИнформациюФайлов(ВсеСсылки);
	
	ОбъектыВизирования = Новый Массив;
	Для каждого СтрокаТаблицы Из ТаблицаДокументов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ОбъектВизирования) Тогда
			Продолжить;
		КонецЕсли;
		// Извлекаем историю визирования.
		
		СтрВизы = "";
		ВизаИД = "";
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Объект", СтрокаТаблицы.ОбъектВизирования);
		Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УстановленныеВизы.ДатаУстановки КАК Период,
		|	УстановленныеВизы.Виза КАК Виза,
		|	ПРЕДСТАВЛЕНИЕ(УстановленныеВизы.Виза) КАК ВизаПредставление,
		|	УстановленныеВизы.ИД КАК ИД,
		|	УстановленныеВизы.Пользователь КАК Пользователь,
		|	ПРЕДСТАВЛЕНИЕ(УстановленныеВизы.Пользователь) КАК ПользовательПредставление,
		|	УстановленныеВизы.Комментарий КАК Комментарий,
		|	УстановленныеВизы.Решение КАК Решение,
		|	ПРЕДСТАВЛЕНИЕ(УстановленныеВизы.Решение) КАК РешениеПредставление
		|ИЗ
		|	РегистрСведений.бит_УстановленныеВизы КАК УстановленныеВизы
		|ГДЕ
		|	УстановленныеВизы.Объект = &Объект
		|	И УстановленныеВизы.Пользователь = &Пользователь
		|	И УстановленныеВизы.Решение <> ЗНАЧЕНИЕ(Справочник.бит_ВидыРешенийСогласования.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		
		Результат = Запрос.Выполнить();
		Выборка   = Результат.Выбрать();
		
		Если Выборка.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		VisaHistory = Новый Структура("Row");
		Визы = Новый Массив();
		StatusDate = '00010101';
		ВизаИД = "";
		Пока Выборка.Следующий() Цикл
			Если StatusDate = '00010101' Тогда
				StatusDate = Формат(Выборка.Период,"ДЛФ=D");
			КонецЕсли;
			
			Visa = Новый Структура;
			Visa.Вставить("Period",     Выборка.Период);
			Visa.Вставить("Visa",       Выборка.ВизаПредставление);
			Visa.Вставить("ID",         Выборка.ИД);
			Visa.Вставить("User",       Выборка.ПользовательПредставление);
			Visa.Вставить("Comment",    Выборка.Комментарий);
			Visa.Вставить("Decision",   Выборка.РешениеПредставление);
			Визы.Добавить(Visa);
			СтрВизы = СтрВизы +?(ПустаяСтрока(СтрВизы),"",", ") + Выборка.ВизаПредставление;
			
			Если ПустаяСтрока(ВизаИД) Тогда
				 ВизаИД = XMLСтрока(Выборка.Виза);
			КонецЕсли;
		КонецЦикла;
		VisaHistory.Row = Визы;
		
		МетаОбъект = СтрокаТаблицы.ОбъектВизирования.Метаданные();
		Имена      = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(МетаОбъект.ПолноеИмя());
		
		МодельОбъекта                = Новый Структура("ID, ObjectName, CollectionName");
		МодельОбъекта.ID             = XMLСтрока(СтрокаТаблицы.ОбъектВизирования);
		МодельОбъекта.ObjectName     = Имена.ИмяОбъекта;
		МодельОбъекта.CollectionName = Имена.ИмяКоллекции;
		
		ДанныеОбъекта = Новый Структура;
		ДанныеОбъекта.Вставить("Company",           Строка(СтрокаТаблицы.Организация));
		ДанныеОбъекта.Вставить("Department",        СтрСоединить(СтрокаТаблицы.ЦФОСмешанная, ", "));
		ДанныеОбъекта.Вставить("TurnoverItem",      СтрСоединить(СтрокаТаблицы.СтатьяОборотовСмешанная, ", "));
		ДанныеОбъекта.Вставить("Partner",           Строка(СтрокаТаблицы.Контрагент));
		ДанныеОбъекта.Вставить("Amount",            Формат(СтрокаТаблицы.СуммаДокумента, "ЧГ="));
		ДанныеОбъекта.Вставить("Currency",          Строка(СтрокаТаблицы.ВалютаДокумента));
		ДанныеОбъекта.Вставить("ManagerialPurpose", Строка(СтрокаТаблицы.НазначениеПлатежаУпр));
		ДанныеОбъекта.Вставить("PaymentPurpose",    Строка(СтрокаТаблицы.НазначениеПлатежа));
		ДанныеОбъекта.Вставить("OverBudget",        ?(ТипЗнч(СтрокаТаблицы.СверхБюджета) = Тип("Булево"), СтрокаТаблицы.СверхБюджета, Ложь));
		ДанныеОбъекта.Вставить("Status",            Строка(СтрокаТаблицы.Статус));
		ДанныеОбъекта.Вставить("StatusDate",        Формат(StatusDate,"ДЛФ=D"));
		ДанныеОбъекта.Вставить("ResponsiblePerson", Строка(СтрокаТаблицы.Ответственный));
		ДанныеОбъекта.Вставить("Scenario",          Строка(СтрокаТаблицы.Сценарий));
		ДанныеОбъекта.Вставить("Comment",           СтрокаТаблицы.Комментарий);
		ДанныеОбъекта.Вставить("Date",              Формат(СтрокаТаблицы.Дата, "ДЛФ=D"));
		ДанныеОбъекта.Вставить("Number",            СтрокаТаблицы.Номер);
		ДанныеОбъекта.Вставить("AdditionalProps",   ДополнительныеРеквизитыОбъекта(СтрокаТаблицы.ОбъектВизирования));
		ДанныеОбъекта.Вставить("UseInternalTables", ИспользоватьВнутреннююТаблицу(СтрокаТаблицы.ОбъектВизирования));
		ДанныеОбъекта.Вставить("BasisForecast",     Неопределено);
		ДанныеОбъекта.Вставить("Executor",          "");
		ДанныеОбъекта.Вставить("PaymentDate",       "");
		// N.B.
		Если СтрокаТаблицы.Статус.Наименование = "Проверен"
			ИЛИ СтрокаТаблицы.Статус.Наименование = "Утвержден"
			ИЛИ СтрокаТаблицы.Статус.Наименование = "Закрыта"
			ИЛИ СтрокаТаблицы.Статус.Наименование = "Исполнена"
			ИЛИ СтрокаТаблицы.Статус.Наименование = "Утверждена"
			ИЛИ СтрокаТаблицы.Статус.Наименование = "Оплачена"
			ИЛИ СтрокаТаблицы.Статус.Наименование = "Выполнена" Тогда
			
			ДанныеОбъекта.Вставить("Agreed", Истина);
		Иначе
			ДанныеОбъекта.Вставить("Agreed", Ложь);
		КонецЕсли;
		бит_МобильноеПриложениеПереопределяемый.ДополнитьДанныеОбъекта(ДанныеОбъекта, СтрокаТаблицы);
		
		ОбъектВизирования = Новый Структура;
		ОбъектВизирования.Вставить("Visas",             СтрВизы);
		ОбъектВизирования.Вставить("VisasID",           ВизаИД);
		ОбъектВизирования.Вставить("ObjectModel",       МодельОбъекта);
		ОбъектВизирования.Вставить("ObjectInfo",        ДанныеОбъекта);
		ОбъектВизирования.Вставить("VisaHistory",       VisaHistory);
		ОбъектВизирования.Вставить("ApplicationReestr", Неопределено);
		ОбъектВизирования.Вставить("Files",             Новый Массив);
		
		Если бит_МобильноеПриложениеПереопределяемый.ЭтоРеестр(СтрокаТаблицы.ОбъектВизирования) Тогда
			бит_МобильноеПриложениеПереопределяемый.ДополнитьДаннымиРеестраПлатежей(ОбъектВизирования, СтрокаТаблицы);
		КонецЕсли;
		
		// Данные о файлах.
		ПрикрепленныеФайлыОбъекта = ПрикрепленныеФайлы[СтрокаТаблицы.ОбъектВизирования];
		Если ТипЗнч(ПрикрепленныеФайлыОбъекта) = Тип("Массив") Тогда
			Для каждого ДанныеФайла Из ПрикрепленныеФайлыОбъекта Цикл
				ИнформацияОФайле = Новый Структура;
				ИнформацияОФайле.Вставить("Name",        ДанныеФайла.Наименование);
				ИнформацияОФайле.Вставить("DateChanged", ДанныеФайла.ДатаМодификацииФайла);
				ИнформацияОФайле.Вставить("ID",          ДанныеФайла.ИдФайла);
				ИнформацияОФайле.Вставить("VersionID",   ДанныеФайла.ИдВерсии);
				ИнформацияОФайле.Вставить("Ext",         ДанныеФайла.Расширение);
				ИнформацияОФайле.Вставить("Size",        ДанныеФайла.Размер);
				ОбъектВизирования.Files.Добавить(ИнформацияОФайле);
			КонецЦикла;
		КонецЕсли;
		
		ОбъектыВизирования.Добавить(ОбъектВизирования);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ОбъектыВизирования;
	
КонецФункции

Функция ПолучитьСтатусы()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Статусы.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.бит_ОбъектыМобильногоВизирования КАК ОбъектыВизирования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_СтатусыОбъектов КАК Статусы
	|		ПО ОбъектыВизирования.ОбъектСистемы = Статусы.Объект";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ПереченьСтатусов = Новый Массив();
	Пока Выборка.Следующий() Цикл
		ПереченьСтатусов.Добавить(Выборка.Наименование);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПереченьСтатусов;
	
КонецФункции

Функция ВидыРешенийСогласования(ДанныеЗапроса)
	
	Если НЕ ТипЗнч(ДанныеЗапроса) = Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Массив;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыРешенийСогласования.ОбъектСистемы КАК ОбъектСистемы,
	|	ПРЕДСТАВЛЕНИЕ(ВидыРешенийСогласования.ОбъектСистемы) КАК ОбъектСистемыПредставление,
	|	ВидыРешенийСогласования.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(ВидыРешенийСогласования.Организация) КАК ОрганизацияПредставление,
	|	ВидыРешенийСогласования.ВидРешения КАК ВидРешения,
	|	ПРЕДСТАВЛЕНИЕ(ВидыРешенийСогласования.ВидРешения) КАК ВидРешенияПредставление,
	|	ВидыРешенийСогласования.НеобходимКомментарийЗадача КАК НеобходимКомментарийЗадача,
	|	ВидыРешенийСогласования.КодСортировки КАК КодСортировки,
	|	ВЫБОР
	|		КОГДА Решения.ТипРешения = ЗНАЧЕНИЕ(Перечисление.бит_ТипыРешений.Согласующее)
	|			ТОГДА ИСТИНА
	|		КОГДА Решения.ТипРешения = ЗНАЧЕНИЕ(Перечисление.бит_ТипыРешений.Отклоняющее)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СогласующееРешение
	|ИЗ
	|	РегистрСведений.бит_НазначениеВидовРешенийСогласования КАК ВидыРешенийСогласования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ВидыРешенийСогласования КАК Решения
	|		ПО ВидыРешенийСогласования.ВидРешения = Решения.Ссылка
	|ГДЕ
	|	НЕ ВидыРешенийСогласования.ВидРешения.Отключено
	|	И &ДопУсловие
	|ИТОГИ ПО
	|	ОбъектСистемы,
	|	Организация";
	
	Запрос = Новый Запрос;
	Если ДанныеЗапроса.Количество() > 0 Тогда
		ОбъектыСистемы = ПолучитьОбъектыСистемы(ДанныеЗапроса);
		Запрос.УстановитьПараметр("ОбъектыСистемы", ОбъектыСистемы);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДопУсловие","ВидыРешенийСогласования.ОбъектСистемы В(&ОбъектыСистемы)");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ДопУсловие","");
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаОбъектСистемы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбъектСистемы.Следующий() Цикл
		
		ОбъектСистемы             = Новый Структура("Id, Description, Organizations");
		ОбъектСистемы.Id          = XMLСтрока(ВыборкаОбъектСистемы.ОбъектСистемы);
		ОбъектСистемы.Description = ВыборкаОбъектСистемы.ОбъектСистемыПредставление;
		
		Организации = Новый Массив;
		ВыборкаОрганизация = ВыборкаОбъектСистемы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОрганизация.Следующий() Цикл
			
			Решения = Новый Массив;
			Выборка = ВыборкаОрганизация.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Решение                   = Новый Структура("Id, Description, NeedCommentOrTask, Priority, Approval");
				Решение.Id                = XMLСтрока(Выборка.ВидРешения);
				Решение.Description       = Выборка.ВидРешенияПредставление;
				Решение.NeedCommentOrTask = Выборка.НеобходимКомментарийЗадача;
				Решение.Priority          = Выборка.КодСортировки;
				Решение.Approval          = Выборка.СогласующееРешение;
				
				Решения.Добавить(Решение);
			КонецЦикла;
			
			ТекущаяОрганизация             = Новый Структура("Id, Description, Decisions");
			ТекущаяОрганизация.Id          = XMLСтрока(ВыборкаОрганизация.Организация);
			ТекущаяОрганизация.Description = ВыборкаОрганизация.ОрганизацияПредставление;
			ТекущаяОрганизация.Decisions   = Решения;
			
			Организации.Добавить(ТекущаяОрганизация);
			
		КонецЦикла;
		
		ОбъектСистемы.Organizations = Организации;
		
		Результат.Добавить(ОбъектСистемы);
		
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции

Функция ИсторияВизирования(Ид, Имя)
	
	Если бит_МобильноеПриложениеПереопределяемый.ЭтоСправочник(Имя) Тогда
		МенеджерОбъекта = Справочники[Имя];
	Иначе
		МенеджерОбъекта = Документы[Имя];
	КонецЕсли;
	УИД    = Новый УникальныйИдентификатор(Ид);
	Ссылка = МенеджерОбъекта.ПолучитьСсылку(УИД);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияВизирования.Период КАК Период,
	|	ИсторияВизирования.Виза КАК Виза,
	|	ПРЕДСТАВЛЕНИЕ(ИсторияВизирования.Виза) КАК ВизаПредставление,
	|	ИсторияВизирования.ИД КАК ИД,
	|	ИсторияВизирования.Пользователь КАК Пользователь,
	|	ПРЕДСТАВЛЕНИЕ(ИсторияВизирования.Пользователь) КАК ПользовательПредставление,
	|	ИсторияВизирования.Комментарий КАК Комментарий,
	|	ИсторияВизирования.Решение КАК Решение,
	|	ПРЕДСТАВЛЕНИЕ(ИсторияВизирования.Решение) КАК РешениеПредставление
	|ИЗ
	|	РегистрСведений.бит_ИсторияИзмененияВиз КАК ИсторияВизирования
	|ГДЕ
	|	ИсторияВизирования.Объект = &Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Запись = Новый Структура();
		Запись.Вставить("Period",   Выборка.Период);
		Запись.Вставить("Visa",     Выборка.ВизаПредставление);
		Запись.Вставить("ID",       Выборка.ИД);
		Запись.Вставить("User",     Выборка.ПользовательПредставление);
		Запись.Вставить("Comment",  Выборка.Комментарий);
		Запись.Вставить("Decision", Выборка.РешениеПредставление);
		Результат.Добавить(Запись);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДоступныеВизыОбъекта(ОбъектВизирования)
	
	Результат          = Новый Массив;
	АдресВХранилище    = ПоместитьВоВременноеХранилище(Новый ТаблицаЗначений, Новый УникальныйИдентификатор);
	МатрицаДоступа     = Обработки.бит_КонсольОперативногоВизирования.МатрицаДоступа();
	ПараметрыПолучения = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыЗаполненияТаблицыВизирования();
	ПараметрыПолучения.МатрицаДоступа           = МатрицаДоступа;
	ПараметрыПолучения.ВыводитьВТаблицуЗначений = Истина;
	ПараметрыПолучения.ЭтоМобильноеПриложение   = Истина;
	ПараметрыПолучения.Отбор.ОбъектВизирования  = ОбъектВизирования;
	Обработки.бит_КонсольОперативногоВизирования.ЗаполнитьТаблицуВизирования(ПараметрыПолучения, АдресВХранилище);
	РезультатОбработки = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ТаблицаОбъектов    = РезультатОбработки.РезультатТаблицаЗначений;
	
	Если ТаблицаОбъектов.Количество() > 0 Тогда
		СтрокаТаблицы = ТаблицаОбъектов[0];
		Для каждого Виза Из СтрокаТаблицы.ВизаСмешанная Цикл
			Результат.Добавить(Виза);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДоступныеВизыОбъектов(ОбъектыВизирования, ВозвращатьИДРегистраВиз = Ложь)
	
	Результат = Новый Соответствие;
	
	Если ОбъектыВизирования.Количество() > 0 Тогда
		ОтборОбъектыВизирования = Новый СписокЗначений;
		ОтборОбъектыВизирования.ЗагрузитьЗначения(ОбъектыВизирования);
		
		АдресВХранилище     = ПоместитьВоВременноеХранилище(Новый ТаблицаЗначений, Новый УникальныйИдентификатор);
		МатрицаДоступа      = Обработки.бит_КонсольОперативногоВизирования.МатрицаДоступа();
		ПараметрыПолучения  = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыЗаполненияТаблицыВизирования();
		ПараметрыПолучения.МатрицаДоступа           = МатрицаДоступа;
		ПараметрыПолучения.ВыводитьВТаблицуЗначений = Истина;
		ПараметрыПолучения.ЭтоМобильноеПриложение   = Истина;
		ПараметрыПолучения.Отбор.ОбъектВизирования  = ОтборОбъектыВизирования;
		Обработки.бит_КонсольОперативногоВизирования.ЗаполнитьТаблицуВизирования(ПараметрыПолучения, АдресВХранилище);
		РезультатОбработки = ПолучитьИзВременногоХранилища(АдресВХранилище);
		ТаблицаОбъектов    = РезультатОбработки.РезультатТаблицаЗначений;
		
		Для каждого СтрокаТаблицы Из ТаблицаОбъектов Цикл
			Визы = Новый Массив;
			Для каждого Виза Из СтрокаТаблицы.ВизаСмешанная Цикл
				ПараметрыВизы = Новый Структура;
				ПараметрыВизы.Вставить("Id",          XMLСтрока(Виза));
				ПараметрыВизы.Вставить("Description", Виза.Наименование);
				Если ВозвращатьИДРегистраВиз Тогда
					ПараметрыВизы.Вставить("МассивИД", СтрокаТаблицы.ИД);
				КонецЕсли;
				Визы.Добавить(ПараметрыВизы);
			КонецЦикла;
			Результат.Вставить(СтрокаТаблицы.ОбъектВизирования, Визы)
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыДоступныхВизОбъектов(ОбъектыВизирования)
	
	Результат = Новый Соответствие;
	
	Если ОбъектыВизирования.Количество() > 0 Тогда
		ОтборОбъектыВизирования = Новый СписокЗначений;
		ОтборОбъектыВизирования.ЗагрузитьЗначения(ОбъектыВизирования);
		
		АдресВХранилище                             = ПоместитьВоВременноеХранилище(Новый ТаблицаЗначений, Новый УникальныйИдентификатор);
		МатрицаДоступа                              = Обработки.бит_КонсольОперативногоВизирования.МатрицаДоступа();
		ПараметрыПолучения                          = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыЗаполненияТаблицыВизирования();
		ПараметрыПолучения.МатрицаДоступа           = МатрицаДоступа;
		ПараметрыПолучения.ВыводитьВТаблицуЗначений = Истина;
		ПараметрыПолучения.ЭтоМобильноеПриложение   = Истина;
		ПараметрыПолучения.Отбор.ОбъектВизирования  = ОтборОбъектыВизирования;
		Обработки.бит_КонсольОперативногоВизирования.ЗаполнитьТаблицуВизирования(ПараметрыПолучения, АдресВХранилище);
		
		РезультатОбработки = ПолучитьИзВременногоХранилища(АдресВХранилище);
		ТаблицаОбъектов    = РезультатОбработки.РезультатТаблицаЗначений;
		
		Для каждого СтрокаТаблицы Из ТаблицаОбъектов Цикл
			Результат.Вставить(СтрокаТаблицы.ОбъектВизирования, СтрокаТаблицы.ИД)
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Задачи

Функция ПринятьЗадачуЗапрос(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/task/accept'; en = 'approval/v1/task/accept'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ПринятьЗадачу(ДанныеЗапроса.ID, ДанныеЗапроса.Result);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода AcceptTask.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the AcceptTask method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода AcceptTask.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. Call the AcceptTask method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка при попытке принять задачу.';
		                             |en = 'An error occurred while trying to accept the task.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция ВыполнитьЗадачуЗапрос(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/task/perform'; en = 'approval/v1/task/perform'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ВыполнитьЗадачу(ДанныеЗапроса.ID, ДанныеЗапроса.Result);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода PerformTask.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the PerformTask method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода PerformTask.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. Error of the PerformTask method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка при попытке выполнить задачу.';
		                             |en = 'An error occurred while trying to complete the task.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция ОбновитьЗадачуЗапрос(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/task/update'; en = 'approval/v1/task/update'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ЗаписатьЗадачу(ДанныеЗапроса.ID, ДанныеЗапроса.Result);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода SaveTask.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the SaveTask method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода SaveTask.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. Error of SaveTask method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка при попытке обновить задачу.';
		                             |en = 'An error occurred while trying to update the task.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция СоздатьЗадачуЗапрос(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/task/create'; en = 'approval/v1/task/create'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = СоздатьЗадачу(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода CreateTask.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the CreateTask method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода CreateTask.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. CreateTask method error.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, ПодробноеПредставление);
		ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		
		ТекстОшибки           = НСтр("ru = 'Ошибка при попытке создать задачу.';
		                             |en = 'An error occurred while trying to create a task.'");
		ОписаниеОшибки        = НовоеОписаниеОшибки();
		ОписаниеОшибки.error  = ТекстОшибки;
		ОписаниеОшибки.detail = ПодробноеПредставление;
		
		Ответ = СформироватьОтветJSON(ОписаниеОшибки, 500);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция ЕстьЗадачиПоДокументу(Ссылка, Виза)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Предмет КАК Предмет
	|ИЗ
	|	Задача.бит_Задача КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Виза = &Виза
	|	И Реквизиты.Предмет = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Виза",   Виза);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьЗадачи()
	
	Результат               = Новый Массив;
	ТекПользователь         = Пользователи.ТекущийПользователь();
	ТипыОбъектовВизирования = бит_МобильноеПриложениеПереопределяемый.ТипыОбъектов();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекПользователь",         ТекПользователь);
	Запрос.УстановитьПараметр("ТипыОбъектовВизирования", ТипыОбъектовВизирования);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""MyTasks"" КАК НаправлениеЗадачи,
	|	ЗадачаПоИсполнителю.Ссылка КАК Ссылка,
	|	ЗадачаПоИсполнителю.Выполнена КАК Выполнена,
	|	ЗадачаПоИсполнителю.Номер КАК Номер,
	|	ЗадачаПоИсполнителю.Состояние КАК Состояние,
	|	ЗадачаПоИсполнителю.Дата КАК Дата,
	|	ЗадачаПоИсполнителю.СрокИсполнения КАК СрокИсполнения,
	|	ЗадачаПоИсполнителю.Наименование КАК Наименование,
	|	ЗадачаПоИсполнителю.Автор КАК Автор,
	|	ЗадачаПоИсполнителю.Исполнитель КАК Исполнитель,
	|	ЗадачаПоИсполнителю.Важность КАК Важность,
	|	ЗадачаПоИсполнителю.Описание КАК Описание,
	|	ЗадачаПоИсполнителю.РезультатВыполнения КАК РезультатВыполнения,
	|	ЗадачаПоИсполнителю.Предмет КАК Предмет
	|ПОМЕСТИТЬ ВсеЗадачи
	|ИЗ
	|	Задача.бит_Задача.ЗадачиПоИсполнителю(
	|			&ТекПользователь,
	|			Выполнена = ЛОЖЬ
	|				И АлгоритмПодчиненный = ЗНАЧЕНИЕ(Справочник.бит_АлгоритмыПроцессов.ПустаяСсылка)
	|				И Состояние <> ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.Задача_Остановлена)) КАК ЗадачаПоИсполнителю
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""TasksFromMe"",
	|	ЗадачиОтПользователя.Ссылка,
	|	ЗадачиОтПользователя.Выполнена,
	|	ЗадачиОтПользователя.Номер,
	|	ЗадачиОтПользователя.Состояние,
	|	ЗадачиОтПользователя.Дата,
	|	ЗадачиОтПользователя.СрокИсполнения,
	|	ЗадачиОтПользователя.Наименование,
	|	ЗадачиОтПользователя.Автор,
	|	ЗадачиОтПользователя.Исполнитель,
	|	ЗадачиОтПользователя.Важность,
	|	ЗадачиОтПользователя.Описание,
	|	ЗадачиОтПользователя.РезультатВыполнения,
	|	ЗадачиОтПользователя.Предмет
	|ИЗ
	|	Задача.бит_Задача КАК ЗадачиОтПользователя
	|ГДЕ
	|	ЗадачиОтПользователя.Автор = &ТекПользователь
	|	И ЗадачиОтПользователя.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.бит_Процесс.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеЗадачи.Предмет КАК Предмет
	|ИЗ
	|	ВсеЗадачи КАК ВсеЗадачи
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ВсеЗадачи.Предмет) В (&ТипыОбъектовВизирования)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеЗадачи.НаправлениеЗадачи КАК НаправлениеЗадачи,
	|	ВсеЗадачи.Ссылка КАК Ссылка,
	|	ВсеЗадачи.Выполнена КАК Выполнена,
	|	ВсеЗадачи.Номер КАК Номер,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ВсеЗадачи.Состояние, """")) КАК СостояниеПредставление,
	|	ВсеЗадачи.Дата КАК Дата,
	|	ВсеЗадачи.СрокИсполнения КАК СрокИсполнения,
	|	ВсеЗадачи.Наименование КАК Наименование,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ВсеЗадачи.Автор, """")) КАК АвторПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ВсеЗадачи.Исполнитель, """")) КАК ИсполнительПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ВсеЗадачи.Важность, """")) КАК ВажностьПредставление,
	|	ВсеЗадачи.Описание КАК Описание,
	|	ВсеЗадачи.РезультатВыполнения КАК РезультатВыполнения,
	|	ВсеЗадачи.Предмет КАК Предмет,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ВсеЗадачи.Предмет, """")) КАК ПредметПредставление
	|ИЗ
	|	ВсеЗадачи КАК ВсеЗадачи";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ОбъектыЗадач = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Предмет");
	
	РеквизитыОбъектовЗадач = Новый ТаблицаЗначений;
	Если ОбъектыЗадач.Количество() > 0 Тогда
		РеквизитыОбъектовЗадач = РеквизитыОбъектов(ОбъектыЗадач);
	КонецЕсли;

	ВсеЗадачи = РезультатЗапроса[2].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОбъектыЗадач, ВсеЗадачи);
	
	// Получение сведений о прикрепленных файлах для задач и их объектов.
	ПрикрепленныеФайлы = ПолучитьИнформациюФайлов(ОбъектыЗадач);
	
	ЗапросПлатежнойПозиции = бит_МобильноеПриложениеПереопределяемый.ЗапросПлатежнойПозиции();
	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МетаОбъект = Выборка.Ссылка.Метаданные();
		Имена = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(МетаОбъект.ПолноеИмя());
		
		МодельОбъекта = Новый Структура("ID, ObjectName, CollectionName");
		МодельОбъекта.ID             = XMLСтрока(Выборка.Ссылка);
		МодельОбъекта.ObjectName     = Имена.ИмяОбъекта;
		МодельОбъекта.CollectionName = Имена.ИмяКоллекции;
		
		Задача = Новый Структура;
		Задача.Вставить("ObjectModel",     МодельОбъекта);
		Задача.Вставить("Direction",       Выборка.НаправлениеЗадачи);
		Задача.Вставить("IsCompleted",     Выборка.Выполнена);
		Задача.Вставить("Number",          Выборка.Номер);
		Задача.Вставить("State",           Выборка.СостояниеПредставление);
		Задача.Вставить("Date",            Выборка.Дата);
		Задача.Вставить("Deadline",        Выборка.СрокИсполнения);
		Задача.Вставить("Name",            Выборка.Наименование);
		Задача.Вставить("Author",          Выборка.АвторПредставление);
		Задача.Вставить("Responsible",     Выборка.ИсполнительПредставление);
		Задача.Вставить("Importance",      Выборка.ВажностьПредставление);
		Задача.Вставить("Description",     Выборка.Описание);
		Задача.Вставить("Result",          Выборка.РезультатВыполнения);
		Задача.Вставить("Object",          Выборка.ПредметПредставление);
		Задача.Вставить("RelatedDocument", Неопределено);
		
		Если ЗначениеЗаполнено(Выборка.Предмет)
			И РеквизитыОбъектовЗадач.Количество() > 0 Тогда
			
			ОбъектЗадачи = РеквизитыОбъектовЗадач.Найти(Выборка.Предмет ,"ОбъектВизирования");
			Если ОбъектЗадачи <> Неопределено Тогда
				Задача.RelatedDocument = ЗаполнитьОбъектВизирования(ОбъектЗадачи, ПрикрепленныеФайлы, ЗапросПлатежнойПозиции, Истина);
			КонецЕсли;
		КонецЕсли;
		
		Задача.Вставить("Files", Новый Массив);
		Файлы = ПрикрепленныеФайлы[Выборка.Ссылка];
		Если ЗначениеЗаполнено(Файлы) Тогда
			Для каждого ДанныеФайла Из Файлы Цикл
				ИнформацияОФайле = Новый Структура;
				ИнформацияОФайле.Вставить("Name",        ДанныеФайла.Наименование);
				ИнформацияОФайле.Вставить("DateChanged", ДанныеФайла.ДатаМодификацииФайла);
				ИнформацияОФайле.Вставить("ID",          ДанныеФайла.ИдФайла);
				ИнформацияОФайле.Вставить("VersionID",   ДанныеФайла.ИдВерсии);
				ИнформацияОФайле.Вставить("Ext",         ДанныеФайла.Расширение);
				ИнформацияОФайле.Вставить("Size",        ДанныеФайла.Размер);
				Задача.Files.Добавить(ИнформацияОФайле);
			КонецЦикла;
		КонецЕсли;
		
		Результат.Добавить(Задача);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыОбъектов(ОбъектыЗадач, РежимАрхива = Ложь, РежимПолученияРеквизитов = Ложь)
	
	СписокОбъектовВизирования = Новый СписокЗначений;
	СписокОбъектовВизирования.ЗагрузитьЗначения(ОбъектыЗадач);
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(Новый ТаблицаЗначений, Новый УникальныйИдентификатор);
	МатрицаДоступа = Обработки.бит_КонсольОперативногоВизирования.МатрицаДоступа();
	
	ПараметрыПолучения = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыЗаполненияТаблицыВизирования();
	ПараметрыПолучения.МатрицаДоступа           = МатрицаДоступа;
	ПараметрыПолучения.ВыводитьВТаблицуЗначений = Истина;
	ПараметрыПолучения.ЭтоМобильноеПриложение   = Истина;
	ПараметрыПолучения.РежимАрхива              = РежимАрхива;
	ПараметрыПолучения.РежимПолученияРеквизитов = РежимПолученияРеквизитов;
	ПараметрыПолучения.Отбор.ОбъектВизирования  = СписокОбъектовВизирования;
	Обработки.бит_КонсольОперативногоВизирования.ЗаполнитьТаблицуВизирования(ПараметрыПолучения, АдресВХранилище);
	
	Результат = ПолучитьИзВременногоХранилища(АдресВХранилище);
	Возврат Результат.РезультатТаблицаЗначений;
	
КонецФункции

Функция ПринятьЗадачу(ID, Result)
	
	Результат    = Ложь;
	ЗадачаСсылка = Задачи.бит_Задача.ПолучитьСсылку(Новый УникальныйИдентификатор(ID));
	Если ЗначениеЗаполнено(ЗадачаСсылка) Тогда
		Структура = Новый Структура;
		Если ЗначениеЗаполнено(Result) Тогда
			Структура.Вставить("РезультатВыполнения", Result);
		КонецЕсли;
		Результат = Задачи.бит_Задача.ПринятьЗадачу(ЗадачаСсылка,,Структура);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьЗадачу(ID, Result)
	
	Результат    = Ложь;
	ЗадачаСсылка = Задачи.бит_Задача.ПолучитьСсылку(Новый УникальныйИдентификатор(ID));
	Если ЗначениеЗаполнено(ЗадачаСсылка) Тогда
		СтрПар = Новый Структура;
		Если ЗначениеЗаполнено(Result) Тогда
			СтрПар.Вставить("РезультатВыполнения", Result);
		КонецЕсли;
		Результат = Задачи.бит_Задача.ОтметитьВыполнение(ЗадачаСсылка,,,СтрПар);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьЗадачу(ID, Result)
	
	Результат    = Ложь;
	ЗадачаСсылка = Задачи.бит_Задача.ПолучитьСсылку(Новый УникальныйИдентификатор(ID));
	Если ЗначениеЗаполнено(ЗадачаСсылка) И ЗначениеЗаполнено(Result) Тогда
		ЗадачаОб = ЗадачаСсылка.ПолучитьОбъект();
		ЗадачаОб.РезультатВыполнения = Result;
		Результат = бит_ОбщегоНазначения.ЗаписатьЗадачу(ЗадачаОб);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьЗадачу(ПараметрыЗадачи)
	
	Name        = ПараметрыЗадачи.Name;
	Description = ПараметрыЗадачи.Description;
	Importance  = ПараметрыЗадачи.Importance;
	Deadline    = ПараметрыЗадачи.Deadline;
	Responsible = ПараметрыЗадачи.Responsible;
	ObjectName  = ПараметрыЗадачи.ObjectName;
	ObjectID    = ПараметрыЗадачи.ObjectID;
	VisaID      = ПараметрыЗадачи.VisaID;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Ложь;
	
	// Попытаемся найти ответственного по строке.
	ОтветственныйСсылка = НайтиПользователя(Responsible);
	Если НЕ ЗначениеЗаполнено(ОтветственныйСсылка) Тогда
		// Ответственный был указан неверно - ставим ответственным самого пользователя.
		ОтветственныйСсылка = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Попытка
		Важность = Перечисления.бит_ВидыВажностиЗадач[Importance];
	Исключение
		// Не удалось определить - по умолчанию.
		Важность = Перечисления.бит_Важность.Средняя;
	КонецПопытки;
	
	Попытка
		Срок = Дата(Deadline);
	Исключение
		// Не удалось определить - по умолчанию
		Срок = НачалоДня(КонецДня(ТекущаяДатаСеанса())+1);
	КонецПопытки;
	
	Предмет = Неопределено;
	Если ЗначениеЗаполнено(ObjectName) И ЗначениеЗаполнено(ObjectID) Тогда
		Если бит_РаботаСМетаданными.ОбъектПринадлежитКоллекцииМетаданных("Документы",ObjectName) Тогда
			Предмет = Документы[ObjectName].ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectID));
		ИначеЕсли бит_РаботаСМетаданными.ОбъектПринадлежитКоллекцииМетаданных("Справочники",ObjectName) Тогда
			Предмет = Справочники[ObjectName].ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectID));
		КонецЕсли;
	КонецЕсли;
	
	Виза = Справочники.бит_Визы.ПустаяСсылка();
	Если ЗначениеЗаполнено(VisaID) Тогда
		Виза = Справочники.бит_Визы.ПолучитьСсылку(Новый УникальныйИдентификатор(VisaID));
	КонецЕсли;
	
	СтрЗадача = Задачи.бит_Задача.СтруктураЗадачи();
	СтрЗадача.Наименование    = Name;
	СтрЗадача.Описание        = Description;
	СтрЗадача.Важность        = Важность;
	СтрЗадача.Исполнитель     = ОтветственныйСсылка;
	СтрЗадача.СрокИсполнения  = Срок;
	СтрЗадача.СпособАдресации = 0;
	СтрЗадача.Предмет         = Предмет;
	СтрЗадача.Виза            = Виза;
	
	МаксКоличествоОбъектов = бит_УправлениеПроцессами.МаксимальноеКоличествоОбъектовАдресации();
	ЗадачаСсылка = Задачи.бит_Задача.СоздатьНовуюЗадачу(СтрЗадача, МаксКоличествоОбъектов);
	Результат = ?(ЗначениеЗаполнено(ЗадачаСсылка), Истина, Ложь);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Файлы

// Функция получает информацию о файлах, прикрепленных к документам.
Функция ПолучитьИнформациюФайлов(Объекты)
	
	ПрикрепленныеФайлы = Новый Соответствие;
	
	Если НЕ ЗначениеЗаполнено(Объекты) Тогда
		Возврат ПрикрепленныеФайлы;	
	КонецЕсли;
	
	ШаблонЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаХранения.ВладелецФайла КАК ВладелецФайла,
	|	ТаблицаХранения.Ссылка КАК Файл,
	|	ТаблицаХранения.Наименование КАК Наименование,
	|	ТаблицаХранения.ДатаМодификацииУниверсальная КАК ДатаМодификацииФайла,
	|	ТаблицаХранения.Расширение КАК Расширение,
	|	ТаблицаХранения.Размер КАК Размер
	|ИЗ
	|	&ИмяТаблицыХранения КАК ТаблицаХранения
	|ГДЕ
	|	НЕ ТаблицаХранения.ПометкаУдаления
	|	И ТаблицаХранения.ВладелецФайла В(&ИмяПараметраВладельцев)";
	
	Разделитель =
	"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";
	
	ШаблонЗапросаИтоги = 
	"
	|
	|ИТОГИ ПО
	|	ВладелецФайла";
	
	ТекстыЗапросов = Новый Массив;
	НомерЗапроса = 1;
	// Группируем ссылки по именам объектов.
	СсылкиПоТипам = СгруппироватьОбъектыПоТипам(Объекты);
	Запрос = Новый Запрос;
	Для каждого КиЗ Из СсылкиПоТипам Цикл
		ИмяСправочника = КиЗ.Ключ + "ПрисоединенныеФайлы";
		ОбъектМетаданных = Метаданные.Справочники.Найти(ИмяСправочника);
		Если ОбъектМетаданных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ПравоДоступа("Чтение", ОбъектМетаданных) Тогда
			Продолжить;
		КонецЕсли;
		ИмяПараметраВладельцев = "МассивСсылок_" + Формат(НомерЗапроса, "ЧГ=");
		Запрос.УстановитьПараметр(ИмяПараметраВладельцев, КиЗ.Значение);
		ТекстЗапроса = ШаблонЗапроса;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяПараметраВладельцев", ИмяПараметраВладельцев);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицыХранения", "Справочник." + ИмяСправочника);
		Если НомерЗапроса = 1 Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		КонецЕсли;
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		НомерЗапроса = НомерЗапроса + 1;
	КонецЦикла;
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, Разделитель);
	
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Возврат ПрикрепленныеФайлы;	
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ШаблонЗапросаИтоги;
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	ВыборкаВладелец = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВладелец.Следующий() Цикл
		Выборка = ВыборкаВладелец.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Файлы = Новый Массив;
		Пока Выборка.Следующий() Цикл
			ДанныеФайла = Новый Структура;
			ДанныеФайла.Вставить("Размер"              , Выборка.Размер);
			ДанныеФайла.Вставить("Расширение"          , Выборка.Расширение);
			ДанныеФайла.Вставить("Наименование"        , Выборка.Наименование);
			ДанныеФайла.Вставить("ДатаМодификацииФайла", Выборка.ДатаМодификацииФайла);
			ДанныеФайла.Вставить("ИдФайла"             , XMLСтрока(Выборка.Файл));
			ДанныеФайла.Вставить("ИдВерсии"            , XMLСтрока(Выборка.Файл));
			Файлы.Добавить(ДанныеФайла);
		КонецЦикла;
		ПрикрепленныеФайлы.Вставить(ВыборкаВладелец.ВладелецФайла, Файлы);
	КонецЦикла;
	
	// Дополним прикрепленные файлы файлами проектов договоров.
	бит_МобильноеПриложениеПереопределяемый.ПрикрепленныеФайлыПроектовДоговоров(ПрикрепленныеФайлы, СсылкиПоТипам);
	
	Возврат ПрикрепленныеФайлы;
	
КонецФункции

// Группирует массив объектов по типам объектов.
Функция СгруппироватьОбъектыПоТипам(Объекты)
	
	СсылкиПоТипам = Новый Структура;
	Для каждого ТекДок Из Объекты Цикл
		ИмяДок = ТекДок.Метаданные().Имя;
		Если СсылкиПоТипам.Свойство(ИмяДок) Тогда
			СсылкиПоТипам[ИмяДок].Добавить(ТекДок);
		Иначе
			СсылкиПоТипам.Вставить(ИмяДок, Новый Массив);
			СсылкиПоТипам[ИмяДок].Добавить(ТекДок);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СсылкиПоТипам;
	
КонецФункции

#КонецОбласти

#Область ДопИзмерения

Функция ПолучитьНазначенияДополнительныхИзмерений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДопИзмерения.ИмяИзмерения КАК ИмяИзмерения,
	|	ДопИзмерения.Синоним КАК Синоним
	|ИЗ
	|	РегистрСведений.бит_НазначениеДополнительныхИзмерений КАК ДопИзмерения";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Измерения = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДопИзмерение = Новый Структура("Name, Description", Выборка.ИмяИзмерения, Выборка.Синоним);
		Измерения.Добавить(ДопИзмерение);
	КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Измерения;
	
КонецФункции

Функция ПолучитьОбъектыСДопИзмерениями(ДанныеЗапроса)
	
	Если НЕ ТипЗнч(ДанныеЗапроса) = Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;
	
	Результат = Новый Массив;
	ОбъектыКонфигурации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗапроса, "ObjectTypes", Неопределено);
	Если ТипЗнч(ОбъектыКонфигурации) = Тип("Массив") Тогда
		Для каждого ОбъектКонфигурации Из ОбъектыКонфигурации Цикл
			ТипОбъекта = ОбъектКонфигурации.ObjectType;
			Если СтрНачинаетсяС(ТипОбъекта, "ДокументСсылка.") Тогда
				ОбъектыВизирования = ОбъектКонфигурации.DocsArray;
				Аналитики    = ОбъектКонфигурации.AnalyticsArray;
				ИмяДокумента = СтрЗаменить(ТипОбъекта, "ДокументСсылка.", "");
				ДокументыСДопИзмерениями = Новый Массив;
				Для каждого ОбъектаУИД Из ОбъектыВизирования Цикл
					ДокументУИД    = Новый УникальныйИдентификатор(ОбъектаУИД);
					ДокументСсылка = Документы[ИмяДокумента].ПолучитьСсылку(ДокументУИД);
					ДокументыСДопИзмерениями.Добавить(ДокументСсылка);
				КонецЦикла;
				СуществующиеАналитики = ПолучитьСуществующиеАналитики(ИмяДокумента, Аналитики);
				СформироватьДанныеПоДопИзмерениям(ТипОбъекта, ИмяДокумента, ДокументыСДопИзмерениями, СуществующиеАналитики, Результат);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСуществующиеАналитики(ИмяДокумента, Аналитики)
	
	Результат     = Новый Массив;
	МетаДокумента = Метаданные.Документы[ИмяДокумента];
	Для каждого ИмяАналитики Из Аналитики Цикл
		Если МетаДокумента.Реквизиты.Найти(ИмяАналитики) <> Неопределено Тогда
			Результат.Добавить(ИмяАналитики);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура СформироватьДанныеПоДопИзмерениям(ТипОбъекта, ИмяДокумента, Документы, Аналитики, Результат)	
	
	ОбъектМетаданных = Метаданные.Документы.Найти(ИмяДокумента);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документы", Документы);
	Запрос.УстановитьПараметр("СписокАналитик", "");
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	&СписокАналитик КАК СписокАналитик
	|ИЗ
	|	#Таблица КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка В(&Документы)";

	// Поля аналитики.
	Если ЗначениеЗаполнено(Аналитики) Тогда
		ПоляВыбора = Новый Массив;
		Для каждого ИмяАналитики Из Аналитики Цикл
			ПутьКДанным = СтрШаблон("ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(%1, """")) КАК %1", ИмяАналитики);
			ПоляВыбора.Добавить(ПутьКДанным);
		КонецЦикла;
		Разделитель = ",
		|	";
		ПоляВыбора = СтрСоединить(ПоляВыбора, Разделитель);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СписокАналитик КАК СписокАналитик", ПоляВыбора);
	КонецЕсли;
	
	// Таблица документа.
	ЧтоЗаменить = "#Таблица";
	НаЧтоЗаменить = ОбъектМетаданных.ПолноеИмя();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, НаЧтоЗаменить);
	Запрос.Текст = ТекстЗапроса;
	
	// Обход результата.
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		АналитикиОтвет = Новый Массив;
		Для каждого ИмяАналитики Из Аналитики Цикл
			ЗначениеАналитики = Выборка[ИмяАналитики];
			Если ЗначениеЗаполнено(ЗначениеАналитики) Тогда
				СтруктураАналитика = Новый Структура("Name, Value", ИмяАналитики, ЗначениеАналитики);
				АналитикиОтвет.Добавить(СтруктураАналитика);
			КонецЕсли;
		КонецЦикла;
		СтруктураОтвет = Новый Структура;
		СтруктураОтвет.Вставить("ObjectType", ТипОбъекта);
		СтруктураОтвет.Вставить("Id",         XMLСтрока(Выборка.Ссылка));
		СтруктураОтвет.Вставить("Analytics",  АналитикиОтвет);
		Результат.Добавить(СтруктураОтвет);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Пользователи

// Функция выполняет поиск пользователя по имени.
//
// Параметры:
//  ИмяПользователя - Строка
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи -  ссылка на пользователя.
//
Функция НайтиПользователя(ИмяПользователя)
	
	УстановитьПривилегированныйРежим(Истина);
	НайденныйПользователь = Справочники.Пользователи.ПустаяСсылка();
	
	НайденныйПользователь = Пользователи.НайтиПоИмени(ИмяПользователя);
	
	Если НЕ ЗначениеЗаполнено(НайденныйПользователь) Тогда
		НайденныйПользователь = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НайденныйПользователь) Тогда
		ПользовательИБ =  ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
		Если НЕ ПользовательИБ = Неопределено Тогда
			НайденныйПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",ПользовательИБ.УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НайденныйПользователь) Тогда
		НайденныйПользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Возврат НайденныйПользователь;
	
КонецФункции

Функция ПолучитьПользователей()
	
	ПользователиСистемы = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Пользователи.Ссылка КАК Ссылка,
	|	Пользователи.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(Пользователи.Подразделение.Наименование, """") КАК ПодразделениеНаименование,
	|	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.Недействителен";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПользовательСсылка = Выборка.Ссылка;
		ПользовательИБ     = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ);
		// Если у пользователя нет доступа в базу,
		// тогда пропускаем его.
		Если ПользовательИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ПользовательСистемы             = Новый Структура("Id, Name, Department");
		ПользовательСистемы.Name        = ПользовательИБ.Имя;
		ПользовательСистемы.Id          = XMLСтрока(ПользовательСсылка);
		ПользовательСистемы.Department  = Выборка.ПодразделениеНаименование;
		ПользователиСистемы.Добавить(ПользовательСистемы);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПользователиСистемы;
	
КонецФункции

#КонецОбласти

#Область ФормированиеТабличныхЧастейHTML

Функция СформироватьТабличнуюЧастьHTML(ДанныеЗапроса)
	
	Если НЕ ТипЗнч(ДанныеЗапроса) = Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;
	
	ТипОбъекта = ДанныеЗапроса.ObjectType;
	ИдентификаторОбъекта = ДанныеЗапроса.ID;
	
	ОбъектСсылка = ПолучитьСсылку(ТипОбъекта, ИдентификаторОбъекта);
	Если ОбъектСсылка = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Объект в системе не найден.'; en = 'An object was not found in the system.'");
		Возврат ТекстСообщения;
	КонецЕсли;
	
	ДопАналитики = ПолучитьСоставДопАналитик();
	Если бит_МобильноеПриложениеПереопределяемый.ЕстьУникальнаяТабличнаяЧасть(ОбъектСсылка) Тогда
		Результат = бит_МобильноеПриложениеПереопределяемый.УникальнаяТабличнаяЧасть(ОбъектСсылка, ДопАналитики);
	Иначе
		Заголовок = Строка(ОбъектСсылка);
		ШаблонHTMLДокумента =
		"<!DOCTYPE html>
		|
		|<head>
		|    <meta charset=""UTF-8"">
		|    <title>%title%</title>
		|    <style>
		|        table {
		|            border-collapse: collapse;
		|            line-height: 1.1;
		|            font-family: ""Lucida Sans Unicode"", ""Lucida Grande"", sans-serif;
		|            color: #0C213B;
		|        }
		|
		|        th {
		|            padding: 10px;
		|            border: 1px solid grey;
		|            background: lightgrey;
		|        }
		|
		|        td {
		|            font-size: 0.8em;
		|            padding: 5px 7px;
		|            border: 1px solid grey;
		|        }
		|    </style>
		|</head>
		|
		|<body>
		|    <h2>%title%</h2>
		|    %body%
		|</body>
		|
		|</html>";
		
		ШаблонHTMLДокумента = СтрЗаменить(ШаблонHTMLДокумента, "%title%", Заголовок);
		ТелоHTMLДокумента  = ТелоHTMLДокумента(ОбъектСсылка, ДопАналитики);
		Результат = СтрЗаменить(ШаблонHTMLДокумента, "%body%", ТелоHTMLДокумента);
 	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТелоHTMLДокумента(ОбъектСсылка, ДопАналитики)
	
	ИменаТабличныхЧастей = ИменаТабличныхЧастей(ОбъектСсылка);
	Если НЕ ЗначениеЗаполнено(ИменаТабличныхЧастей) Тогда
		ТелоHTMLДокумента = НСтр("ru = '<h3>У объекта нет табличной части(ей).</h3>';
		                         |en = '<h3>The object does not have any table part(s).</h3>'");
		Возврат ТелоHTMLДокумента;
	КонецЕсли;

	МетаОбъект = ОбъектСсылка.Метаданные();
	
	ИсключитьСтолбцы = Новый Массив;
	ИсключитьСтолбцы.Добавить("ИД");
	ИсключитьСтолбцы.Добавить("ИД_Прогноз");
	ИсключитьСтолбцы.Добавить("ИДВладельца");
	ИсключитьСтолбцы.Добавить("КоэффициентРаспределения");
	ИсключитьСтолбцы.Добавить("УдалитьНазначениеПлатежа");
	ИсключитьСтолбцы.Добавить("Расчетная");
	ИсключитьСтолбцы.Добавить("Удалить_Сценарий");
	ИсключитьСтолбцы.Добавить("Служебный");
	
	// Обход табличных частей объекта.
	СтрокиТелаHTMLДокумента = Новый Массив;
	Для каждого ИмяТабличнойЧасти Из ИменаТабличныхЧастей Цикл
		
		Попытка
			МетаТабличнаяЧасть = МетаОбъект.ТабличныеЧасти[ИмяТабличнойЧасти];
		Исключение
			ТелоHTMLДокумента = НСтр("ru = '<h3>Табличной части с именем ""%1"" не существует.</h3>';
			                         |en = '<h3>The table part named ""%1"" does not exist.</h3>'");
			ТелоHTMLДокумента = СтрШаблон(ТелоHTMLДокумента, ИмяТабличнойЧасти);
			Возврат ТелоHTMLДокумента;
		КонецПопытки;
		
		// Заголовок табличной части
		ЗаголовокТабличнойЧасти = "<h3>%1</h3>";
		ЗаголовокТабличнойЧасти = СтрШаблон(ЗаголовокТабличнойЧасти, МетаТабличнаяЧасть.Синоним);
		СтрокиТелаHTMLДокумента.Добавить(ЗаголовокТабличнойЧасти);
		
		// Табличная часть.
		СтрокиТелаHTMLДокумента.Добавить("<table>");
		
		// Добавление первой строки, названия колонок.
		СтрокиТелаHTMLДокумента.Добавить("<tr>");
		КолонкиТаблицы = Новый Массив;
		Для каждого КолонкаТаблицы Из МетаТабличнаяЧасть.Реквизиты Цикл
			
			Если НЕ ИсключитьСтолбцы.Найти(КолонкаТаблицы.Имя) = Неопределено 
				ИЛИ НЕ СтрНайти(КолонкаТаблицы.Имя, "_Старый") = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяКолонки = КолонкаТаблицы.Синоним;
			
			// Проверка на аналитику.
			НайденнаяАналитика = Неопределено;
			ДопАналитики.Свойство(КолонкаТаблицы.Имя, НайденнаяАналитика);
			Если ЗначениеЗаполнено(НайденнаяАналитика) Тогда
				Если НайденнаяАналитика.Используется Тогда
					ИмяКолонки = НайденнаяАналитика.Синоним;
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			ЗаголовокТаблицы = СтрШаблон("<th>%1</th>", ИмяКолонки);
			СтрокиТелаHTMLДокумента.Добавить(ЗаголовокТаблицы);
			
			КолонкиТаблицы.Добавить(КолонкаТаблицы.Имя);
		КонецЦикла;
		СтрокиТелаHTMLДокумента.Добавить("</tr>");
		
	    // Добавление строк с данными табличной части.
		Для каждого ТекущаяСтрока Из ОбъектСсылка[ИмяТабличнойЧасти] Цикл
			СтрокиТелаHTMLДокумента.Добавить("<tr>");
			Для каждого КолонкаТаблицы Из КолонкиТаблицы Цикл
				ДанныеКолонки = ТекущаяСтрока[КолонкаТаблицы];
				ДанныеКолонки = СтрШаблон("<td>%1</td>", ДанныеКолонки);
				СтрокиТелаHTMLДокумента.Добавить(ДанныеКолонки);
			КонецЦикла;
			СтрокиТелаHTMLДокумента.Добавить("</tr>");
		КонецЦикла;
		
		СтрокиТелаHTMLДокумента.Добавить("</table>");
		СтрокиТелаHTMLДокумента.Добавить("</br>");		
	КонецЦикла;

	ТелоHTMLДокумента = СтрСоединить(СтрокиТелаHTMLДокумента, Символы.ПС);
	
	Возврат ТелоHTMLДокумента;
	
КонецФункции

Функция ИменаТабличныхЧастей(ОбъектСсылка)
	
	ИменаТабличныхЧастей = Новый Массив;
	
	Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.бит_АктуализацияБюджета")
		ИЛИ ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.бит_ФормаВводаБюджета")
		ИЛИ ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.бит_КорректировкаБюджета") Тогда
		
		ИменаТабличныхЧастей.Добавить("БДДС");
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.бит_ВерсияОтчета") Тогда
		
		ИменаТабличныхЧастей.Добавить("ПараметрыХранение");
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.бит_ДополнительныеУсловияПоДоговору") Тогда
		
		ИменаТабличныхЧастей.Добавить("ГрафикПлатежей");
		ИменаТабличныхЧастей.Добавить("ГрафикНачислений");
		ИменаТабличныхЧастей.Добавить("ГрафикВыдачиТраншей");
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.бит_КорректировкаКонтрольныхЗначений") Тогда
		
		ИменаТабличныхЧастей.Добавить("УвеличениеЛимита");
		ИменаТабличныхЧастей.Добавить("УменьшениеЛимита");
	Иначе
		бит_МобильноеПриложениеПереопределяемый.ИменаТабличныхЧастей(ОбъектСсылка, ИменаТабличныхЧастей);
	КонецЕсли;
	
	Возврат ИменаТабличныхЧастей;

КонецФункции

#КонецОбласти

#Область ОстаткиПоБюджету

Функция ПолучитьОстаткиПоБюджету(ДанныеЗапроса)
	
	Если НЕ ТипЗнч(ДанныеЗапроса) = Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если бит_МобильноеПриложениеПереопределяемый.ЭтоСправочник(ДанныеЗапроса.ObjectType) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипДокумента            = ДанныеЗапроса.ObjectType;
	УникальныйИдентификатор = Новый УникальныйИдентификатор(ДанныеЗапроса.Id);
	ОбъектСсылка            = Документы[ТипДокумента].ПолучитьСсылку(УникальныйИдентификатор);
	
	Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДеревоИнформация = бит_МобильноеПриложениеПереопределяемый.ДанныеОбъекта(ОбъектСсылка);
	
	Если НЕ ЗначениеЗаполнено(ДеревоИнформация) Тогда
		ТекстСообщения = НСтр("ru = 'По данному объекту нет дополнительной информации.';
                              |en = 'There is no additional information on this property.'");
		Возврат ТекстСообщения;
	КонецЕсли;
	
	Результат = Новый Массив;
	Для каждого Строка Из ДеревоИнформация.Строки Цикл
		
		Если СтрСравнить(Строка.Имя, "СуммаДокумента") = 0 Тогда
			Имя      = "DocumentSums";
			Описание = Строка.ИмяПараметра;
		ИначеЕсли СтрСравнить(Строка.Имя, "СведенияОбОплате") = 0 Тогда
			Имя      = "PaymentDetails";
			Описание = Строка.ИмяПараметра;
		ИначеЕсли СтрСравнить(Строка.Имя, "ОстаткиПобюджету") = 0 Тогда
			Имя      = "Balances";
			Описание = Строка.ИмяПараметра;
		Иначе
			Продолжить;
		КонецЕсли;
		
		Раздел = Новый Структура("Name, Description, Details", Имя, Описание);
		Детали = Новый Массив;
		
		Для каждого строка2 Из Строка.Строки Цикл
			Если строка2.ЭтоГруппа Тогда
				СтатьиОборотов = Новый Массив;
				Для каждого строка3 Из строка2.Строки Цикл
					Entry = Новый Структура("Name, Value", строка3.ИмяПараметра, Строка(строка3.ЗначениеПараметра));
					СтатьиОборотов.Добавить(Entry);
				КонецЦикла;
				Detail = Новый Структура("Name, Entries", строка2.ИмяПараметра, СтатьиОборотов);
			Иначе
				Detail = Новый Структура("Name, Value", строка2.ИмяПараметра, Строка(строка2.ЗначениеПараметра));
			КонецЕсли;
			Детали.Добавить(Detail);
		КонецЦикла;
		
		Раздел.Details = Детали;
		Результат.Добавить(Раздел);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ИнформацияОСервисеПолная()
	
	УстановитьПривилегированныйРежим(Истина);
	СисИнфо                                 = бит_ОбщегоНазначения.ПолучитьСведенияОПрограмме();
	ИнформацияОСервисе                      = Новый Структура("ServiceVersion, ConfigurationName, ConfigurationVersion");
	ИнформацияОСервисе.ServiceVersion       = ВерсияСервиса();
	ИнформацияОСервисе.ConfigurationName    = СисИнфо.Имя_1С;
	ИнформацияОСервисе.ConfigurationVersion = СисИнфо.НомерРелиза_1С;
	
	Возврат ИнформацияОСервисе;
	
КонецФункции

Функция ПолучитьСоставДопАналитик()
	
	ДопАналитики          = ПолучитьНазначенияДополнительныхИзмерений();
	МаксКолвоДопАналитик  = бит_МеханизмДопИзмерений.ПолучитьМаксимальноеКоличествоДополнительныхИзмерений();
	ДопАналитикиСтруктура = Новый Структура;
	
	Для Номер = 1 По МаксКолвоДопАналитик Цикл
		АналитикаСтруктура = Новый Структура("Синоним, Используется", "", Ложь);
		ДопАналитикиСтруктура.Вставить("Аналитика_"+Номер, АналитикаСтруктура);
	КонецЦикла;
	
	Для каждого Аналитика Из ДопАналитики Цикл
		Если НЕ ДопАналитикиСтруктура.Свойство(Аналитика) = Неопределено Тогда
			ДопАналитикиСтруктура[Аналитика.Name].Синоним = Аналитика.Description;
			ДопАналитикиСтруктура[Аналитика.Name].Используется = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДопАналитикиСтруктура;
	
КонецФункции

Функция ДополнительныеРеквизитыОбъекта(ОбъектСсылка)
	
	// N.B. Требуется рефакторинг.
	МетаОбъект  = ОбъектСсылка.Метаданные();
	Результат   = Новый Массив;
	ИмяТаблицы  = "ДополнительныеРеквизиты";
	МетаТаблица = МетаОбъект.ТабличныеЧасти.Найти(ИмяТаблицы);
	Если НЕ МетаТаблица = Неопределено Тогда
		Для каждого ТекущаяСтрока Из ОбъектСсылка[ИмяТаблицы] Цикл
			// Мобильное приложение чувствительно к регистру ключей этой структуры!!!!
			ДополнительныйРеквизит             = Новый Структура("ID, Description, Value");
			ДополнительныйРеквизит.Id          = XMLСтрока(ТекущаяСтрока.Свойство);
			ДополнительныйРеквизит.Description = ТекущаяСтрока.Свойство.Заголовок;
			ДополнительныйРеквизит.Value       = Строка(ТекущаяСтрока.Значение);
			Результат.Добавить(ДополнительныйРеквизит);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользоватьВнутреннююТаблицу(ОбъектСсылка)
	
	Возврат бит_МобильноеПриложениеПереопределяемый.ЭтоРеестр(ОбъектСсылка)
	
КонецФункции

Функция ВерсияСервиса()
	
	Возврат "1.1.2.6";
	
КонецФункции

Процедура ЗарегистрироватьИнформацию(ИмяСобытия, ТекстИнформации = "")
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,
	    Метаданные.HTTPСервисы.bit_ApprovalServiceNew,, ТекстИнформации);
	
КонецПроцедуры

Процедура ЗарегистрироватьОшибку(ИмяСобытия, ТекстОшибки = "")
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,
	    Метаданные.HTTPСервисы.bit_ApprovalServiceNew,, ТекстОшибки);
	
КонецПроцедуры

Функция ЗначениеИзСтрокиJSON(Значение)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Значение);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьОтветJSON(ПередаваемыеДанные, КодСостояния = 200)
	
	СтрокаДляОтвета = СформироватьJSON(ПередаваемыеДанные);
	Ответ           = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.Заголовки.Вставить("Content-type", "application/JSON; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат Ответ;
	
КонецФункции

Функция СформироватьJSON(ПередаваемыеДанные)
	
	ЗаписьJSON          = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, ПередаваемыеДанные);

	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция СформироватьОтветHTML(ТелоДокумента)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ТелоДокумента, КодировкаТекста.UTF8);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьСсылку(ТипОбъекта, ИдентификаторОбъекта)
	
	ПозицияРазделителя = Найти(ТипОбъекта, ".");
	
	Если НЕ ПозицияРазделителя = 0 Тогда
		ТипОбъекта = Сред(ТипОбъекта, ПозицияРазделителя+1, СтрДлина(ТипОбъекта));
	КонецЕсли;
	
	Если бит_МобильноеПриложениеПереопределяемый.ЭтоСправочник(ТипОбъекта) Тогда
		МенеджерОбъекта = Справочники[ТипОбъекта];
	Иначе
		МенеджерОбъекта = Документы[ТипОбъекта];
	КонецЕсли;
	
	Попытка
		УИД            = Новый УникальныйИдентификатор(ИдентификаторОбъекта);
		ОбъектСсылка   = МенеджерОбъекта.ПолучитьСсылку(УИД);
		ДокументОбъект = ОбъектСсылка.ПолучитьОбъект();
	Исключение
		ДокументОбъект = Неопределено;
	КонецПопытки;
	
	Если ДокументОбъект = Неопределено Тогда
		ОбъектСсылка = Неопределено;
	КонецЕсли;
	
	Возврат ОбъектСсылка;
	
КонецФункции

// Функция реализует проверку настройки "Необходим комментарий или задача" по всем вариантам
Функция НеобходимКомментарийЗадачаПолнаяПроверка(Организация, ПолноеИмяОбъекта, ВидРешения)
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(ПолноеИмяОбъекта);
	
	// 1. Организация, ОбъектСистемы, ВидРешения - все реквизиты заполнены
	Результат = бит_МобильноеПриложениеПереопределяемый.НеобходимКомментарийЗадача(Организация,
	    ОбъектСистемы, ВидРешения);
		
	Если Результат.ЗаписьСуществует Тогда
		Возврат Результат.НеобходимКомментарийЗадача;
	КонецЕсли;
	
	// 2. ОбъектСистемы, ВидРешения - реквизиты заполнены, Организация - не заполнена.
	Результат = бит_МобильноеПриложениеПереопределяемый.НеобходимКомментарийЗадача(
	    Справочники.Организации.ПустаяСсылка(), ОбъектСистемы, ВидРешения);
		
	Если Результат.ЗаписьСуществует Тогда
		Возврат Результат.НеобходимКомментарийЗадача;
	КонецЕсли;
	
	// 3. Организация, ВидРешения - реквизиты заполнены, ОбъектСистемы - не заполнен.
	Результат = бит_МобильноеПриложениеПереопределяемый.НеобходимКомментарийЗадача(
	    Организация, Справочники.бит_ОбъектыСистемы.ПустаяСсылка(), ВидРешения);
		
	Если Результат.ЗаписьСуществует Тогда
		Возврат Результат.НеобходимКомментарийЗадача;
	КонецЕсли;
	
	// 4. ВидРешения - реквизит заполнены, Организация, ОбъектСистемы - не заполнены.
	Результат = бит_МобильноеПриложениеПереопределяемый.НеобходимКомментарийЗадача(
		Справочники.Организации.ПустаяСсылка(), Справочники.бит_ОбъектыСистемы.ПустаяСсылка(), ВидРешения);
		
	Если Результат.ЗаписьСуществует Тогда
		Возврат Результат.НеобходимКомментарийЗадача;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьОбъектыСистемы(ИменаОбъектов)
	
	Результат = Новый Массив;
	Результат.Добавить(Справочники.бит_ОбъектыСистемы.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИменаОбъектов", ИменаОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыСистемы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК ОбъектыСистемы
	|ГДЕ
	|	ОбъектыСистемы.ИмяОбъекта В(&ИменаОбъектов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеТабличнойЧасти(ДанныеЗапроса)
	
	Результат = Новый Структура;
	Результат.Вставить("Version",      "");
	Результат.Вставить("ErrorMessage", "");
	Результат.Вставить("Lines",         Новый Массив);
	
	Если НЕ ТипЗнч(ДанныеЗапроса) = Тип("Структура") Тогда
		Результат.ErrorMessage = НСтр("ru = 'Неверные данные для обработки.'; en = 'Incorrect data for processing.'",
		    ОбщегоНазначения.КодОсновногоЯзыка());
		Возврат Результат;
	КонецЕсли;
	
	ТипОбъекта = ДанныеЗапроса.ObjectType;
	ИдентификаторОбъекта = ДанныеЗапроса.ID;
	
	ОбъектСсылка = ПолучитьСсылку(ТипОбъекта, ИдентификаторОбъекта);
	Если ОбъектСсылка = Неопределено Тогда
		Результат.ErrorMessage = НСтр("ru = 'Объект не найден.'; en = 'Object not found.'",
		    ОбщегоНазначения.КодОсновногоЯзыка());
		Возврат Результат;
	КонецЕсли;
	
	бит_МобильноеПриложениеПереопределяемый.ДанныеТабличнойЧасти(ОбъектСсылка, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УстановитьДанныеТабличнойЧасти(ДанныеЗапроса = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("ErrorMessage", "");
	
	Если НЕ ТипЗнч(ДанныеЗапроса) = Тип("Структура") Тогда
		Результат.ErrorMessage = НСтр("ru = 'Неверные данные для обработки.'; en = 'Incorrect data for processing.'",
		    ОбщегоНазначения.КодОсновногоЯзыка());
		Возврат Результат;
	КонецЕсли;
	
	ТипОбъекта = ДанныеЗапроса.ObjectType;
	ИдентификаторОбъекта = ДанныеЗапроса.ID;
	
	ОбъектСсылка = ПолучитьСсылку(ТипОбъекта, ИдентификаторОбъекта);
	Если ОбъектСсылка = Неопределено Тогда
		Результат.ErrorMessage = НСтр("ru = 'Объект не найден.'; en = 'Object not found.'",
		    ОбщегоНазначения.КодОсновногоЯзыка());
		Возврат Результат;
	КонецЕсли;
	
	Если ДанныеЗапроса.Lines.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	бит_МобильноеПриложениеПереопределяемый.УстановитьДанныеТабличнойЧасти(ОбъектСсылка, ДанныеЗапроса, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОбъектПоИдентификатору(ПараметрыОбъекта)
	
	Ид              = ПараметрыОбъекта.ID;
	Имя             = ПараметрыОбъекта.ObjectName;
	Результат       = Неопределено;
	ТекПользователь = Пользователи.ТекущийПользователь();
	
	// Получаем ссылку.
	Если НЕ ЗначениеЗаполнено(Имя) Тогда
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода GetObject.
                               |Пустое значение обязательного параметра ObjectName';
                               |en = 'HTTP service bit_ApprovalServiceNew. GetObject method error.
                               |Empty value of the required parameter ObjectName'");
		ИмяСобытия = НСтр("ru = 'approval/v1/object'; en = 'approval/v1/object'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		Возврат Результат;
	КонецЕсли;
	
	Если бит_МобильноеПриложениеПереопределяемый.ЭтоСправочник(Имя) Тогда
		МенеджерОбъекта = Справочники[Имя];
	Иначе
		МенеджерОбъекта = Документы[Имя];
	КонецЕсли;
	
	УИД = Новый УникальныйИдентификатор(Ид);
	СсылкаОбъекта = МенеджерОбъекта.ПолучитьСсылку(УИД);
	
	Если ОбщегоНазначения.СсылкаСуществует(СсылкаОбъекта) Тогда
		Объекты = Новый Массив();
		Объекты.Добавить(СсылкаОбъекта);
		РеквизитыОбъектов = РеквизитыОбъектов(Объекты);
		// Получение сведений о прикрепленных файлах.
		ПрикрепленныеФайлы = ПолучитьИнформациюФайлов(Объекты);
		
		ЗаявкаНаРС = РеквизитыОбъектов.Найти(СсылкаОбъекта, "ОбъектВизирования");
		Если ЗаявкаНаРС <> Неопределено Тогда
			ЗапросПлатежнойПозиции = бит_МобильноеПриложениеПереопределяемый.ЗапросПлатежнойПозиции();
			Результат = ЗаполнитьОбъектВизирования(ЗаявкаНаРС, ПрикрепленныеФайлы, ЗапросПлатежнойПозиции);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаВДату(Знач Значение)
	
	Если НЕ ПустаяСтрока(Значение) Тогда
		Значение = Лев(Значение, 8);
		Значение = СтроковыеФункцииКлиентСервер.СтрокаВДату(Значение);
	Иначе
		Значение = Дата('0001.01.01');
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция НовоеОписаниеОшибки()
	
	// К сожалению, возникла непредвиденная ошибка.
	СообщениеПользователю = НСтр("ru = 'Что-то пошло не так, обратитесь в техническую поддержку.';
	                             |en = 'Something went wrong, please contact technical support.'");
	
	ОписаниеОшибки = Новый Структура;
	ОписаниеОшибки.Вставить("message", СообщениеПользователю); // Текст сообщения пользователю.
	ОписаниеОшибки.Вставить("error",   ""); // Краткое техническое описание ошибки для разработчика.
	ОписаниеОшибки.Вставить("detail",  ""); // Технические детали для разработчика, ИнформацияОбОшибке.
	ОписаниеОшибки.Вставить("code",    ""); // Резерв. Код ошибки, не состояния.
	
	Возврат ОписаниеОшибки;
	
КонецФункции

#КонецОбласти