#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение видов документов иностранного работника.
Процедура НачальноеЗаполнение() Экспорт
	
	СправочникСсылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.бит_ум_ВидыДокументовИР.Патент");
	Если СправочникСсылка <> Неопределено Тогда
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		СправочникОбъект.ИспользоватьДопПоле = Истина;
		СправочникОбъект.НазваниеДопПоля = "Серия и номер бланка";
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	КонецЕсли;
	
	СправочникСсылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.бит_ум_ВидыДокументовИР.Приглашение");
	Если СправочникСсылка <> Неопределено Тогда
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		СправочникОбъект.ИспользоватьДопПоле = Истина;
		СправочникОбъект.НазваниеДопПоля = "Серия и номер бланка";
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	КонецЕсли;	
	
	СправочникСсылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.бит_ум_ВидыДокументовИР.ДокументОВладенииРусскимЯзыком");
	Если СправочникСсылка <> Неопределено Тогда
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		СправочникОбъект.ИспользоватьДопПоле = Истина;
		СправочникОбъект.НазваниеДопПоля = "Название документа";
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	КонецЕсли;
	
	СправочникСсылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.бит_ум_ВидыДокументовИР.РазрешениеНаРаботу");
	Если СправочникСсылка <> Неопределено Тогда
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		СправочникОбъект.ИспользоватьДопПоле = Истина;
		СправочникОбъект.НазваниеДопПоля = "Данные о работодателе";
		СправочникОбъект.ИспользоватьДопПоле2 = Истина;
		СправочникОбъект.НазваниеДопПоля2 = "Серия и номер бланка";
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	КонецЕсли;    
	
	СправочникСсылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.бит_ум_ВидыДокументовИР.МедПолис");
	Если СправочникСсылка <> Неопределено Тогда
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		СправочникОбъект.ИспользоватьДопПоле = Истина;
		СправочникОбъект.НазваниеДопПоля = НСтр("ru = 'Наименование и реквизиты'");
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	КонецЕсли;		
	
КонецПроцедуры

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
// Используется для сопоставления элементов механизмом «Выгрузка/загрузка областей данных».
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Наименование");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти   

#Область СлужебныйПрограммныйИнтерфейс   

// Вызывается при переходе на версию конфигурации 3.1.9.5.
//
Процедура ЗаполнениеНаименованийДляПечати_3_1_9_5() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДокументовИР.Ссылка КАК Ссылка,
	|	ВидыДокументовИР.Наименование КАК Наименование
	|ИЗ
	|	Справочник.бит_ум_ВидыДокументовИР КАК ВидыДокументовИР
	|ГДЕ
	|	ВидыДокументовИР.НаименованиеДляПечати = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.НаименованиеДляПечати = Выборка.Наименование;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли