
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		УстановитьПривилегированныйРежим(Истина);
		ХранимыеДанные = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка,
							"КлючAPI, ИдентификаторКаталога, ПарольПрокси");
		КлючAPI               = ?(ЗначениеЗаполнено(ХранимыеДанные.КлючAPI), УникальныйИдентификатор, "");
		ИдентификаторКаталога = ?(ЗначениеЗаполнено(ХранимыеДанные.ИдентификаторКаталога), УникальныйИдентификатор, "");
		ПарольПрокси          = ?(ЗначениеЗаполнено(ХранимыеДанные.ПарольПрокси), УникальныйИдентификатор, "");
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	АвтоНаименование = Объект.Ссылка.Пустая() ИЛИ СтрНачинаетсяС(Объект.Наименование, Объект.Поставщик);
	
	Если НЕ Объект.Поставщик.Пустая() Тогда
		ЗаполнитьДанныеПоставщика();
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
 
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если КлючИзменен Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, КлючAPI, "КлючAPI");
		УстановитьПривилегированныйРежим(Ложь);
		КлючAPI = ?(ЗначениеЗаполнено(КлючAPI), УникальныйИдентификатор, "");
		КлючИзменен = Ложь;
	КонецЕсли;
	
	Если ИдентификаторКаталогаИзменен Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, ИдентификаторКаталога, "ИдентификаторКаталога");
		УстановитьПривилегированныйРежим(Ложь);
		ИдентификаторКаталога = ?(ЗначениеЗаполнено(ИдентификаторКаталога), УникальныйИдентификатор, "");
		ИдентификаторКаталогаИзменен = Ложь;
	КонецЕсли;
	
	Если ПарольПроксиИзменен Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, ПарольПрокси, "ПарольПрокси");
		УстановитьПривилегированныйРежим(Ложь);
		ПарольПрокси = ?(ЗначениеЗаполнено(ПарольПрокси), УникальныйИдентификатор, "");
		ПарольПроксиИзменен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	АвтоНаименование = ПустаяСтрока(Объект.Наименование);
	
КонецПроцедуры

&НаСервере
Процедура ПоставщикПриИзмененииНаСервере()
	
	ЗаполнитьПараметрыПоставщикаПоУмолчанию();
	ЗаполнитьДанныеПоставщика();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	
	СформироватьНаименование();
	ПоставщикПриИзмененииНаСервере();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидМоделиПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура БазовыйURLПриИзменении(Элемент)
	
	АдресСервера = СокрЛП(Объект.АдресСервера);
	Если ПустаяСтрока(АдресСервера) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНачинаетсяС(НРег(АдресСервера), "https://") Тогда
		Объект.ИспользоватьБезопасноеСоединение = Истина;
		АдресСервера = Сред(АдресСервера, 9);
	ИначеЕсли СтрНачинаетсяС(НРег(АдресСервера), "http://") Тогда
		Объект.ИспользоватьБезопасноеСоединение = Ложь;
		АдресСервера = Сред(АдресСервера, 8);
	КонецЕсли;
	
	ПозицияДвоеточия = СтрНайти(АдресСервера, ":");
	Если ПозицияДвоеточия > 0 Тогда
		ПортСтрокой  = Сред(АдресСервера, ПозицияДвоеточия + 1);
		АдресСервера = Лев(АдресСервера, ПозицияДвоеточия - 1);
		Попытка
			Объект.ПортСервера = Число(ПортСтрокой);
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось определить порт: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПортСтрокой);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;
	
	Объект.АдресСервера = АдресСервера;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючAPIПриИзменении(Элемент)
	
	КлючИзменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторКаталогаПриИзменении(Элемент)
	
	ИдентификаторКаталогаИзменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПроксиПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПроксиПриИзменении(Элемент)
	
	ПарольПроксиИзменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура МетодОбработкиВложенийПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНастройкаСервиса(Команда)
	
	ОповещениеОЗавершенииРедактирования = Новый ОписаниеОповещения("ПриЗавершенииРедактированияОбработчика", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбработчикРаспознаванияДокументов", Объект.ОбработчикРаспознаванияДокументов);
	ОткрытьФорму("Справочник.бит_МоделиИИ.Форма.ОбработчикСервисаРаспознавания", ПараметрыФормы, ЭтотОбъект,
		УникальныйИдентификатор,,, ОповещениеОЗавершенииРедактирования);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект 	 = Форма.Объект;
	
	Элементы.АдресРесурсаФайлов.Видимость =
		(Объект.МетодОбработкиВложений = ПредопределенноеЗначение("Перечисление.бит_МетодыОбработкиВложений.APIМодели"));
	Элементы.КомандаНастройкаСервиса.Видимость =
		(Объект.МетодОбработкиВложений = ПредопределенноеЗначение("Перечисление.бит_МетодыОбработкиВложений.СервисРаспознавания"));	
	Элементы.ИдентификаторКаталога.Видимость =
		(Объект.Поставщик = ПредопределенноеЗначение("Перечисление.бит_ПоставщикиИИ.Yandex"));
	Элементы.ТарифGigaChat.Видимость =
		(Объект.Поставщик = ПредопределенноеЗначение("Перечисление.бит_ПоставщикиИИ.GigaChat"));
		
	ИспользоватьПрокси = Объект.ИспользоватьПрокси;
	Элементы.ПроксиСервер.Видимость                       = ИспользоватьПрокси;
	Элементы.ПроксиПорт.Видимость                         = ИспользоватьПрокси;
	Элементы.ПроксиИспользоватьАутентификациюОС.Видимость = ИспользоватьПрокси;
	Элементы.ПользовательПрокси.Видимость                 = ИспользоватьПрокси;
	Элементы.ПарольПрокси.Видимость                       = ИспользоватьПрокси;
	
	Элементы.ИнформацияОПоставщике.Видимость              = НЕ ПустаяСтрока(Форма.ИнформацияОПоставщике);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПоставщикаПоУмолчанию()
	
	ПараметрыПоставщика = Перечисления.бит_ПоставщикиИИ.ПараметрыПоставщикаПоУмолчанию(Объект.Поставщик);
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыПоставщика);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоставщика()
	
	ОписаниеПараметров = Перечисления.бит_ПоставщикиИИ.ОписаниеПараметровПоставщика(Объект.Поставщик);
	Элементы.ВидМодели.СписокВыбора.ЗагрузитьЗначения(ОписаниеПараметров.ВидыМоделей);
	ИнформацияОПоставщике = ОписаниеПараметров.ИнформацияОПоставщике;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	
	Если НЕ АвтоНаименование Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Поставщик.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Наименование = Объект.Поставщик;
	Если НЕ ПустаяСтрока(Объект.ВидМодели) Тогда
		Объект.Наименование = СтрШаблон("%1 (%2)", Объект.Наименование, СокрЛП(Объект.ВидМодели));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииРедактированияОбработчика(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОбработчикРаспознаванияДокументов = Результат;
	
КонецПроцедуры

#КонецОбласти