
&НаКлиенте
Процедура УВМ_ОбновитьНастройкуСинхронизацииПосле(Команда)
	ИдентификаторНастроек = Элементы.СписокПриложений.ТекущиеДанные.ПолучитьИдентификатор();
	УВМ_ОбновитьНастройкуСинхронизацииПослеНаСервере(ИдентификаторНастроек);
КонецПроцедуры

&НаСервере
Процедура УВМ_ОбновитьНастройкуСинхронизацииПослеНаСервере(ИдентификаторНастроек)
	стрНастроек = СписокПриложений.НайтиПоИдентификатору(ИдентификаторНастроек);
	
	НовыйУзел = стрНастроек.УзелИнформационнойБазы;
	ИмяПланаОбмена = стрНастроек.ИмяПланаОбмена;
	ИмяПланаОбменаКорреспондента = стрНастроек.ИмяПланаОбмена;
	
	ТаблицаОбъектыБазы = ОбменДаннымиXDTOСервер.ПоддерживаемыеОбъектыФормата(ИмяПланаОбмена,
		"ОтправкаПолучение", НовыйУзел.Ссылка);
	ТаблицаОбъектыКорреспондента = ТаблицаОбъектыБазы.СкопироватьКолонки();
	
	Для Каждого СтрокаОбъектыБазы Из ТаблицаОбъектыБазы Цикл
		СтрокаОбъектыКорреспондента = ТаблицаОбъектыКорреспондента.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОбъектыКорреспондента, СтрокаОбъектыБазы, "Версия, Объект");
		СтрокаОбъектыКорреспондента.Отправка = СтрокаОбъектыБазы.Получение;
		СтрокаОбъектыКорреспондента.Получение = СтрокаОбъектыБазы.Отправка;
	КонецЦикла;
	
	МенеджерНастройкиXDTO = ОбщегоНазначения.ОбщийМодуль("РегистрыСведений.НастройкиОбменаДаннымиXDTO");
	МенеджерНастройкиXDTO.ОбновитьНастройки(
		НовыйУзел.Ссылка, "ПоддерживаемыеОбъекты", ТаблицаОбъектыБазы);
	МенеджерНастройкиXDTO.ОбновитьНастройкиКорреспондента(
		НовыйУзел.Ссылка, "ПоддерживаемыеОбъекты", ТаблицаОбъектыКорреспондента);
		
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("УзелИнформационнойБазы", НовыйУзел.Ссылка);
	СтруктураЗаписи.Вставить("ИмяПланаОбменаКорреспондента", ИмяПланаОбменаКорреспондента);
	
	ОбменДаннымиСлужебный.ОбновитьЗаписьВРегистрСведений(СтруктураЗаписи, "НастройкиОбменаДаннымиXDTO");
	
КонецПроцедуры
