#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИБ

Процедура ОбновитьНастройкиПриПереходеНаНовуюВерсию() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипНастройки", 		 Перечисления.бит_ТипыСохраненныхНастроек.Отчеты);
	Запрос.УстановитьПараметр("НастраиваемыйОбъект", "Отчет.бит_УниверсальныйОтчетИсточникиДанных_Скд");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.ХранилищеНастроек КАК ХранилищеНастроек,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Реквизиты.Ссылка) КАК ПредставлениеСсылки
	|ИЗ
	|	Справочник.бит_СохраненныеНастройки КАК Реквизиты
	|ГДЕ
	|	Реквизиты.ТипНастройки = &ТипНастройки
	|	И Реквизиты.НастраиваемыйОбъект = &НастраиваемыйОбъект
	|АВТОУПОРЯДОЧИВАНИЕ";
				   
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		ПредставлениеСсылки = Выборка.ПредставлениеСсылки;
		НачатьТранзакцию();
		Попытка
			
			ОтменитьОбработку = Истина;
			СтруктураНастроек = Выборка.ХранилищеНастроек.Получить();
			
			Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
				
				// Заполним ожидаюмую архитетктуру настроек.
				СохраненныеНастройки = НовыеСохраненныеНастройки();
				ЗаполнитьЗначенияСвойств(СохраненныеНастройки, СтруктураНастроек);
				
				Если ТипЗнч(СохраненныеНастройки.ОтборВОтчете) = Тип("ТаблицаЗначений") Тогда
					СохраненныеНастройки.ОтборВОтчете = Новый ХранилищеЗначения(СохраненныеНастройки.ОтборВОтчете,
																				Новый СжатиеДанных(9));
					ОтменитьОбработку			      = Ложь;
				КонецЕсли;
				
				Если ТипЗнч(СохраненныеНастройки.ТаблицаПараметры) = Тип("ТаблицаЗначений") Тогда
					СохраненныеНастройки.ТаблицаПараметры = Новый ХранилищеЗначения(СохраненныеНастройки.ТаблицаПараметры,
																					Новый СжатиеДанных(9));
					ОтменитьОбработку			     	  = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если ОтменитьОбработку Тогда
				ОтменитьТранзакцию();
				Продолжить;			
			КонецЕсли;
			
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если СправочникОбъект = Неопределено Тогда
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			СправочникОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(СохраненныеНастройки, Новый СжатиеДанных(9));
			// Запись обработанного объекта.
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(Выборка.Ссылка, ПредставлениеСсылки, ИнформацияОбОшибке());
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти // ОбновлениеИБ

// Процедура заполняет дополнительные списки.
// 
// Параметры:
//  СписокПараметровНаФорме - СписокЗначений ИЛИ Неопределено - список параметров на форме.
// 
Процедура ЗаполнитьДополнительныеСписки(СписокПараметровНаФорме) Экспорт
	
	// Список имен параметров СКД, заполняемых пользователем через элементы формы.
	СписокПараметровНаФорме.Добавить("Период", "Период");
	
КонецПроцедуры

// Процедура формирует структуру настроек.
//
Функция НовыеСохраненныеНастройки() Экспорт

	СохраненныеНастройки = Новый Структура;
	СохраненныеНастройки.Вставить("Период", 				   Новый СтандартныйПериод);
	СохраненныеНастройки.Вставить("НастройкаОтчета", 		   Справочники.бит_НастройкиОтчетов.ПустаяСсылка());
	СохраненныеНастройки.Вставить("Язык", 					   Справочники.бит_Языки.ПустаяСсылка());
	СохраненныеНастройки.Вставить("НастройкаПулаПодключений",  Справочники.бит_мпд_НастройкиПуловПодключений.ПустаяСсылка());
	СохраненныеНастройки.Вставить("ОтборВОтчете", 			   Новый ХранилищеЗначения(Новый ТаблицаЗначений, Новый СжатиеДанных(9)));
	СохраненныеНастройки.Вставить("ТаблицаПараметры", 		   Новый ХранилищеЗначения(Новый ТаблицаЗначений, Новый СжатиеДанных(9)));
	СохраненныеНастройки.Вставить("НастройкиКомпоновщика", 	   Новый НастройкиКомпоновкиДанных);
	СохраненныеНастройки.Вставить("ПользовательскиеНастройки", Новый ПользовательскиеНастройкиКомпоновкиДанных);
	
	Возврат СохраненныеНастройки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
