#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры
	
// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
	
Функция ИнициализироватьКомпоновщик(вхТекстЗапроса, Компоновщик, УникальныйИдентификатор) Экспорт
	
	АдресКомпоновки = "";
	
	ТекстЗапроса = бит_МеханизмПолученияДанных.АдаптироватьТекстПостроителяДляКомпоновки(вхТекстЗапроса);
	
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		
		// Создаем СКД по запросу.
		СКД = бит_МеханизмПолученияДанных.СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапроса);
		// Параметр Бюджет не должен быть доступен в настройках СКД.
		Если Найти(ТекстЗапроса, "&Бюджет") > 0 Тогда
			ПараметрСКД = СКД.Параметры.Добавить();
			ПараметрСКД.Имя						= "Бюджет";
			ПараметрСКД.Заголовок				= НСтр("ru = 'Бюджет'");
			ПараметрСКД.ТипЗначения				= Новый ОписаниеТипов("СправочникСсылка.бит_Бюджеты");
			ПараметрСКД.ВключатьВДоступныеПоля	= Ложь;
			ПараметрСКД.ОграничениеИспользования= Ложь;
			ПараметрСКД.Значение				= Справочники.бит_Бюджеты.ПустаяСсылка();
		КонецЕсли; 
		
		АдресКомпоновки = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
		
		// Инициализируем компоновщик.
		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресКомпоновки);
		Попытка
			Компоновщик.Инициализировать(ИсточникНастроек);
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось инициализировать компоновщик для отбора. Попробуйте обновить текст запроса. Описание ошибки: %1.';
								  |en = 'Failed to initialize the builder for selection. Try to update the query. Description of error: %1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
		
		НастройкиИзмерений = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();
		бит_МеханизмДопИзмерений.СформироватьЗаголовкиПолейДополнительныхИзмеренийНастройкиФормыВвода(СКД 
																						,"НаборДанныхОсновной" 
																						,НастройкиИзмерений);	
		
	КонецЕсли; 
	
	Возврат АдресКомпоновки;
	
КонецФункции

// Функция - Конструктор параметра работы с деревом данных формы ввода бюджета.
// 
// Возвращаемое значение:
//  Структура - со свойствами:
//  * ВыводитьСообщения			- Булево - Выводить ли сообщения при обработке дерева.
//  * АдресКомпоновки			- Строка - Адрес временного хранилища компановки данных формы.
//  * НастройкиКомпоновщика		- КомпоновщикНастроекКомпоновкиДанных - Настройки компановки данных формы.
//  * ОбновитьДерево			- Булево - Выполнить ли обновление дерева после восстановления.
//  * УдалитьЛишнее				- Булево - Выполнить поиск и удаление строк, для которых не удалось найти ячейки в дереве.
//  * Периодичность				- ПеречислениеСсылка.бит_ПериодичностьПланирования - Периодичность планирования.
//  * ПродолжительностьИнтервала- Число - Продолжительность интервала планирования (количество периодов планирования).
//  * ДатаНачалаПланирования	- Дата - Начало интервала планирования.
//  * ДатаОкончанияПланирования	- Дата - Дата окончания планирования.
//
Функция НовыеПараметрыДерева() Экспорт
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("ВыводитьСообщения",			Ложь);
	ПараметрыПолучения.Вставить("АдресКомпоновки",				"");
	ПараметрыПолучения.Вставить("НастройкиКомпоновщика",		Новый КомпоновщикНастроекКомпоновкиДанных);
	ПараметрыПолучения.Вставить("ОбновитьДерево",				Истина);
	ПараметрыПолучения.Вставить("УдалитьЛишнее",				Ложь);
	ПараметрыПолучения.Вставить("Периодичность",				Перечисления.бит_ПериодичностьПланирования.ПустаяСсылка());
	ПараметрыПолучения.Вставить("ПродолжительностьИнтервала",	0);
	ПараметрыПолучения.Вставить("ДатаНачалаПланирования",		'0001-01-01');
	ПараметрыПолучения.Вставить("ДатаОкончанияПланирования",	'0001-01-01');
	ПараметрыПолучения.Вставить("СхемаКомпоновкиДанных",		Новый СхемаКомпоновкиДанных);

	Возврат ПараметрыПолучения;
	
КонецФункции

// Функция подготавливает параметры проведения.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.бит_ФормаВводаБюджета - ссылка на документ.
//  Отказ          - Булево - признак обнаружения ошибки и отказа от дальнейших действий.
//
// Возвращаемое значение:
//  Структура - структура параметров проведения.
//
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.ЦФО КАК ЦФО,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.КратностьДокумента КАК КратностьДокумента,
	|	Реквизиты.КурсДокумента КАК КурсДокумента,
	|	Реквизиты.РучнаяКорректировка КАК РучнаяКорректировка,
	|	Реквизиты.СверхБюджета КАК СверхБюджета,
	|	Реквизиты.ЕдиницаИзмеренияСумм КАК ЕдиницаИзмеренияСумм,
	|	Реквизиты.Сценарий.ИспользоватьКурсыСценария КАК ИспользоватьКурсыСценария,
	|	Реквизиты.Сценарий.Валюта КАК ВалютаСценария,
	|	Реквизиты.РежимФормированияДвижений КАК РежимФормированияДвижений,
	|	Реквизиты.РежимПринятияКУчету КАК РежимПринятияКУчету,
	|	ВЫБОР
	|		КОГДА Реквизиты.НастройкаФормы.Вид = ЗНАЧЕНИЕ(Перечисление.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Фиксированныймакет,
	|	Реквизиты.СписатьЛимиты КАК СписатьЛимиты,
	|	Реквизиты.ДанныеТЧВРегистре КАК ДанныеТЧВРегистре
	|ИЗ
	|	Документ.бит_ФормаВводаБюджета КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат[0]);
	
	Если НЕ бит_ОбщегоНазначения.ВалютаУпрУчетаУстановлена(Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;

	КоэффициентСуммы = бит_ОбщегоНазначения.ПолучитьРазмерностьЕдиницыИзмеренияСумм(Реквизиты.ЕдиницаИзмеренияСумм);
	КурсыВалют 		 = бит_Бюджетирование.КурсыВалютСценария(Реквизиты.Регистратор, 
											Реквизиты.Дата, Новый Структура("Документ, Регл, Упр, Сценарий"));
		
	Реквизиты.Вставить("КоэффициентСуммы", КоэффициентСуммы);
	Реквизиты.Вставить("КурсыВалют",	   КурсыВалют);
	
	ПриниматьКУчету = Истина;
	ПроводитьПослеУтверждения = бит_ВизированиеСервер.ПриниматьКУчетуПослеУтверждения(
									Метаданные.Документы.бит_ФормаВводаБюджета.ПолноеИмя());
	Если ПроводитьПослеУтверждения И Реквизиты.РежимПринятияКУчету = 1 Тогда
		ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(ДокументСсылка);
		Если НЕ Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(ТекущийСтатус,
					Перечисления.бит_ТипыСтатусовОбъектов.Утвержден) Тогда
			ПриниматьКУчету = Ложь;
		КонецЕсли;
	КонецЕсли;

	ПараметрыПроведения.Вставить("ТаблицаОборотыПоБюджетам", Новый ТаблицаЗначений());
	
	ПараметрыНастройки 		= Новый Структура("ЦФО, Организация", Реквизиты.ЦФО, Реквизиты.Организация);
	НеУчитыватьСверхБюджета = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету(
									ПараметрыНастройки, Реквизиты.Дата);
									
	Запрос.УстановитьПараметр("НеУчитыватьСверхБюджета",	НеУчитыватьСверхБюджета);
	Запрос.УстановитьПараметр("КоэффициентСуммы",			Реквизиты.КоэффициентСуммы);
	Запрос.УстановитьПараметр("ФиксированныйМакет",			Реквизиты.ФиксированныйМакет);
	Запрос.УстановитьПараметр("РежимФормированияДвижений",	Реквизиты.РежимФормированияДвижений);
	Запрос.УстановитьПараметр("Сценарий", 				 	Реквизиты.Сценарий);
	Запрос.УстановитьПараметр("Валюта", 				 	Реквизиты.ВалютаДокумента);
	Запрос.УстановитьПараметр("СинонимБДДС", 			 	НСтр("ru='Данные бюджета';en='Budget Data'"));
	Запрос.УстановитьПараметр("СинонимЗависимыеОбороты", 	НСтр("ru='Зависимые обороты';en='Dependent Line-Items'"));

	ИнициализироватьКлючиАналитик(Реквизиты);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаВременнаяТаблицаДокумента(НомераТаблиц, Реквизиты)
				 + ТекстЗапросаТаблицыВалютногоПерерасчета(НомераТаблиц)
				 + ТекстЗапросаТаблицаОборотыПоБюджетам(НомераТаблиц, ПриниматьКУчету)
				 + ТекстЗапросаКонтрольИсполненияБюджета(НомераТаблиц);

	Результат = Запрос.ВыполнитьПакет();
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	ПодготовитьТаблицыДокументаРасчетыВВалюте(ПараметрыПроведения, Реквизиты);	
	
	ПодготовитьТаблицуИсполнениеБюджетаРасчетыВВалюте(ПараметрыПроведения.ИсполнениеБюджета, 
		ПараметрыПроведения.ИсполнениеБюджетаРеквизиты);
		
	Возврат ПараметрыПроведения;
	
КонецФункции 

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//   Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
//   Реквизиты - Массив - список имен реквизитов объекта.
//
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	Реквизиты.Добавить("НастройкиПостроителя");
	Реквизиты.Добавить("ХранилищеДерева");
	Реквизиты.Добавить("ХранилищеДанных");
    Реквизиты.Добавить("БДДС.ИД");
	Реквизиты.Добавить("БДДС.Служебный");
	
	Реквизиты.Добавить("ЗависимыеОбороты.ИД");
	Реквизиты.Добавить("ЗависимыеОбороты.ИД_Родитель");
	Реквизиты.Добавить("ЗависимыеОбороты.КомментарийРасчета");
	
	Реквизиты.Добавить("НаборыЗначенийДоступа.*");
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	// ++ ЕРП
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиОбновленияИБ

Процедура ДоработатьДанныеРасшифровкиПриПереходеНаНовуюВерсию(Параметры) Экспорт

	ПолноеИмяОбъекта  = ПустаяСсылка().Метаданные().ПолноеИмя();
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);

	Для Каждого СтрокаТаблицы Из ОбновляемыеДанные Цикл
				
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СтрокаТаблицы.Ссылка);
			Блокировка.Заблокировать();
	
			ДокументОбъект 	 	= СтрокаТаблицы.Ссылка.ПолучитьОбъект();
			ПредставлениеСсылки = Строка(ДокументОбъект);
			
			Если ДокументОбъект = Неопределено Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтрокаТаблицы.Ссылка);
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;			
			
			ДокументРезультат = ДокументОбъект.ХранилищеДерева.Получить();
			
			ОбъектИзменен = Ложь;
			Для каждого Область Из ДокументРезультат.Области Цикл
				Если ТипЗнч(Область.Расшифровка) <> Тип("Структура") Тогда
					Продолжить;		
				КонецЕсли;	
				
				ИмяКласса = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Область.Расшифровка, "ИмяКласса", "");
				Если ИмяКласса <> "РасшифровкаЯчейкиФормыВвода" Тогда
					Продолжить;		
				КонецЕсли;
				
				ИдентификаторРасшифровки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Область.Расшифровка, "ИдентификаторРасшифровки", "");
				ОбработатьРасшифровку 	 = ПустаяСтрока(ИдентификаторРасшифровки);
				
				Если НЕ ОбработатьРасшифровку Тогда
					Продолжить;		
				КонецЕсли;
				
				СмежныеОбласти = Новый Структура;
				СмежныеОбласти.Вставить("СП", "");
				СмежныеОбласти.Вставить("КП", "");
				СмежныеОбласти.Вставить("СФ", "");
				СмежныеОбласти.Вставить("КФ", "");		
				
				ЧастиИмени = СтрРазделить(Область.Расшифровка.Имя, "_");
				Если ЧастиИмени.Количество() > 2 Тогда
					Префикс = ЧастиИмени[0];
					// Если префикс подойдет к одному из ключей структуры, значит это наша область.
					Если СмежныеОбласти.Свойство(Префикс) Тогда
						СмежныеОбласти[Префикс] = Область.Расшифровка.Имя;
						Для каждого КлючЗначение Из СмежныеОбласти Цикл
							Если КлючЗначение.Ключ = Префикс Тогда
								Продолжить;					
							КонецЕсли;
							ЧастиИмени[0] 	= КлючЗначение.Ключ;
							ИмяКандидата	= СтрСоединить(ЧастиИмени, "_");
							РезультатПоиска = ДокументРезультат.Области.Найти(ИмяКандидата);
							Если РезультатПоиска <> Неопределено Тогда
								СмежныеОбласти[КлючЗначение.Ключ] = ИмяКандидата;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;

				Область.Расшифровка.Вставить("СмежныеОбласти", 			 СмежныеОбласти);
				Область.Расшифровка.Вставить("ИдентификаторРасшифровки", Область.Расшифровка.Имя);
				Область.Расшифровка.Вставить("ИдентификаторСтроки", 	 "");
				Область.Расшифровка.Вставить("ЦветФона", 				 Область.ЦветФона);
				
				ЗначенияГруппировок = Новый Массив;
				Если ТипЗнч(Область.Расшифровка.Измерения) = Тип("Структура") Тогда
					Для каждого КлючЗначение Из Область.Расшифровка.Измерения Цикл
						ЗначенияГруппировок.Добавить(КлючЗначение.Значение);
					КонецЦикла;
				Иначе
					ЗначенияГруппировок.Добавить(Область.Расшифровка.Значение);
				КонецЕсли;
				Область.Расшифровка.ИдентификаторСтроки = бит_ВводБюджета.ИдентификаторРасшифровки(ЗначенияГруппировок, Область.Расшифровка.Период);
				
				ОбъектИзменен = Истина;
			КонецЦикла;
			
			Если ОбъектИзменен Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтрокаТаблицы.Ссылка);
			КонецЕсли;
		
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();

			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(СтрокаТаблицы.Ссылка, ПредставлениеСсылки, 
				ИнформацияОбОшибке());	
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеРасшифроки(Параметры) Экспорт

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.СпособВыборки 		 = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Ссылка УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Ссылка УБЫВ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бит_ФормаВводаБюджета КАК Реквизиты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ";

	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));

КонецПроцедуры

Процедура ИсправитьСмежныеОбластиРасшифровкиПриПереходеНаНовуюВерсию(Параметры) Экспорт

	ПолноеИмяОбъекта  = ПустаяСсылка().Метаданные().ПолноеИмя();
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);

	Для Каждого СтрокаТаблицы Из ОбновляемыеДанные Цикл
				
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СтрокаТаблицы.Ссылка);
			Блокировка.Заблокировать();
	
			ДокументОбъект 	 	= СтрокаТаблицы.Ссылка.ПолучитьОбъект();
			ПредставлениеСсылки = Строка(ДокументОбъект);
			
			Если ДокументОбъект = Неопределено Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтрокаТаблицы.Ссылка);
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;			
			
			ДокументРезультат = ДокументОбъект.ХранилищеДерева.Получить();
			
			ОбъектИзменен = Ложь;
			Для каждого Область Из ДокументРезультат.Области Цикл
				
				ЭтоРасшифровкаЯчейкиФВБ = бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЗначенияФВБ(Область.Расшифровка)
									  ИЛИ бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаФормулыФВБ(Область.Расшифровка);
											
				Если НЕ ЭтоРасшифровкаЯчейкиФВБ Тогда
					Продолжить;		
				КонецЕсли;
				
				ОбновитьДанныеРасшифровки(Область);
				ОбъектИзменен = Истина;
			КонецЦикла;
			
			Если ОбъектИзменен Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтрокаТаблицы.Ссылка);
			КонецЕсли;
		
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();

			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(СтрокаТаблицы.Ссылка, ПредставлениеСсылки, 
				ИнформацияОбОшибке());	
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКИсправлениюРасшифровки(Параметры) Экспорт

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.СпособВыборки 		 = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Ссылка УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Ссылка УБЫВ");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вид", Перечисления.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бит_ФормаВводаБюджета КАК Реквизиты
	|ГДЕ
	|	Реквизиты.НастройкаФормы.Вид = &Вид
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ";

	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));

КонецПроцедуры

#КонецОбласти

// Функция сдвигает период или извлекает период из кэша периодов. 
// 
// Параметры:
//  ВхПериод  - Дата.
//  Сдвиг     - Число.
//  Периодичность - ПеречислениеСсылка.бит_Периодичность.
//  КэшПериодов   - Соответствие.
// 
// Возвращаемое значение:
//  ПериодНовый - Дата.
// 
Функция ПреобразоватьПериод(ВхПериод, Сдвиг, Периодичность, КэшПериодов) Экспорт
	
	ПериодНовый = КэшПериодов[ВхПериод];
	Если ПериодНовый = Неопределено Тогда
		ПериодНовый = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ВхПериод, Сдвиг, Периодичность);
		КэшПериодов.Вставить(ВхПериод, ПериодНовый);
	КонецЕсли;	
	Возврат ПериодНовый;					
	
КонецФункции

// Процедура обновляет дерево данных.
//
// Параметры:
//  Настройка			 - СправочникСсылка.бит_НастройкиФормВводаБюджета - Настройки форм ввода бюджета.
//  ПараметрыОбновления	 - Структура - см. Документы.бит_ФормаВводаБюджета.НовыеПараметрыДерева().
//
Функция ОбновитьДеревоДанных(Настройка, ПараметрыОбновления) Экспорт
	 
	Результат = Новый Структура("ДокументРезультат", Новый ТабличныйДокумент); 
	
	Если Настройка.Версия_2 Тогда
		Если Настройка.Вид = Перечисления.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет Тогда
			Результат = ОбновитьДеревоДанныхФиксированныйМакет(Настройка, ПараметрыОбновления);
		Иначе	
			ПараметрыПередачи = бит_ВводБюджета.НовыеПараметрыПосроенияМакетаБюджета();
			ЗаполнитьЗначенияСвойств(ПараметрыПередачи, ПараметрыОбновления);
			Результат = бит_ВводБюджета.РезультатПостроенияМакетаБюджета(Настройка, ПараметрыПередачи);
		КонецЕсли;
	Иначе	
		Если Настройка.Вид = Перечисления.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет Тогда
			Результат = ОбновитьДеревоДанныхФиксированныйМакет(Настройка, ПараметрыОбновления);
		Иначе	
			Результат = ОбновитьДеревоДанныхДинамическийМакет(Настройка, ПараметрыОбновления);		
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьДеревоДанныхДинамическийМакет(Настройка, ПараметрыОбновления) Экспорт
		
	СтрокаСортировки = "";
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	НастрФормы = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(Настройка);	
	НастройкиИзмерений = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();
	
	Периодичность              = ПараметрыОбновления.Периодичность;
	ПродолжительностьИнтервала = ПараметрыОбновления.ПродолжительностьИнтервала;
	ДатаНачалаПланирования     = ПараметрыОбновления.ДатаНачалаПланирования;
	ДатаОкончанияПланирования  = ПараметрыОбновления.ДатаОкончанияПланирования;
	
	Если НЕ ЗначениеЗаполнено(ДатаНачалаПланирования) Тогда
		ДатаНачалаПланирования  = НачалоГода(ТекущаяДатаСеанса());
	КонецЕсли; 
	
	Бюджет = НастрФормы.Бюджет;
	Если ЗначениеЗаполнено(Бюджет) И Справочники.бит_Бюджеты.БюджетЗапрещенВПланировании(Бюджет) Тогда
		ТекстИсключения = НСтр("ru = 'Выполнение операции остановлено.
								|Бюджет настройки формы ввода не должен содержать дубли статей оборотов.';
								|en = 'The operation is stopped.
								|Budget setting entry forms should not contain duplicates revolutions articles.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	// Инициализация построителя.
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Бюджет", НастрФормы.Бюджет);
	Попытка
		Запрос.Текст = НастрФормы.ТекстЗапроса;
	Исключение
		ТекстСообщения = НСтр("ru = 'Неверный текст запроса. Описание ошибки: %1.';
						 	  |en = 'Invalid query text. Description of error:%1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Если НЕ НастрФормы.ВыводитьКодификатор Тогда
		бит_ОтчетыБФСервер.УдалитьВыбранноеПолеИзВсехНастроекОтчета(ПараметрыОбновления.НастройкиКомпоновщика, "Кодификатор");
	КонецЕсли;
	
	СКД = ПараметрыОбновления.СхемаКомпоновкиДанных;
	Если СКД.НаборыДанных.Количество() <> 0 Тогда
		
		КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетСКД = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СКД, ПараметрыОбновления.НастройкиКомпоновщика);
				
		// Получаем запрос макета компоновки данных.
		Попытка
			Запрос.Текст = МакетСКД.НаборыДанных.НаборДанныхОсновной.Запрос;
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось установить отбор для получения дерева.';
							 	  |en = 'Unable to establish the selection for obtaining the tree.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
		// Устанавливаем параметры запроса.
		ОписаниеПараметровЗапроса = Запрос.НайтиПараметры();
		Для каждого ОписаниеПараметраЗапроса Из ОписаниеПараметровЗапроса Цикл
			
			Если НЕ МакетСКД.ЗначенияПараметров.Найти(ОписаниеПараметраЗапроса.Имя) = Неопределено Тогда
				
				Запрос.УстановитьПараметр(ОписаниеПараметраЗапроса.Имя, МакетСКД.ЗначенияПараметров[ОписаниеПараметраЗапроса.Имя].Значение);
				
			КонецЕсли; 
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(НастрФормы.Бюджет) Тогда
			СхемаЗапроса = Новый СхемаЗапроса;
			СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
			
			// В новой версии запросов настроек формы ввода 2 оператора для формирования дерева из групп.
			// Старые элементы настроек формы ввода, содержат только 1 оператор в пакете запроса. 
			Если СхемаЗапроса.ПакетЗапросов[0].Операторы.Количество() = 2 Тогда
				ОтборыСКД = СхемаЗапроса.ПакетЗапросов[0].Операторы[1].Отбор;
				ОтборыСКД.Очистить();
				ОтборыСКД.Добавить(Новый ВыражениеСхемыЗапроса("СпрГруппы.ЭтоГруппа"));
				ОтборыСКД.Добавить(Новый ВыражениеСхемыЗапроса("НЕ СпрГруппы.ПометкаУдаления"));
				Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// Формируем строку сортировки.
	Если ТипЗнч(Настройка) = Тип("СправочникОбъект.бит_НастройкиФормВводаБюджета") Тогда
		СохраненнаяНастройка = Настройка.ПолучитьНастройкиПостроителя();
	Иначе	
		НастройкаОб = Настройка.ПолучитьОбъект();
		СохраненнаяНастройка = НастройкаОб.ПолучитьНастройкиПостроителя();
	КонецЕсли; 
	
	Если СохраненнаяНастройка.Свойство("НастройкиКомпоновщика") 
		И ТипЗнч(СохраненнаяНастройка.НастройкиКомпоновщика) = Тип("НастройкиКомпоновкиДанных")  Тогда
		
		Для каждого ЭлПорядка Из СохраненнаяНастройка.НастройкиКомпоновщика.Порядок.Элементы Цикл
			
			Если ЭлПорядка.Использование = Истина И НЕ Строка(ЭлПорядка.Поле) = "" Тогда
				
				НаправлениеСтр = ?(ЭлПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв, "УБЫВ", "ВОЗР"); 
				СтрокаСортировки = СтрокаСортировки+?(ПустаяСтрока(СтрокаСортировки),"",",")+Строка(ЭлПорядка.Поле)+" "+НаправлениеСтр;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// Установка отбора под владельцу дополнительных аналитик при необходимости.
	ИзмеренияРазворачивать = НастрФормы.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать];
	Для каждого Имя Из ИзмеренияРазворачивать Цикл
	
		ТекНастройка = НастройкиИзмерений[Имя];
		
		Если НЕ ТекНастройка = Неопределено 
			 И ТекНастройка.ТипЗначения.СодержитТип(Тип("СправочникСсылка.бит_ДополнительныеЗначенияАналитик")) Тогда
		
			 Запрос.УстановитьПараметр(Имя, ТекНастройка.Аналитика);
		
		КонецЕсли; 
	
	КонецЦикла; 
	
	// Выполнение запроса.
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось заполнить дерево данных. Описание ошибки: %1.';
						 	  |en = 'Unable to fill in the data tree. Description of error: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	РезДерево = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

	ЭтоНовыйЗапрос = ?(РезДерево.Колонки.Найти("Ссылка") = Неопределено, Истина, Ложь);
	
	// Получение областей, необходимых для вывода.
	Макет = Документы.бит_ФормаВводаБюджета.ПолучитьМакет("Макет");	
	Области = Новый Структура;
	Области.Вставить("Заголовок_Кодификатор", Макет.ПолучитьОбласть("Заголовок|Кодификатор"));
	Области.Вставить("Заголовок_Измерение"  , Макет.ПолучитьОбласть("Заголовок|Измерение"));
	Области.Вставить("Заголовок_Поле"       , Макет.ПолучитьОбласть("Заголовок|Поле"));
	Области.Вставить("Заголовок_ПолеДубль"  , Макет.ПолучитьОбласть("Заголовок|ПолеДубль"));
	Области.Вставить("Строка_Кодификатор"   		 , Макет.ПолучитьОбласть("Строка|Кодификатор"));
	Области.Вставить("Строка_Измерение"     		 , Макет.ПолучитьОбласть("Строка|Измерение"));
	Области.Вставить("Строка_ПолеКоличество"		 , Макет.ПолучитьОбласть("Строка|ПолеКоличество"));
	Области.Вставить("Строка_ПолеСумма"     		 , Макет.ПолучитьОбласть("Строка|ПолеСумма"));
	Области.Вставить("Строка_ПолеДубль"     		 , Макет.ПолучитьОбласть("Строка|ПолеДубль"));
	Области.Вставить("СтрокаРасчетная_ПолеКоличество", Макет.ПолучитьОбласть("СтрокаРасчетная|ПолеКоличество"));
	Области.Вставить("СтрокаРасчетная_ПолеСумма"     , Макет.ПолучитьОбласть("СтрокаРасчетная|ПолеСумма"));
	Области.Вставить("СтрокаРасчетная_ПолеДубль"	 , Макет.ПолучитьОбласть("СтрокаРасчетная|ПолеДубль"));
	
	// Установка цветов.
	РедактируемыеОбласти = Новый Массив;
	РедактируемыеОбласти.Добавить("Строка_ПолеКоличество");
	РедактируемыеОбласти.Добавить("Строка_ПолеСумма");
	РедактируемыеОбласти.Добавить("Строка_ПолеДубль");
	
	Для каждого КиЗ Из Области Цикл
		
		ИмяОбласти = КиЗ.Ключ;
		Обл		   = КиЗ.Значение;
		ЦветФона   = Обл.Область(1,1,1,1).ЦветФона;
		
		Если РедактируемыеОбласти.Найти(ИмяОбласти) <> Неопределено Тогда
			Если НастрФормы.ИспользоватьЦветЯчейки Тогда 
				ЦветФона = НастрФормы.Цвета.Цвет_Ячейка;	
			КонецЕсли;
		Иначе	
			Если НастрФормы.ИспользоватьЦветГруппы Тогда
				ЦветФона = НастрФормы.Цвета.Цвет_Группа;	
			КонецЕсли;
		КонецЕсли;
		
		яч = Обл.Область(1,1,1,1);
		яч.ЦветФона = ЦветФона;
		
		Если НЕ Найти(ИмяОбласти, "Дубль") = 0 Тогда
			
			яч = Обл.Область(1,2,1,2);
			яч.ЦветФона = ЦветФона;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ЭтоНастройкаПоБюджету   = ?(ЗначениеЗаполнено(НастрФормы.Бюджет), Истина, Ложь);
	ИспользоватьКоэффициенты = ?(ЭтоНастройкаПоБюджету И НастрФормы.ИспользоватьКоэффициентыСтатейБюджета, Истина, Ложь);
	
	Если ИспользоватьКоэффициенты Тогда
		
		// Если используются коэффициенты статей бюджета необходимо установить специальный формат.
		яч = Области.Строка_ПолеСумма.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(яч);
		яч = Области.Строка_ПолеКоличество.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(яч);
		яч = Области.Строка_ПолеДубль.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(яч);
		яч = Области.Строка_ПолеДубль.Область(1,2,1,2);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(яч);
		
		яч = Области.СтрокаРасчетная_ПолеСумма.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(яч);
		яч = Области.СтрокаРасчетная_ПолеКоличество.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(яч);
		яч = Области.СтрокаРасчетная_ПолеДубль.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(яч);
		яч = Области.СтрокаРасчетная_ПолеДубль.Область(1,2,1,2);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(яч);
		
	КонецЕсли; 
	
	// Вывод дерева данных.
	СтрПарШапка = НовыеПараметрыШапки();
	СтрПарШапка.Периодичность              = Периодичность;
	СтрПарШапка.ПродолжительностьИнтервала = ПродолжительностьИнтервала;
	СтрПарШапка.ДатаНачалаПланирования     = ДатаНачалаПланирования;
	СтрПарШапка.ДатаОкончанияПланирования  = ДатаОкончанияПланирования;
								   
	Периоды = бит_ВводБюджета.ПериодыПланированияБюджета(НастрФормы, СтрПарШапка); 
	
	ВывестиШапку(ДокументРезультат, Области, НастрФормы, Периоды);
	
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
		
	Если ПустаяСтрока(СтрокаСортировки) Тогда
		
	    // По умолчанию -сортировка по кодификатору.		
		ИзмеренияРазворачивать  = НастрФормы.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать];
		Если ИзмеренияРазворачивать.Количество() > 1 Тогда

			ИмяПервого	   = ИзмеренияРазворачивать[0];
			ИмяКодификатор = ИмяПервого + "_Кодификатор";
			
			Если НЕ РезДерево.Колонки.Найти(ИмяКодификатор) = Неопределено Тогда
				СтрокаСортировки = ИмяКодификатор + "," + ИмяПервого;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(СтрокаСортировки) Тогда
		Попытка
			РезДерево.Строки.Сортировать(СтрокаСортировки, Истина);
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось выполнить сортировку по настройке: %1. Описание ошибки: %2.';
								  |en = 'Unable to sort of set up: %1. Description of error:%2.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаСортировки, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли; 
	
	СтатьиБезИтогов = бит_Бюджетирование.СтатьиБезИтогов(Бюджет);
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ЭтоНовыйЗапрос",	ЭтоНовыйЗапрос);
	ДопПараметры.Вставить("СтатьиБезИтогов",СтатьиБезИтогов);

	ОбойтиДерево(РезДерево, ДокументРезультат, Области, НастрФормы, Периоды, 1, ДопПараметры);
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	
	ДокументРезультат.НаправлениеПерехода = ТипНаправленияПереходаТабличногоДокумента.БезПерехода;
	
	Результат = Новый Структура("ДокументРезультат", ДокументРезультат); 
	
	Возврат Результат;
	
КонецФункции

Процедура СформироватьДвиженияОборотыПоБюджетам(ДанныеБюджета, Реквизиты, Движения, Отказ) Экспорт 
	
	Для каждого СтрокаТаблицы Из ДанныеБюджета Цикл
		Движение = Движения.бит_ОборотыПоБюджетам.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицы);
	КонецЦикла; 
	Движения.бит_ОборотыПоБюджетам.Записывать = Истина;
	
КонецПроцедуры

Процедура СформироватьДвиженияБюджетирование(ДанныеБюджета, Реквизиты, Движения, Отказ) Экспорт 
	
	Если ДанныеБюджета.Количество() > 0 Тогда
		бит_Бюджетирование.СформироватьПроводкиБюджетирования(ДанныеБюджета,
			Движения.бит_Бюджетирование, Ложь);
	КонецЕсли;
	Движения.бит_Бюджетирование.Записывать = Истина;
	
КонецПроцедуры

Функция ОбновитьДеревоДанныхВФоне(Настройка, ПараметрыВыполнения) Экспорт

	Результат = ОбновитьДеревоДанных(Настройка, ПараметрыВыполнения);	
	
	Возврат Результат;
	
КонецФункции

// Функция - Заполнить таблицу данных.
//
// Параметры:
//  ТабличныйДокумент	 - табличный документ.
//  ИдентификаторФормы - уникальный идентификатор.
// 
// Возвращаемое значение:
//  ХранилищеЗначений.
//
Функция ЗаполнитьТаблицуДанных(ТабличныйДокумент, ИдентификаторФормы) Экспорт
	
	ТаблицаДанных = НовыеДанныеЯчеек();
	
	Для каждого Обл Из ТабличныйДокумент.Области Цикл
		СтрокаТаблицы = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Обл);
		СтрокаТаблицы.ИмяАргумента = Обл.Имя;
		
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Обл) 
			 И (бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЗначенияФВБ(Обл.Расшифровка)
			 ИЛИ бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаФормулыФВБ(Обл.Расшифровка)) Тогда
				 
			СтрокаТаблицы.ЗначимаяОбласть = Истина;	
		Иначе	
			СтрокаТаблицы.ЗначимаяОбласть = Ложь;	 
		КонецЕсли;
		
		Для каждого ИмяАргумента Из Обл.Расшифровка.Аргументы Цикл
			
			СтрокаТаблицыАрг = ТаблицаДанных.Добавить();
			СтрокаТаблицыАрг.Имя 				= Обл.Имя;
			СтрокаТаблицыАрг.ИмяАргумента 		= ИмяАргумента;
			СтрокаТаблицыАрг.ЗначимаяОбласть 	= Ложь;	
		КонецЦикла;
	КонецЦикла;
	ТаблицаДанных.Индексы.Добавить("Имя,ИмяАргумента");
	ТаблицаДанных.Индексы.Добавить("ИмяАргумента");
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаДанных,ИдентификаторФормы);
	
КонецФункции 

// Заполняет список смежности необходимый для расчетов.
//
// Параметры:
//  ТабличныйДокумент	 - табличный документ.
//  ИдентификаторФормы - уникальный идентификатор.
// 
// Возвращаемое значение:
//  ХранилищеЗначений.
//
Функция ЗаполнитьСписокСмежности(ТабличныйДокумент, ИдентификаторФормы) Экспорт
	
	СписокСмежности = бит_БюджетированиеКлиентСервер.СписокСмежности(ТабличныйДокумент);
	Возврат ПоместитьВоВременноеХранилище(СписокСмежности, ИдентификаторФормы);
	
КонецФункции

// Конструктор таблицы данных для расчета.
// 
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с колонками:
//      * Расшифровка - Неопределенно.
//      * Значение - Число - значение области.
//      * Имя - Строка - имя области.
//      * ИмяАргумента - Строка - имя аргумента.
//      * ФормулаВычислена - Булево - компенсация за задержку зарплаты.
//      * ЗначениеВычисленияФормулы - Число - результат вычисления.
//      * ЗначимаяОбласть - Булево - область является формулой или значением. 
//
Функция НовыеДанныеЯчеек() Экспорт
	
	ДанныеЯчеек = Новый ТаблицаЗначений;
	ДанныеЯчеек.Колонки.Добавить("Расшифровка");
	ДанныеЯчеек.Колонки.Добавить("Значение", Новый ОписаниеТипов("Число"));
	ДанныеЯчеек.Колонки.Добавить("Имя", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ДанныеЯчеек.Колонки.Добавить("ИмяАргумента", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ДанныеЯчеек.Колонки.Добавить("ФормулаВычислена", Новый ОписаниеТипов("Булево"));
	ДанныеЯчеек.Колонки.Добавить("ЗначениеВычисленияФормулы", Новый ОписаниеТипов("Число"));
	ДанныеЯчеек.Колонки.Добавить("ЗначимаяОбласть", Новый ОписаниеТипов("Булево"));
	
	Возврат ДанныеЯчеек;
	
КонецФункции
 
// Процедура - Выполнить расчеты по зависимостям.
//
// Параметры:
//  ТабличныйДокумент	 - Табличный документ. 
//  ТаблицаДанных		 - таблица значений.
//
Процедура ВыполнитьРасчетыПоЗависимостям(ТабличныйДокумент,ТаблицаДанных) Экспорт 
	
	// Проверка и добавления второго индекса для старых бюджетов.
	Если ТаблицаДанных.Индексы.Количество() = 1 Тогда
		ТаблицаДанных.Индексы.Добавить("ИмяАргумента");
	КонецЕсли;
	
	СписокСмежности = бит_БюджетированиеКлиентСервер.СписокСмежности(ТабличныйДокумент);
	
	ЕстьЦикл = Ложь;
	Последовательность = Новый Массив();
	СтатусыВершин = Новый Соответствие();
	Для каждого Элемент Из СписокСмежности Цикл
		Вершина = Элемент.Ключ;
		Если СтатусыВершин[Вершина] = Неопределено Тогда // Не проверенная вершина.
			МаршрутЦикла = Новый Массив();
			ЕстьЦикл = бит_БюджетированиеКлиентСервер.ПоискПоследовательностиРасчета(Вершина, СписокСмежности, Последовательность, МаршрутЦикла, СтатусыВершин);
		КонецЕсли;
		Если ЕстьЦикл Тогда
			Прервать;	
		КонецЕсли;
	КонецЦикла;
	СтатусыВершин = Неопределено; // Освобождение памяти, соответствие может быть очень тяжелым.
	
	Если ЕстьЦикл Тогда
		ТекстСообщения = НСтр("ru='Найдены циклические ссылки. Необходимо проверить формулы в ""Настройки формы ввода бюджета"".';
								|en='Cyclic links found. You need to check the formulas in the ""Budget Entry Form Settings"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	Иначе
		Сч = Последовательность.ВГраница();
		Пока Сч >= 0 Цикл
			ИмяТекущейЯчейки = Последовательность[Сч];
			СтрОтбор = Новый Структура("Имя,ИмяАргумента",ИмяТекущейЯчейки,ИмяТекущейЯчейки);
			МассивСтрок = ТаблицаДанных.НайтиСтроки(СтрОтбор);
			Если МассивСтрок.Количество()>0 Тогда
				СтрокаТаблицыФормула = МассивСтрок[0];
				СтрокаТаблицыФормулаР = СтрокаТаблицыФормула.Расшифровка;
				Если СтрокаТаблицыФормулаР.Вид = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБФормула()
					ИЛИ СтрокаТаблицыФормулаР.Вид = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБЗначение() Тогда
					
					ВычислитьФормулу(СтрокаТаблицыФормула,ТаблицаДанных);
				КонецЕсли; 
			КонецЕсли;
			Сч = Сч - 1;
		КонецЦикла;
		
		Для каждого Обл Из ТабличныйДокумент.Области Цикл
			Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Обл) 
				И (бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЗначенияФВБ(Обл.Расшифровка)
				ИЛИ бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаФормулыФВБ(Обл.Расшифровка)) Тогда
				
				СтрОтбор = Новый Структура("Имя,ИмяАргумента",Обл.Имя,Обл.Имя);
				МассивСтрок = ТаблицаДанных.НайтиСтроки(СтрОтбор);
				Если МассивСтрок.Количество()>0 Тогда
					СтрокаТаблицы = МассивСтрок[0];
					Обл.Значение = СтрокаТаблицы.Значение;
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Функция - Вычислить зависимые формулы
//
// Параметры:
//  ТаблицаДанных		 - таблица значений.
//  ИмяЯчейки			 - строка.
//  ОбработанныеОбласти	 - области табличного документа.
//  УровеньРекурсии		 - число.
// 
// Возвращаемое значение:
//  Результат - структура.
//
Функция ВычислитьЗависимыеФормулы(ТаблицаДанных, СписокСмежности, ИмяЯчейки, ОбработанныеОбласти = Неопределено) Экспорт
	
	// Проверка и добавления второго индекса для старых бюджетов.
	Если ТаблицаДанных.Индексы.Количество() = 1 Тогда
		ТаблицаДанных.Индексы.Добавить("ИмяАргумента");
	КонецЕсли;

	Результат = Новый Структура("Статус, ИзмененныеОбласти, МассивИзменений","ОК", Новый Массив, Новый Массив);		
	Если ОбработанныеОбласти = Неопределено Тогда
		ОбработанныеОбласти = Новый Массив;
	КонецЕсли; 
	
	МаршрутЦикла = Новый Массив();
	Последовательность = Новый Массив();
	СтатусыВершин = Новый Соответствие();
	ЕстьЦикл = бит_БюджетированиеКлиентСервер.ПоискПоследовательностиРасчета(ИмяЯчейки, СписокСмежности, Последовательность, МаршрутЦикла, СтатусыВершин);
	СтатусыВершин = Неопределено; // Освобождение памяти, соответствие может быть очень тяжелым.
	Если ЕстьЦикл Тогда
		ТекстСообщения = НСтр("ru='Найдены циклические ссылки. Необходимо проверить формулы в ""Настройки формы ввода бюджета"".';
								|en='Cyclic links found. You need to check the formulas in the ""Budget Entry Form Settings"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Результат.Статус = "Ошибка";
		Возврат Результат;
	КонецЕсли;
		
	Если Последовательность.Количество() > 0 Тогда
		// Удаляемя из последовательности саму ячейку, так как уже посчитали ее.
		Последовательность.Удалить(Последовательность.ВГраница());
	КонецЕсли;
	
	// Обходим последовательность расчета в обратном порядке.
	Сч = Последовательность.ВГраница();
	Пока Сч >= 0 Цикл
		ИмяТекущейЯчейки = Последовательность[Сч];
		ОбработанныеОбласти.Добавить(ИмяТекущейЯчейки);
		СтрОтбор = Новый Структура("Имя,ИмяАргумента",ИмяТекущейЯчейки,ИмяТекущейЯчейки);
		МассивСтрок = ТаблицаДанных.НайтиСтроки(СтрОтбор);
		Если МассивСтрок.Количество()>0 Тогда
			СтрокаТаблицыФормула = МассивСтрок[0];
			СтрокаТаблицыФормулаР = СтрокаТаблицыФормула.Расшифровка;
			Если СтрокаТаблицыФормулаР.Вид = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБФормула()
				ИЛИ СтрокаТаблицыФормулаР.Вид = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБЗначение() Тогда
				
				ЗначениеВычисления = ВычислитьФормулу(СтрокаТаблицыФормула,ТаблицаДанных);
				СтруктураПередачи = Новый Структура("Имя,Значение", ИмяТекущейЯчейки, ЗначениеВычисления);
				Результат.МассивИзменений.Добавить(СтруктураПередачи);
				
				Если СтрокаТаблицыФормулаР.Вид = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБЗначение() Тогда
					Результат.ИзмененныеОбласти.Добавить(ИмяТекущейЯчейки);
				КонецЕсли; 				
			КонецЕсли; 
		КонецЕсли;
		Сч = Сч - 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция определяет новый статус объекта.
// Механизм определения статусов может быть переопределен алгоритмами.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект.бит_ФормаВводаБюджета.
//  ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
//   СправочникСсылка.бит_СтатусыОбъектов - новый статус объекта.
//
Функция НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Возврат бит_ВизированиеСервер.НовыйСтатусПоСтандартномуАлгоритму(ТекущийОбъект, ПараметрыУстановкиСтатуса);
	
КонецФункции

// Элементы формы, которые не блокируются в зависимости от статуса.
//
// Возвращаемое значение:
// 	СписокЗначений - Список имен элементов.
//
Функция ЭлементыИсключенияНастройкиДоступности() Экспорт
	
	ИсключаемыеЭлементы = Новый СписокЗначений;
	
	Возврат ИсключаемыеЭлементы;
	
КонецФункции

Функция ДанныеХранилищДокумента(СсылкаНаДокумент, ИдентификаторФормы) Экспорт
	
	НовыеДанныеЯчеек 			  = Документы.бит_ФормаВводаБюджета.НовыеДанныеЯчеек();
	АдресХранилищаДанных		  = ПоместитьВоВременноеХранилище(НовыеДанныеЯчеек, ИдентификаторФормы);
	АдресХранилищаСпискаСмежности = ПоместитьВоВременноеХранилище(Новый Структура, ИдентификаторФормы);
	
	ДанныеХранилищ = Новый Структура;
	ДанныеХранилищ.Вставить("ТабличныйДокумент", 			 Новый ТабличныйДокумент);
	ДанныеХранилищ.Вставить("НастройкиПостроителя", 		 Новый Структура);
	ДанныеХранилищ.Вставить("АдресХранилищаДанных", 		 АдресХранилищаДанных);
	ДанныеХранилищ.Вставить("АдресХранилищаСпискаСмежности", АдресХранилищаСпискаСмежности);
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		Возврат ДанныеХранилищ;
	КонецЕсли;
	
	ИменаПолей = Новый Массив;
	ИменаПолей.Добавить("ХранилищеДерева");
	ИменаПолей.Добавить("НастройкиПостроителя");
	ИменаПолей.Добавить("ХранилищеДанных");
	ИменаПолей.Добавить("ХранилищеСпискаСмежности");
	
	РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент,
							СтрСоединить(ИменаПолей, ","));
	
	ТабличныйДокумент = РеквизитыОбъекта.ХранилищеДерева.Получить();
	Если ТипЗнч(ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
		ДанныеХранилищ.ТабличныйДокумент = ТабличныйДокумент;
	КонецЕсли; 
	
	НастройкиПостроителя = РеквизитыОбъекта.НастройкиПостроителя.Получить();
	Если ТипЗнч(НастройкиПостроителя) = Тип("Структура") Тогда
		ДанныеХранилищ.НастройкиПостроителя = НастройкиПостроителя;
	КонецЕсли; 	
	
	ДанныеЯчеек = РеквизитыОбъекта.ХранилищеДанных.Получить();
	Если ТипЗнч(ДанныеЯчеек) <> Тип("ТаблицаЗначений") Тогда
		АдресХранилищаДанных = Документы.бит_ФормаВводаБюджета.ЗаполнитьТаблицуДанных(
									ДанныеХранилищ.ТабличныйДокумент, ИдентификаторФормы);
	Иначе	
		// Уточненение состава колонок таблицы значений.
		Для каждого СтрокаТаблицы Из ДанныеЯчеек Цикл
			ЗаполнитьЗначенияСвойств(НовыеДанныеЯчеек.Добавить(), СтрокаТаблицы);
		КонецЦикла;
		АдресХранилищаДанных = ПоместитьВоВременноеХранилище(ДанныеЯчеек,ИдентификаторФормы);
	КонецЕсли;
	ДанныеХранилищ.АдресХранилищаДанных = АдресХранилищаДанных;	
	
	СписокСмежности = РеквизитыОбъекта.ХранилищеСпискаСмежности.Получить();
	Если ТипЗнч(СписокСмежности) <> Тип("Структура") Тогда
		АдресХранилищаСпискаСмежности = Документы.бит_ФормаВводаБюджета.ЗаполнитьСписокСмежности(
											ДанныеХранилищ.ТабличныйДокумент, ИдентификаторФормы);
	Иначе	
		АдресХранилищаСпискаСмежности = ПоместитьВоВременноеХранилище(СписокСмежности, ИдентификаторФормы);
	КонецЕсли;	
	ДанныеХранилищ.АдресХранилищаСпискаСмежности = АдресХранилищаСпискаСмежности;
	
	Возврат ДанныеХранилищ;
	
КонецФункции

Функция ДанныеТабличнойЧастиБДДС(Ссылка) Экспорт
	
	ДанныеТЧВРегистре = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ДанныеТЧВРегистре");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Если ДанныеТЧВРегистре Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ФормаВводаБюджетаБДДС.ДокументВладелец КАК Ссылка,
		|	ФормаВводаБюджетаБДДС.НомерСтрокиДокумента КАК НомерСтроки,
		|	ФормаВводаБюджетаБДДС.ИД КАК ИД,
		|	ФормаВводаБюджетаБДДС.ПериодСтрокиДокумента КАК Период,
		|	ФормаВводаБюджетаБДДС.ЦФО КАК ЦФО,
		|	ФормаВводаБюджетаБДДС.Организация КАК Организация,
		|	ФормаВводаБюджетаБДДС.СтатьяОборотов КАК СтатьяОборотов,
		// ++ ЕРП
		|	ФормаВводаБюджетаБДДС.Аналитика_8 КАК Аналитика_8,
		|	ФормаВводаБюджетаБДДС.Аналитика_9 КАК Аналитика_9,
		|	ФормаВводаБюджетаБДДС.Аналитика_10 КАК Аналитика_10,
		|	ФормаВводаБюджетаБДДС.Аналитика_11 КАК Аналитика_11,
		|	ФормаВводаБюджетаБДДС.Аналитика_12 КАК Аналитика_12,
		// -- ЕРП
		|	ФормаВводаБюджетаБДДС.Аналитика_1 КАК Аналитика_1,
		|	ФормаВводаБюджетаБДДС.Аналитика_2 КАК Аналитика_2,
		|	ФормаВводаБюджетаБДДС.Аналитика_3 КАК Аналитика_3,
		|	ФормаВводаБюджетаБДДС.Аналитика_4 КАК Аналитика_4,
		|	ФормаВводаБюджетаБДДС.Аналитика_5 КАК Аналитика_5,
		|	ФормаВводаБюджетаБДДС.Аналитика_6 КАК Аналитика_6,
		|	ФормаВводаБюджетаБДДС.Аналитика_7 КАК Аналитика_7,
		|	ФормаВводаБюджетаБДДС.Количество КАК Количество,
		|	ФормаВводаБюджетаБДДС.Норма КАК Норма,
		|	ФормаВводаБюджетаБДДС.Сумма КАК Сумма,
		|	ФормаВводаБюджетаБДДС.Измерение КАК Измерение,
		|	ФормаВводаБюджетаБДДС.Расчетная КАК Расчетная,
		|	ФормаВводаБюджетаБДДС.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.бит_ФормаВводаБюджетаБДДС КАК ФормаВводаБюджетаБДДС
		|ГДЕ
		|	ФормаВводаБюджетаБДДС.ДокументВладелец = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ФормаВводаБюджетаБДДС.Ссылка КАК Ссылка,
		|	ФормаВводаБюджетаБДДС.НомерСтроки КАК НомерСтроки,
		|	ФормаВводаБюджетаБДДС.ИД КАК ИД,
		|	ФормаВводаБюджетаБДДС.Период КАК Период,
		|	ФормаВводаБюджетаБДДС.ЦФО КАК ЦФО,
		|	ФормаВводаБюджетаБДДС.Организация КАК Организация,
		|	ФормаВводаБюджетаБДДС.СтатьяОборотов КАК СтатьяОборотов,
		// ++ ЕРП
		|	ФормаВводаБюджетаБДДС.Аналитика_8 КАК Аналитика_8,
		|	ФормаВводаБюджетаБДДС.Аналитика_9 КАК Аналитика_9,
		|	ФормаВводаБюджетаБДДС.Аналитика_10 КАК Аналитика_10,
		|	ФормаВводаБюджетаБДДС.Аналитика_11 КАК Аналитика_11,
		|	ФормаВводаБюджетаБДДС.Аналитика_12 КАК Аналитика_12,
		// -- ЕРП
		|	ФормаВводаБюджетаБДДС.Аналитика_1 КАК Аналитика_1,
		|	ФормаВводаБюджетаБДДС.Аналитика_2 КАК Аналитика_2,
		|	ФормаВводаБюджетаБДДС.Аналитика_3 КАК Аналитика_3,
		|	ФормаВводаБюджетаБДДС.Аналитика_4 КАК Аналитика_4,
		|	ФормаВводаБюджетаБДДС.Аналитика_5 КАК Аналитика_5,
		|	ФормаВводаБюджетаБДДС.Аналитика_6 КАК Аналитика_6,
		|	ФормаВводаБюджетаБДДС.Аналитика_7 КАК Аналитика_7,
		|	ФормаВводаБюджетаБДДС.Количество КАК Количество,
		|	ФормаВводаБюджетаБДДС.Норма КАК Норма,
		|	ФормаВводаБюджетаБДДС.Сумма КАК Сумма,
		|	ФормаВводаБюджетаБДДС.Измерение КАК Измерение,
		|	ФормаВводаБюджетаБДДС.Расчетная КАК Расчетная,
		|	ФормаВводаБюджетаБДДС.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.бит_ФормаВводаБюджета.БДДС КАК ФормаВводаБюджетаБДДС
		|ГДЕ
		|	ФормаВводаБюджетаБДДС.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДанныеТабличнойЧастиЗависимыеОбороты(Ссылка) Экспорт
	
	ДанныеТЧВРегистре = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ДанныеТЧВРегистре");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Если ДанныеТЧВРегистре Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗависимыеОбороты.ДокументВладелец КАК Ссылка,
		|	ЗависимыеОбороты.НомерСтрокиДокумента КАК НомерСтроки,
		|	ЗависимыеОбороты.ИД КАК ИД,
		|	ЗависимыеОбороты.ИД_Родитель КАК ИД_Родитель,
		|	ЗависимыеОбороты.ПериодСтрокиДокумента КАК Период,
		|	ЗависимыеОбороты.Сценарий КАК Сценарий,
		|	ЗависимыеОбороты.ЦФО КАК ЦФО,
		|	ЗависимыеОбороты.Организация КАК Организация,
		|	ЗависимыеОбороты.СтатьяОборотов КАК СтатьяОборотов,
		// ++ ЕРП
		|	ЗависимыеОбороты.Аналитика_8 КАК Аналитика_8,
		|	ЗависимыеОбороты.Аналитика_9 КАК Аналитика_9,
		|	ЗависимыеОбороты.Аналитика_10 КАК Аналитика_10,
		|	ЗависимыеОбороты.Аналитика_11 КАК Аналитика_11,
		|	ЗависимыеОбороты.Аналитика_12 КАК Аналитика_12,
		// -- ЕРП
		|	ЗависимыеОбороты.Аналитика_1 КАК Аналитика_1,
		|	ЗависимыеОбороты.Аналитика_2 КАК Аналитика_2,
		|	ЗависимыеОбороты.Аналитика_3 КАК Аналитика_3,
		|	ЗависимыеОбороты.Аналитика_4 КАК Аналитика_4,
		|	ЗависимыеОбороты.Аналитика_5 КАК Аналитика_5,
		|	ЗависимыеОбороты.Аналитика_6 КАК Аналитика_6,
		|	ЗависимыеОбороты.Аналитика_7 КАК Аналитика_7,
		|	ЗависимыеОбороты.Количество КАК Количество,
		|	ЗависимыеОбороты.Норма КАК Норма,
		|	ЗависимыеОбороты.Сумма КАК Сумма,
		|	ЗависимыеОбороты.Измерение КАК Измерение,
		|	ЗависимыеОбороты.Комментарий КАК Комментарий,
		|	ЗависимыеОбороты.КомментарийРасчета КАК КомментарийРасчета,
		|	ЗависимыеОбороты.Расчетная КАК Расчетная
		|ИЗ
		|	РегистрСведений.бит_ФормаВводаБюджетаЗависимыеОбороты КАК ЗависимыеОбороты
		|ГДЕ
		|	ЗависимыеОбороты.ДокументВладелец = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗависимыеОбороты.Ссылка КАК Ссылка,
		|	ЗависимыеОбороты.НомерСтроки КАК НомерСтроки,
		|	ЗависимыеОбороты.ИД КАК ИД,
		|	ЗависимыеОбороты.ИД_Родитель КАК ИД_Родитель,
		|	ЗависимыеОбороты.Период КАК Период,
		|	ЗависимыеОбороты.Сценарий КАК Сценарий,
		|	ЗависимыеОбороты.ЦФО КАК ЦФО,
		|	ЗависимыеОбороты.Организация КАК Организация,
		|	ЗависимыеОбороты.СтатьяОборотов КАК СтатьяОборотов,
		// ++ ЕРП
		|	ЗависимыеОбороты.Аналитика_8 КАК Аналитика_8,
		|	ЗависимыеОбороты.Аналитика_9 КАК Аналитика_9,
		|	ЗависимыеОбороты.Аналитика_10 КАК Аналитика_10,
		|	ЗависимыеОбороты.Аналитика_11 КАК Аналитика_11,
		|	ЗависимыеОбороты.Аналитика_12 КАК Аналитика_12,
		// -- ЕРП
		|	ЗависимыеОбороты.Аналитика_1 КАК Аналитика_1,
		|	ЗависимыеОбороты.Аналитика_2 КАК Аналитика_2,
		|	ЗависимыеОбороты.Аналитика_3 КАК Аналитика_3,
		|	ЗависимыеОбороты.Аналитика_4 КАК Аналитика_4,
		|	ЗависимыеОбороты.Аналитика_5 КАК Аналитика_5,
		|	ЗависимыеОбороты.Аналитика_6 КАК Аналитика_6,
		|	ЗависимыеОбороты.Аналитика_7 КАК Аналитика_7,
		|	ЗависимыеОбороты.Количество КАК Количество,
		|	ЗависимыеОбороты.Норма КАК Норма,
		|	ЗависимыеОбороты.Сумма КАК Сумма,
		|	ЗависимыеОбороты.Измерение КАК Измерение,
		|	ЗависимыеОбороты.Комментарий КАК Комментарий,
		|	ЗависимыеОбороты.КомментарийРасчета КАК КомментарийРасчета,
		|	ЗависимыеОбороты.Расчетная КАК Расчетная
		|ИЗ
		|	Документ.бит_ФормаВводаБюджета.ЗависимыеОбороты КАК ЗависимыеОбороты
		|ГДЕ
		|	ЗависимыеОбороты.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Элементы формы, которые блокируются программно.
//
// Возвращаемое значение:
// 	СписокЗначений - Список имен элементов.
//
Функция ЭлементыПрограммнойБлокировкиНастройкиДоступности() Экспорт
	
	ЭлементыФормы = Новый СписокЗначений;
	
	ЭлементыФормы.Добавить("ТабДокДанные");
	
	Возврат ЭлементыФормы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеДерева

// Функция сдвигает период или извлекает период из кэша периодов. 
// 
// Параметры:
//  ВхИмя     - Дата.
//  Сдвиг     - Число.
//  Периодичность - ПеречислениеСсылка.бит_Периодичность.
//  КэшПериодов   - Соответствие.
// 
// Возвращаемое значение:
//  ИмяНов - Строка.
// 
Функция ПреобразоватьИмяЯчейки(ВхИмя, Сдвиг, Периодичность, КэшИмен, КэшПериодов) 
	
	НовоеИмя = КэшИмен[ВхИмя];
	
	Если НовоеИмя = Неопределено Тогда
		
		РезМассив = бит_СтрокиКлиентСервер.РазобратьСтрокуСРазделителями(ВхИмя, "_");
		Если РезМассив.Количество() > 2 Тогда
			// Разбираем имя на составные части, сдвигаем период и формируем новое имя.
			Префикс   = РезМассив[0];           
			ПериодСтр = РезМассив[1];
			
			ИдентификаторИзмерений = Новый Массив;
			Для й = 2 По РезМассив.ВГраница() Цикл
				ИдентификаторИзмерений.Добавить(РезМассив[й]);
			КонецЦикла;	
			ИдентификаторИзмерений = СтрСоединить(ИдентификаторИзмерений, "_");
			
			Если ПериодСтр = "Итог" ИЛИ ПериодСтр = "Ит" Тогда
				НовоеИмя = Префикс+"_"+ПериодСтр+"_"+ИдентификаторИзмерений;
			Иначе
				Период    = Дата(ПериодСтр);
				ТекПериод = ПреобразоватьПериод(Период, Сдвиг, Периодичность, КэшПериодов);			
				НовоеИмя = бит_Бюджетирование.СформироватьИмяКолонкиПериод(Префикс, ТекПериод) + "_" + ИдентификаторИзмерений;
			КонецЕсли;	
			КэшИмен.Вставить(ВхИмя, НовоеИмя);
		КонецЕсли;	
	КонецЕсли;
	
	Если НовоеИмя = Неопределено Тогда
		// Преобразовать не удалось, оставим начальное имя.
		НовоеИмя = ВхИмя;
	КонецЕсли;	
	
	Возврат НовоеИмя;
	
КонецФункции	

Процедура ОбновитьДанныеРасшифровки(Область)
	
	Расшифровка = Область.Расшифровка;
	ИмяОбласти  = Расшифровка.Имя;
	
	СмежныеОбласти = Новый Структура;
	СмежныеОбласти.Вставить("СП", "");
	СмежныеОбласти.Вставить("КП", "");
	СмежныеОбласти.Вставить("СФ", "");
	СмежныеОбласти.Вставить("КФ", "");		
	
	ЧастиИмени = СтрРазделить(ИмяОбласти, "_");
	Если ЧастиИмени.Количество() > 2 Тогда
		Префикс = ЧастиИмени[0];
		// Если префикс подойдет к одному из ключей структуры, значит это наша область.
		Если СмежныеОбласти.Свойство(Префикс) Тогда
			СмежныеОбласти[Префикс] = ИмяОбласти;
			Для каждого КлючЗначение Из СмежныеОбласти Цикл
				Если КлючЗначение.Ключ = Префикс Тогда
					Продолжить;					
				КонецЕсли;
				ЧастиИмени[0] 	= КлючЗначение.Ключ;
				ИмяКандидата	= СтрСоединить(ЧастиИмени, "_");
				СмежныеОбласти[КлючЗначение.Ключ] = ИмяКандидата;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	Расшифровка.Вставить("СмежныеОбласти", 			 СмежныеОбласти);
	Расшифровка.Вставить("ИдентификаторРасшифровки", ИмяОбласти);
	Расшифровка.Вставить("ИдентификаторСтроки", 	 "");
	Расшифровка.Вставить("ЦветФона", 				 Область.ЦветФона);
	
	ЗначенияГруппировок = Новый Массив;
	Если ТипЗнч(Расшифровка.Измерения) = Тип("Структура") Тогда
		Для каждого КлючЗначение Из Расшифровка.Измерения Цикл
			ЗначенияГруппировок.Добавить(КлючЗначение.Значение);
		КонецЦикла;
	Иначе
		ЗначенияГруппировок.Добавить(Расшифровка.Значение);
	КонецЕсли;
	Расшифровка.ИдентификаторСтроки = бит_ВводБюджета.ИдентификаторРасшифровки(ЗначенияГруппировок, Расшифровка.Период);

КонецПроцедуры	

Процедура ВывестиШапку(ТабДок, Области, НастрФормы, Периоды)
	
	УчетПоКоличеству = НастрФормы.УчетКоличество;
	УчетПоСумме      = НастрФормы.УчетСумма;
	ИмяОбластиПериод = ?(УчетПоКоличеству И УчетПоСумме, "Заголовок_ПолеДубль", "Заголовок_Поле");
	
	ОтдельноеРасположениеПолейГруппировок = (НастрФормы.РасположениеПолейГруппировок = Перечисления.бит_РасположениеПолейГруппировок.Отдельно);
								  
	ВыведеноОбластей = 0;
	
	// Колонка кодификатор. 
	Если НастрФормы.ВыводитьКодификатор Тогда
		ТабДок.Вывести(Области.Заголовок_Кодификатор); 
		ВыведеноОбластей = ВыведеноОбластей + 1;
	КонецЕсли;
	
	// Имена измерений.
	Для каждого Имя Из НастрФормы.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать] Цикл
		
		Если НастрФормы.ИспользоватьНаименованияСтатейБюджета И НастрФормы.Измерения[Имя].Имя = "СтатьяОборотов" Тогда
			Области.Заголовок_Измерение.Параметры.ИмяИзмерения = НСтр("ru = 'Статьи бюджета'");
		Иначе	
			Области.Заголовок_Измерение.Параметры.ИмяИзмерения = НастрФормы.Измерения[Имя].Синоним;
		КонецЕсли;   
		
		Если ВыведеноОбластей = 0 Тогда
			ТабДок.Вывести(Области.Заголовок_Измерение); 
			ВыведеноОбластей = ВыведеноОбластей + 1;
		Иначе	
			ТабДок.Присоединить(Области.Заголовок_Измерение);
		КонецЕсли;
	КонецЦикла; 
	
	// Фиксация области измерений.
	ТабДок.ФиксацияСверху = ТабДок.ВысотаТаблицы;
	ТабДок.ФиксацияСлева  = НастрФормы.КоличествоРазворачивать + 1;
	
	ОбластьПериод = Области[ИмяОбластиПериод];
	ном = 1;
	Для каждого ТекОписание Из Периоды Цикл
		
		ОбластьПериод.Параметры.ИмяПоля = ТекОписание.Синоним;
		ИмяЯчейки = бит_Бюджетирование.ИмяОбластиПериод(ном);
		ВидЯчейки = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБПериод();
		расш = бит_Бюджетирование.РасшифровкаЯчейки(ИмяЯчейки, Неопределено, ТекОписание.Период, ВидЯчейки);
		расш.Периодичность = ТекОписание.Периодичность;
		
		яч = ОбластьПериод.Область(1,1,1,1);
		яч.ИспользованиеРасшифровки = ИспользованиеРасшифровкиТабличногоДокумента.БезОбработки;
		яч.Имя = ИмяЯчейки;
		яч.Расшифровка = расш;
		
		Если ТекОписание.ЭтоВыходной 
			 И НастрФормы.ОтображениеВыходных = Перечисления.бит_РежимыОтображенияВыходныхДнейФормыВвода.Выделять Тогда		
			 яч.ЦветТекста = WebЦвета.Красный;			 
		Иначе			 
			 яч.ЦветТекста = WebЦвета.Черный;			 
		КонецЕсли; 
		
		ТабДок.Присоединить(ОбластьПериод);
		Ном = Ном + 1;
	КонецЦикла; 
		
КонецПроцедуры

// Выводит групировки в дерево данных. 
// 
// Параметры:
//  СтрокаВерх - СтрокаДереваЗначений.
//  ТабДок - ТабличныйДокумент.
//  Области - Структура.
//  НастрФормы - Структура.
//  Периоды - Массив.
//  Ном - Число.
//  СтрПар - Структура.
// 
Функция ОбойтиДерево(СтрокаВерх, ТабДок, Области, НастрФормы, Периоды, Ном, ДопПараметры)
	
	ИменаЯчеек = Новый Соответствие;
	ИзмеренияРазворачивать  = НастрФормы.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать];
	КоличествоРазворачивать = НастрФормы.КоличествоРазворачивать;
	ЭтоНастройкаПоБюджету   = ?(ЗначениеЗаполнено(НастрФормы.Бюджет), Истина, Ложь);
	ИспользоватьКоэффициенты = ?(ЭтоНастройкаПоБюджету И НастрФормы.ИспользоватьКоэффициентыСтатейБюджета, Истина, Ложь);
	
	ВидыРасшифровокФВБ = бит_БюджетированиеКлиентСервер.ВидыРасшифровокФВБ();
	
	// Структура для хранения данных, используемых при анализе необходимости объединения ячеек.
	ДанныеВрем = бит_Бюджетирование.КонструкторСтруктурыПроверкиОбъединения(ИзмеренияРазворачивать, НастрФормы.ВыводитьКодификатор);
	
	ИмяПоляКодификатор = "";
	Если ТипЗнч(СтрокаВерх) = Тип("ДеревоЗначений") Тогда
		Колонки = СтрокаВерх.Колонки;
	Иначе	
		Колонки = СтрокаВерх.Владелец().Колонки;
	КонецЕсли; 
	Для Каждого Колонка Из Колонки Цикл
		Если СтрЧислоВхождений(Колонка.Имя, "_Кодификатор") <> 0  Тогда
			ИмяПоляКодификатор = "_Кодификатор";
		ИначеЕсли СтрЧислоВхождений(Колонка.Имя, "Кодификатор") <> 0  Тогда	
			ИмяПоляКодификатор = "Кодификатор";
		КонецЕсли;	
	КонецЦикла; 	
	
	Для каждого СтрокаДерева Из СтрокаВерх.Строки Цикл
		
		Уровень = СтрокаДерева.Уровень();
		ЕстьПодчиненныеСтроки = ?(СтрокаДерева.Строки.Количество() > 0, Истина, Ложь);
		// Если настройка не по бюджету, коэффициент всегда 1.
		// Для настройки по бюджету, для групп коэффициент 1, для статей берем указанный в статье.
		Коэффициент = ?(ИспользоватьКоэффициенты, ?(СтрокаДерева.СтатьяБюджета.ЭтоГруппа, 1, СтрокаДерева.СтатьяБюджета.Коэффициент), 1);
		
		// Если нет подчиненных строк - строку, содержащую группы выводить не нужно.
		ЕстьГруппы = Ложь;
		Для каждого Имя Из ИзмеренияРазворачивать Цикл
			Если ДопПараметры.ЭтоНовыйЗапрос Тогда
				// Новый формат запроса может содержать несколько измерений.
				ТекЗначение = СтрокаДерева[Имя];
				Если ЭтоНастройкаПоБюджету И ВРег(Имя) = ВРег("СтатьяОборотов") И НЕ ЗначениеЗаполнено(ТекЗначение) Тогда					
					Если СтрокаДерева.СтатьяБюджета.ЭтоГруппа Тогда
						Если НастрФормы.Настройка.ИспользоватьНаименованияСтатейБюджета Тогда
							ТекЗначение = СтрокаДерева.СтатьяБюджета;
						Иначе
							ТекЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДерева.СтатьяБюджета, "СтатьяОборотов");
							Если НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
								ТекЗначение = СтрокаДерева.СтатьяБюджета;
							КонецЕсли;
						КонецЕсли;
					Иначе	
						ТекЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДерева.СтатьяБюджета, "СтатьяОборотов");
					КонецЕсли; 
				КонецЕсли; 
			Иначе	
				ТекЗначение = СтрокаДерева.Ссылка; 
			КонецЕсли;	
			Если ЗначениеЗаполнено(ТекЗначение) И ТекЗначение.ЭтоГруппа Тогда
				ЕстьГруппы = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;  // По именам измерений.
		
		Если ЕстьГруппы И НЕ ЕстьПодчиненныеСтроки Тогда
			Продолжить;
		КонецЕсли; 
		
		// Если в подчиненных строках только группы - выводить не нужно.
		ТолькоГруппы = Истина;
		бит_Бюджетирование.ПроверитьНаличиеПодчиненныхЭлементов(СтрокаДерева, ИзмеренияРазворачивать, ДопПараметры.ЭтоНовыйЗапрос, ТолькоГруппы); 			
        Если ТолькоГруппы Тогда
			Продолжить;
		КонецЕсли; 
		
		// Измерения.
		ЗначенияИзмерений = Новый Структура;
		ИдИзмерений = "";
		ЕстьГруппа = Ложь;
		Сч = 1;
		Для каждого Имя Из ИзмеренияРазворачивать Цикл
			
			Если Сч = 1 И НастрФормы.ВыводитьКодификатор Тогда
				// Вывод кодификатора для первого измерения.
				Если ДопПараметры.ЭтоНовыйЗапрос Тогда
					Области.Строка_Кодификатор.Параметры.Кодификатор = СтрокаДерева[Имя + ИмяПоляКодификатор];
				Иначе	
					Области.Строка_Кодификатор.Параметры.Кодификатор = СтрокаДерева.Кодификатор;
				КонецЕсли; 
				Области.Строка_Кодификатор.Параметры.р = Новый Структура("Уровень", Уровень);
				ТабДок.Вывести(Области.Строка_Кодификатор, Уровень);
			КонецЕсли; 
			
			// Вывод измерений в макет.
			Если ДопПараметры.ЭтоНовыйЗапрос Тогда
				ТекЗначение = СтрокаДерева[Имя];
				Если НЕ ЗначениеЗаполнено(ТекЗначение) И СтрСравнить(Имя, "СтатьяОборотов") = 0 И ЭтоНастройкаПоБюджету Тогда
					Если СтрокаДерева.СтатьяБюджета.ЭтоГруппа Тогда
						Если НастрФормы.ИспользоватьНаименованияСтатейБюджета Тогда
							ТекЗначение = СтрокаДерева.СтатьяБюджета;
						Иначе
							ТекЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДерева.СтатьяБюджета, "СтатьяОборотов");
							Если НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
								ТекЗначение = СтрокаДерева.СтатьяБюджета;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли; 
			Иначе	
				// Формат запроса редакции 2.8 содержал, только одно измерение с именем Ссылка.
				ТекЗначение = СтрокаДерева.Ссылка; 
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ТекЗначение) И ТекЗначение.ЭтоГруппа Тогда
				ЕстьГруппа = Истина;
			КонецЕсли;
			
			Если ЭтоНастройкаПоБюджету И НастрФормы.ИспользоватьНаименованияСтатейБюджета И СтрСравнить(Имя, "СтатьяОборотов") = 0 Тогда
				Области.Строка_Измерение.Параметры.ЗначениеИзмерения = СтрокаДерева.СтатьяБюджета;
			Иначе
				Области.Строка_Измерение.Параметры.ЗначениеИзмерения = ТекЗначение;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекЗначение) Тогда
			    ЗначенияИзмерений.Вставить(Имя, ТекЗначение);
				ИдИзмерений = ИдИзмерений+?(ПустаяСтрока(ИдИзмерений),"","_")+СтрЗаменить(Строка(ТекЗначение.УникальныйИдентификатор()),"-","");
			Иначе	
				// Если значение измерения по каким-то причинам не заполнено, 
				// то необходимо сгенерить ИД, чтобы имя ячейки было уникальным.
				НовыйИД = Строка(Новый УникальныйИдентификатор);
				ИдИзмерений = ИдИзмерений+?(ПустаяСтрока(ИдИзмерений),"","_")+СтрЗаменить(НовыйИД,"-","");
			КонецЕсли; 
			
			ИмяЯчейки = бит_Бюджетирование.ИмяОбластиИзмерение(Имя, Ном);
			Обл 	  = Области.Строка_Измерение.Область(1,1,1,1);
			Обл.Имя   = ИмяЯчейки;
			ВидЯчейки = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБИзмерение();
			Области.Строка_Измерение.Параметры.р = бит_Бюджетирование.РасшифровкаЯчейки(ИмяЯчейки, Неопределено, Неопределено,
													ВидЯчейки, ,ТекЗначение); 
			
			Если Сч = 1 И НЕ НастрФормы.ВыводитьКодификатор Тогда
				ТабДок.Вывести(Области.Строка_Измерение, Уровень);
           	Иначе
				ТабДок.Присоединить(Области.Строка_Измерение, Уровень);			
			КонецЕсли;                                                 
			
			// Объединение ограничено 1 разворотом, чтобы избежать смещения в сетке табличного документа.
			Если НастрФормы.ОбъединятьЯчейки И Сч = 1 И КоличествоРазворачивать > 1 Тогда
				// Объединяем ячейки с повторяющимися значениями аналитик. 
				бит_Бюджетирование.ПроверитьВыполнитьОбъединениеЯчеек(ТабДок, ДанныеВрем, Имя, ТекЗначение, ЕстьПодчиненныеСтроки);
			КонецЕсли; 
			Сч = Сч +1;
		КонецЦикла;  // По именам измерений.
		
		// Ячейки данных.
		ИспользуемДваРесурса = (НастрФормы.УчетСумма И НастрФормы.УчетКоличество);
		ИмяСтроки  			 = ?(НЕ ЕстьПодчиненныеСтроки И НЕ ЕстьГруппа , "Строка", "СтрокаРасчетная");
		ИмяКолонки 			 = ?(ИспользуемДваРесурса, "ПолеДубль", ?(НастрФормы.УчетКоличество,"ПолеКоличество","ПолеСумма"));
		ИмяОбласти 			 = ИмяСтроки+"_"+ИмяКолонки;
		ИмяОбластиИтог 		 = "СтрокаРасчетная_"+ИмяКолонки;
		ВидЯчейки  			 = ?(НЕ ЕстьПодчиненныеСтроки И НЕ ЕстьГруппа , 
									бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБЗначение(), 
									бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБФормула());
		
	    Префиксы = Новый Структура;
		Префиксы.Вставить("ИмяСумма","СП");
		Префиксы.Вставить("ИмяКоличество","КП");
		
		Аргументы	= Новый Структура;  // Хранит аргументы для формул.
		Имена		= Новый Структура;  // Хранит имена различных типов ячеек.
		Для каждого КиЗ Из Префиксы Цикл
			Аргументы.Вставить(КиЗ.Значение, Новый Массив);
			Имена.Вставить(КиЗ.Значение, "");
		КонецЦикла; 
		
		Для каждого ТекОписание Из Периоды Цикл
			
			// Подготовка имен.
			Для каждого КиЗ Из Префиксы Цикл
				
				ТипИмени = КиЗ.Ключ;
				Префикс  = КиЗ.Значение;
				
				ТекИмяБезАналитики = ТекОписание[ТипИмени];
				ТекИмяЯчейки = ТекОписание[ТипИмени]+"_"+ИдИзмерений;
				Имена[Префикс] = ТекИмяЯчейки;
				Если ИменаЯчеек[ТекИмяБезАналитики] = Неопределено Тогда
					ИменаЯчеек[ТекИмяБезАналитики] = Новый Массив;
				КонецЕсли; 
				
				// Проверка статьи бюджета на флаг "НеВключатьВИтоги".
				Если НЕ ЗначениеЗаполнено(НастрФормы.Бюджет)
					ИЛИ (ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДерева, "СтатьяБюджета")
					И ДопПараметры.СтатьиБезИтогов[СтрокаДерева.СтатьяБюджета] = Неопределено) Тогда
					ИменаЯчеек[ТекИмяБезАналитики].Добавить(Новый Структура("Имя, Коэф", Имена[Префикс], Коэффициент));
				КонецЕсли;
				Если НЕ ТекОписание.ЭтоИтог Тогда
					Аргументы[Префикс].Добавить(Имена[Префикс]);
				КонецЕсли;
			
			КонецЦикла; // Префиксы.
			
			Если ИспользуемДваРесурса Тогда
				
				// Форма с двумя ресурсами.
				
				Если ТекОписание.ЭтоИтог Тогда
					
					// Итоговые колонки.
					Обл = Области[ИмяОбластиИтог];
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = Имена.КП;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидыРасшифровокФВБ.Формула;
					ПараметрыДоработки.Аргументы 	   = Аргументы.КП;
					ПараметрыДоработки.СмежныеОбласти  = Имена;
					ПараметрыДоработки.ЦветФона		   = Обл.Область(1, 1, 1, 1).ЦветФона;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 2;
					ПараметрыДоработки.Имя 			   = Имена.СП;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидыРасшифровокФВБ.Формула;
					ПараметрыДоработки.Аргументы 	   = Аргументы.СП;
					ПараметрыДоработки.СмежныеОбласти  = Имена;
					ПараметрыДоработки.ЦветФона		   = Обл.Область(1, 1, 1, 1).ЦветФона;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					ТабДок.Присоединить(Обл);					
				Иначе	
					
					// Колонки для ввода данных.
					Обл = Области[ИмяОбласти];
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = Имена.КП;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					ПараметрыДоработки.СмежныеОбласти  = Имена;
					ПараметрыДоработки.ЦветФона		   = Обл.Область(1, 1, 1, 1).ЦветФона;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);

					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 2;
					ПараметрыДоработки.Имя 			   = Имена.СП;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					ПараметрыДоработки.СмежныеОбласти  = Имена;
					ПараметрыДоработки.ЦветФона		   = Обл.Область(1, 1, 1, 1).ЦветФона;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					ТабДок.Присоединить(Обл);
				КонецЕсли; 
			Иначе	
				
				// Форма с одним ресурсом.
				ИмяЯчейки = ?(НастрФормы.УчетКоличество, Имена.КП, Имена.СП);
				Если ТекОписание.ЭтоИтог Тогда
					
					// Итоговая колонка.
					Обл = Области[ИмяОбластиИтог];
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = ИмяЯчейки;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидыРасшифровокФВБ.Формула;
					ПараметрыДоработки.Аргументы 	   = ?(НастрФормы.УчетКоличество, Аргументы.КП, Аргументы.СП);
					ПараметрыДоработки.СмежныеОбласти  = Имена;
					ПараметрыДоработки.ЦветФона		   = Обл.Область(1, 1, 1, 1).ЦветФона;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					ТабДок.Присоединить(Обл);
				Иначе	
					
					// Колонка для ввода данных.
					Обл = Области[ИмяОбласти];
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = ИмяЯчейки;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					ПараметрыДоработки.СмежныеОбласти  = Имена;
					ПараметрыДоработки.ЦветФона		   = Обл.Область(1, 1, 1, 1).ЦветФона;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					ТабДок.Присоединить(Обл);
				КонецЕсли; 
			КонецЕсли;  // ФлДваРесурса.
		КонецЦикла; // Периоды.
		
		ТекНом = Ном; // Фиксируем номер строки до входа в рекурсивный вызов.
		Ном = Ном + 1;	
		
		ИменаПодчиненныхЯчеек = ОбойтиДерево(СтрокаДерева, ТабДок, Области, НастрФормы, Периоды, Ном, ДопПараметры);
		
		// Установим формулы для вычисления итогов по группам.
		Если ИменаПодчиненныхЯчеек.Количество() > 0 Тогда
			// После выхода из подчиненного вызова сбрасываем параметры проверяющие объединение ячеек.
			ДанныеВрем = бит_Бюджетирование.КонструкторСтруктурыПроверкиОбъединения(ИзмеренияРазворачивать, НастрФормы.ВыводитьКодификатор);
			Для каждого ТекОписание Из Периоды Цикл
				Если НастрФормы.УчетКоличество Тогда
					 бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ТабДок, ИменаПодчиненныхЯчеек,
					 	ТекОписание.ИмяКоличество, ИдИзмерений);
				КонецЕсли; 
				Если НастрФормы.УчетСумма Тогда
					 бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ТабДок, ИменаПодчиненныхЯчеек,
					 	ТекОписание.ИмяСумма, ИдИзмерений);
				КонецЕсли; 
			КонецЦикла; // Периоды - установка формул.
		КонецЕсли;
		
	КонецЦикла; // По строкам дерева данного уровня.
	
	Если НастрФормы.ОбъединятьЯчейки Тогда
		// Вызова процедуры объединения для объединения ячеек в случае завершения группировки.
		Сч = 1;
		Для каждого Имя Из ИзмеренияРазворачивать Цикл
			// Объединение ограничено 1 разворотом, чтобы избежать смещения в сетке табличного документа.
			Если Сч = 1 И КоличествоРазворачивать > 1 Тогда
				// Объединяем ячейки с повторяющимися значениями аналитик.
				ЕстьПодчиненныеСтроки = ?(ТипЗнч(СтрокаВерх) = Тип("ДеревоЗначений"), Истина, Ложь);
				бит_Бюджетирование.ПроверитьВыполнитьОбъединениеЯчеек(ТабДок, ДанныеВрем, Имя, "НереальноеЗначение", ЕстьПодчиненныеСтроки, Истина);
			КонецЕсли; 
			Сч = Сч +1;
		КонецЦикла;  // По именам измерений.
	КонецЕсли; 
	
	Возврат ИменаЯчеек;
	
КонецФункции

Функция ОбновитьДеревоДанныхФиксированныйМакет(Настройка, ПараметрыОбновления)

	Бюджет = Настройка.Бюджет;
	Если ЗначениеЗаполнено(Бюджет) И Справочники.бит_Бюджеты.БюджетЗапрещенВПланировании(Бюджет) Тогда
		ТекстИсключения = НСтр("ru = 'Выполнение операции остановлено.
								|Бюджет настройки формы ввода не должен содержать дубли статей оборотов.';
								|en = 'The operation is stopped.
								|Budget setting entry forms should not contain duplicates revolutions articles.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;

	ДатаНачалаПланирования     = ПараметрыОбновления.ДатаНачалаПланирования;
	ДатаОкончанияПланирования  = ПараметрыОбновления.ДатаОкончанияПланирования;
	
	// Восстановление макета, сохраненного в настройке.
	НастройкаОбъект   = Настройка.ПолучитьОбъект();
	ДокументРезультат = НастройкаОбъект.ПолучитьДерево();
	
	Периодичность = Настройка.ПериодичностьПланирования;
	Сдвиг = бит_ОбщегоНазначенияКлиентСервер.РазностьДат(Настройка.ДатаНачалаПланирования, ДатаНачалаПланирования, Периодичность);
	
	// Кэш для периодов.
	Периоды = Новый Соответствие;
	// Кэш для имен ячеек.
	Имена = Новый Соответствие;
	
	МассивОбластей = Новый Массив;
	
	Для Каждого Обл Из ДокументРезультат.Области Цикл
		
		Если бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЯчейкиФВБ(Обл.Расшифровка) Тогда
			
			Если Обл.СодержитЗначение Тогда
				Обл.Значение = 0;
			КонецЕсли; 
			
			Если Сдвиг = 0 Тогда
				Продолжить;		
			КонецЕсли;
			
			Расшифровка = Обл.Расшифровка;
			Если ( Расшифровка.Вид = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБФормула() 
				ИЛИ Расшифровка.Вид = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБЗначение()) Тогда
				
				// Сдвиг периода.	 
				Расшифровка.Период = ПреобразоватьПериод(Расшифровка.Период, Сдвиг, Периодичность, Периоды);
				
				// Преобразование имени ячейки.
				Расшифровка.Имя = ПреобразоватьИмяЯчейки(Расшифровка.Имя, Сдвиг, Периодичность, Имена, Периоды);
				
				ОбновитьДанныеРасшифровки(Обл);
				
				МассивОбластей.Добавить(Новый Структура("Обл,Имя", Обл, Расшифровка.Имя));					
				
				// Преобразование аргументов и формулы.
				Если ТипЗнч(Расшифровка.Аргументы) = Тип("Массив") И Не ПустаяСтрока(Расшифровка.Формула) Тогда
					
					// Преобразование формулы производится в два этапа, 
					// сначала имена аргументов заменяются на временные, а затем на новые, для которых выполнен сдвиг.
					// Это необходимо, т.к. в случае сдвига внутри периода планирования ( например на месяц внутри года) 
					// имена после сдвига могут совпадать с существующими именами до сдвига.
					
					Расшифровка.Аргументы = бит_РаботаСКоллекциямиКлиентСервер.УдалитьПовторяющиесяЭлементыМассива(Расшифровка.Аргументы);
					АргСоотв = Новый Соответствие;
					Для й = 0 По Расшифровка.Аргументы.ВГраница() Цикл
						АргСтарый = Расшифровка.Аргументы[й];
						
						ИмяАрг = "%Арг_"+Формат(й+1, "ЧГ=")+"%";
						Расшифровка.Формула = СтрЗаменить(Расшифровка.Формула, АргСтарый, ИмяАрг);
						
						Расшифровка.Аргументы[й] = ПреобразоватьИмяЯчейки(Расшифровка.Аргументы[й], Сдвиг, Периодичность, Имена, Периоды);
						АргСоотв.Вставить(ИмяАрг, Расшифровка.Аргументы[й]);
					КонецЦикла;
					
					Для каждого КиЗ Из АргСоотв Цикл
						Расшифровка.Формула = СтрЗаменить(Расшифровка.Формула, КиЗ.Ключ, КиЗ.Значение);
					КонецЦикла; 
				КонецЕсли;
				
			КонецЕсли; // Необходимо выполнять сдвиг. 
			
			Если Расшифровка.Вид = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБПериод() И ЗначениеЗаполнено(Расшифровка.Период) Тогда
				// Сдвиг периода.	 
				Расшифровка.Период		= ПреобразоватьПериод(Расшифровка.Период, Сдвиг, Периодичность, Периоды);
				ТекПериодичность= ?(ЗначениеЗаполнено(Расшифровка.Периодичность), Расшифровка.Периодичность, Периодичность);
				Обл.Текст	= бит_ОбщегоНазначения.СформироватьПредставлениеПериода(Расшифровка.Период, ТекПериодичность);		
			КонецЕсли;	
		КонецЕсли; 
		
	КонецЦикла; // ТабДок.Области.
	
	// Замена имен областей. Необходимо выполнять отдельно, т.к. при смене имени области меняется 
	// индекс в коллекции и это приводит к странным эффектам, если менять имя областей в том же цикле, 
	// что и все остальные имена.
	
	// Сбрасываем имена областей, чтобы в процессе замены не могло дублей возникнуть
	// в верхнем цикле это делать нельзя, т.к. при смене имени области возможна смена индекса в коллекции.
	Ном = 1;
	Для каждого ПарамОбласти Из МассивОбластей Цикл
		Обл = ПарамОбласти.Обл;
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Обл) Тогда
			Обл.Имя = Строка("Area_"+Формат(Ном, "ЧГ="));				
			Ном = Ном+1;
		КонецЕсли;	
	КонецЦикла; 
	
	// Устанавливаем новые имена областей.
	Для каждого ПарамОбласти Из МассивОбластей Цикл
		Обл = ПарамОбласти.Обл;
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Обл) Тогда
			Обл.Имя = ПарамОбласти.Имя;
		КонецЕсли;	
	КонецЦикла;

	Результат = Новый Структура("ДокументРезультат", ДокументРезультат); 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииПечати

// Сформировать печатные формы объектов.
//
// Параметры:
//  МассивСсылок  	 - Массив. Массив ссылок которые нужно распечатать.
//  ИмяМакета 	     - Строка.
//  ПараметрыПечати  - Структура. Структура дополнительных параметров печати.
//  ПечатныйДокумент - ТабличныйДокумент. Возвращаемый.
// 
Процедура Печать(МассивСсылок, ИмяМакета, ПараметрыПечати, ПечатныйДокумент) Экспорт
	
	ПечатныйДокумент = СформироватьПечатнуюФорму(ИмяМакета, МассивСсылок);
	
КонецПроцедуры

// АПК:134-выкл Количество параметров более 7 для совместимости с предыдущими версиями библиотеки.

// Осуществляет вывод шапки дерева данных. 
// 
// Параметры:
//  ТабДок - ТабличныйДокумент.
//  Области - Структура - Области макета.
//  НастрФормы - Структура - Настройки формы ввода.
// 
Функция ВывестиШапкуПечатнойФормы(ИмяМакета, ТабДок, Области, НастройкаФормы, СтрПар, ТекДокумент, МассивИзмеренийТаблицы, МассивИзмеренийРазворачивать)

	НастрФормы = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(НастройкаФормы);
	
	ДатаНачалаПланирования    = СтрПар.ДатаНачалаПланирования;
	ДатаОкончанияПланирования = СтрПар.ДатаОкончанияПланирования;	
							  	
	// Имена измерений.
	Для каждого Имя Из НастрФормы.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать] Цикл
		
		Области.Заголовок_Измерение.Параметры.ИмяИзмерения = НастрФормы.Измерения[Имя].Синоним;
		ТабДок.Присоединить(Области.Заголовок_Измерение);
		
		МассивИзмеренийРазворачивать.Добавить(Имя);

	КонецЦикла; 
	
	ТЗ = ДанныеТабличнойЧастиБДДС(ТекДокумент);
	
	Для каждого Имя Из НастрФормы.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.РучнойВвод] Цикл
		
		ВыводитьКолонку = Ложь;
		
		МассивЗначений = ТЗ.ВыгрузитьКолонку(Имя);
		Для Каждого Эл Из МассивЗначений Цикл
			Если ЗначениеЗаполнено(Эл) Тогда
				ВыводитьКолонку = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ВыводитьКолонку Тогда
			Области.Заголовок_Измерение.Параметры.ИмяИзмерения = НастрФормы.Измерения[Имя].Синоним;
			
			Если Не ТабДок.ПроверитьПрисоединение(Области.Заголовок_Измерение) Тогда
				ТабДок.ВывестиВертикальныйРазделительСтраниц();
			КонецЕсли;
				
			ТабДок.Присоединить(Области.Заголовок_Измерение);
			
			МассивИзмеренийТаблицы.Добавить(Имя);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// комментарий.
	Если ВРег(ИмяМакета) = ВРег("ДанныеБюджета") Тогда
		Области.Заголовок_Измерение.Параметры.ИмяИзмерения = "Комментарий";
		
		Если Не ТабДок.ПроверитьПрисоединение(Области.Заголовок_Измерение) Тогда
			ТабДок.ВывестиВертикальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Присоединить(Области.Заголовок_Измерение);
	КонецЕсли;
		
	// Вывод заголовка периодов.
	Периодичность        = СтрПар.Периодичность;
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончанияПланирования) Тогда
		
		КоличествоИнтервалов = СтрПар.ПродолжительностьИнтервала;
		
	Иначе
		
		КоличествоИнтервалов = бит_ОбщегоНазначенияКлиентСервер.РазностьДат(ДатаНачалаПланирования, ДатаОкончанияПланирования, Периодичность)+1;
		
	КонецЕсли; 
		
	ИмяОбластиПериод     = "Заголовок_Поле";

	// Проверим, следует ли создавать дополнительные итоговые колонки.
	ПериодыИтогов = Новый Массив;
	Для каждого СтрНастройки Из НастрФормы.ДополнительныеИтоги Цикл
	
		Если Перечисления.бит_ПериодичностьПланирования.Индекс(СтрНастройки.Периодичность) > Перечисления.бит_ПериодичностьПланирования.Индекс(Периодичность) Тогда
		
			  ПериодыИтогов.Добавить(СтрНастройки);
		
		КонецЕсли; 
	
	КонецЦикла; 
		
	Периоды = Новый Массив;
	НомИт = 1;
	Для й=1 По КоличествоИнтервалов Цикл
	
		ТекущийПериод = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ДатаНачалаПланирования,й-1,Периодичность);
		
		Синоним = бит_ОбщегоНазначения.СформироватьПредставлениеПериода(ТекущийПериод,Периодичность);		
		ПараметрыОписанияПериода = бит_Бюджетирование.НовыеПараметрыОписаниеПериода();
		ПараметрыОписанияПериода.Период  = ТекущийПериод;
		ПараметрыОписанияПериода.Синоним = Синоним;
		ТекОписаниеПериода = бит_Бюджетирование.ОписаниеПериода(ПараметрыОписанияПериода);
		
		Периоды.Добавить(ТекОписаниеПериода);
		
	КонецЦикла; // По интервалам.

	// Колонки итогов.
	Если НастрФормы.ВыводитьОбщиеИтоги Тогда
		ПараметрыОписанияПериода = бит_Бюджетирование.НовыеПараметрыОписаниеПериода();
		ПараметрыОписанияПериода.Период  = Дата('00010101');
		// АПК:1297-выкл Не локализуется.
		ПараметрыОписанияПериода.Синоним = "Итого";
		// АПК:1297-вкл
		ПараметрыОписанияПериода.Имя 	 = "Итог";
		ПараметрыОписанияПериода.ЭтоИтог = Истина;
		ТекОписаниеПериода = бит_Бюджетирование.ОписаниеПериода(ПараметрыОписанияПериода);
		Периоды.Добавить(ТекОписаниеПериода);		
	КонецЕсли; 
	
	ОбластьПериод = Области[ИмяОбластиПериод];
	
	ном = 1;
	СоответствиеПериодаСуммы = Новый ТаблицаЗначений;
	СоответствиеПериодаСуммы.Колонки.Добавить("Период");
	СоответствиеПериодаСуммы.Колонки.Добавить("Сумма");

	Для каждого ТекОписание Из Периоды Цикл
		
		ОбластьПериод.Параметры.ИмяПоля = ТекОписание.Синоним;
		ИмяЯчейки = бит_Бюджетирование.ИмяОбластиПериод(ном);
		ВидЯчейки = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБПериод();
		расш = бит_Бюджетирование.РасшифровкаЯчейки(ИмяЯчейки, Неопределено, ТекОписание.Период, ВидЯчейки);
		расш.Периодичность = ТекОписание.Периодичность;
		
		яч = ОбластьПериод.Область(1,1,1,1);
		яч.ИспользованиеРасшифровки = ИспользованиеРасшифровкиТабличногоДокумента.БезОбработки;
		яч.Имя = ИмяЯчейки;
		яч.Расшифровка = расш;
		
		Если ТекОписание.ЭтоВыходной 
			 И НастрФормы.ОтображениеВыходных = Перечисления.бит_РежимыОтображенияВыходныхДнейФормыВвода.Выделять Тогда
		
			 яч.ЦветТекста = WebЦвета.Красный;
			 
		Иначе
			 
			 яч.ЦветТекста = WebЦвета.Черный;
			 
		КонецЕсли; 
		
		Если Не ТабДок.ПроверитьПрисоединение(ОбластьПериод) Тогда 
			ТабДок.ВывестиВертикальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Присоединить(ОбластьПериод);
		
		Ном = Ном + 1;
		
		НоваяСтрокаТЗ = СоответствиеПериодаСуммы.Добавить();
		НоваяСтрокаТЗ.Период = ТекОписание.Период;
		НоваяСтрокаТЗ.Сумма  = 0;

	КонецЦикла; 
	
	Возврат СоответствиеПериодаСуммы;
	
КонецФункции
// АПК:134-вкл

// Функция формирует печатную форму заявки на оплату.
//
// Параметры:
//  ИмяМакета			   - Строка
//  МассивСсылок  		   - Массив.
//  СчитатьСуммуПоПлатежам - Булево. По умолчанию Ложь.
//
// Возвращаемое значение:
//  ТабличныйДокумент - ТабличныйДокумент.
// 
Функция СформироватьПечатнуюФорму(ИмяМакета, МассивСсылок)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Формируем запрос по заявкам.
	РезультатЗапроса = ПолучитьРезультатЗапросаПоФормеВвода(МассивСсылок);
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		// Получаем макет и области.
		Макет = ПолучитьМакет("МакетПечатнаяФорма");
		// Получаем области.
		Шапка 			 = Макет.ПолучитьОбласть("Шапка");
		Аналитика        = Макет.ПолучитьОбласть("Аналитика");
		ШапкаВиза    	 = Макет.ПолучитьОбласть("ШапкаВиза");
		СтрокаВиза  	 = Макет.ПолучитьОбласть("СтрокаВиза");
		Подвал  		 = Макет.ПолучитьОбласть("Подвал");

		Области = Новый Структура;
		Области.Вставить("ИмяДокумента"         ,Макет.ПолучитьОбласть("ИмяДокумента"));
		Области.Вставить("ЗаголовокТаблицы"     ,Макет.ПолучитьОбласть("ЗаголовокТаблицы"));
		Области.Вставить("Заголовок_Измерение"  ,Макет.ПолучитьОбласть("Заголовок|Измерение"));
		Области.Вставить("Заголовок_Поле"       ,Макет.ПолучитьОбласть("Заголовок|Поле"));
		Области.Вставить("Строка_Измерение"     ,Макет.ПолучитьОбласть("Строка|Измерение"));
		Области.Вставить("Строка_ПолеКоличество",Макет.ПолучитьОбласть("Строка|ПолеКоличество"));
		Области.Вставить("Строка_ПолеСумма"     ,Макет.ПолучитьОбласть("Строка|ПолеСумма"));		
		Области.Вставить("Строка_Поле"          ,Макет.ПолучитьОбласть("Строка|Поле"));
		
		// Вывод результатов.
		ПервыйДокумент   = Истина;
		ВыборкаИзЗапроса = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаИзЗапроса.Следующий() Цикл 
			
			ТекДокумент = ВыборкаИзЗапроса.Ссылка;
			// Отбор для таблиц по текущему документу.
			Отбор = Новый Структура;
			Отбор.Вставить("Ссылка", ТекДокумент); 			
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			Области.ИмяДокумента.Параметры.ДокументаСсылка = ТекДокумент;
			ТабличныйДокумент.Вывести(Области.ИмяДокумента);
			
			ТабличныйДокумент.ВерхнийКолонтитул.Выводить = Истина;
			ТабличныйДокумент.ВерхнийКолонтитул.ТекстВЦентре = ТекДокумент;
			ТабличныйДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 2;
			
			ТабличныйДокумент.НижнийКолонтитул.Выводить = Истина;
			ТабличныйДокумент.НижнийКолонтитул.ТекстВЦентре = "Стр [&НомерСтраницы]/[&СтраницВсего]";
			ТабличныйДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
			
			// Заполяем параметры областей.
			Шапка.Параметры.Заполнить(ВыборкаИзЗапроса);			   
			
			ТабличныйДокумент.Вывести(Шапка);
						
			ПродолжительностьИнтервала = ТекДокумент.Сценарий.ПродолжительностьИнтервала;
			Периодичность              = ТекДокумент.Сценарий.бит_Периодичность;
			ДатаНачалаПланирования     = ТекДокумент.ДатаНачалаПланирования;
			ДатаОкончанияПланирования  = ТекДокумент.ДатаОкончанияПланирования;

			 // Вывод дерева данных.
			СтрПарШапка = НовыеПараметрыШапки();
			СтрПарШапка.Периодичность              = Периодичность;
			СтрПарШапка.ПродолжительностьИнтервала = ПродолжительностьИнтервала;
			СтрПарШапка.ДатаНачалаПланирования     = ДатаНачалаПланирования;
			СтрПарШапка.ДатаОкончанияПланирования  = ДатаОкончанияПланирования;
			СтрПарШапка.ДанныеТЧВРегистре          = ВыборкаИзЗапроса.ДанныеТЧВРегистре;

			НастройкаФормы = ВыборкаИзЗапроса.НастройкаФормы;
			
			НастрФормы = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(НастройкаФормы);
			
			// Вывод аналитик.
			СтрОтбор = Новый Структура("СпособЗаполнения", Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчанию);
		    Строки = НастройкаФормы.Измерения.НайтиСтроки(СтрОтбор);

			СтрОтбор = Новый Структура("СпособЗаполнения", Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчаниюРедактирование);
			Для Каждого  Эл Из НастройкаФормы.Измерения.НайтиСтроки(СтрОтбор) Цикл 
				Строки.добавить(Эл);
			КонецЦикла;
			
			Для каждого Эл Из Строки Цикл
				
				Если ЗначениеЗаполнено(ТекДокумент[Эл.Имя]) И Не ВРег(Эл.Имя) = ВРег("Сценарий") Тогда
					Аналитика.Параметры.АналитикаЗаголовок = НастрФормы.Измерения[Эл.Имя].Синоним;
					Аналитика.Параметры.АналитикаЗначение  = ТекДокумент[Эл.Имя];
					
					ТабличныйДокумент.Вывести(Аналитика);
					
				ИначеЕсли ЗначениеЗаполнено(Эл.ЗначениеПоУмолчанию) И Не ВРег(Эл.Имя) = ВРег("Сценарий") Тогда
					Аналитика.Параметры.АналитикаЗаголовок = НастрФормы.Измерения[Эл.Имя].Синоним;
					Аналитика.Параметры.АналитикаЗначение  = Эл.ЗначениеПоУмолчанию;
					
					ТабличныйДокумент.Вывести(Аналитика);
				КонецЕсли;
				
			КонецЦикла;
				
			ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
			
			Если ВРег(ИмяМакета) = ВРег("СводнаяТаблица") Тогда
				ВывестиДанныеПечатнойФормы("ДанныеБюджета", ТабличныйДокумент, Области, НастройкаФормы, СтрПарШапка, ТекДокумент);
			    ВывестиДанныеПечатнойФормы("ЗависимыеОбороты", ТабличныйДокумент, Области, НастройкаФормы, СтрПарШапка, ТекДокумент);
			Иначе
				ВывестиДанныеПечатнойФормы(ИмяМакета, ТабличныйДокумент, Области, НастройкаФормы, СтрПарШапка, ТекДокумент);
			КонецЕсли;		

			
			ТабДокПодвал = Новый ТабличныйДокумент;
			
			// Получим таблицу установленных виз.
			ТаблицаПоВизам  = ЗаписиУстановкиВиз(МассивСсылок);
				
			ТабДокПодвал.Вывести(ШапкаВиза);
			// Заполняем и выводим в табличный документ строки с визами для текущего документа.
			МассивСтрок = ТаблицаПоВизам.НайтиСтроки(Отбор);
			Для Каждого ТекСтрока Из МассивСтрок Цикл
				СтрокаВиза.Параметры.Заполнить(ТекСтрока);
				ТабДокПодвал.Вывести(СтрокаВиза);
			КонецЦикла;
			
			// Выводим область "ЗаявкаНиз" в табличный документ.
			Подвал.Параметры.Заполнить(ВыборкаИзЗапроса);
			ТабДокПодвал.Вывести(Подвал);
			
			Если Не ТабличныйДокумент.ПроверитьВывод(ТабДокПодвал) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ТабДокПодвал);

		КонецЦикла; // Пока ВыборкаИзЗапроса.Следующий() Цикл.
		
	КонецЕсли; // Если Не РезультатЗапроса.Пустой() Тогда.
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ВывестиДанныеПечатнойФормы(ИмяМакета, ТабличныйДокумент, Области, НастройкаФормы, СтрПарШапка, ТекДокумент)

	// Выведем заголовок таблицы.
	Области.ЗаголовокТаблицы.Параметры.ЗаголовокТаблицы = ?(ИмяМакета = "ДанныеБюджета"
															, НСтр("ru = 'Данные бюджета';
															  	   |en = 'Budget data'")
															, НСтр("ru = 'Зависимые обороты';
															  	   |en = 'Dependent line-items'"));
	ТабличныйДокумент.Вывести(Области.ЗаголовокТаблицы);
	
	МассивИзмеренийТаблицы = Новый Массив;
	МассивИзмеренийРазворачивать = Новый Массив;

	Периоды = ВывестиШапкуПечатнойФормы(ИмяМакета, ТабличныйДокумент, Области, НастройкаФормы, СтрПарШапка, ТекДокумент, МассивИзмеренийТаблицы, МассивИзмеренийРазворачивать);

	НастрФормы = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(НастройкаФормы);

	Строки = Справочники.бит_НастройкиФормВводаБюджета.НастройкаСтруктурыБюджета(НастройкаФормы.Измерения);
	
	Периодичность = СтрПарШапка.Периодичность;
	
	ИзмереенияИтогов = "";
	
	КоличествоСтрок = Строки.Количество();
	ИндСтроки = 1;
	
	Для каждого Эл Из Строки Цикл
		СимволОкончания = ?(КоличествоСтрок = ИндСтроки, "", ",");
		ИзмереенияИтогов = ИзмереенияИтогов + Эл.Имя + СимволОкончания;
		ИндСтроки = ИндСтроки +1;
	КонецЦикла;

	Если ВРег(ИмяМакета) = ВРег("ДанныеБюджета") Тогда
		Если СтрПарШапка.ДанныеТЧВРегистре Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Таблица.ДокументВладелец КАК Ссылка,
			|	Таблица.ЦФО КАК ЦФО,
			|	Таблица.Организация КАК Организация,
			|	Таблица.СтатьяОборотов КАК СтатьяОборотов,
			|	СУММА(Таблица.Количество) КАК Количество,
			|	СУММА(Таблица.Сумма) КАК Сумма,
			|	Таблица.ПериодСтрокиДокумента КАК Период,
			|	Таблица.Аналитика_1 КАК Аналитика_1,
			|	Таблица.Аналитика_2 КАК Аналитика_2,
			|	Таблица.Аналитика_3 КАК Аналитика_3,
			|	Таблица.Аналитика_4 КАК Аналитика_4,
			|	Таблица.Аналитика_5 КАК Аналитика_5,
			|	Таблица.Аналитика_6 КАК Аналитика_6,
			|	Таблица.Аналитика_7 КАК Аналитика_7,
			// ++ ЕРП
			|	Таблица.Аналитика_8 КАК Аналитика_8,
			|	Таблица.Аналитика_9 КАК Аналитика_9,
			|	Таблица.Аналитика_10 КАК Аналитика_10,
			|	Таблица.Аналитика_11 КАК Аналитика_11,
			|	Таблица.Аналитика_12 КАК Аналитика_12
			// -- ЕРП
			|ИЗ
			|	РегистрСведений.бит_ФормаВводаБюджетаБДДС КАК Таблица
			|ГДЕ
			|	Таблица.ДокументВладелец = &ТекДокумент
			|
			|СГРУППИРОВАТЬ ПО
			|	Таблица.ЦФО,
			|	Таблица.Организация,
			|	Таблица.ДокументВладелец,
			|	Таблица.СтатьяОборотов,
			|	Таблица.ПериодСтрокиДокумента,
			|	Таблица.Аналитика_1,
			|	Таблица.Аналитика_2,
			|	Таблица.Аналитика_3,
			|	Таблица.Аналитика_4,
			|	Таблица.Аналитика_5,
			|	Таблица.Аналитика_6,
			|	Таблица.Аналитика_7,
			// ++ ЕРП
			|	Таблица.Аналитика_8,
			|	Таблица.Аналитика_9,
			|	Таблица.Аналитика_10,
			|	Таблица.Аналитика_11,
			|	Таблица.Аналитика_12
			// -- ЕРП
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период
			|ИТОГИ
			|	СУММА(Количество),
			|	СУММА(Сумма)
			|ПО
			|	&ИзмереенияИтогов,
			|	&Периодичность";
		Иначе
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Таблица.Ссылка КАК Ссылка,
			|	Таблица.ЦФО КАК ЦФО,
			|	Таблица.Организация КАК Организация,
			|	Таблица.СтатьяОборотов КАК СтатьяОборотов,
			|	СУММА(Таблица.Количество) КАК Количество,
			|	СУММА(Таблица.Сумма) КАК Сумма,
			|	Таблица.Период КАК Период,
			|	Таблица.Аналитика_1 КАК Аналитика_1,
			|	Таблица.Аналитика_2 КАК Аналитика_2,
			|	Таблица.Аналитика_3 КАК Аналитика_3,
			|	Таблица.Аналитика_4 КАК Аналитика_4,
			|	Таблица.Аналитика_5 КАК Аналитика_5,
			|	Таблица.Аналитика_6 КАК Аналитика_6,
			|	Таблица.Аналитика_7 КАК Аналитика_7,
			// ++ ЕРП
			|	Таблица.Аналитика_8 КАК Аналитика_8,
			|	Таблица.Аналитика_9 КАК Аналитика_9,
			|	Таблица.Аналитика_10 КАК Аналитика_10,
			|	Таблица.Аналитика_11 КАК Аналитика_11,
			|	Таблица.Аналитика_12 КАК Аналитика_12
			// -- ЕРП
			|ИЗ
			|	Документ.бит_ФормаВводаБюджета.БДДС КАК Таблица
			|ГДЕ
			|	Таблица.Ссылка = &ТекДокумент
			|
			|СГРУППИРОВАТЬ ПО
			|	Таблица.ЦФО,
			|	Таблица.Организация,
			|	Таблица.Ссылка,
			|	Таблица.СтатьяОборотов,
			|	Таблица.Период,
			|	Таблица.Аналитика_1,
			|	Таблица.Аналитика_2,
			|	Таблица.Аналитика_3,
			|	Таблица.Аналитика_4,
			|	Таблица.Аналитика_5,
			|	Таблица.Аналитика_6,
			|	Таблица.Аналитика_7,
			// ++ ЕРП
			|	Таблица.Аналитика_8,
			|	Таблица.Аналитика_9,
			|	Таблица.Аналитика_10,
			|	Таблица.Аналитика_11,
			|	Таблица.Аналитика_12
			// -- ЕРП
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период
			|ИТОГИ
			|	СУММА(Количество),
			|	СУММА(Сумма)
			|ПО
			|	&ИзмереенияИтогов,
			|	&Периодичность";
		КонецЕсли;
	Иначе
		Если СтрПарШапка.ДанныеТЧВРегистре Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Таблица.ДокументВладелец КАК Ссылка,
			|	Таблица.ЦФО КАК ЦФО,
			|	Таблица.Организация КАК Организация,
			|	Таблица.СтатьяОборотов КАК СтатьяОборотов,
			|	СУММА(Таблица.Количество) КАК Количество,
			|	СУММА(Таблица.Сумма) КАК Сумма,
			|	Таблица.ПериодСтрокиДокумента КАК Период,
			|	Таблица.Аналитика_1 КАК Аналитика_1,
			|	Таблица.Аналитика_2 КАК Аналитика_2,
			|	Таблица.Аналитика_3 КАК Аналитика_3,
			|	Таблица.Аналитика_4 КАК Аналитика_4,
			|	Таблица.Аналитика_5 КАК Аналитика_5,
			|	Таблица.Аналитика_6 КАК Аналитика_6,
			|	Таблица.Аналитика_7 КАК Аналитика_7,
			// ++ ЕРП
			|	Таблица.Аналитика_8 КАК Аналитика_8,
			|	Таблица.Аналитика_9 КАК Аналитика_9,
			|	Таблица.Аналитика_10 КАК Аналитика_10,
			|	Таблица.Аналитика_11 КАК Аналитика_11,
			|	Таблица.Аналитика_12 КАК Аналитика_12
			// -- ЕРП
			|ИЗ
			|	РегистрСведений.бит_ФормаВводаБюджетаЗависимыеОбороты КАК Таблица
			|ГДЕ
			|	Таблица.ДокументВладелец = &ТекДокумент
			|
			|СГРУППИРОВАТЬ ПО
			|	Таблица.ЦФО,
			|	Таблица.Организация,
			|	Таблица.ДокументВладелец,
			|	Таблица.СтатьяОборотов,
			|	Таблица.ПериодСтрокиДокумента,
			|	Таблица.Аналитика_1,
			|	Таблица.Аналитика_2,
			|	Таблица.Аналитика_3,
			|	Таблица.Аналитика_4,
			|	Таблица.Аналитика_5,
			|	Таблица.Аналитика_6,
			|	Таблица.Аналитика_7,
			// ++ ЕРП
			|	Таблица.Аналитика_8,
			|	Таблица.Аналитика_9,
			|	Таблица.Аналитика_10,
			|	Таблица.Аналитика_11,
			|	Таблица.Аналитика_12
			// -- ЕРП
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период
			|ИТОГИ
			|	СУММА(Количество),
			|	СУММА(Сумма)
			|ПО
			|	&ИзмереенияИтогов,
			|	&Периодичность";
		Иначе
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Таблица.Ссылка КАК Ссылка,
			|	Таблица.ЦФО КАК ЦФО,
			|	Таблица.Организация КАК Организация,
			|	Таблица.СтатьяОборотов КАК СтатьяОборотов,
			|	СУММА(Таблица.Количество) КАК Количество,
			|	СУММА(Таблица.Сумма) КАК Сумма,
			|	Таблица.Период КАК Период,
			|	Таблица.Аналитика_1 КАК Аналитика_1,
			|	Таблица.Аналитика_2 КАК Аналитика_2,
			|	Таблица.Аналитика_3 КАК Аналитика_3,
			|	Таблица.Аналитика_4 КАК Аналитика_4,
			|	Таблица.Аналитика_5 КАК Аналитика_5,
			|	Таблица.Аналитика_6 КАК Аналитика_6,
			|	Таблица.Аналитика_7 КАК Аналитика_7,
			// ++ ЕРП
			|	Таблица.Аналитика_8 КАК Аналитика_8,
			|	Таблица.Аналитика_9 КАК Аналитика_9,
			|	Таблица.Аналитика_10 КАК Аналитика_10,
			|	Таблица.Аналитика_11 КАК Аналитика_11,
			|	Таблица.Аналитика_12 КАК Аналитика_12
			// -- ЕРП
			|ИЗ
			|	Документ.бит_ФормаВводаБюджета.ЗависимыеОбороты КАК Таблица
			|ГДЕ
			|	Таблица.Ссылка = &ТекДокумент
			|
			|СГРУППИРОВАТЬ ПО
			|	Таблица.ЦФО,
			|	Таблица.Организация,
			|	Таблица.Ссылка,
			|	Таблица.СтатьяОборотов,
			|	Таблица.Период,
			|	Таблица.Аналитика_1,
			|	Таблица.Аналитика_2,
			|	Таблица.Аналитика_3,
			|	Таблица.Аналитика_4,
			|	Таблица.Аналитика_5,
			|	Таблица.Аналитика_6,
			|	Таблица.Аналитика_7,
			// ++ ЕРП
			|	Таблица.Аналитика_8,
			|	Таблица.Аналитика_9,
			|	Таблица.Аналитика_10,
			|	Таблица.Аналитика_11,
			|	Таблица.Аналитика_12
			// -- ЕРП
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период
			|ИТОГИ
			|	СУММА(Количество),
			|	СУММА(Сумма)
			|ПО
			|	&ИзмереенияИтогов,
			|	&Периодичность";
		КонецЕсли;
	КонецЕсли;
	
	// АПК:1297-выкл Не локализуется, т.к. является текстом запроса.
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса , "&ИзмереенияИтогов", ИзмереенияИтогов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса , "&Периодичность", "Период ПЕРИОДАМИ("+Периодичность+", &НачалоПериода, &КонецПериода)");
	// АПК:1297-вкл
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекДокумент",   ТекДокумент);
	Запрос.УстановитьПараметр("НачалоПериода", СтрПарШапка.ДатаНачалаПланирования);
	Запрос.УстановитьПараметр("КонецПериода",  СтрПарШапка.ДатаОкончанияПланирования);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	КоличествоИзмеренийГруппировок = МассивИзмеренийРазворачивать.Количество();
	
	СтрокаИзмерений = "";
	МассивСтрокИзмерений = Новый ТаблицаЗначений;
	
	Для Каждого ИмяИзмерения Из МассивИзмеренийРазворачивать Цикл
		
		СтрокаИзмерений = СтрокаИзмерений + ИмяИзмерения + ",";
		
		МассивСтрокИзмерений.Колонки.Добавить(ИмяИзмерения);

	КонецЦикла;
	
	Для Инд = 0 По МассивИзмеренийТаблицы.Количество() -1 Цикл
		ОкончаниеСтроки = ?(Инд = МассивИзмеренийТаблицы.Количество() -1, "", ",");
		
		СтрокаИзмерений = СтрокаИзмерений + МассивИзмеренийТаблицы[Инд] + ОкончаниеСтроки;
		
		МассивСтрокИзмерений.Колонки.Добавить(МассивИзмеренийТаблицы[Инд]);

	КонецЦикла;
		
	ВыполнитьВыводСтроки(ИмяМакета, ТекДокумент, ТабличныйДокумент, Области, Периоды, НастрФормы, КоличествоИзмеренийГруппировок, РезультатЗапроса, МассивИзмеренийТаблицы, СтрокаИзмерений, МассивСтрокИзмерений);
		

КонецПроцедуры

// АПК:134-выкл Количество параметров более 7 для совместимости с предыдущими версиями библиотеки.
Процедура ВыполнитьВыводСтроки(ИмяМакета, ТекДокумент, ТабличныйДокумент, Области, Периоды, НастрФормы, 
				КоличествоИзмеренийГруппировок, РезультатЗапроса, МассивИзмеренийТаблицы, СтрокаИзмерений, МассивСтрокИзмерений)
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Если Выборка.Уровень() < КоличествоИзмеренийГруппировок Тогда

		ОбнулитьПериоды(Периоды);
		
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока Выборка.Следующий() Цикл
			
			ТабДок = Новый ТабличныйДокумент;
			
			// Имена измерений.
			Для Инд = 0 По НастрФормы.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать].КОличество()-1 Цикл
								
				Области.Строка_Измерение.Параметры.ЗначениеИзмерения = Выборка[НастрФормы.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать][Инд]];
				
				ТекущаяОбласть = Области.Строка_Измерение.Область();
				ТекущаяОбласть.Отступ = Выборка.Уровень();
				
				ТабДок.Присоединить(Области.Строка_Измерение);
				
			КонецЦикла;
			
			ОбластьТабДок = ТабДок.Область();
			ОбластьТабДок.Шрифт = Новый Шрифт("Arial", 8, 1);

			Для каждого Имя Из МассивИзмеренийТаблицы Цикл
				
				Области.Строка_Измерение.Параметры.ЗначениеИзмерения = Выборка[Имя];
				ТабДок.Присоединить(Области.Строка_Измерение);
						
			КонецЦикла;

			// вывести комментарий.
			Если ВРег(ИмяМакета) = ВРег("ДанныеБюджета") Тогда

				Области.Строка_Измерение.Параметры.ЗначениеИзмерения = "";
				ТабДок.Присоединить(Области.Строка_Измерение);
				
			КонецЕсли;
			
			ВыборкаПериодов = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Период", "Все");
															
			Пока ВыборкаПериодов.Следующий() Цикл
				
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Период", ВыборкаПериодов.Период);
				
				МассивСтрок = Периоды.НайтиСтроки(СтруктураОтбора);
				Для Каждого Строка Из МассивСтрок Цикл
					Строка.Сумма = ?(ЗначениеЗаполнено(ВыборкаПериодов.Сумма),ВыборкаПериодов.Сумма, 0);
				КонецЦикла;
				
			КонецЦикла;				
				
			ОбщаяСумма = 0;
	        
			Для Каждого Период Из Периоды Цикл

				ОбщаяСумма = ОбщаяСумма + Период.Сумма;
				Если Период.Период = Дата('00010101') Тогда 
					Области.Строка_Поле.Параметры.ЗначениеПоля = ОбщаяСумма;
				Иначе
					Области.Строка_Поле.Параметры.ЗначениеПоля = Период.Сумма;
				КонецЕсли;
								
				ТабДок.Присоединить(Области.Строка_Поле);

			КонецЦикла;  
			
			ОбластьТабДок = ТабДок.Область();
			ОбластьТабДок.Шрифт = Новый Шрифт("Arial", 8, 1);

			Если Не ТабличныйДокумент.ПроверитьВывод(Области.Строка_Поле) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ТабДок);
						
			ВыполнитьВыводСтроки(ИмяМакета, ТекДокумент, ТабличныйДокумент, Области, Периоды, НастрФормы, КоличествоИзмеренийГруппировок, Выборка, МассивИзмеренийТаблицы, СтрокаИзмерений, МассивСтрокИзмерений);
			
		КонецЦикла;
		
	Иначе
		
		Пока Выборка.Следующий() Цикл
				
			ВыборкаДетальныеЗаписи = Выборка.Выбрать();
						
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ТабДок = Новый ТабличныйДокумент;
				
				СтруктураИзмерений = Новый Структура(СтрокаИзмерений);
				
				// Имена измерений.
				Для каждого КлючЗначение Из СтруктураИзмерений Цикл
					
					СтруктураИзмерений.Вставить(КлючЗначение.Ключ, ВыборкаДетальныеЗаписи[КлючЗначение.Ключ]);
					
				КонецЦикла; 
					
				СтрокаОтсутствет = Ложь;
				Если МассивСтрокИзмерений.Количество() > 0 Тогда
					
					МассивСтрок = МассивСтрокИзмерений.НайтиСтроки(СтруктураИзмерений);
					Если МассивСтрок.Количество() = 0 Тогда
						СтрокаОтсутствет = Истина;
					КонецЕсли;
					
				Иначе
					
					СтрокаОтсутствет = Истина;
					
				КонецЕсли;
				
				Если СтрокаОтсутствет Тогда

					ТекущаяОбласть = Области.Строка_Измерение.Область();
					ТекущаяОбласть.Шрифт = Новый Шрифт("Arial", 8, 0);
					
					// Имена измерений.
					Для Инд = 0 По НастрФормы.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать].КОличество()-1 Цикл
						
						ТекущаяОбласть.Отступ = Выборка.Уровень();

						Области.Строка_Измерение.Параметры.ЗначениеИзмерения = ВыборкаДетальныеЗаписи[НастрФормы.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать][Инд]];
						ТабДок.Присоединить(Области.Строка_Измерение);
					    						
					КонецЦикла;

					ТекущаяОбласть.Отступ = 0;

					Для каждого Имя Из МассивИзмеренийТаблицы Цикл
					
						Области.Строка_Измерение.Параметры.ЗначениеИзмерения = ВыборкаДетальныеЗаписи[Имя];
						ТабДок.Присоединить(Области.Строка_Измерение);

					КонецЦикла;

					// Вывести комментарий.
					Если ВРег(ИмяМакета) = ВРег("ДанныеБюджета") Тогда
						
						СтрокаКомментарий = "";
						МассивСтрокКомментарий = ТекДокумент.Бддс.НайтиСтроки(СтруктураИзмерений);
						Для каждого Стр Из МассивСтрокКомментарий Цикл
							СтрокаКомментарий = СтрокаКомментарий + Стр.Комментарий+ " ";
						КонецЦикла;
					
						Области.Строка_Измерение.Параметры.ЗначениеИзмерения = СтрокаКомментарий;
						ТабДок.Присоединить(Области.Строка_Измерение);

					КонецЕсли;
					
					ВывестиДанныеПоСтроке(Выборка, СтруктураИзмерений, ТабДок, Периоды, Области);
					
					Выборка.Сбросить();
					
					Если Не ТабличныйДокумент.ПроверитьВывод(Области.Строка_Поле) Тогда
						ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					ТабличныйДокумент.Вывести(ТабДок);

					НоваяСтрока = МассивСтрокИзмерений.Добавить();
                    ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураИзмерений);
					
				КонецЕсли;
								
			КонецЦикла;
										
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры 
// АПК:134-вкл

Процедура ВывестиДанныеПоСтроке(ВыборкаПериодов, СтруктураИзмерений, ТабДок, Периоды, Области)

	ОбнулитьПериоды(Периоды);

	ВыборкаПериодов.Сбросить();
			
	СуммаВЯчейке = 0;

	Пока ВыборкаПериодов.Следующий() Цикл
			
		ВыборкаДетальныеЗаписи = ВыборкаПериодов.Выбрать();
					
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			                                                                                                                              
			ВыводСтроки = Истина;					
			Для Каждого КлючЗначение Из СтруктураИзмерений Цикл
				Если КлючЗначение.Значение <>  ВыборкаДетальныеЗаписи[КлючЗначение.Ключ] Тогда
					ВыводСтроки = Ложь;
				КонецЕсли;
			КонецЦикла;
			
			Если ВыводСтроки Тогда
			
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Период", ВыборкаПериодов.Период);
				
				МассивСтрок = Периоды.НайтиСтроки(СтруктураОтбора);
				Для Каждого Строка Из МассивСтрок Цикл
					Строка.Сумма = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сумма),ВыборкаДетальныеЗаписи.Сумма, 0);
				КонецЦикла;
									
			КонецЕсли;
			
		КонецЦикла;
						
	КонецЦикла;
	
	ОбщаяСумма = 0;
	
	Для Каждого Период Из Периоды Цикл

		ОбщаяСумма = ОбщаяСумма + Период.Сумма;
		Если Период.Период = Дата('00010101') Тогда 
			Области.Строка_Поле.Параметры.ЗначениеПоля = ОбщаяСумма;
		Иначе
			Области.Строка_Поле.Параметры.ЗначениеПоля = Период.Сумма;
		КонецЕсли;
		
		ТабДок.Присоединить(Области.Строка_Поле);

	КонецЦикла; 
	
КонецПроцедуры 

Процедура ОбнулитьПериоды(ТаблицаПериодов)
	
	Для Каждого Период Из ТаблицаПериодов Цикл
		Период.Сумма = 0;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьРезультатЗапросаПоФормеВвода(МассивСсылок)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСсылок" , МассивСсылок);
 	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФормаВводаБюджета.Ссылка КАК Ссылка,
	|	ФормаВводаБюджета.НастройкаФормы КАК НастройкаФормы,
	|	ФормаВводаБюджета.ДатаНачалаПланирования КАК ДатаНачалаПланирования,
	|	ФормаВводаБюджета.Сценарий КАК Сценарий,
	|	ФормаВводаБюджета.ВалютаДокумента КАК ВалютаДокумента,
	|	ФормаВводаБюджета.КурсДокумента КАК КурсДокумента,
	|	ФормаВводаБюджета.ЕдиницаИзмеренияСумм КАК ЕдиницаИзмеренияСумм,
	|	ФормаВводаБюджета.Ответственный КАК Ответственный,
	|	ФормаВводаБюджета.Комментарий КАК Комментарий,
	|	ФормаВводаБюджета.ДанныеТЧВРегистре КАК ДанныеТЧВРегистре
	|ИЗ
	|	Документ.бит_ФормаВводаБюджета КАК ФормаВводаБюджета
	|ГДЕ
	|	ФормаВводаБюджета.Ссылка В(&МассивСсылок)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Функция получает таблицу значений по установленным визам.
//
// Параметры:
//  МассивСсылок  - Массив
//  
// Возвращаемое значение:
//   Таблица значений.
//
Функция ЗаписиУстановкиВиз(МассивСсылок)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.УстановитьПараметр("РежимПечатиНеВыводить", Перечисления.бит_РежимПечатиВиз.НеВыводить);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегВизы.Объект КАК Ссылка,
	|	РегВизы.Виза,
	|	РегВизы.ФизическоеЛицо КАК ФИО
	|ИЗ
	|	РегистрСведений.бит_УстановленныеВизы КАК РегВизы
	|ГДЕ
	|	РегВизы.Объект В(&МассивСсылок)
	|	И РегВизы.Виза.РежимПечати <> &РежимПечатиНеВыводить
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегВизы.КодСортировки";
	
	ТаблицаПоВизам = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаПоВизам;
	
КонецФункции

#КонецОбласти

Функция ВычислитьФормулу(СтрокаТаблицы, ТаблицаДанных)
	
	Рез = 0;
	СтрФормула = СтрокаТаблицы.Расшифровка.Формула;
	Если НЕ ПустаяСтрока(СтрФормула) Тогда
		// СтрЗаменить() значительно замедляется на большом числе аргументов.
		Если СтрокаТаблицы.Расшифровка.Аргументы.Количество() > 0 Тогда
			Аргументы = Новый Структура;
			Для каждого ИмяАрг Из СтрокаТаблицы.Расшифровка.Аргументы Цикл
				СтрОтбор = Новый Структура("Имя,ИмяАргумента",ИмяАрг,ИмяАрг);
				МассивСтрок = ТаблицаДанных.НайтиСтроки(СтрОтбор);
				СтрокаАргумента = МассивСтрок[0];
				Если СтрокаАргумента.Расшифровка.Вид = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБЗначение()  Тогда
					ЗнАрг = СтрокаАргумента.Значение;
				ИначеЕсли СтрокаАргумента.Расшифровка.Вид = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБФормула() Тогда
					СтрокаАргумента.ЗначениеВычисленияФормулы = СтрокаАргумента.Значение;
					СтрокаАргумента.ФормулаВычислена = Истина;
					СтрокаТаблицы.Значение = СтрокаАргумента.ЗначениеВычисленияФормулы;
					ЗнАрг = СтрокаАргумента.ЗначениеВычисленияФормулы;
				Иначе
					ЗнАрг = 0;
				КонецЕсли;
				Аргументы.Вставить(ИмяАрг, Формат(ЗнАрг,"ЧРД=.; ЧН=0; ЧГ=")); 
			КонецЦикла;
			
			// Поиск, замена и склейка формулы.
			Формула = Новый Массив();
			СтрФормула = СтрЗаменить(СтрФормула, "[", "[@");
			ЧастиФормулы = СтрРазделить(СтрФормула, "[", Ложь);
			Для каждого Часть Из ЧастиФормулы Цикл
				ПодстрокиФормулы = СтрРазделить(Часть, "]", Ложь);
				Для каждого ЧастьПодстроки Из ПодстрокиФормулы Цикл
					Если СтрНачинаетсяС(ЧастьПодстроки, "@") Тогда
						ЧастьПодстроки = Сред(ЧастьПодстроки, 2);
						ЗначениеАргумента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Аргументы, ЧастьПодстроки,"");
						Формула.Добавить(ЗначениеАргумента);
					Иначе	
						Формула.Добавить(ЧастьПодстроки);
					КонецЕсли;
				КонецЦикла; 
			КонецЦикла; 
			СтрФормула = СтрСоединить(Формула);
		КонецЕсли;
		
		Попытка
			Рез = ОбщегоНазначения.ВычислитьВБезопасномРежиме(СтрФормула);
		Исключение
			Рез = 0;	 
		КонецПопытки;
		СтрокаТаблицы.Значение = Рез;
	КонецЕсли; 
	
	Возврат Рез;
	
КонецФункции

Функция ТекстЗапросаВременнаяТаблицаДокумента(НомераТаблиц, Реквизиты)
	
	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента", НомераТаблиц.Количество());
	
	Если Реквизиты.ДанныеТЧВРегистре Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	""БДДС"" КАК ИмяСписка,
		|	&СинонимБДДС КАК СинонимСписка,
		|	1 КАК НомерТаблицы,
		|	Таблица.ДокументВладелец КАК Ссылка,
		|	Таблица.НомерСтрокиДокумента КАК НомерСтроки,
		|	&Сценарий КАК Сценарий,
		|	&Валюта КАК Валюта,
		|	Таблица.ЦФО КАК ЦФО,
		|	Таблица.Организация КАК Организация,
		|	Таблица.СтатьяОборотов КАК СтатьяОборотов,
		|	Таблица.Количество КАК Количество,
		|	Таблица.Норма КАК Норма,
		|	ВЫБОР
		|		КОГДА Таблица.СтатьяОборотов.ЭтоКоэффициент
		|			ТОГДА ЕСТЬNULL(Таблица.Сумма, 0)
		|		ИНАЧЕ ЕСТЬNULL(Таблица.Сумма, 0) * &КоэффициентСуммы
		|	КОНЕЦ КАК Сумма,
		|	0 КАК СуммаРегл,
		|	0 КАК СуммаУпр,
		|	0 КАК СуммаСценарий,
		|	Таблица.ПериодСтрокиДокумента КАК Период,
		|	Таблица.Комментарий КАК Комментарий,
		|	Таблица.СтатьяОборотов.СтавкаНДС КАК СтавкаНДС,
		|	Таблица.СтатьяОборотов.ЭтоКоэффициент КАК ЭтоКоэффициент,
		|	Таблица.Расчетная КАК Расчетная,
		|	Таблица.Аналитика_1 КАК Аналитика_1,
		|	Таблица.Аналитика_2 КАК Аналитика_2,
		|	Таблица.Аналитика_3 КАК Аналитика_3,
		|	Таблица.Аналитика_4 КАК Аналитика_4,
		|	Таблица.Аналитика_5 КАК Аналитика_5,
		|	Таблица.Аналитика_6 КАК Аналитика_6,
		|	Таблица.Аналитика_7 КАК Аналитика_7,
		// ++ ЕРП
		|	Таблица.Аналитика_8 КАК Аналитика_8,
		|	Таблица.Аналитика_9 КАК Аналитика_9,
		|	Таблица.Аналитика_10 КАК Аналитика_10,
		|	Таблица.Аналитика_11 КАК Аналитика_11,
		|	Таблица.Аналитика_12 КАК Аналитика_12,
		// -- ЕРП
		|	ЗНАЧЕНИЕ(Перечисление.бит_ТипыЗаписейОборотовПоБюджетам.ЗаписьБюджетногоДокумента) КАК ТипЗаписи,
		|	"""" КАК КомментарийРасчета
		|ПОМЕСТИТЬ ВременнаяТаблицаДокумента
		|ИЗ
		|	РегистрСведений.бит_ФормаВводаБюджетаБДДС КАК Таблица
		|ГДЕ
		|	Таблица.ДокументВладелец = &Ссылка
		|	И ВЫБОР
		|			КОГДА &Фиксированныймакет
		|				ТОГДА ВЫБОР
		|						КОГДА &РежимФормированияДвижений = ЗНАЧЕНИЕ(Перечисление.бит_РежимыФормированияДвиженийФормыВвода.Расчетные)
		|							ТОГДА Таблица.Расчетная
		|						КОГДА &РежимФормированияДвижений = ЗНАЧЕНИЕ(Перечисление.бит_РежимыФормированияДвиженийФормыВвода.ИсключаяРасчетные)
		|							ТОГДА НЕ Таблица.Расчетная
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ЗависимыеОбороты"",
		|	&СинонимЗависимыеОбороты,
		|	2,
		|	Таблица.ДокументВладелец,
		|	Таблица.НомерСтрокиДокумента,
		|	ВЫБОР
		|		КОГДА Таблица.Сценарий = НЕОПРЕДЕЛЕНО
		|				ИЛИ Таблица.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		|			ТОГДА &Сценарий
		|		ИНАЧЕ Таблица.Сценарий
		|	КОНЕЦ,
		|	&Валюта,
		|	Таблица.ЦФО,
		|	Таблица.Организация,
		|	Таблица.СтатьяОборотов,
		|	Таблица.Количество,
		|	0,
		|	Таблица.Сумма * &КоэффициентСуммы,
		|	0,
		|	0,
		|	0,
		|	Таблица.ПериодСтрокиДокумента,
		|	Таблица.Комментарий,
		|	Таблица.СтатьяОборотов.СтавкаНДС,
		|	Таблица.СтатьяОборотов.ЭтоКоэффициент,
		|	Таблица.Расчетная,
		|	Таблица.Аналитика_1,
		|	Таблица.Аналитика_2,
		|	Таблица.Аналитика_3,
		|	Таблица.Аналитика_4,
		|	Таблица.Аналитика_5,
		|	Таблица.Аналитика_6,
		|	Таблица.Аналитика_7,
		// ++ ЕРП
		|	Таблица.Аналитика_8 КАК Аналитика_8,
		|	Таблица.Аналитика_9 КАК Аналитика_9,
		|	Таблица.Аналитика_10 КАК Аналитика_10,
		|	Таблица.Аналитика_11 КАК Аналитика_11,
		|	Таблица.Аналитика_12 КАК Аналитика_12,
		// -- ЕРП
		|	ЗНАЧЕНИЕ(Перечисление.бит_ТипыЗаписейОборотовПоБюджетам.ЗависимыйОборот),
		|	Таблица.КомментарийРасчета
		|ИЗ
		|	РегистрСведений.бит_ФормаВводаБюджетаЗависимыеОбороты КАК Таблица
		|ГДЕ
		|	Таблица.ДокументВладелец = &Ссылка
		|	И ВЫБОР
		|			КОГДА &Фиксированныймакет
		|				ТОГДА ВЫБОР
		|						КОГДА &РежимФормированияДвижений = ЗНАЧЕНИЕ(Перечисление.бит_РежимыФормированияДвиженийФормыВвода.Расчетные)
		|							ТОГДА Таблица.Расчетная
		|						КОГДА &РежимФормированияДвижений = ЗНАЧЕНИЕ(Перечисление.бит_РежимыФормированияДвиженийФормыВвода.ИсключаяРасчетные)
		|							ТОГДА НЕ Таблица.Расчетная
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	""БДДС"" КАК ИмяСписка,
		|	&СинонимБДДС КАК СинонимСписка,
		|	1 КАК НомерТаблицы,
		|	Таблица.Ссылка КАК Ссылка,
		|	Таблица.НомерСтроки КАК НомерСтроки,
		|	&Сценарий КАК Сценарий,
		|	&Валюта КАК Валюта,
		|	Таблица.ЦФО КАК ЦФО,
		|	Таблица.Организация КАК Организация,
		|	Таблица.СтатьяОборотов КАК СтатьяОборотов,
		|	Таблица.Количество КАК Количество,
		|	Таблица.Норма КАК Норма,
		|	ВЫБОР
		|		КОГДА Таблица.СтатьяОборотов.ЭтоКоэффициент
		|			ТОГДА ЕСТЬNULL(Таблица.Сумма, 0)
		|		ИНАЧЕ ЕСТЬNULL(Таблица.Сумма, 0) * &КоэффициентСуммы
		|	КОНЕЦ КАК Сумма,
		|	0 КАК СуммаРегл,
		|	0 КАК СуммаУпр,
		|	0 КАК СуммаСценарий,
		|	Таблица.Период КАК Период,
		|	Таблица.Комментарий КАК Комментарий,
		|	Таблица.СтатьяОборотов.СтавкаНДС КАК СтавкаНДС,
		|	Таблица.СтатьяОборотов.ЭтоКоэффициент КАК ЭтоКоэффициент,
		|	Таблица.Расчетная КАК Расчетная,
		|	Таблица.Аналитика_1 КАК Аналитика_1,
		|	Таблица.Аналитика_2 КАК Аналитика_2,
		|	Таблица.Аналитика_3 КАК Аналитика_3,
		|	Таблица.Аналитика_4 КАК Аналитика_4,
		|	Таблица.Аналитика_5 КАК Аналитика_5,
		|	Таблица.Аналитика_6 КАК Аналитика_6,
		|	Таблица.Аналитика_7 КАК Аналитика_7,
		// ++ ЕРП
		|	Таблица.Аналитика_8 КАК Аналитика_8,
		|	Таблица.Аналитика_9 КАК Аналитика_9,
		|	Таблица.Аналитика_10 КАК Аналитика_10,
		|	Таблица.Аналитика_11 КАК Аналитика_11,
		|	Таблица.Аналитика_12 КАК Аналитика_12,
		// -- ЕРП
		|	ЗНАЧЕНИЕ(Перечисление.бит_ТипыЗаписейОборотовПоБюджетам.ЗаписьБюджетногоДокумента) КАК ТипЗаписи,
		|	"""" КАК КомментарийРасчета
		|ПОМЕСТИТЬ ВременнаяТаблицаДокумента
		|ИЗ
		|	Документ.бит_ФормаВводаБюджета.БДДС КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА &Фиксированныймакет
		|				ТОГДА ВЫБОР
		|						КОГДА &РежимФормированияДвижений = ЗНАЧЕНИЕ(Перечисление.бит_РежимыФормированияДвиженийФормыВвода.Расчетные)
		|							ТОГДА Таблица.Расчетная
		|						КОГДА &РежимФормированияДвижений = ЗНАЧЕНИЕ(Перечисление.бит_РежимыФормированияДвиженийФормыВвода.ИсключаяРасчетные)
		|							ТОГДА НЕ Таблица.Расчетная
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ЗависимыеОбороты"",
		|	&СинонимЗависимыеОбороты,
		|	2,
		|	Таблица.Ссылка,
		|	Таблица.НомерСтроки,
		|	ВЫБОР
		|		КОГДА Таблица.Сценарий = НЕОПРЕДЕЛЕНО
		|				ИЛИ Таблица.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		|			ТОГДА &Сценарий
		|		ИНАЧЕ Таблица.Сценарий
		|	КОНЕЦ,
		|	&Валюта,
		|	Таблица.ЦФО,
		|	Таблица.Организация,
		|	Таблица.СтатьяОборотов,
		|	Таблица.Количество,
		|	0,
		|	Таблица.Сумма * &КоэффициентСуммы,
		|	0,
		|	0,
		|	0,
		|	Таблица.Период,
		|	Таблица.Комментарий,
		|	Таблица.СтатьяОборотов.СтавкаНДС,
		|	Таблица.СтатьяОборотов.ЭтоКоэффициент,
		|	Таблица.Расчетная,
		|	Таблица.Аналитика_1,
		|	Таблица.Аналитика_2,
		|	Таблица.Аналитика_3,
		|	Таблица.Аналитика_4,
		|	Таблица.Аналитика_5,
		|	Таблица.Аналитика_6,
		|	Таблица.Аналитика_7,
		// ++ ЕРП
		|	Таблица.Аналитика_8 КАК Аналитика_8,
		|	Таблица.Аналитика_9 КАК Аналитика_9,
		|	Таблица.Аналитика_10 КАК Аналитика_10,
		|	Таблица.Аналитика_11 КАК Аналитика_11,
		|	Таблица.Аналитика_12 КАК Аналитика_12,
		// -- ЕРП
		|	ЗНАЧЕНИЕ(Перечисление.бит_ТипыЗаписейОборотовПоБюджетам.ЗависимыйОборот),
		|	Таблица.КомментарийРасчета
		|ИЗ
		|	Документ.бит_ФормаВводаБюджета.ЗависимыеОбороты КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА &Фиксированныймакет
		|				ТОГДА ВЫБОР
		|						КОГДА &РежимФормированияДвижений = ЗНАЧЕНИЕ(Перечисление.бит_РежимыФормированияДвиженийФормыВвода.Расчетные)
		|							ТОГДА Таблица.Расчетная
		|						КОГДА &РежимФормированияДвижений = ЗНАЧЕНИЕ(Перечисление.бит_РежимыФормированияДвиженийФормыВвода.ИсключаяРасчетные)
		|							ТОГДА НЕ Таблица.Расчетная
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();;
	
КонецФункции

Функция ТекстЗапросаТаблицыВалютногоПерерасчета(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВремТаблицаПериодов",НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПериодов",	НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Сценарии",			НомераТаблиц.Количество());

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДанныеБюджета.Период КАК Период,
	|	ТаблицаДанныеБюджета.Сценарий КАК Сценарий,
	|	ТаблицаДанныеБюджета.Сценарий.ИспользоватьКурсыСценария КАК ИспользоватьКурсыСценария,
	|	ТаблицаДанныеБюджета.Сценарий.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВремТаблицаПериодов
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ТаблицаДанныеБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТаблицаПериодов.Период КАК Период,
	|	ВремТаблицаПериодов.Сценарий КАК Сценарий,
	|	ВремТаблицаПериодов.ИспользоватьКурсыСценария КАК ИспользоватьКурсыСценария
	|ИЗ
	|	ВремТаблицаПериодов КАК ВремТаблицаПериодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремТаблицаПериодов.Сценарий КАК Сценарий,
	|	ВремТаблицаПериодов.Валюта КАК Валюта
	|ИЗ
	|	ВремТаблицаПериодов КАК ВремТаблицаПериодов";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаТаблицаОборотыПоБюджетам(НомераТаблиц, ПриниматьКУчету)
	
	Если НЕ ПриниматьКУчету Тогда
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("ТаблицаОборотыПоБюджетам", НомераТаблиц.Количество());

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДанные.ИмяСписка КАК ИмяСписка,
	|	ТаблицаДанные.СинонимСписка КАК СинонимСписка,
	|	ТаблицаДанные.Ссылка КАК Ссылка,
	|	ТаблицаДанные.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДанные.Сценарий КАК Сценарий,
	|	ТаблицаДанные.Валюта КАК Валюта,
	|	ТаблицаДанные.ЦФО КАК ЦФО,
	|	ТаблицаДанные.Организация КАК Организация,
	|	ТаблицаДанные.СтатьяОборотов КАК СтатьяОборотов,
	|	ТаблицаДанные.Количество КАК Количество,
	|	ТаблицаДанные.Норма КАК Норма,
	|	ТаблицаДанные.Сумма КАК Сумма,
	|	ТаблицаДанные.Период КАК Период,
	|	ТаблицаДанные.Комментарий КАК Комментарий,
	|	ТаблицаДанные.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДанные.ЭтоКоэффициент КАК ЭтоКоэффициент,
	|	ТаблицаДанные.Расчетная КАК Расчетная,
	|	ТаблицаДанные.СуммаРегл КАК СуммаРегл,
	|	ТаблицаДанные.СуммаУпр КАК СуммаУпр,
	|	ТаблицаДанные.СуммаСценарий КАК СуммаСценарий,
	|	ТаблицаДанные.Аналитика_1 КАК Аналитика_1,
	|	ТаблицаДанные.Аналитика_2 КАК Аналитика_2,
	|	ТаблицаДанные.Аналитика_3 КАК Аналитика_3,
	|	ТаблицаДанные.Аналитика_4 КАК Аналитика_4,
	|	ТаблицаДанные.Аналитика_5 КАК Аналитика_5,
	|	ТаблицаДанные.Аналитика_6 КАК Аналитика_6,
	|	ТаблицаДанные.Аналитика_7 КАК Аналитика_7,
	// ++ ЕРП
	|	ТаблицаДанные.Аналитика_8 КАК Аналитика_8,
	|	ТаблицаДанные.Аналитика_9 КАК Аналитика_9,
	|	ТаблицаДанные.Аналитика_10 КАК Аналитика_10,
	|	ТаблицаДанные.Аналитика_11 КАК Аналитика_11,
	|	ТаблицаДанные.Аналитика_12 КАК Аналитика_12,
	// -- ЕРП
	|	ЕСТЬNULL(АналитикаСценарийЦФО.КлючАналитики, ЗНАЧЕНИЕ(Справочник.бит_КлючиСценарийЦФО.ПустаяСсылка)) КАК КлючСценарийЦФО,
	|	ТаблицаДанные.ТипЗаписи КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.бит_ВидыОборотовОборотыПоБюджетам.Основной) КАК ВидОборота,
	|	ТаблицаДанные.КомментарийРасчета КАК КомментарийРасчета
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ТаблицаДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК АналитикаСценарийЦФО
	|		ПО ТаблицаДанные.ЦФО = АналитикаСценарийЦФО.ЦФО
	|			И ТаблицаДанные.Сценарий = АналитикаСценарийЦФО.Сценарий";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаКонтрольИсполненияБюджета(НомераТаблиц)
	
	НомераТаблиц.Вставить("ИсполнениеБюджетаРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ИсполнениеБюджета", НомераТаблиц.Количество());
    НомераТаблиц.Вставить("ВозвратЛимита", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.СверхБюджета КАК СверхБюджета,
	|	Реквизиты.КурсДокумента КАК Курс,
	|	Реквизиты.КратностьДокумента КАК Кратность,
	|	Реквизиты.Сценарий.Валюта КАК ВалютаСценария,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.Сценарий КАК СценарийКонтролируемый,
	|	ЗНАЧЕНИЕ(Перечисление.бит_РежимыКонтроляПоБюджету.Бюджет) КАК РежимКонтроля,
	|	ИСТИНА КАК КонтролироватьБюджет,
	|	&НеУчитыватьСверхБюджета КАК НеУчитыватьСверхБюджета,
	|	Реквизиты.СписатьЛимиты КАК СписатьЛимиты,
	|	ЛОЖЬ КАК КонтролироватьВозвратЛимита
	|ИЗ
	|	Документ.бит_ФормаВводаБюджета КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаДокумента.ИмяСписка КАК ИмяСписка,
	|	ВременнаяТаблицаДокумента.СинонимСписка КАК СинонимСписка,
	|	ВременнаяТаблицаДокумента.НомерТаблицы КАК НомерТаблицы,
	|	ВременнаяТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаДокумента.Период КАК Период,
	|	ВременнаяТаблицаДокумента.Сценарий КАК Сценарий,
	|	ВременнаяТаблицаДокумента.Валюта КАК Валюта,
	|	ВременнаяТаблицаДокумента.ЦФО КАК ЦФО,
	|	ВременнаяТаблицаДокумента.Организация КАК Организация,
	|	ВременнаяТаблицаДокумента.СтатьяОборотов КАК СтатьяОборотов,
	|	ВременнаяТаблицаДокумента.ЭтоКоэффициент КАК ЭтоКоэффициент,
	|	ВременнаяТаблицаДокумента.Количество КАК Количество,
	|	ВременнаяТаблицаДокумента.Сумма КАК Сумма,
	|	НЕ ВременнаяТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Сумма КАК КонтролироватьСумму,
	|	НЕ ВременнаяТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Количество КАК КонтролироватьКоличество,
	|	НЕ ВременнаяТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Бюджеты КАК КонтролироватьПоСтатье,
	|	ВременнаяТаблицаДокумента.Аналитика_1 КАК Аналитика_1,
	|	ВременнаяТаблицаДокумента.Аналитика_2 КАК Аналитика_2,
	|	ВременнаяТаблицаДокумента.Аналитика_3 КАК Аналитика_3,
	|	ВременнаяТаблицаДокумента.Аналитика_4 КАК Аналитика_4,
	|	ВременнаяТаблицаДокумента.Аналитика_5 КАК Аналитика_5,
	|	ВременнаяТаблицаДокумента.Аналитика_6 КАК Аналитика_6,
	|	ВременнаяТаблицаДокумента.Аналитика_7 КАК Аналитика_7,
	// ++ ЕРП
	|	ВременнаяТаблицаДокумента.Аналитика_8 КАК Аналитика_8,
	|	ВременнаяТаблицаДокумента.Аналитика_9 КАК Аналитика_9,
	|	ВременнаяТаблицаДокумента.Аналитика_10 КАК Аналитика_10,
	|	ВременнаяТаблицаДокумента.Аналитика_11 КАК Аналитика_11,
	|	ВременнаяТаблицаДокумента.Аналитика_12 КАК Аналитика_12
	// -- ЕРП
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ВременнаяТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкаКонтроляПоСценариям КАК НастройкаКонтроляПоСценариям
	|		ПО (НастройкаКонтроляПоСценариям.Сценарий = &Сценарий)
	|			И ВременнаяТаблицаДокумента.Период >= НастройкаКонтроляПоСценариям.Период
	|			И (ВременнаяТаблицаДокумента.Период <= НастройкаКонтроляПоСценариям.ДатаОкончания
	|				ИЛИ НастройкаКонтроляПоСценариям.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))   
	|ГДЕ
	|	ВременнаяТаблицаДокумента.Сумма > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТаблицы,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаДокумента.ИмяСписка КАК ИмяСписка,
	|	ВременнаяТаблицаДокумента.СинонимСписка КАК СинонимСписка,
	|	ВременнаяТаблицаДокумента.НомерТаблицы КАК НомерТаблицы,
	|	ВременнаяТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаДокумента.Период КАК Период,
	|	ВременнаяТаблицаДокумента.Сценарий КАК Сценарий,
	|	ВременнаяТаблицаДокумента.Валюта КАК Валюта,
	|	ВременнаяТаблицаДокумента.ЦФО КАК ЦФО,
	|	ВременнаяТаблицаДокумента.Организация КАК Организация,
	|	ВременнаяТаблицаДокумента.СтатьяОборотов КАК СтатьяОборотов,
	|	ВременнаяТаблицаДокумента.ЭтоКоэффициент КАК ЭтоКоэффициент,
	|	- ВременнаяТаблицаДокумента.Количество КАК Количество,
	|	- ВременнаяТаблицаДокумента.Сумма КАК Сумма,
	|	НЕ ВременнаяТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Сумма КАК КонтролироватьСумму,
	|	НЕ ВременнаяТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Количество КАК КонтролироватьКоличество,
	|	НЕ ВременнаяТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Бюджеты КАК КонтролироватьПоСтатье,
	|	ВременнаяТаблицаДокумента.Аналитика_1 КАК Аналитика_1,
	|	ВременнаяТаблицаДокумента.Аналитика_2 КАК Аналитика_2,
	|	ВременнаяТаблицаДокумента.Аналитика_3 КАК Аналитика_3,
	|	ВременнаяТаблицаДокумента.Аналитика_4 КАК Аналитика_4,
	|	ВременнаяТаблицаДокумента.Аналитика_5 КАК Аналитика_5,
	|	ВременнаяТаблицаДокумента.Аналитика_6 КАК Аналитика_6,
	|	ВременнаяТаблицаДокумента.Аналитика_7 КАК Аналитика_7,
	// ++ ЕРП
	|	ВременнаяТаблицаДокумента.Аналитика_8 КАК Аналитика_8,
	|	ВременнаяТаблицаДокумента.Аналитика_9 КАК Аналитика_9,
	|	ВременнаяТаблицаДокумента.Аналитика_10 КАК Аналитика_10,
	|	ВременнаяТаблицаДокумента.Аналитика_11 КАК Аналитика_11,
	|	ВременнаяТаблицаДокумента.Аналитика_12 КАК Аналитика_12
	// -- ЕРП
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ВременнаяТаблицаДокумента 
	|ГДЕ
	|	ВременнаяТаблицаДокумента.Сумма < 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТаблицы,
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Процедура ПодготовитьТаблицуИсполнениеБюджетаРасчетыВВалюте(ИсполнениеБюджета, ИсполнениеБюджетаРеквизиты)

	Если НЕ ЗначениеЗаполнено(ИсполнениеБюджета) ИЛИ НЕ ЗначениеЗаполнено(ИсполнениеБюджетаРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = ИсполнениеБюджетаРеквизиты[0];
	
	КурсВалютыДокумента = Новый Структура;
	КурсВалютыДокумента.Вставить("Валюта", 	  Реквизиты.Валюта);
	КурсВалютыДокумента.Вставить("Курс", 	  Реквизиты.Курс);
	КурсВалютыДокумента.Вставить("Кратность", Реквизиты.Кратность);
	
	КурсВалютыСценария = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Реквизиты.ВалютаСценария, Реквизиты.Дата);
	
	Для каждого СтрокаТаблицы Из ИсполнениеБюджета Цикл
		СтрокаТаблицы.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
								СтрокаТаблицы.Сумма, КурсВалютыДокумента, КурсВалютыСценария);
	КонецЦикла;																	

КонецПроцедуры

Процедура ПодготовитьТаблицыДокументаРасчетыВВалюте(ПараметрыПроведения, Реквизиты)

	Если ПараметрыПроведения.ТаблицаОборотыПоБюджетам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Сценарии		  = ПараметрыПроведения.Сценарии;
	ТаблицаПериодов	  = ПараметрыПроведения.ТаблицаПериодов;
	ОборотыПоБюджетам = ПараметрыПроведения.ТаблицаОборотыПоБюджетам;
	КурсыПоПериодам	  = Неопределено;
	
	Если ТаблицаПериодов.Количество() >= 1000 Тогда
		ТаблицаПериодов.Индексы.Добавить("Сценарий");
	КонецЕсли; 
	
	Если ОборотыПоБюджетам.Количество() >= 1000 Тогда
		ОборотыПоБюджетам.Индексы.Добавить("Сценарий");
	КонецЕсли;
	
	Если Реквизиты.ИспользоватьКурсыСценария Тогда
		Для каждого СтрокаТаблицы Из Сценарии Цикл
			
			Отбор	= Новый Структура("Сценарий", СтрокаТаблицы.Сценарий);
			Периоды = ТаблицаПериодов.Скопировать(Отбор);
			Валюты  =  бит_Бюджетирование.ЗаполнитьСтруктуруПараметровПолученияКурсовПоПериодам(СтрокаТаблицы.Сценарий, Реквизиты.ВалютаДокумента);
		
			КурсыПоПериодам = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(Периоды, Валюты, СтрокаТаблицы.Сценарий);
			
			НайденныСтроки = ОборотыПоБюджетам.НайтиСтроки(Отбор);
			бит_Бюджетирование.ВыполнитьПересчетыВТаблицеОборотов(НайденныСтроки, 
								КурсыПоПериодам, Реквизиты.КурсыВалют);

		КонецЦикла; 
	Иначе
		
		бит_Бюджетирование.ВыполнитьПересчетыВТаблицеОборотов(ОборотыПоБюджетам, 
								Неопределено, Реквизиты.КурсыВалют);
	КонецЕсли;
							
КонецПроцедуры

Функция НовыеПараметрыШапки()
	
	ПараметрыШапки = Новый Структура;
	ПараметрыШапки.Вставить("Периодичность");
	ПараметрыШапки.Вставить("ПродолжительностьИнтервала");
	ПараметрыШапки.Вставить("ДатаНачалаПланирования", '0001-01-01');
	ПараметрыШапки.Вставить("ДатаОкончанияПланирования", '0001-01-01');
	ПараметрыШапки.Вставить("ДанныеТЧВРегистре");
	ПараметрыШапки.Вставить("ДатаАктуализации", '0001-01-01'); // ++ NB Совместимость с Актуализацией. 
	
	Возврат ПараметрыШапки;
	
КонецФункции

Процедура ИнициализироватьКлючиАналитик(Реквизиты)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Реквизиты.Регистратор);
	Запрос.УстановитьПараметр("Сценарий", 	 Реквизиты.Сценарий);

	Если Реквизиты.ДанныеТЧВРегистре Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ФормаВводаБюджетаБДДС.ЦФО КАК ЦФО,
		|	&Сценарий КАК Сценарий
		|ПОМЕСТИТЬ ДанныеБюджета
		|ИЗ
		|	РегистрСведений.бит_ФормаВводаБюджетаБДДС КАК ФормаВводаБюджетаБДДС
		|ГДЕ
		|	ФормаВводаБюджетаБДДС.ДокументВладелец = &Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФормаВводаБюджетаЗависимыеОбороты.ЦФО,
		|	ВЫБОР
		|		КОГДА ФормаВводаБюджетаЗависимыеОбороты.Сценарий = НЕОПРЕДЕЛЕНО
		|				ИЛИ ФормаВводаБюджетаЗависимыеОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		|			ТОГДА &Сценарий
		|		ИНАЧЕ ФормаВводаБюджетаЗависимыеОбороты.Сценарий
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.бит_ФормаВводаБюджетаЗависимыеОбороты КАК ФормаВводаБюджетаЗависимыеОбороты
		|ГДЕ
		|	ФормаВводаБюджетаЗависимыеОбороты.ДокументВладелец = &Регистратор";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДанныеБюджета.ЦФО КАК ЦФО,
		|	&Сценарий КАК Сценарий
		|ПОМЕСТИТЬ ДанныеБюджета
		|ИЗ
		|	Документ.бит_ФормаВводаБюджета.БДДС КАК ДанныеБюджета
		|ГДЕ
		|	ДанныеБюджета.Ссылка = &Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗависимыеОбороты.ЦФО,
		|	ВЫБОР
		|		КОГДА ЗависимыеОбороты.Сценарий = НЕОПРЕДЕЛЕНО
		|				ИЛИ ЗависимыеОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		|			ТОГДА &Сценарий
		|		ИНАЧЕ ЗависимыеОбороты.Сценарий
		|	КОНЕЦ
		|ИЗ
		|	Документ.бит_ФормаВводаБюджета.ЗависимыеОбороты КАК ЗависимыеОбороты
		|ГДЕ
		|	ЗависимыеОбороты.Ссылка = &Регистратор";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеБюджета.Сценарий КАК Сценарий,
	|	ДанныеБюджета.ЦФО КАК ЦФО
	|ПОМЕСТИТЬ УникальныеДанныеБюджета
	|ИЗ
	|	ДанныеБюджета КАК ДанныеБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УникальныеДанныеБюджета.Сценарий КАК Сценарий,
	|	УникальныеДанныеБюджета.ЦФО КАК ЦФО,
	|	АналитикаСценарийЦФО.КлючАналитики КАК КлючАналитики
	|ИЗ
	|	УникальныеДанныеБюджета КАК УникальныеДанныеБюджета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК АналитикаСценарийЦФО
	|		ПО УникальныеДанныеБюджета.Сценарий = АналитикаСценарийЦФО.Сценарий
	|			И УникальныеДанныеБюджета.ЦФО = АналитикаСценарийЦФО.ЦФО
	|ГДЕ
	|	АналитикаСценарийЦФО.КлючАналитики ЕСТЬ NULL";
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Справочники.бит_КлючиСценарийЦФО.КлючиСценарийЦФОДокумента(Выборка);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти 

#КонецЕсли