
Процедура ПриОпределенииПоддерживаемыхКорреспондентомОбъектовФормата(УзелОбмена, ТаблицаОбъекты, Режим) Экспорт
	Если Режим = "Получение" Тогда
		Строка = ТаблицаОбъекты.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Новый Структура("Версия,Объект,Получение", "1.20", "РегистрСведений.УВМ_ИсторияСотрудников", Истина));
		// + СБит 2025-07-30 255683
		Строка = ТаблицаОбъекты.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Новый Структура("Версия,Объект,Получение", "1.20", "РегистрСведений.УВМ_Руководители", Истина));
		// - СБит 2025-07-30		
		Строка = ТаблицаОбъекты.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Новый Структура("Версия,Объект,Получение", "1.20", "Справочник.УВМ_ДолжностиУпр", Истина));
	КонецЕсли;	
	Если Режим = "Отправка" Тогда
		Строка = ТаблицаОбъекты.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Новый Структура("Версия,Объект,Отправка", "1.20", "РегистрСведений.УВМ_ИсторияСотрудников", Истина));
		// + СБит 2025-07-30 255683
		Строка = ТаблицаОбъекты.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Новый Структура("Версия,Объект,Отправка", "1.20", "РегистрСведений.УВМ_Руководители", Истина));
		// - СБит 2025-07-30		
		Строка = ТаблицаОбъекты.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Новый Структура("Версия,Объект,Отправка", "1.20", "Справочник.УВМ_ДолжностиУпр", Истина));
	КонецЕсли;	
КонецПроцедуры

&После("ПриПолученииНастроек")
Процедура УВМ_ПриПолученииНастроек(Настройки) 
	
	// + СБит 2024-01-25
	РасширенияФорматаОбмена = Новый Соответствие;
	//++dar 15.01.26 (304514)
	//РасширенияФорматаОбмена.Вставить("http://v8.1c.ru/edi/edi_stnd/ED_Ext_UVM/1.17", "1.17");
	РасширенияФорматаОбмена.Вставить("http://v8.1c.ru/edi/edi_stnd/ED_Ext_UVM/1.20", "1.20");
	//--dar 15.01.26 (304514)
	Настройки.РасширенияФорматаОбмена = РасширенияФорматаОбмена; 
	
	Настройки.Алгоритмы.Вставить("ПриОпределенииПоддерживаемыхКорреспондентомОбъектовФормата", Истина); 
	
КонецПроцедуры
