
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 Если НЕ ЗначениеЗаполнено(Параметры.ВалютаДокумента) Тогда
		ТекстСообщения = НСтр("ru = 'Непосредственное открытие этой формы не предусмотрено.';
									|en = 'You can''t open this form directly.'");
	    ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Оплатить = ТекущаяДатаСеанса();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "ВалютаПланирования, ВалютаДокумента, ВалютаПлатежа, СуммаДокумента, СуммаКОплате");
	
	Элементы.ВалютаПланирования.Видимость = (ВалютаПлатежа <> ВалютаДокумента);
	
	ОбработатьИзменениеВалютыПланирования(ЭтотОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ПрограммноеЗакрытие = Не Модифицированность;
	
	ТекстПредупреждения = НСтр("ru = 'Настройки были изменены. Закрыть без сохранения?';
								|en = 'Settings were changed. Close without saving?'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОтказеОтЗакрытияФормы", ЭтотОбъект); 
	
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияПроизвольнойФормы(ЭтотОбъект,
		Отказ, ЗавершениеРаботы, ТекстПредупреждения, "ПрограммноеЗакрытие", ОписаниеОповещения);
	
КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//	
&НаКлиенте
Процедура ПриОтказеОтЗакрытияФормы(Результат, ВходящийКонтекст) Экспорт
	
	Модифицированность = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КОплатеПриИзменении(Элемент)
	
	Если КОплате >= Запланировано Тогда
		ТекстСообщения = НСтр("ru = 'Сумма к оплате должна быть меньше запланированной суммы.';
							 |en = 'The amount to be paid must be less than the planned amount'");
		ПоказатьПредупреждение(,ТекстСообщения);
		КОплате = 0;
	КонецЕсли;
								
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьПриИзменении(Элемент)
	
	Если Оплатить < НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
		ТекстСообщения = НСтр("ru='Запрещено создавать платежные позиции на дату ранее текущей.';
							  |en='It is forbidden to create payment items on a date before the current.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		Оплатить = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПланированияПриИзменении(Элемент)
	
	ОбработатьИзменениеВалютыПланирования(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		Модифицированность = Ложь;
		
		ПараметрыПередачи = Новый Структура("ДатаПлатежа, КОплате, ВВалютеПлатежа", 
								Оплатить, КОплате, Булево(ВалютаПланирования));
		Закрыть(ПараметрыПередачи);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзменениеВалютыПланирования(Форма)

	Если Форма.ВалютаПланирования = 0 Тогда
		Форма.Запланировано = Форма.СуммаДокумента;
		Форма.Валюта 		= Форма.ВалютаДокумента;
	Иначе	
		Форма.Запланировано = Форма.СуммаКОплате;
		Форма.Валюта 		= Форма.ВалютаПлатежа;
	КонецЕсли;

	Форма.КОплате = 0;
	
КонецПроцедуры

#КонецОбласти