#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьПараметрыМоделейПриПереходеНаНовуюВерсию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Модели.Ссылка КАК Ссылка,
	|	Модели.АдресРесурсаФайлов КАК АдресРесурсаФайлов
	|ИЗ
	|	Справочник.бит_МоделиИИ КАК Модели";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Модель = Выборка.Ссылка.ПолучитьОбъект();
		Модель.ИспользоватьБезопасноеСоединение = Истина;
		МетодОбработкиВложений = Перечисления.бит_МетодыОбработкиВложений.APIМодели;
		Если ПустаяСтрока(Выборка.АдресРесурсаФайлов) Тогда
			МетодОбработкиВложений = Перечисления.бит_МетодыОбработкиВложений.СтрокаBase64;
		КонецЕсли;
		Модель.МетодОбработкиВложений = МетодОбработкиВложений;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Модель);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли