#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляУправленческихДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОбновления

Процедура СоздатьФормуЗачетаСтоБаллов(ПараметрыОбновления = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(НайтиПоНаименованию(НСтр("ru = '100-балльная шкала'"))) Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ФормыЗачетаМероприятийОбучения");
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ОценкиОбучения");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		НовыйЭлементФормаЗачета = СоздатьЭлемент();
		НовыйЭлементФормаЗачета.Наименование = НСтр("ru = '100-балльная шкала'");
		НовыйЭлементФормаЗачета.Записать();
		Для Оценка = 0 По 100 Цикл
			НовыйЭлементОценка = Справочники.ОценкиОбучения.СоздатьЭлемент();
			НовыйЭлементОценка.Владелец = НовыйЭлементФормаЗачета.Ссылка;
			НовыйЭлементОценка.Наименование = Строка(Оценка);
			НовыйЭлементОценка.Балл = Оценка;
			НовыйЭлементОценка.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли