
Процедура УВМ_СинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияДокумента(Источник, Отказ) Экспорт
	
	//++dar 03.05.23 (102491)                                                                              
	УстановитьПривилегированныйРежим(Истина);
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Сотрудники") Тогда
		Результат = КадровыйУчет.КадровыеДанныеСотрудника(Истина, Источник.Ссылка, "ДатаПриема", ТекущаяДатаСеанса());
		Если Результат <> Неопределено Тогда
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат, "ДатаПриема") И НЕ ЗначениеЗаполнено(Результат.ДатаПриема) Тогда
				Источник.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	//--dar 03.05.23 (102491)
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относится к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("СинхронизацияДанныхЧерезУниверсальныйФормат", Источник, Отказ);
	
КонецПроцедуры

Процедура УВМ_СинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияУдаления(Источник, Отказ) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относится к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("СинхронизацияДанныхЧерезУниверсальныйФормат", Источник, Отказ);
	
КонецПроцедуры

// Зарегистрировать изменение кадровой истории сотрудников.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.КадроваяИсторияСотрудников - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура УВМ_ЗарегистрироватьИзменениеКадровойИсторииДляРасчетовERP(Источник, Отказ, Замещение) Экспорт
	
	// + СБит 2023-11-09 138579 
	Если Источник.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//++dar 05.06.26 (331252)
	//ИсточникЗапись = Источник[0];
	УзелЕРП = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоНаименованию("ERP");
	УзелНахабино = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоНаименованию("Нахабино");
	
	Для Каждого ИсточникЗапись Из Источник Цикл	
	//--dar 05.06.26 (331252)
		НачальныеЗначения = РегистрыСведений.УВМ_ИсторияСотрудников.СрезПоследних(ИсточникЗапись.Период, 
			Новый Структура("ФизическоеЛицо,Пользователь,Организация",  // + СБит 2024-04-15
			ИсточникЗапись.ФизическоеЛицо,
			ИсточникЗапись.Сотрудник,
			ИсточникЗапись.Организация));
		СтруктураСравнения = Новый Структура("ФизическоеЛицо,Пользователь,Организация,Подразделение,Должность,ДолжностьУпр,ВидСобытия");
		ЗаполнитьЗначенияСвойств(СтруктураСравнения,НачальныеЗначения); 
	
		//ЗаписьШР = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Получить(Новый Структура("Позиция", ИсточникЗапись.ДолжностьПоШтатномуРасписанию));
		ЗаписьШР = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Получить(ИсточникЗапись.Период, Новый Структура("Позиция", ИсточникЗапись.ДолжностьПоШтатномуРасписанию));
	
		Если ИсточникЗапись.Сотрудник 		= СтруктураСравнения.Пользователь
			и ИсточникЗапись.ФизическоеЛицо = СтруктураСравнения.ФизическоеЛицо // + СБит 2024-04-15
			и ИсточникЗапись.Организация 	= СтруктураСравнения.Организация
			и ЗаписьШР.Подразделение 		= СтруктураСравнения.Подразделение
			и ИсточникЗапись.Должность 		= СтруктураСравнения.Должность
			и ЗаписьШР.УВМ_ДолжностьУпр 	= СтруктураСравнения.ДолжностьУпр
			и ИсточникЗапись.ВидСобытия 	= СтруктураСравнения.ВидСобытия
		Тогда
			//++dar 05.06.26 (331252)
			//Возврат
			Продолжить;
			//--dar 05.06.26 (331252)
		КонецЕсли;	

		НаборЗаписей = РегистрыСведений.УВМ_ИсторияСотрудников.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ИсточникЗапись.ФизическоеЛицо);   
		НаборЗаписей.Отбор.Организация.Установить(ИсточникЗапись.Организация);   
		НаборЗаписей.Отбор.Пользователь.Установить(ИсточникЗапись.Сотрудник); 
		НаборЗаписей.Отбор.Период.Установить(ИсточникЗапись.Период);   
		
		Запись = НаборЗаписей.Добавить();
		Запись.Активность   = Истина;
		Запись.Пользователь	= ИсточникЗапись.Сотрудник;
		Запись.ФизическоеЛицо	= ИсточникЗапись.ФизическоеЛицо; // + СБит 2024-04-15
		Запись.Организация  = ИсточникЗапись.Организация;
		Запись.Подразделение= ЗаписьШР.Подразделение;
		Запись.Должность    = ИсточникЗапись.Должность;
		Запись.ДолжностьУпр = ЗаписьШР.УВМ_ДолжностьУпр;
		Запись.ДолжностьПоШтатномуРасписанию = ИсточникЗапись.ДолжностьПоШтатномуРасписанию;
		Запись.ВидСобытия 	= ИсточникЗапись.ВидСобытия; 
		Запись.НавигационнаяСсылкаДокумента = ПолучитьНавигационнуюСсылкуИнформационнойБазы()+"/#"+ПолучитьНавигационнуюСсылку(ИсточникЗапись.Регистратор);
		Запись.Период       = ИсточникЗапись.Период;

		НаборЗаписей.Записать(); 
		
		// + СБит 2024-02-26
		Если Метаданные.ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.Состав.Содержит(НаборЗаписей.Метаданные()) Тогда
			НаборЗаписей = РегистрыСведений.УВМ_ИсторияСотрудников.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.Пользователь.Установить(ИсточникЗапись.Сотрудник); 
			НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ИсточникЗапись.ФизическоеЛицо);  // + СБит 2024-04-15
			НаборЗаписей.Отбор.Организация.Установить(ИсточникЗапись.Организация); 
			НаборЗаписей.Отбор.Период.Установить(ИсточникЗапись.Период); 
			ПланыОбмена.ЗарегистрироватьИзменения(УзелЕРП, НаборЗаписей);	
		КонецЕсли;	
		// - СБит 2024-02-26
	
		//++dar 05.06.26 (331252)
		Если Не ЗначениеЗаполнено(ЗаписьШР.Подразделение) Тогда
			Продолжить;
		КонецЕсли;		
		//--dar 05.06.26 (331252)
		
		//++dar 05.06.26 (331252)
		СтруктураПодразделения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаписьШР.Подразделение, "УВМ_ЦФО,Наименование");
		Если НЕ ЗначениеЗаполнено(СтруктураПодразделения.УВМ_ЦФО) Тогда
			Продолжить;
		КонецЕсли;
		НаименованиеЦФО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураПодразделения.УВМ_ЦФО, "Наименование");
		//--dar 05.06.26 (331252)

		//+++$$$20241210(215678)
		Если СтрНайти(СтруктураПодразделения.Наименование, "Нахабино") > 0 ИЛИ СтрНайти(НаименованиеЦФО, "Нахабино") > 0 Тогда
			Если Метаданные.ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.Состав.Содержит(НаборЗаписей.Метаданные()) Тогда
				НаборЗаписей = РегистрыСведений.УВМ_ИсторияСотрудников.СоздатьНаборЗаписей(); 
				НаборЗаписей.Отбор.Пользователь.Установить(ИсточникЗапись.Сотрудник); 
				НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ИсточникЗапись.ФизическоеЛицо);  
				НаборЗаписей.Отбор.Организация.Установить(ИсточникЗапись.Организация); 
				НаборЗаписей.Отбор.Период.Установить(ИсточникЗапись.Период); 
				ПланыОбмена.ЗарегистрироватьИзменения(УзелНахабино, НаборЗаписей);
			КонецЕсли;	
		КонецЕсли;	
		//+++$$$20241210(215678)
		
	//++dar 05.06.26 (331252)
	КонецЦикла;
	//--dar 05.06.26 (331252)
		
КонецПроцедуры

// + СБит 2024-09-25
Процедура УВМ_ЗарегистрироватьИзменениеКадровойИсторииДляУведомлений(Источник, Отказ, Замещение) Экспорт
	Если НЕ Отказ Тогда 
		Если ЗначениеЗаполнено(Константы.УВМ_ДатаНачалаРассылки.Получить()) И Источник.Дата >= Константы.УВМ_ДатаНачалаРассылки.Получить()
			И Метаданные.РегистрыСведений.УВМ_Уведомления.Измерения.КадровыйДокумент.Тип.СодержитТип(ТипЗнч(Источник.Ссылка)) Тогда
			
			// исключения
			ТипИсточника = ТипЗнч(Источник);
			
			// + СБит 2025-05-05 240701 
			// перенесено в регламентную процедуру
			//Если ТипИсточника = Тип("ДокументОбъект.Увольнение") ИЛИ ТипИсточника = Тип("ДокументОбъект.УвольнениеСписком") Тогда 
			//	Запрос = Новый Запрос;
			//	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
			//	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			//	|	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя,
			//	|	ИсполнителиЗадач.Исполнитель КАК Исполнитель
			//	|ИЗ
			//	|	Документ.Увольнение КАК КадровыйДокумент
			//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК СпрПользователи
			//	|		ПО КадровыйДокумент.ФизическоеЛицо = СпрПользователи.ФизическоеЛицо
			//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
			//	|		ПО (СпрПользователи.Ссылка = ИсполнителиЗадач.Исполнитель)
			//	|ГДЕ
			//	|	КадровыйДокумент.Ссылка = &Ссылка
			//	|	И НЕ ИсполнителиЗадач.Исполнитель ЕСТЬ NULL"; 
			//	Если ТипИсточника = Тип("ДокументОбъект.УвольнениеСписком") Тогда
			//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Увольнение КАК КадровыйДокумент", "Документ.УвольнениеСписком.Сотрудники КАК КадровыйДокумент");  
			//	КонецЕсли;
			//	Выборка = Запрос.Выполнить().Выбрать();
			//	
			//	ИсполнителиЗадач = РегистрыСведений.ИсполнителиЗадач.СоздатьНаборЗаписей();
			//	Пока Выборка.Следующий() Цикл
			//		ИсполнителиЗадач.Отбор.РольИсполнителя.Установить(Выборка.РольИсполнителя);
			//		ИсполнителиЗадач.Отбор.Исполнитель.Установить(Выборка.Исполнитель);
			//		ИсполнителиЗадач.Записать();
			//	КонецЦикла;	
			//КонецЕсли;
			// - СБит 2025-05-05
			
			Если ТипИсточника = Тип("ДокументОбъект.БольничныйЛист") Тогда 
				ПричинаНетрудоспособности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ПричинаНетрудоспособности");
				Если ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли;	
		
			Попытка
				ПараметрыДокументов = ЗаполнитьТекстУведомления(Источник.Ссылка);
			Исключение
				Возврат;
			КонецПопытки;	
			ТекстСообщения = ПараметрыДокументов.ТекстСообщения;

			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсполнителиЗадач.Исполнитель КАК Исполнитель,
			|	СтруктураПредприятия.Ссылка КАК Подразделение
			|ПОМЕСТИТЬ Подразделения	
			|ИЗ
			|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
			|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
			|	по СтруктураПредприятия.Ссылка = ИсполнителиЗадач.ДополнительныйОбъектАдресации
			|	или СтруктураПредприятия.Ссылка.Родитель = ИсполнителиЗадач.ДополнительныйОбъектАдресации 
			|	или СтруктураПредприятия.Ссылка.Родитель.Родитель = ИсполнителиЗадач.ДополнительныйОбъектАдресации 
			|	или СтруктураПредприятия.Ссылка.Родитель.Родитель.Родитель = ИсполнителиЗадач.ДополнительныйОбъектАдресации 
			|	или СтруктураПредприятия.Ссылка.Родитель.Родитель.Родитель.Родитель = ИсполнителиЗадач.ДополнительныйОбъектАдресации 
			|ГДЕ
			|	НЕ СтруктураПредприятия.Ссылка Есть NULL
			|;	
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УВМ_Уведомления.КадровыйДокумент КАК КадровыйДокумент
			|ИЗ
			|	РегистрСведений.УВМ_Уведомления КАК УВМ_Уведомления
			|ГДЕ
			|	УВМ_Уведомления.КадровыйДокумент = &Источник
			|	И УВМ_Уведомления.УведомлениеОтправлено
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсполнителиЗадач.Исполнитель КАК Исполнитель
			|ИЗ
			|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
			|ГДЕ
			|	ИсполнителиЗадач.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.ОтветственныйЗаИзменениеКадровыхДанных)
			|	И (ИсполнителиЗадач.ОсновнойОбъектАдресации = Неопределено ИЛИ ИсполнителиЗадач.ОсновнойОбъектАдресации = &Организация)
			|	И (ИсполнителиЗадач.ДополнительныйОбъектАдресации = Неопределено 
			|		ИЛИ (ИсполнителиЗадач.Исполнитель, &ПодразделениеСтруктуры) В (ВЫБРАТЬ Исполнитель, Подразделение ИЗ Подразделения)) 
			|"; 
			Запрос.УстановитьПараметр("Источник", Источник.Ссылка); 
			ОрганизацияДокумента = Источник.Организация;
			Если ТипИсточника = Тип("ДокументОбъект.ПеремещениеВДругоеПодразделение") Тогда 
				ОрганизацияДокумента = Источник.ОрганизацияНовая;
			КонецЕсли;
			Запрос.УстановитьПараметр("Организация", ОрганизацияДокумента); 
			Запрос.УстановитьПараметр("ПодразделениеСтруктуры", ПараметрыДокументов.ПодразделениеСтруктуры); 

			Попытка
				РезультатЗапроса = Запрос.ВыполнитьПакет();
			Исключение
				Возврат;
			КонецПопытки;	
				
			Отправленные = РезультатЗапроса[1].Выбрать();
			Если Отправленные.Следующий() Тогда
				Возврат;
			КонецЕсли;
			
			Получатели = РезультатЗапроса[2].Выгрузить().ВыгрузитьКолонку("Исполнитель");
			Если Получатели.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
				
			МенеджерЗаписи = РегистрыСведений.УВМ_Уведомления.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.КадровыйДокумент = Источник.Ссылка;
			МенеджерЗаписи.ДатаУведомить = ТекущаяДата();
			МенеджерЗаписи.ДатаИзменения = ТекущаяДата();
			МенеджерЗаписи.УведомлениеОтправлено = Ложь;
			МенеджерЗаписи.Записать(Истина);

			ЗаголовокСообщения = "Уведомление о кадровых изменениях"; 
			УспешныйУспех = ОтправитьУведомлениеПоEmail(Получатели, ЗаголовокСообщения, ТекстСообщения, , ТипТекстаПочтовогоСообщения.ПростойТекст); 
			Если УспешныйУспех Тогда
				МенеджерЗаписи = РегистрыСведений.УВМ_Уведомления.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.КадровыйДокумент = Источник.Ссылка;
				МенеджерЗаписи.Прочитать();
				МенеджерЗаписи.УведомлениеОтправлено = Истина;
				МенеджерЗаписи.Записать(Истина);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Функция ЗаполнитьТекстУведомления(Источник) Экспорт
	ТекстСообщения = "";
	ТипИсточника = ТипЗнч(Источник);
    Подразделение = Неопределено;
    ПодразделениеСтруктуры = Неопределено;
	
	Если ТипИсточника = Тип("ДокументСсылка.КадровыйПеревод") ИЛИ ТипИсточника = Тип("ДокументСсылка.КадровыйПереводСписком") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Источник); 
		Если ТипИсточника = Тип("ДокументСсылка.КадровыйПеревод") Тогда
			ДатаДо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "ДатаНачала");
		Иначе
			ДатаДо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "ДатаСобытия");
		КонецЕсли;	
		Если ЗначениеЗаполнено(ДатаДо) Тогда
			ДатаДо = ДатаДо - 1;
		Иначе	
			ДатаДо =ТекущаяДатаСеанса();
		КонецЕсли;
		Запрос.УстановитьПараметр("ДатаДо", ДатаДо);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйДокумент.Ссылка КАК Ссылка,
		|	КадровыйДокумент.Ссылка.Организация КАК Организация,
		|	КадровыйДокумент.ВидЗанятости КАК ВидЗанятости,
		|	КадровыйДокумент.Подразделение КАК Подразделение,
		|	ШтатноеРасписание.Подразделение КАК ПодразделениеСтруктуры, 
		|	ШтатноеРасписание.УВМ_ДолжностьУпр КАК УВМ_ДолжностьУпр, 
		|	КадровыйДокумент.Сотрудник КАК Сотрудник,
		|	КадровыйДокумент.ГрафикРаботы КАК ГрафикРаботы,
		|	КадровыйДокумент.КоличествоСтавок КАК КоличествоСтавок,
		|	КадровыйДокумент.РабочееМесто КАК РабочееМесто,
		|	РабочиеМестаОхраныТруда.Номер КАК РабочееМестоНомер,
		|	КадровыйДокумент.Должность КАК Должность,
		|	КадровыйДокумент.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ФизическиеЛица.ДатаРождения КАК ФизическоеЛицоДатаРождения,
		|	ФизическиеЛица.СтраховойНомерПФР КАК ФизическоеЛицоСтраховойНомерПФР,

		|	КадроваяИсторияСотрудников.Подразделение КАК ПодразделениеДо,
		|	ВЫБОР
		|		КОГДА КадровыйДокумент.Подразделение = КадроваяИсторияСотрудников.Подразделение
		|			ТОГДА Ложь
		|		ИНАЧЕ Истина
		|	КОНЕЦ КАК ИзмПодразделение, 
		|	КадроваяИсторияСотрудников.Должность КАК ДолжностьДо,
		|	ВЫБОР
		|		КОГДА КадровыйДокумент.Должность = КадроваяИсторияСотрудников.Должность
		|			ТОГДА Ложь
		|		ИНАЧЕ Истина
		|	КОНЕЦ КАК ИзмДолжность, 
		|	КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписаниюДо,
		|	ВЫБОР
		|		КОГДА КадровыйДокумент.ДолжностьПоШтатномуРасписанию = КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию
		|			ТОГДА Ложь
		|		ИНАЧЕ Истина
		|	КОНЕЦ КАК ИзмДолжностьШтат,
		
		|	КадровыйДокумент.ДатаНачала КАК ДатаПеревода
		|ИЗ
		|	Документ.КадровыйПеревод КАК КадровыйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО КадровыйДокумент.ФизическоеЛицо = ФизическиеЛица.Ссылка
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних(&ДатаДо, ) КАК ШтатноеРасписание 
		|		ПО КадровыйДокумент.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ПО КадровыйДокумент.РабочееМесто = РабочиеМестаОхраныТруда.Ссылка
		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ДатаДо, ) КАК КадроваяИсторияСотрудников
		|		ПО КадровыйДокумент.Сотрудник = КадроваяИсторияСотрудников.Сотрудник
		|			И КадровыйДокумент.Ссылка.Организация = КадроваяИсторияСотрудников.ГоловнаяОрганизация
		|			И КадровыйДокумент.ФизическоеЛицо = КадроваяИсторияСотрудников.ФизическоеЛицо
		
		|ГДЕ
		|	КадровыйДокумент.Ссылка = &Ссылка"; 
		Если ТипИсточника = Тип("ДокументСсылка.КадровыйПереводСписком") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.КадровыйПеревод КАК КадровыйДокумент", "Документ.КадровыйПереводСписком.Сотрудники КАК КадровыйДокумент");  
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + 
			СтрШаблон(НСтр("ru = 'Кадровый перевод сотрудника 
			|%1 
			|Дата перевода 	%2
			|Организация 	%3
			|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			Выборка.Ссылка,
			Формат(Выборка.ДатаПеревода, "ДФ=dd.MM.yyyy"),
			Выборка.Организация
			) +

			СтрШаблон(НСтр("ru = '
			|Подразделение 	%1
			|Кол-во ставок 	%2
			|Вид занятости 	%3
			|Должность 	%4
			|Рабочее место 	%5
			|График 	%6
			|ФИО 	%7
			|Дата рождения	%8
			|СНИЛС	%9
			|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			Выборка.Подразделение,
			Выборка.КоличествоСтавок,
			Выборка.ВидЗанятости,
			Выборка.Должность,
			Выборка.РабочееМестоНомер,
			Выборка.ГрафикРаботы,
			Выборка.ФизическоеЛицо,
			Формат(Выборка.ФизическоеЛицоДатаРождения, "ДФ=dd.MM.yyyy"),
			Выборка.ФизическоеЛицоСтраховойНомерПФР
			);
			
			Изменений = 0;
			Если Выборка.ИзмПодразделение = Истина Тогда
				ТекстСообщения = ТекстСообщения + СтрШаблон("Предыдущее подразделение: '%1'", Выборка.ПодразделениеДо) + Символы.ПС;	
				Изменений = Изменений + 1;
			КонецЕсли;
			Если Выборка.ИзмДолжность = Истина Тогда
				ТекстСообщения = ТекстСообщения + СтрШаблон("Предыдущая должность: '%1'", Выборка.ДолжностьДо) + Символы.ПС;	
				Изменений = Изменений + 1;
			КонецЕсли;
			Если Выборка.ИзмДолжностьШтат = Истина Тогда
				ТекстСообщения = ТекстСообщения + СтрШаблон("Предыдущая позиция штатного расписания: '%1'", Выборка.ДолжностьПоШтатномуРасписаниюДо) + Символы.ПС;	
				Изменений = Изменений + 1;
			КонецЕсли;
			Если Изменений = 0 Тогда
				ТекстСообщения = ТекстСообщения + "Подразделение, должность и позиция штатного расписания не изменились"  + Символы.ПС;
			КонецЕсли;	
			ТекстСообщения = ТекстСообщения + Символы.ПС;
			
			Подразделение = Выборка.Подразделение;
			ПодразделениеСтруктуры = Выборка.ПодразделениеСтруктуры;
		КонецЦикла;	

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.БольничныйЛист") Тогда 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Источник);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйДокумент.Ссылка КАК Ссылка,
		|	КадровыйДокумент.Организация КАК Организация,
		|	КадроваяИсторияСотрудников.Подразделение КАК Подразделение,
		|	ШтатноеРасписание.Подразделение КАК ПодразделениеСтруктуры, 
		|	ШтатноеРасписание.УВМ_ДолжностьУпр КАК УВМ_ДолжностьУпр, 
		|	КадровыйДокумент.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ФизическиеЛица.ДатаРождения КАК ФизическоеЛицоДатаРождения,
		|	ФизическиеЛица.СтраховойНомерПФР КАК ФизическоеЛицоСтраховойНомерПФР,
		|	РабочиеМестаСотрудников.РабочееМесто КАК РабочееМесто,
		|	РабочиеМестаОхраныТруда.Номер КАК РабочееМестоНомер,
		|	КадровыйДокумент.ДатаНачала КАК ДатаНачала,
		|	КадровыйДокумент.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.БольничныйЛист КАК КадровыйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО КадровыйДокумент.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудников
		|		ПО КадровыйДокумент.ФизическоеЛицо = КадроваяИсторияСотрудников.ФизическоеЛицо
		|		И КадровыйДокумент.Организация = КадроваяИсторияСотрудников.ГоловнаяОрганизация
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних КАК ШтатноеРасписание 
		|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РабочиеМестаСотрудников.СрезПоследних КАК РабочиеМестаСотрудников
		|		ПО КадровыйДокумент.ФизическоеЛицо = РабочиеМестаСотрудников.ФизическоеЛицо
		|		И КадровыйДокумент.Организация = РабочиеМестаСотрудников.ГоловнаяОрганизация
		|		И КадровыйДокумент.Сотрудник = РабочиеМестаСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ПО РабочиеМестаСотрудников.РабочееМесто = РабочиеМестаОхраныТруда.Ссылка
		|ГДЕ
		|	КадровыйДокумент.Ссылка = &Ссылка
		|	И КадроваяИсторияСотрудников.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)"; 
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + 
			СтрШаблон(НСтр("ru = 'Больничный лист сотрудника 
			|%1 
			|ДатаНачала 	%2
			|ДатаОкончания 	%3
			|Организация 	%4
			|Рабочее место 	%5
			|ФИО 	%6
			|Дата рождения	%7
			|СНИЛС	%8
			|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			Выборка.Ссылка,
			Формат(Выборка.ДатаНачала, "ДФ=dd.MM.yyyy"),
			Формат(Выборка.ДатаОкончания, "ДФ=dd.MM.yyyy"),
			Выборка.Организация,
			Выборка.РабочееМестоНомер,
			Выборка.ФизическоеЛицо,
			Формат(Выборка.ФизическоеЛицоДатаРождения, "ДФ=dd.MM.yyyy"),
			Выборка.ФизическоеЛицоСтраховойНомерПФР
			) + Символы.ПС;

			Подразделение = Выборка.Подразделение;
			ПодразделениеСтруктуры = Выборка.ПодразделениеСтруктуры;
		КонецЦикла;	
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ПриемНаРаботу") ИЛИ ТипИсточника = Тип("ДокументСсылка.ПриемНаРаботуСписком") Тогда 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Источник);
	
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадроваяИсторияСотрудников.ГоловнаяОрганизация,
		|	КадроваяИсторияСотрудников.ФизическоеЛицо,
		|	МАКСИМУМ(КадроваяИсторияСотрудников.Период) КАК Период
		|Поместить КадровыеДаты	
		|ИЗ
		|	Документ.ПриемНаРаботу КАК КадровыйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, ) КАК КадроваяИсторияСотрудников
		|		ПО КадровыйДокумент.Ссылка.Организация = КадроваяИсторияСотрудников.ГоловнаяОрганизация
		|			И КадровыйДокумент.ФизическоеЛицо = КадроваяИсторияСотрудников.ФизическоеЛицо
		|			И КадровыйДокумент.Сотрудник <> КадроваяИсторияСотрудников.Сотрудник
		|ГДЕ
		|	КадровыйДокумент.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	КадроваяИсторияСотрудников.ГоловнаяОрганизация,
		|	КадроваяИсторияСотрудников.ФизическоеЛицо
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйДокумент.Ссылка КАК Ссылка,
		|	КадровыйДокумент.Ссылка.Организация КАК Организация,
		|	КадровыйДокумент.ВидЗанятости КАК ВидЗанятости,
		|	КадровыйДокумент.Подразделение КАК Подразделение,
		|	ШтатноеРасписание.Подразделение КАК ПодразделениеСтруктуры, 
		|	ШтатноеРасписание.УВМ_ДолжностьУпр КАК УВМ_ДолжностьУпр, 
		|	КадровыйДокумент.Сотрудник КАК Сотрудник,
		|	КадровыйДокумент.ГрафикРаботы КАК ГрафикРаботы,
		|	КадровыйДокумент.КоличествоСтавок КАК КоличествоСтавок,
		|	КадровыйДокумент.РабочееМесто КАК РабочееМесто,
		|	РабочиеМестаОхраныТруда.Номер КАК РабочееМестоНомер,
		|	КадровыйДокумент.Должность КАК Должность,
		|	КадровыйДокумент.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ФизическиеЛица.ДатаРождения КАК ФизическоеЛицоДатаРождения,
		|	ФизическиеЛица.СтраховойНомерПФР КАК ФизическоеЛицоСтраховойНомерПФР,
		|	КадроваяИсторияСотрудников.Должность КАК ДолжностьДо,
		|	КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписаниюДо,
		|	КадровыйДокумент.ДатаПриема КАК ДатаПриема
		|ИЗ
		|	Документ.ПриемНаРаботу КАК КадровыйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО КадровыйДокумент.ФизическоеЛицо = ФизическиеЛица.Ссылка
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних(, ) КАК ШтатноеРасписание 
		|		ПО КадровыйДокумент.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ПО КадровыйДокумент.РабочееМесто = РабочиеМестаОхраныТруда.Ссылка

		|		ЛЕВОЕ СОЕДИНЕНИЕ КадровыеДаты КАК КадровыеДаты
		|		ПО КадровыйДокумент.Ссылка.Организация = КадровыеДаты.ГоловнаяОрганизация
		|			И КадровыйДокумент.ФизическоеЛицо = КадровыеДаты.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, ) КАК КадроваяИсторияСотрудников
		|		ПО КадровыеДаты.ГоловнаяОрганизация = КадроваяИсторияСотрудников.ГоловнаяОрганизация
		|			И КадровыеДаты.ФизическоеЛицо = КадроваяИсторияСотрудников.ФизическоеЛицо
		|			И КадровыйДокумент.Сотрудник <> КадроваяИсторияСотрудников.Сотрудник
		|			И КадровыеДаты.Период = КадроваяИсторияСотрудников.Период

		|ГДЕ
		|	КадровыйДокумент.Ссылка = &Ссылка"; 
		Если ТипИсточника = Тип("ДокументСсылка.ПриемНаРаботуСписком") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПриемНаРаботу КАК КадровыйДокумент", "Документ.ПриемНаРаботуСписком.Сотрудники КАК КадровыйДокумент");  
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + 
			СтрШаблон(НСтр("ru = 'Прием на работу сотрудника 
			|%1 
			|Дата приема 	%2
			|Организация 	%3
			|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			Выборка.Ссылка,
			Формат(Выборка.ДатаПриема, "ДФ=dd.MM.yyyy"),
			Выборка.Организация
			) +

			СтрШаблон(НСтр("ru = '
			|Подразделение 	%1
			|Кол-во ставок 	%2
			|Вид занятости 	%3
			|Должность 	%4 %5
			|Рабочее место	%6
			|График 	%7
			|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			Выборка.Подразделение,
			Выборка.КоличествоСтавок,
			Выборка.ВидЗанятости,
			Выборка.Должность,
			?(Выборка.ВидЗанятости <> Перечисления.ВидыЗанятости.ВнутреннееСовместительство, "", СтрШаблон("(должность по основному месту работы: %1)", Выборка.ДолжностьДо)),
			Выборка.РабочееМестоНомер,
			Выборка.ГрафикРаботы,
			) + 

			СтрШаблон(НСтр("ru = '
			|ФИО 	%1
			|Дата рождения	%2
			|СНИЛС	%3
			|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			Выборка.ФизическоеЛицо,
			Формат(Выборка.ФизическоеЛицоДатаРождения, "ДФ=dd.MM.yyyy"),
			Выборка.ФизическоеЛицоСтраховойНомерПФР
			) + Символы.ПС;

			Подразделение = Выборка.Подразделение;
			ПодразделениеСтруктуры = Выборка.ПодразделениеСтруктуры;
		КонецЦикла;	

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ВозвратИзОтпускаПоУходуЗаРебенком") Тогда 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Источник);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйДокумент.Ссылка КАК Ссылка,
		|	КадровыйДокумент.Организация КАК Организация,
		|	КадроваяИсторияСотрудников.Подразделение КАК Подразделение,
		|	РабочиеМестаСотрудников.РабочееМесто КАК РабочееМесто,
		|	РабочиеМестаОхраныТруда.Номер КАК РабочееМестоНомер,
		|	ШтатноеРасписание.Подразделение КАК ПодразделениеСтруктуры, 
		|	ШтатноеРасписание.УВМ_ДолжностьУпр КАК УВМ_ДолжностьУпр, 
		|	КадровыйДокумент.ДатаВозврата КАК ДатаВозврата,
		|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо,
		|	ФизическиеЛица.ДатаРождения КАК ФизическоеЛицоДатаРождения,
		|	ФизическиеЛица.СтраховойНомерПФР КАК ФизическоеЛицоСтраховойНомерПФР
		|ИЗ
		|	Документ.ВозвратИзОтпускаПоУходуЗаРебенком КАК КадровыйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО КадровыйДокумент.Сотрудник = ФизическиеЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудников
		|		ПО КадровыйДокумент.Сотрудник = КадроваяИсторияСотрудников.ФизическоеЛицо
		|		И КадровыйДокумент.Организация = КадроваяИсторияСотрудников.ГоловнаяОрганизация
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних() КАК ШтатноеРасписание 
		|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РабочиеМестаСотрудников.СрезПоследних КАК РабочиеМестаСотрудников
		|		ПО КадровыйДокумент.Сотрудник = РабочиеМестаСотрудников.ФизическоеЛицо
		|		И КадровыйДокумент.Организация = РабочиеМестаСотрудников.ГоловнаяОрганизация
		|		И КадроваяИсторияСотрудников.Сотрудник = РабочиеМестаСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ПО РабочиеМестаСотрудников.РабочееМесто = РабочиеМестаОхраныТруда.Ссылка
		|ГДЕ
		|	КадровыйДокумент.Ссылка = &Ссылка
		|	И КадроваяИсторияСотрудников.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)"; 
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + 
			СтрШаблон(НСтр("ru = 'Возврат из отпуска по уходу за ребенком 
			|%1 
			|ДатаВозврата 	%2
			|Организация 	%3
			|Рабочее место 	%4
			|ФИО 	%5
			|Дата рождения	%6
			|СНИЛС	%7
			|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			Выборка.Ссылка,
			Формат(Выборка.ДатаВозврата, "ДФ=dd.MM.yyyy"),
			Выборка.Организация,
			Выборка.РабочееМестоНомер,
			Выборка.ФизическоеЛицо,
			Формат(Выборка.ФизическоеЛицоДатаРождения, "ДФ=dd.MM.yyyy"),
			Выборка.ФизическоеЛицоСтраховойНомерПФР
			) + Символы.ПС;

			Подразделение = Выборка.Подразделение;
			ПодразделениеСтруктуры = Выборка.ПодразделениеСтруктуры;
		КонецЦикла;	

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ОтпускПоУходуЗаРебенком") Тогда 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Источник);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйДокумент.Ссылка КАК Ссылка,
		|	КадровыйДокумент.Организация КАК Организация,
		|	КадроваяИсторияСотрудников.Подразделение КАК Подразделение,
		|	РабочиеМестаСотрудников.РабочееМесто КАК РабочееМесто,
		|	РабочиеМестаОхраныТруда.Номер КАК РабочееМестоНомер,
		|	ШтатноеРасписание.Подразделение КАК ПодразделениеСтруктуры, 
		|	ШтатноеРасписание.УВМ_ДолжностьУпр КАК УВМ_ДолжностьУпр, 
		|	КадровыйДокумент.ДатаНачала КАК ДатаНачала,
		|	КадровыйДокумент.ДатаОкончания КАК ДатаОкончания,
		|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо,
		|	ФизическиеЛица.ДатаРождения КАК ФизическоеЛицоДатаРождения,
		|	ФизическиеЛица.СтраховойНомерПФР КАК ФизическоеЛицоСтраховойНомерПФР
		|ИЗ
		|	Документ.ОтпускПоУходуЗаРебенком КАК КадровыйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО КадровыйДокумент.Сотрудник = ФизическиеЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудников
		|		ПО КадровыйДокумент.Сотрудник = КадроваяИсторияСотрудников.ФизическоеЛицо
		|		И КадровыйДокумент.Организация = КадроваяИсторияСотрудников.ГоловнаяОрганизация
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних() КАК ШтатноеРасписание 
		|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РабочиеМестаСотрудников.СрезПоследних КАК РабочиеМестаСотрудников
		|		ПО КадровыйДокумент.Сотрудник = РабочиеМестаСотрудников.ФизическоеЛицо
		|		И КадровыйДокумент.Организация = РабочиеМестаСотрудников.ГоловнаяОрганизация
		|		И КадроваяИсторияСотрудников.Сотрудник = РабочиеМестаСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ПО РабочиеМестаСотрудников.РабочееМесто = РабочиеМестаОхраныТруда.Ссылка
		|ГДЕ
		|	КадровыйДокумент.Ссылка = &Ссылка
		|	И КадроваяИсторияСотрудников.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)"; 
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + 
			СтрШаблон(НСтр("ru = 'Отпуск по уходу за ребенком 
			|%1 
			|ДатаНачала 	%2
			|ДатаОкончания 	%3
			|Организация 	%4
			|Рабочее место 	%5
			|ФИО 	%6
			|Дата рождения	%7
			|СНИЛС	%8
			|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			Выборка.Ссылка,
			Формат(Выборка.ДатаНачала, "ДФ=dd.MM.yyyy"),
			Выборка.ДатаОкончания,
			Выборка.Организация,
			Выборка.РабочееМестоНомер,
			Выборка.ФизическоеЛицо,
			Формат(Выборка.ФизическоеЛицоДатаРождения, "ДФ=dd.MM.yyyy"),
			Выборка.ФизическоеЛицоСтраховойНомерПФР
			) + Символы.ПС;

			Подразделение = Выборка.Подразделение;
			ПодразделениеСтруктуры = Выборка.ПодразделениеСтруктуры;
		КонецЦикла;	

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ВозобновлениеТрудовыхДоговоровКонтрактов") Тогда 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Источник);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйДокумент.Ссылка КАК Ссылка,
		|	КадровыйДокументШапка.Организация КАК Организация,
		|	КадроваяИсторияСотрудников.Подразделение КАК Подразделение,
		|	РабочиеМестаСотрудников.РабочееМесто КАК РабочееМесто,
		|	РабочиеМестаОхраныТруда.Номер КАК РабочееМестоНомер,
		|	ШтатноеРасписание.Подразделение КАК ПодразделениеСтруктуры, 
		|	ШтатноеРасписание.УВМ_ДолжностьУпр КАК УВМ_ДолжностьУпр, 
		|	КадровыйДокумент.ДатаВозобновления КАК ДатаНачала,
		|	СпрФизическиеЛица.Ссылка КАК ФизическоеЛицо,
		|	СпрФизическиеЛица.ДатаРождения КАК ФизическоеЛицоДатаРождения,
		|	СпрФизическиеЛица.СтраховойНомерПФР КАК ФизическоеЛицоСтраховойНомерПФР
		|ИЗ
		|	Документ.ВозобновлениеТрудовыхДоговоровКонтрактов КАК КадровыйДокументШапка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозобновлениеТрудовыхДоговоровКонтрактов.Сотрудники КАК КадровыйДокумент
		|		ПО (КадровыйДокумент.Ссылка = КадровыйДокументШапка.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК СпрФизическиеЛица
		|		ПО (КадровыйДокумент.Сотрудник.ФизическоеЛицо = СпрФизическиеЛица.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудников
		|		ПО КадровыйДокумент.Сотрудник.ФизическоеЛицо = КадроваяИсторияСотрудников.ФизическоеЛицо
		|		И КадровыйДокументШапка.Организация = КадроваяИсторияСотрудников.ГоловнаяОрганизация
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних() КАК ШтатноеРасписание 
		|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РабочиеМестаСотрудников.СрезПоследних КАК РабочиеМестаСотрудников
		|		ПО СпрФизическиеЛица.Ссылка = РабочиеМестаСотрудников.ФизическоеЛицо
		|		И КадровыйДокументШапка.Организация = РабочиеМестаСотрудников.ГоловнаяОрганизация
		|		И КадровыйДокумент.Сотрудник = РабочиеМестаСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ПО РабочиеМестаСотрудников.РабочееМесто = РабочиеМестаОхраныТруда.Ссылка
		|ГДЕ
		|	КадровыйДокумент.Ссылка = &Ссылка
		|	И КадроваяИсторияСотрудников.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)"; 
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + 
			СтрШаблон(НСтр("ru = 'Возобновление трудового договора 
			|%1 
			|ДатаНачала 	%2
			|Организация 	%3
			|Рабочее место 	%4
			|ФИО 	%5
			|Дата рождения	%6
			|СНИЛС	%7
			|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			Выборка.Ссылка,
			Формат(Выборка.ДатаНачала, "ДФ=dd.MM.yyyy"),
			Выборка.Организация,
			Выборка.РабочееМестоНомер,
			Выборка.ФизическоеЛицо,
			Формат(Выборка.ФизическоеЛицоДатаРождения, "ДФ=dd.MM.yyyy"),
			Выборка.ФизическоеЛицоСтраховойНомерПФР
			) + Символы.ПС;

			Подразделение = Выборка.Подразделение;
			ПодразделениеСтруктуры = Выборка.ПодразделениеСтруктуры;
		КонецЦикла;	
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ПриостановлениеТрудовыхДоговоровКонтрактов") Тогда 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Источник);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйДокумент.Ссылка КАК Ссылка,
		|	КадровыйДокументШапка.Организация КАК Организация,
		|	КадроваяИсторияСотрудников.Подразделение КАК Подразделение,
		|	РабочиеМестаСотрудников.РабочееМесто КАК РабочееМесто,
		|	РабочиеМестаОхраныТруда.Номер КАК РабочееМестоНомер,
		|	ШтатноеРасписание.Подразделение КАК ПодразделениеСтруктуры, 
		|	ШтатноеРасписание.УВМ_ДолжностьУпр КАК УВМ_ДолжностьУпр, 
		|	КадровыйДокумент.ДатаНачала КАК ДатаНачала,
		|	КадровыйДокумент.ДатаОкончания КАК ДатаОкончания,
		|	СпрФизическиеЛица.Ссылка КАК ФизическоеЛицо,
		|	СпрФизическиеЛица.ДатаРождения КАК ФизическоеЛицоДатаРождения,
		|	СпрФизическиеЛица.СтраховойНомерПФР КАК ФизическоеЛицоСтраховойНомерПФР
		|ИЗ
		|	Документ.ПриостановлениеТрудовыхДоговоровКонтрактов КАК КадровыйДокументШапка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриостановлениеТрудовыхДоговоровКонтрактов.Сотрудники КАК КадровыйДокумент
		|		ПО (КадровыйДокумент.Ссылка = КадровыйДокументШапка.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК СпрФизическиеЛица
		|		ПО (КадровыйДокумент.Сотрудник.ФизическоеЛицо = СпрФизическиеЛица.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудников
		|		ПО КадровыйДокумент.Сотрудник.ФизическоеЛицо = КадроваяИсторияСотрудников.ФизическоеЛицо
		|		И КадровыйДокументШапка.Организация = КадроваяИсторияСотрудников.ГоловнаяОрганизация
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних() КАК ШтатноеРасписание 
		|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РабочиеМестаСотрудников.СрезПоследних КАК РабочиеМестаСотрудников
		|		ПО СпрФизическиеЛица.Ссылка = РабочиеМестаСотрудников.ФизическоеЛицо
		|		И КадровыйДокументШапка.Организация = РабочиеМестаСотрудников.ГоловнаяОрганизация
		|		И КадровыйДокумент.Сотрудник = РабочиеМестаСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ПО РабочиеМестаСотрудников.РабочееМесто = РабочиеМестаОхраныТруда.Ссылка
		|ГДЕ
		|	КадровыйДокумент.Ссылка = &Ссылка
		|	И КадроваяИсторияСотрудников.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)"; 
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + 
			СтрШаблон(НСтр("ru = 'Приостановление трудового договора 
			|%1 
			|ДатаНачала 	%2
			|ДатаОкончания 	%3
			|Организация 	%4
			|Рабочее место 	%5
			|ФИО 	%6
			|Дата рождения	%7
			|СНИЛС	%8
			|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			Выборка.Ссылка,
			Формат(Выборка.ДатаНачала, "ДФ=dd.MM.yyyy"),
			Формат(Выборка.ДатаОкончания, "ДФ=dd.MM.yyyy"),
			Выборка.Организация,
			Выборка.РабочееМестоНомер,
			Выборка.ФизическоеЛицо,
			Формат(Выборка.ФизическоеЛицоДатаРождения, "ДФ=dd.MM.yyyy"),
			Выборка.ФизическоеЛицоСтраховойНомерПФР
			) + Символы.ПС;

			Подразделение = Выборка.Подразделение;
			ПодразделениеСтруктуры = Выборка.ПодразделениеСтруктуры;
		КонецЦикла;	

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ПеремещениеВДругоеПодразделение") Тогда 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Источник);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйДокументШапка.Ссылка КАК Ссылка,
		|	КадровыйДокументШапка.Организация КАК Организация,
		|	КадровыйДокументШапка.ПодразделениеНовое КАК Подразделение,
		|	ШтатноеРасписание.Подразделение КАК ПодразделениеСтруктуры, 
		|	ШтатноеРасписание.УВМ_ДолжностьУпр КАК УВМ_ДолжностьУпр, 
		|	КадровыйДокумент.Сотрудник КАК Сотрудник,
		|	КадровыйДокумент.РабочееМесто КАК РабочееМесто,
		|	РабочиеМестаОхраныТруда.Номер КАК РабочееМестоНомер,
		|	КадровыйДокумент.Должность КАК Должность,
		|	СпрФизическиеЛица.Ссылка КАК ФизическоеЛицо,
		|	СпрФизическиеЛица.ДатаРождения КАК ФизическоеЛицоДатаРождения,
		|	СпрФизическиеЛица.СтраховойНомерПФР КАК ФизическоеЛицоСтраховойНомерПФР,
		|	КадровыйДокументШапка.ДатаПеремещения КАК ДатаПеремещения
		|ИЗ
		|	Документ.ПеремещениеВДругоеПодразделение КАК КадровыйДокументШапка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеВДругоеПодразделение.Сотрудники КАК КадровыйДокумент
		|		ПО (КадровыйДокумент.Ссылка = КадровыйДокументШапка.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК СпрФизическиеЛица
		|		ПО (КадровыйДокумент.Сотрудник.ФизическоеЛицо = СпрФизическиеЛица.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудников
		|		ПО КадровыйДокумент.Сотрудник.ФизическоеЛицо = КадроваяИсторияСотрудников.ФизическоеЛицо
		|		И КадровыйДокументШапка.Организация = КадроваяИсторияСотрудников.ГоловнаяОрганизация
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних() КАК ШтатноеРасписание 
		|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ПО КадровыйДокумент.РабочееМесто = РабочиеМестаОхраныТруда.Ссылка
		|ГДЕ
		|	КадровыйДокумент.Ссылка = &Ссылка
		|	И КадроваяИсторияСотрудников.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)"; 
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + 
			СтрШаблон(НСтр("ru = 'Перемещение сотрудника в другое подразделение 
			|%1 
			|Дата перемещения 	%2
			|Организация 	%3
			|Подразделение 	%4
			|Должность 	%5
			|Рабочее место 	%6
			|ФИО 	%7
			|Дата рождения	%8
			|СНИЛС	%9
			|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			Выборка.Ссылка,
			Формат(Выборка.ДатаПеремещения, "ДФ=dd.MM.yyyy"),
			Выборка.Организация,
			Выборка.Подразделение,
			Выборка.Должность,
			Выборка.РабочееМестоНомер,
			Выборка.ФизическоеЛицо,
			Формат(Выборка.ФизическоеЛицоДатаРождения, "ДФ=dd.MM.yyyy"),
			Выборка.ФизическоеЛицоСтраховойНомерПФР
			) + Символы.ПС;

			Подразделение = Выборка.Подразделение;
			ПодразделениеСтруктуры = Выборка.ПодразделениеСтруктуры;
		КонецЦикла;	

    	// + СБит 2025-11-25 #УВМ 293680 
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.Совмещение") Тогда 
		ПричинаСовмещения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "ПричинаСовмещения");
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Источник);
		Если ПричинаСовмещения = Перечисления.ПричиныСовмещения.ИсполнениеОбязанностей Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КадровыйДокумент.Ссылка КАК Ссылка,
			|	КадровыйДокумент.Организация КАК Организация,
			|	КадровыйДокумент.ПричинаСовмещения КАК ПричинаСовмещения,
			|	КадровыйДокумент.ОтсутствующийСотрудник КАК ОтсутствующийСотрудник,
			
			|	КадроваяИсторияОтсутствующихСотрудников.Должность КАК СовмещаемаяДолжность,
			|	КадроваяИсторияОтсутствующихСотрудников.Подразделение КАК СовмещаемоеПодразделение,
			|	СовмещаемоеШтатноеРасписание.Подразделение КАК СовмещаемоеПодразделениеСтруктуры, 
			|	СовмещаемаяПозицияШтатногоРасписания.УВМ_ДолжностьУпр КАК СовмещаемаяУВМ_ДолжностьУпр, 
			
			|	КадроваяИсторияСотрудников.Должность КАК ОсновнаяДолжность,
			|	КадроваяИсторияСотрудников.Подразделение КАК ОсновноеПодразделение,
			|	ШтатноеРасписание.Подразделение КАК ОсновноеПодразделениеСтруктуры, 
			|	ШтатноеРасписание.УВМ_ДолжностьУпр КАК ОсновнаяУВМ_ДолжностьУпр, 
			
			|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
			|	спрФизическиеЛица.ДатаРождения КАК ФизическоеЛицоДатаРождения,
			|	спрФизическиеЛица.СтраховойНомерПФР КАК ФизическоеЛицоСтраховойНомерПФР,
			|	КадровыйДокумент.УВМ_РабочееМесто КАК РабочееМесто,
			|	РабочиеМестаОхраныТруда.Номер КАК РабочееМестоНомер,
			|	КадровыйДокумент.ДатаНачала КАК ДатаНачала,
			|	КадровыйДокумент.ДатаОкончания КАК ДатаОкончания
			|ИЗ
			|	Документ.Совмещение КАК КадровыйДокумент
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
			|		ПО КадровыйДокумент.СовмещающийСотрудник = Сотрудники.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК спрФизическиеЛица
			|		ПО Сотрудники.ФизическоеЛицо = спрФизическиеЛица.Ссылка
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК ОтсутствующиеСотрудники
			|		ПО (КадровыйДокумент.ОтсутствующийСотрудник = ОтсутствующиеСотрудники.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияОтсутствующихСотрудников
			|		ПО (ОтсутствующиеСотрудники.ФизическоеЛицо = КадроваяИсторияОтсутствующихСотрудников.ФизическоеЛицо)
			|			И (КадровыйДокумент.Организация = КадроваяИсторияОтсутствующихСотрудников.ГоловнаяОрганизация)

			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК СовмещаемоеШтатноеРасписание
			|		ПО (КадроваяИсторияОтсутствующихСотрудников.ДолжностьПоШтатномуРасписанию  = СовмещаемоеШтатноеРасписание.Ссылка)
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК СовмещаемаяПозицияШтатногоРасписания
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних() КАК СовмещаемаяПозицияШтатногоРасписания
			|		ПО (КадроваяИсторияОтсутствующихСотрудников.ДолжностьПоШтатномуРасписанию  = СовмещаемаяПозицияШтатногоРасписания.Позиция)
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудников
			|		ПО Сотрудники.ФизическоеЛицо = КадроваяИсторияСотрудников.ФизическоеЛицо
			|		И КадровыйДокумент.Организация = КадроваяИсторияСотрудников.ГоловнаяОрганизация
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание 
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних КАК ШтатноеРасписание 
			|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
			|		ПО КадровыйДокумент.УВМ_РабочееМесто = РабочиеМестаОхраныТруда.Ссылка
			|ГДЕ
			|	КадровыйДокумент.Ссылка = &Ссылка
			|";

		Иначе //Если ПричинаСовмещения = Перечисления.ПричиныСовмещения.СовмещениеПрофессийДолжностей Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КадровыйДокумент.Ссылка КАК Ссылка,
			|	КадровыйДокумент.Организация КАК Организация,
			|	КадровыйДокумент.ПричинаСовмещения КАК ПричинаСовмещения,
			
			|	СовмещаемоеШтатноеРасписание.Должность КАК СовмещаемаяДолжность,
			|	СовмещаемаяПозицияШтатногоРасписания.Подразделение КАК СовмещаемоеПодразделение,
			|	СовмещаемоеШтатноеРасписание.Подразделение КАК СовмещаемоеПодразделениеСтруктуры, 
			|	СовмещаемаяПозицияШтатногоРасписания.УВМ_ДолжностьУпр КАК СовмещаемаяУВМ_ДолжностьУпр, 
			
			|	КадроваяИсторияСотрудников.Должность КАК ОсновнаяДолжность,
			|	КадроваяИсторияСотрудников.Подразделение КАК ОсновноеПодразделение,
			|	ШтатноеРасписание.Подразделение КАК ОсновноеПодразделениеСтруктуры, 
			|	ШтатноеРасписание.УВМ_ДолжностьУпр КАК ОсновнаяУВМ_ДолжностьУпр, 
			
			|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
			|	спрФизическиеЛица.ДатаРождения КАК ФизическоеЛицоДатаРождения,
			|	спрФизическиеЛица.СтраховойНомерПФР КАК ФизическоеЛицоСтраховойНомерПФР,
			|	КадровыйДокумент.УВМ_РабочееМесто КАК РабочееМесто,
			|	РабочиеМестаОхраныТруда.Номер КАК РабочееМестоНомер,
			|	КадровыйДокумент.ДатаНачала КАК ДатаНачала,
			|	КадровыйДокумент.ДатаОкончания КАК ДатаОкончания
			|ИЗ
			|	Документ.Совмещение КАК КадровыйДокумент
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
			|		ПО КадровыйДокумент.СовмещающийСотрудник = Сотрудники.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК спрФизическиеЛица
			|		ПО Сотрудники.ФизическоеЛицо = спрФизическиеЛица.Ссылка
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК СовмещаемоеШтатноеРасписание
			|		ПО (КадровыйДокумент.СовмещаемаяДолжность  = СовмещаемоеШтатноеРасписание.Ссылка)
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК СовмещаемаяПозицияШтатногоРасписания
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних() КАК СовмещаемаяПозицияШтатногоРасписания
			|		ПО (КадровыйДокумент.СовмещаемаяДолжность  = СовмещаемаяПозицияШтатногоРасписания.Позиция)
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудников
			|		ПО Сотрудники.ФизическоеЛицо = КадроваяИсторияСотрудников.ФизическоеЛицо
			|		И КадровыйДокумент.Организация = КадроваяИсторияСотрудников.ГоловнаяОрганизация
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание 
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних() КАК ШтатноеРасписание 
			|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
			|		ПО КадровыйДокумент.УВМ_РабочееМесто = РабочиеМестаОхраныТруда.Ссылка
			|ГДЕ
			|	КадровыйДокумент.Ссылка = &Ссылка
			|";
		КонецЕсли;	
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + 
			СтрШаблон(НСтр("ru = 'Совмещение должностей сотрудника 
			|%1 
			|ДатаНачала 	%2
			|ДатаОкончания 	%3
			|Организация 	%4
			|ФИО 	%5
			|Дата рождения	%6
			|СНИЛС	%7
			|Рабочее место 	%8
			|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			Выборка.Ссылка,
			Формат(Выборка.ДатаНачала, "ДФ=dd.MM.yyyy"),
			Формат(Выборка.ДатаОкончания, "ДФ=dd.MM.yyyy"),
			Выборка.Организация,
			Выборка.ФизическоеЛицо,
			Формат(Выборка.ФизическоеЛицоДатаРождения, "ДФ=dd.MM.yyyy"),
			Выборка.ФизическоеЛицоСтраховойНомерПФР,
			Выборка.РабочееМестоНомер
			);
			Если ПричинаСовмещения = Перечисления.ПричиныСовмещения.ИсполнениеОбязанностей Тогда
	 			ТекстСообщения = ТекстСообщения + 
				СтрШаблон(НСтр("ru = '
				|Причина совмещения	%1
				|Отсутствующий сотрудник %2
				|Основная должность	%3
				|Подразделение по основной должности %4
				|Совмещаемая должность %5
				|Подразделение по совмещаемой должности	%6
				|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
				Выборка.ПричинаСовмещения,
				Выборка.ОтсутствующийСотрудник,
				Выборка.ОсновнаяДолжность,
				Выборка.ОсновноеПодразделение,
				Выборка.СовмещаемаяДолжность,
				Выборка.СовмещаемоеПодразделение
				) + Символы.ПС;
			Иначе
	 			ТекстСообщения = ТекстСообщения + 
				СтрШаблон(НСтр("ru = '
				|Причина совмещения	%1
				|Основная должность	%2
				|Подразделение по основной должности %3
				|Совмещаемая должность %4
				|Подразделение по совмещаемой должности	%5
				|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
				Выборка.ПричинаСовмещения,
				Выборка.ОсновнаяДолжность,
				Выборка.ОсновноеПодразделение,
				Выборка.СовмещаемаяДолжность,
				Выборка.СовмещаемоеПодразделение
				) + Символы.ПС;
			КонецЕсли;	

			Подразделение = Выборка.ОсновноеПодразделение;
			ПодразделениеСтруктуры = Выборка.ОсновноеПодразделениеСтруктуры;
		КонецЦикла;	
		// - СБит 2025-11-25 #УВМ 
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.Увольнение") ИЛИ ТипИсточника = Тип("ДокументСсылка.УвольнениеСписком") Тогда 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Источник);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйДокумент.Ссылка КАК Ссылка,
		|	КадровыйДокумент.Ссылка.Организация КАК Организация,
		|	КадроваяИсторияСотрудников.Подразделение КАК Подразделение,
		|	РабочиеМестаСотрудников.РабочееМесто КАК РабочееМесто,
		|	РабочиеМестаОхраныТруда.Номер КАК РабочееМестоНомер,
		|	ШтатноеРасписание.Подразделение КАК ПодразделениеСтруктуры, 
		|	ШтатноеРасписание.УВМ_ДолжностьУпр КАК УВМ_ДолжностьУпр, 
		|	КадровыйДокумент.Сотрудник КАК Сотрудник,
		|   КадроваяИсторияСотрудников.Подразделение,
		|   КадроваяИсторияСотрудников.Должность,
		|   КадроваяИсторияСотрудников.КоличествоСтавок,
		|	КадровыйДокумент.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СпрФизическиеЛица.ДатаРождения КАК ФизическоеЛицоДатаРождения,
		|	СпрФизическиеЛица.СтраховойНомерПФР КАК ФизическоеЛицоСтраховойНомерПФР,
		|	КадровыйДокумент.ДатаУвольнения КАК ДатаУвольнения
		|ИЗ
		|	Документ.Увольнение КАК КадровыйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК СпрФизическиеЛица
		|		ПО (КадровыйДокумент.ФизическоеЛицо = СпрФизическиеЛица.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудников
		|		ПО КадровыйДокумент.ФизическоеЛицо = КадроваяИсторияСотрудников.ФизическоеЛицо
		|		И КадровыйДокумент.Ссылка.Организация = КадроваяИсторияСотрудников.ГоловнаяОрганизация
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних() КАК ШтатноеРасписание 
		|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РабочиеМестаСотрудников.СрезПоследних КАК РабочиеМестаСотрудников
		|		ПО КадровыйДокумент.ФизическоеЛицо = РабочиеМестаСотрудников.ФизическоеЛицо
		|		И КадровыйДокумент.Организация = РабочиеМестаСотрудников.ГоловнаяОрганизация
		|		И КадровыйДокумент.Сотрудник = РабочиеМестаСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ПО РабочиеМестаСотрудников.РабочееМесто = РабочиеМестаОхраныТруда.Ссылка
		|ГДЕ
		|	КадровыйДокумент.Ссылка = &Ссылка
		|"; 
		Если ТипИсточника = Тип("ДокументСсылка.УвольнениеСписком") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Увольнение КАК КадровыйДокумент", "Документ.УвольнениеСписком.Сотрудники КАК КадровыйДокумент");  
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + 
			СтрШаблон(НСтр("ru = 'Увольнение сотрудника 
			|%1 
			|Дата увольнения %2
			|Организация %3
			|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			Выборка.Ссылка,
			Формат(Выборка.ДатаУвольнения, "ДФ=dd.MM.yyyy"),
			Выборка.Организация)
			+ СтрШаблон(НСтр("ru = '
			|Подразделение 	%1
			|Рабочее место 	%2
			|Кол-во ставок 	%3
			|Должность 	%4
			|ФИО %5
			|Дата рождения	%6
			|СНИЛС	%7
			|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			Выборка.Подразделение,
			Выборка.РабочееМестоНомер,
			Выборка.КоличествоСтавок,
			Выборка.Должность,
			Выборка.ФизическоеЛицо,
			Формат(Выборка.ФизическоеЛицоДатаРождения, "ДФ=dd.MM.yyyy"),
			Выборка.ФизическоеЛицоСтраховойНомерПФР
			) + Символы.ПС;

			Подразделение = Выборка.Подразделение;
			ПодразделениеСтруктуры = Выборка.ПодразделениеСтруктуры;
		КонецЦикла;	

	КонецЕсли;
	
	Возврат Новый Структура("ТекстСообщения, Подразделение, ПодразделениеСтруктуры", ТекстСообщения, Подразделение, ПодразделениеСтруктуры);
КонецФункции

Функция ОтправитьУведомлениеПоEmail(Получатели, Тема, Тело, АдресОтвета="", ТипТекста) Экспорт
  	УстановитьПривилегированныйРежим(Истина);	
	
	Если БлокировкаРаботыСВнешнимиРесурсами.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура;
	
	Кому ="";
	Если ТипЗнч(Получатели)=Тип("Массив") ИЛИ ТипЗнч(Получатели)=Тип("ТаблицаЗначений") Тогда
		Если ТипЗнч(Получатели)=Тип("Массив") Тогда
			мПолучатели = Получатели;
		Иначе
			мПолучатели = Получатели.ВыгрузитьКолонку("Получатель");
		КонецЕсли;
	Иначе 
		мПолучатели = Новый Массив;
		мПолучатели.Добавить(Получатели);
	КонецЕсли;	

	Для Каждого Строка Из мПолучатели Цикл
		Адрес = ПолучитьАдресИзКонтактов(Строка);
		Если ЗначениеЗаполнено(Адрес) Тогда 
			Кому =Кому+?(Кому="","",";")+Адрес;
		КонецЕсли;
	КонецЦикла; 

	Если ЗначениеЗаполнено(Кому) Тогда
		ПараметрыПисьма.Вставить("Кому", Кому);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыПисьма.Вставить("АдресОтвета", АдресОтвета);
	ПараметрыПисьма.Вставить("Тема", Тема);
	ПараметрыПисьма.Вставить("Тело", Тело);
	ПараметрыПисьма.Вставить("ТипТекста",  ТипТекста);
	Попытка
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(), ПараметрыПисьма);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьАдресИзКонтактов(Получатель) 
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	Контакты.Представление КАК АдресЭлектроннойПочты
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК Контакты
	|ГДЕ
	|	Контакты.Ссылка = &Получатель
	|	И Контакты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)");
	Запрос.УстановитьПараметр("Получатель", Получатель);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.АдресЭлектроннойПочты;
	КонецЕсли;
	Возврат ""; 
	
КонецФункции

// + СБит 2024-03-12
Процедура ОбновитьИсториюСотрудниковПоШтатке(Позиции) Экспорт

	Если ТипЗнч(Позиции) = Тип("Массив") Тогда
		СписокПозиций = Позиции;
	ИначеЕсли ТипЗнч(Позиции) = Тип("СписокЗначений") Тогда
		СписокПозиций = Позиции;
	Иначе
		СписокПозиций = Новый Массив;
		СписокПозиций.Добавить(Позиции);
	КонецЕсли;	
		
	Узел = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоНаименованию("ERP");

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КадроваяИсторияСотрудников.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ втСотрудники
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
	|ГДЕ
	|	КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию В (&СписокПозиций)
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КадроваяИсторияСотрудников.Период КАК Период,
	|	КадроваяИсторияСотрудников.Сотрудник КАК Пользователь, 
	// + СБит 2024-04-15
	|	КадроваяИсторияСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КадроваяИсторияСотрудников.ГоловнаяОрганизация КАК Организация,
	|	ШтатноеРасписание.Подразделение КАК Подразделение,
	|	КадроваяИсторияСотрудников.Должность КАК Должность,
	|	ШтатноеРасписание.УВМ_ДолжностьУпр КАК ДолжностьУпр,
	|	КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
	|	КадроваяИсторияСотрудников.ВидСобытия КАК ВидСобытия
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних() КАК ШтатноеРасписание
	|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
	|
	|ГДЕ
	|	КадроваяИсторияСотрудников.Сотрудник В (ВЫБРАТЬ втСотрудники.Сотрудник ИЗ втСотрудники КАК втСотрудники)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователь,
	|	Организация,
	|	Период");
	Запрос.УстановитьПараметр("СписокПозиций", СписокПозиций);
	СтруктураСравнения = Новый Структура("Пользователь, ФизическоеЛицо, Организация, Подразделение, Должность, ДолжностьУпр, ВидСобытия");

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Пользователь = СтруктураСравнения.Пользователь 
			И Выборка.ФизическоеЛицо = СтруктураСравнения.ФизическоеЛицо // + СБит 2024-04-15
			И Выборка.Организация = СтруктураСравнения.Организация 
			И Выборка.Подразделение = СтруктураСравнения.Подразделение 
			И Выборка.Должность = СтруктураСравнения.Должность 
			И Выборка.ДолжностьУпр = СтруктураСравнения.ДолжностьУпр 
			И Выборка.ВидСобытия = СтруктураСравнения.ВидСобытия
		Тогда
			Продолжить;
		КонецЕсли;
			
		НаборЗаписей = РегистрыСведений.УВМ_ИсторияСотрудников.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период); 
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);  // + СБит 2024-04-15
		НаборЗаписей.Отбор.Пользователь.Установить(Выборка.Пользователь); 
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация); 
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		НаборЗаписей.Записать(Истина); 
		
		ЗаполнитьЗначенияСвойств(СтруктураСравнения, Запись);

		НаборЗаписей = РегистрыСведений.УВМ_ИсторияСотрудников.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период); 
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);  // + СБит 2024-04-15
		НаборЗаписей.Отбор.Пользователь.Установить(Выборка.Пользователь); 
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация); 
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, НаборЗаписей);
	КонецЦикла;	

КонецПроцедуры

// + СБит 2025-08-04 255683 
// Зарегистрировать изменение структуры подчиненности сотрудников.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.УВМ_Руководители - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура УВМ_ЗарегистрироватьИзменениеСтруктурыПодчиненностиСотрудников(Источник, Отказ, Замещение) Экспорт 
	Если Источник.Количество() =0 Тогда
		Возврат;
	КонецЕсли;
	//ИсточникЗапись = Источник[0];
	
	Для Каждого ИсточникЗапись Из Источник Цикл
		НаборЗаписей = РегистрыСведений.УВМ_Руководители.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Физлицо.Установить(ИсточникЗапись.Физлицо);   
		НаборЗаписей.Отбор.Период.Установить(ИсточникЗапись.Период);   
		НаборЗаписей.Прочитать();
		
		Узел = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоНаименованию("ERP");
		Если Метаданные.ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.Состав.Содержит(НаборЗаписей.Метаданные()) Тогда
			НаборЗаписей = РегистрыСведений.УВМ_Руководители.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.Физлицо.Установить(ИсточникЗапись.Физлицо);  
			НаборЗаписей.Отбор.Период.Установить(ИсточникЗапись.Период); 
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, НаборЗаписей);	
		КонецЕсли;	
	КонецЦикла;	
	// - СБит 2024-02-26
	
КонецПроцедуры


&После("ПриПолученииДоступныхРасширенийФормата")
Процедура УВМ_ПриПолученииДоступныхРасширенийФормата(РасширенияФормата)
	//++dar 15.01.26 (304514)
	//РасширенияФормата.Вставить("http://v8.1c.ru/edi/edi_stnd/ED_Ext_UVM/1.17", "1.17"); 
	РасширенияФормата.Вставить("http://v8.1c.ru/edi/edi_stnd/ED_Ext_UVM/1.20", "1.20");	
	//--dar 15.01.26 (304514)
КонецПроцедуры
