#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("1.1.1.1");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия = "2023.12.28"; 
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Заявления о переносе или согласии с отпуском'");
	Команда.Идентификатор = "Заявления о переносе или согласии с отпуском";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Ложь;
	Возврат ПараметрыРегистрации; 
КонецФункции


#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ДокументРезультат.Очистить();
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();				   
	КлючВарианта = ЗарплатаКадрыОтчеты.КлючВарианта(КомпоновщикНастроек);
	Если КлючВарианта = "Уведомление" ИЛИ КлючВарианта = "Заявление" Тогда
		
		Попытка
			
			СтандартнаяОбработка = Ложь;
			
			// Параметры документа
			ДокументРезультат.ТолькоПросмотр = Истина;
			ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УнифицированнаяФормаТ7";
			ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
			
			ВосстанавливатьПериод = Ложь;
			Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ВосстанавливатьПериод", ВосстанавливатьПериод) И ВосстанавливатьПериод Тогда
				ПараметрПериод = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
				ПереданныйПараметрПериод = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
				ПараметрПериод.Значение = ПереданныйПараметрПериод.Значение;
			КонецЕсли;
			
			ПроверитьЗначенияПараметров(НастройкиОтчета, Истина);
			
			Данные = Новый ДеревоЗначений;
			
			МакетКомпоновки = ЗарплатаКадрыОтчеты.МакетКомпоновкиДанныхДляКоллекцииЗначений(СхемаКомпоновкиДанных, НастройкиОтчета); 
			
			// Создадим и инициализируем процессор компоновки.
			ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
			
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
			ПроцессорВывода.УстановитьОбъект(Данные);
			
			// Обозначим начало вывода
			ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
			
			ВывестиМакет(ДокументРезультат, Данные, КлючВарианта);
			
			ДопСвойства = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
			ДопСвойства.Вставить("ОтчетПустой", Данные.Строки.Количество() = 0);
			
		Исключение
			ВызватьИсключение НСтр("ru = 'В настройку отчета внесены критичные изменения. Отчет не будет сформирован.'") + " " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		
		ПроверитьЗначенияПараметров(НастройкиОтчета);
		
		СтандартнаяОбработка = ложь;
		
		МакетКомпоновки = ЗарплатаКадрыОтчеты.МакетКомпоновкиДанных(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
		
		// Создадим и инициализируем процессор компоновки.
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		
		// Обозначим начало вывода
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
		ДопСвойства = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
		ДопСвойства.Вставить("ОтчетПустой", ОтчетыСервер.ОтчетПустой(ЭтотОбъект, ПроцессорКомпоновки));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьОтчет() Экспорт
	
	//ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(ЭтотОбъект);
	
КонецПроцедуры

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	Если КлючСхемы <> КлючВарианта Тогда
		
		ИнициализироватьОтчет();
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКомпоновкиДанных, КлючСхемы);
		
		КлючСхемы = КлючВарианта;
		
	КонецЕсли;
	
КонецПроцедуры

// Унифицированная форма Т-7

Процедура ВывестиМакет(ДокументРезультат, Данные, КлючВарианта)
	//СтрокаФорматаДат = "ДФ='dd MMMM yyyy'";
	СтрокаФорматаДат = "ДФ='<dd> MMMM yyyy ""г.""'";
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб = Истина;
	
	Макет = ЭтотОбъект.ПолучитьМакет(КлючВарианта);
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаРаботник");
	
	Для Каждого ДанныеПоСотруднику Из Данные.Строки Цикл
		
		ТекущийЛист = Новый ТабличныйДокумент;
		НастройкиПечатныхФорм = ЗарплатаКадры.НастройкиПечатныхФорм();
		ТекущийЛист.ОриентацияСтраницы = ДокументРезультат.ОриентацияСтраницы;
		ТекущийЛист.АвтоМасштаб = ДокументРезультат.АвтоМасштаб;
	
		ДанныеПодписантов = СведенияОПодписантах(ДанныеПоСотруднику.Организация, ДанныеПоСотруднику.ДатаНачала); 
		ОбластьСтрока.Параметры.Заполнить(ДанныеПодписантов);

		ОбластьСтрока.Параметры.Заполнить(ДанныеПоСотруднику);  
		
		СтруктураИзменений = Новый Структура("ФИОПолные, жен, ФИОВДательном, ДолжностьВДательном, ФИОВРодительном, ДолжностьВРодительном, ТекущаяДата, ДатаНачала, ДатаОкончания, ГодГрафика, ВидОтпуска");
		ДанныеСотр = ЗарплатаКадры.ПолучитьДанныеИсполнителя(ДанныеПоСотруднику.ФизическоеЛицо, ДанныеПоСотруднику.Организация);
		
		СклоненияДолжности = СклоненияДолжности(ДанныеСотр.Должность);
		СтруктураИзменений.ДолжностьВРодительном = нрег(СклоненияДолжности.РодительныйПадеж);
		СтруктураИзменений.ДолжностьВДательном = нрег(СклоненияДолжности.ДательныйПадеж);
		
		СтруктураИзменений.жен = ?(ДанныеСотр.Пол = "Женский", "а", "");
		СтруктураИзменений.ФИОПолные = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ДанныеПоСотруднику.ФизическоеЛицо);
		
		СклоненияФИО = СклоненияФИО(ДанныеПоСотруднику.ФизическоеЛицо); 
		СтруктураИзменений.ФИОВРодительном = СклоненияФИО.РодительныйПадеж; 
		СтруктураИзменений.ФИОВДательном = СклоненияФИО.ДательныйПадеж; 
		
		СтруктураИзменений.ДатаНачала = Формат(ДанныеПоСотруднику.ДатаНачала, СтрокаФорматаДат);
		СтруктураИзменений.ДатаОкончания = Формат(ДанныеПоСотруднику.ДатаОкончания, СтрокаФорматаДат);
		СтруктураИзменений.ГодГрафика =СтрЗаменить(ДанныеПоСотруднику.ГодГрафика, " ", ""); 
		СтруктураИзменений.ТекущаяДата = Формат(ТекущаяДатаСеанса(), СтрокаФорматаДат); 
		СтруктураИзменений.ВидОтпуска = ?(ДанныеПоСотруднику.ВидОтпуска = Справочники.ВидыОтпусков.Основной, "ежегодный основной оплачиваемый отпуск", "дополнительный отпуск"); 
		
		ОбластьСтрока.Параметры.Заполнить(СтруктураИзменений);  

		ТекущийЛист.Вывести(ОбластьСтрока);
		
		Если ТекущийЛист.ВысотаТаблицы > 0 Тогда
			ДокументРезультат.Вывести(ТекущийЛист);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

Функция СклоненияФИО(ФизЛицо) 
	УстановитьПривилегированныйРежим(Истина);
	СклоненияФИО = Новый Структура("РодительныйПадеж, ДательныйПадеж");
	ЗапросСклонений = РегистрыСведений.СклоненияПредставленийОбъектов.СоздатьНаборЗаписей();
	ЗапросСклонений.Отбор.Объект.Установить(ФизЛицо);
	ЗапросСклонений.Прочитать();
	Если ЗапросСклонений.Количество() > 0 Тогда
		СклоненияФИО.РодительныйПадеж = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЗапросСклонений[0].РодительныйПадеж);
		СклоненияФИО.ДательныйПадеж = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЗапросСклонений[0].ДательныйПадеж);
	Иначе
		Пол = ?(ЗначениеЗаполнено(ФизЛицо.Пол), ?(ФизЛицо.Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской"), 1, 2), Неопределено);
		РодительныйПадеж = СклонениеПредставленийОбъектов.ПросклонятьФИО(ФизЛицо.Наименование, 2, ФизЛицо, Пол);
		СклоненияФИО.РодительныйПадеж = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(РодительныйПадеж);
		ДательныйПадеж = СклонениеПредставленийОбъектов.ПросклонятьФИО(ФизЛицо.Наименование, 3, , Пол);
		СклоненияФИО.РодительныйПадеж = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ДательныйПадеж);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат СклоненияФИО;
	
КонецФункции	

Функция СклоненияДолжности(Должность) 
	УстановитьПривилегированныйРежим(Истина);
	СклоненияДолжности = Новый Структура("РодительныйПадеж, ДательныйПадеж");
	ЗапросСклонений = РегистрыСведений.СклоненияПредставленийОбъектов.СоздатьНаборЗаписей();
	ЗапросСклонений.Отбор.Объект.Установить(Должность);
	ЗапросСклонений.Прочитать();
	Если ЗапросСклонений.Количество() > 0 Тогда
		СклоненияДолжности.РодительныйПадеж = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЗапросСклонений[0].РодительныйПадеж);
		СклоненияДолжности.ДательныйПадеж = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЗапросСклонений[0].ДательныйПадеж);
	Иначе
		СклоненияДолжности.РодительныйПадеж = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Должность, 2);
		СклоненияДолжности.ДательныйПадеж = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Должность, 3);
    КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат СклоненияДолжности;
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// Универсальные процедуры и Функции.

Процедура ПроверитьЗначенияПараметров(НастройкиОтчета, ВыводитьПодписантов = Ложь)
	
	ПараметрПериод = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	Если ПараметрПериод <> Неопределено Тогда
		НачалоПериода = ПараметрПериод.Значение.ДатаНачала;
		КонецПериода = ПараметрПериод.Значение.ДатаОкончания;
		
		ПараметрПериод.Использование = Истина;
	Иначе
		НачалоПериода = НачалоГода(ТекущаяДатаСеанса());
		КонецПериода = КонецГода(ТекущаяДатаСеанса());
		
		ПараметрПериод = НастройкиОтчета.ПараметрыДанных.Элементы.Добавить();
		ПараметрПериод.Значение = Новый СтандартныйПериод;
		ПараметрПериод.Значение.ДатаНачала = НачалоПериода;
		ПараметрПериод.Значение.ДатаОкончания = КонецПериода;
		ПараметрПериод.Использование = Истина;
	КонецЕсли;
	
	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НомерДок"));
	Если ЗначениеПараметра <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(ЗначениеПараметра.Значение) Тогда
			ЗначениеПараметра.Использование = Ложь;
		КонецЕсли;
	КонецЕсли;
	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаДок"));
	Если ЗначениеПараметра <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(ЗначениеПараметра.Значение) Тогда
			ЗначениеПараметра.Использование = ЗначениеЗаполнено(ЗначениеПараметра.Значение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция СведенияОПодписантах(Организация, ДатаОтчета)
	
	ПараметрыЗаполнения = Новый Структура("Руководитель,РуководительРасшифровкаПодписи,
		|ДолжностьРуководителя,ДолжностьРуководителяВДательном,РуководительРасшифровкаПодписиВДательном, 
		|ДолжностьРуководителяВРодительном,РуководительРасшифровкаПодписиВРодительном,
		|ПодписантРасшифровкаПодписи");
	
	ОтветственныеЛица = Новый Структура("Организация,Руководитель,ДолжностьРуководителя,ДолжностьРуководителяСтрокой", Организация);
	
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ОтветственныеЛица, ДатаОтчета);
	
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ОтветственныеЛица);
	
	Если ОтветственныеЛица.Свойство("ДолжностьРуководителяСтрокой") И ЗначениеЗаполнено(ОтветственныеЛица.ДолжностьРуководителяСтрокой) Тогда
		
		ПараметрыЗаполнения.ДолжностьРуководителя = ОтветственныеЛица.ДолжностьРуководителяСтрокой;
		ПараметрыЗаполнения.ДолжностьРуководителяВДательном = нрег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(ПараметрыЗаполнения.ДолжностьРуководителя, 3));
		ПараметрыЗаполнения.ДолжностьРуководителяВРодительном = нрег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(ПараметрыЗаполнения.ДолжностьРуководителя, 2));
		
	ИначеЕсли ОтветственныеЛица.Свойство("ДолжностьРуководителя") И ЗначениеЗаполнено(ОтветственныеЛица.ДолжностьРуководителя) Тогда
		
		ПараметрыЗаполнения.ДолжностьРуководителя = ОтветственныеЛица.ДолжностьРуководителя;
		ПараметрыЗаполнения.ДолжностьРуководителяВДательном = нрег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(ПараметрыЗаполнения.ДолжностьРуководителя, 3));
		ПараметрыЗаполнения.ДолжностьРуководителяВРодительном = нрег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(ПараметрыЗаполнения.ДолжностьРуководителя, 2));
		
	КонецЕсли; 
	
	
	МассивФизЛиц = Новый Массив;
	Если ЗначениеЗаполнено(ПараметрыЗаполнения.Руководитель) Тогда
		МассивФизЛиц.Добавить(ПараметрыЗаполнения.Руководитель);
	КонецЕсли; 
	
	Если МассивФизЛиц.Количество() > 0 Тогда
		
		ФИОФизЛиц = ЗарплатаКадры.СоответствиеФИОФизЛицСсылкам(ДатаОтчета, МассивФизЛиц);
		
		Если ЗначениеЗаполнено(ПараметрыЗаполнения.Руководитель) Тогда
			ПараметрыЗаполнения.РуководительРасшифровкаПодписи = ФизическиеЛицаЗарплатаКадры.РасшифровкаПодписи(ФИОФизЛиц[ПараметрыЗаполнения.Руководитель]);
			СклоненияФИО = СклоненияФИО(ПараметрыЗаполнения.Руководитель); 
			ПараметрыЗаполнения.РуководительРасшифровкаПодписиВРодительном = СклоненияФИО.РодительныйПадеж;
			ПараметрыЗаполнения.РуководительРасшифровкаПодписиВДательном = СклоненияФИО.ДательныйПадеж;
		КонецЕсли; 
	КонецЕсли; 
	
	ПараметрыЗаполнения.ПодписантРасшифровкаПодписи = УправлениеСвойствами.ЗначениеСвойства(Организация, "ПодписантУведомлений"); 
	
Возврат ПараметрыЗаполнения;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли