
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторОсновнойФормы = Параметры.ИдентификаторОсновнойФормы;
	
	КомпоновщикПредварительногоОтбора = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикПредварительногоОтбора.Инициализировать( 
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(Параметры.АдресСхемыКомпоновки));
	
	СохраненныеНастройки = ПолучитьИзВременногоХранилища(Параметры.АдресНастроек);
	СхемаКомпоновки		 = ПолучитьИзВременногоХранилища(Параметры.АдресСхемыКомпоновки);
	
	КомпоновщикПредварительногоОтбора.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	бит_ОтчетыБФКлиентСервер.СкопироватьЭлементы(КомпоновщикПредварительногоОтбора.Настройки.Отбор,
		СохраненныеНастройки.НастройкиКомпоновщикаПредварительногоОтбора.Отбор);
	КомпоновщикПредварительногоОтбора.Восстановить();
	
	ЗначениеВРеквизитФормы(СохраненныеНастройки.ПравилаПоиска, "ПравилаПоиска");
	
	СкрыватьДокументыБезПары	   = Параметры.СкрыватьДокументыБезПары;
	АвтоПомечатьНаиболееПодходящие = Параметры.АвтоПомечатьНаиболееПодходящие;
	
	УдалитьИзВременногоХранилища(Параметры.АдресНастроек);
	
	Заголовок = СтрШаблон(НСтр("ru = 'Правила отбора и поиска ""%1""'; 
							|en = '""%1"" selection and search rules'"), Параметры.ПредставлениеОбластиОтбора);
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Закладка = "Поиск" Тогда
		ТекущаяСтраницаФормы = Элементы.СтраницаНастройкиПоиска;
	Иначе	
		ТекущаяСтраницаФормы = Элементы.СтраницаОтборы;
	КонецЕсли;
	Элементы.СтраницыОтбораИНастрок.ТекущаяСтраница = ТекущаяСтраницаФормы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПравилаПоиска

&НаКлиенте
Процедура ПравилаПоискаВидСравненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПравилаПоиска.ТекущиеДанные;
	ТекущиеДанные.Пометка = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Если Модифицированность Тогда
		Модифицированность = Ложь;
		Закрыть(АдресРезультата());
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	ПоменятьПометки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	ПоменятьПометки(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция АдресРезультата()
	
	Результат = Новый Структура;
	Результат.Вставить("НастройкиКомпоновщикаПредварительногоОтбора", КомпоновщикПредварительногоОтбора.Настройки);
	Результат.Вставить("ПравилаПоиска", 				 РеквизитФормыВЗначение("ПравилаПоиска"));
	Результат.Вставить("СкрыватьДокументыБезПары", 		 СкрыватьДокументыБезПары);
	Результат.Вставить("АвтоПомечатьНаиболееПодходящие", АвтоПомечатьНаиболееПодходящие);
	
	Возврат ПоместитьВоВременноеХранилище(Результат, ИдентификаторОсновнойФормы)
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл Проектное решение вызвать функционал другой подсистемы.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПравилаПоискаВидСравнения");
	// АПК:277-вкл
	ГруппаИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор,, 
					ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ); 
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИ,
		"ПравилаПоиска.ВыражениеИсточник", ВидСравненияКомпоновкиДанных.НеРавно, "Дата");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИ,
		"ПравилаПоиска.ВыражениеИсточник", ВидСравненияКомпоновкиДанных.НеРавно, "Сумма");
		
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ТекстНедоступнойНадписи);

КонецПроцедуры

&НаКлиенте
Процедура ПоменятьПометки(Пометка)

	Для каждого СтрокаТаблицы Из ПравилаПоиска Цикл
		СтрокаТаблицы.Пометка = Пометка;
	КонецЦикла;
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

