#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрыОтчета  = ОбязательныеПараметрыОтчета();
		
	ТаблицаДанных = НастройкиЭлиминацииДанные(ПараметрыОтчета);
	ВнешниеНаборы	  = Новый Структура;
	Для каждого НаборДанных Из СхемаКомпоновкиДанных.НаборыДанных Цикл
		ВнешниеНаборы.Вставить(НаборДанных.ИмяОбъекта, ТаблицаДанных);
	КонецЦикла;
	
	КомпоновщикМакета 		  = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 		  = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборы, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);

	бит_ОтчетыБФСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, 
		ДокументРезультат, ВспомогательныеПараметрыОтчета());

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПериметрКонсолидации = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПериметрКонсолидации").Значение;
	Если НЕ ЗначениеЗаполнено(ПериметрКонсолидации) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,
							НСтр("ru = 'Периметр консолидации'; en = 'Report Setup'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , ,Отказ); 
	КонецЕсли;
	
	НастройкиЭлиминации = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "НастройкиЭлиминации").Значение;
	Если НЕ ЗначениеЗаполнено(НастройкиЭлиминации) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,
							НСтр("ru = 'Настройки элиминации'; en = 'Report Setup'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , ,Отказ); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
Функция НастройкиЭлиминацииДанные(ПараметрыНастойки)
		
	Период			     = ПараметрыНастойки.Период;
	ПериметрКонсолидации = ПараметрыНастойки.ПериметрКонсолидации;
	НастройкиЭлиминации	 = ПараметрыНастойки.НастройкиЭлиминации;
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Организация");
	ТаблицаДанных.Колонки.Добавить("Контрагент");
	ТаблицаДанных.Колонки.Добавить("Регистратор");
	ТаблицаДанных.Колонки.Добавить("НастройкаЭлиминации");
	ТаблицаДанных.Колонки.Добавить("Счет");
	ТаблицаДанных.Колонки.Добавить("Субконто1");
	ТаблицаДанных.Колонки.Добавить("Субконто2");
	ТаблицаДанных.Колонки.Добавить("Субконто3");
	ТаблицаДанных.Колонки.Добавить("Субконто4");
	ТаблицаДанных.Колонки.Добавить("Сумма");
	
	Если НЕ ЗначениеЗаполнено(НастройкиЭлиминации) Тогда
		Возврат ТаблицаДанных;	
	КонецЕсли;
	
	Если ТипЗнч(НастройкиЭлиминации) = Тип("СправочникСсылка.бит_му_НастройкиЭлиминации") Тогда
		ДополнитьТаблицу(ТаблицаДанных, НастройкиЭлиминации, ПериметрКонсолидации, Период);
	Иначе
		Для каждого НастройкаЭлиминации Из НастройкиЭлиминации Цикл
			ДополнитьТаблицу(ТаблицаДанных, НастройкаЭлиминации.Значение, ПериметрКонсолидации, Период); 
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаДанных;
	
КонецФункции

Процедура ДополнитьТаблицу(ТаблицаДанных, НастройкаЭлиминации, ПериметрКонсолидации, Период)
	
	ГраницаНач = Период.ДатаНачала;
	ГраницаКон = Новый Граница(КонецДня(Период.ДатаОкончания), ВидГраницы.Включая);
	
	Для каждого ТекущаяНастройка Из НастройкаЭлиминации.Настройки Цикл
		Параметры = Новый Структура;				
		Параметры.Вставить("ПериметрКонсолидации", ПериметрКонсолидации);
		
		СтрПар = бит_МеханизмПолученияДанных.НовыеПараметрыПолучитьДанныеПоИсточнику();
		СтрПар.Параметры = Параметры;
		
		ДанныеПоИсточнику = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточнику(ТекущаяНастройка.ИсточникДанных, ГраницаНач, ГраницаКон, СтрПар);
		Для каждого СтрокаДанных Из ДанныеПоИсточнику Цикл
			НоваяСтрока = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
							
			НоваяСтрока.НастройкаЭлиминации = НастройкаЭлиминации;
			Если ДанныеПоИсточнику.Колонки.Найти("СуммаУпр_Дт") <> Неопределено Тогда
				НоваяСтрока.Сумма = СтрокаДанных.СуммаУпр_Дт;
			ИначеЕсли ДанныеПоИсточнику.Колонки.Найти("СуммаУпр_Кт") <> Неопределено Тогда
				НоваяСтрока.Сумма = -СтрокаДанных.СуммаУпр_Кт;
			ИначеЕсли ДанныеПоИсточнику.Колонки.Найти("СуммаУпр") <> Неопределено Тогда
				НоваяСтрока.Сумма = СтрокаДанных.СуммаУпр;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
			
КонецПроцедуры

Функция ВспомогательныеПараметрыОтчета()
	
	ВспомогательныеПараметры = Новый Массив;
	ВспомогательныеПараметры.Добавить("Язык");
	ВспомогательныеПараметры.Добавить("ВалютаДокумента");
	
	Возврат ВспомогательныеПараметры;
	
КонецФункции

Функция ОбязательныеПараметрыОтчета()

	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Период", 				   	 Новый СтандартныйПериод);
	ПараметрыОтчета.Вставить("ПериметрКонсолидации",	 Справочники.бит_му_ПериметрыКонсолидации.ПустаяСсылка());
	ПараметрыОтчета.Вставить("НастройкиЭлиминации",	   	 Новый СписокЗначений);
	ПараметрыОтчета.Вставить("СуммаОтклонение",	   	     Новый ОписаниеТипов("Число"));
	
	Для каждого ОписаниеПараметра Из ПараметрыОтчета Цикл
		ПараметрНастройки = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, ОписаниеПараметра.Ключ);
		Если ПараметрНастройки <> Неопределено Тогда
			ПараметрыОтчета[ОписаниеПараметра.Ключ] = ПараметрНастройки.Значение;
		КонецЕсли;
	КонецЦикла;
		
	Возврат ПараметрыОтчета;
	
КонецФункции

#КонецОбласти

#КонецЕсли