#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает список возможных настроек для заданного действия.
//
// Параметры:
//   Действие - СправочникСсылка.бит_ум_ДействияПоСобытиям
//     - действие, для которого нужно получить настройки.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с колонками:
//     * Настройка - ПланВидовХарактеристикСсылка.бит_ум_НастройкиДействий.
//     * Значение - Произвольный - значение настройки.
//
Функция ДополнительныеНастройкиДляДействия(Действие) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	СписокНастроек = бит_ум_УчетМигрантовПовтИсп.СписокВозможныхНастроекВидаОформляемогоДокумента(Действие.ВидОформляемогоДокумента);
	Для Каждого СтрокаНастроек Из СписокНастроек Цикл
		ИмяНастройки = СтрокаНастроек.Настройка.ИмяПредопределенныхДанных;
		НайденнаяСтрока = Действие.ДополнительныеНастройки.Найти(СтрокаНастроек.Настройка, "Настройка");
		Если НайденнаяСтрока <> Неопределено Тогда
			ЗначениеНастройки = СтрокаНастроек.Настройка.ТипЗначения.ПривестиЗначение(НайденнаяСтрока.Значение);
		Иначе
			ЗначениеНастройки = СтрокаНастроек.НачальноеЗначение;
		КонецЕсли;
		СтруктураНастроек.Вставить(ИмяНастройки, ЗначениеНастройки);
	КонецЦикла;
	
	Возврат СтруктураНастроек;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается при переходе на версию конфигурации 3.1.0.5.
//
Процедура ОбновлениеДействийПоСобытиям_3_1_0_5() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДействийПоСобытиям.Ссылка КАК Действие,
	|	ВидыДействийПоСобытиям.ВидОформляемогоДокумента КАК ВидОформляемогоДокумента,
	|	ВЫБОР
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОВнесенииИзмененийВРазрешениеНаРаботу_2017""
	|			ТОГДА ""ЗаявлениеОВнесенииИзмененийВРазрешениеНаРаботу_2020""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НовыйВидОформляемогоДокумента
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям КАК ВидыДействийПоСобытиям
	|ГДЕ
	|	ВидыДействийПоСобытиям.ПометкаУдаления = ЛОЖЬ
	|	И ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОВнесенииИзмененийВРазрешениеНаРаботу_2017""
	|	И ВидыДействийПоСобытиям.ВАрхиве = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.НовыйВидОформляемогоДокумента) Тогда
			Продолжить;
		КонецЕсли;
	
		СправочникОбъект = Справочники.бит_ум_ДействияПоСобытиям.СоздатьЭлемент();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка.Действие, "Наименование, КонтролироватьИсполнение, СрокИсполнения, КонтролирующийОрган, НеРазбиватьНаСтраницы");
		Для Каждого Строка Из Выборка.Действие.ВидыИР Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.ВидыИР.Добавить(), Строка);
		КонецЦикла;
		Для Каждого Строка Из Выборка.Действие.События Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.События.Добавить(), Строка);
		КонецЦикла;
		СправочникОбъект.ВидОформляемогоДокумента = Справочники.бит_ум_ВидыОформляемыхДокументов.НайтиПоРеквизиту("ИмяМакета", Выборка.НовыйВидОформляемогоДокумента);
		СправочникОбъект.УстановитьНовыйКод();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
		СправочникОбъект = Выборка.Действие.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = '(старый)'");
		СправочникОбъект.ВАрхиве = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

// Вызывается при переходе на версию конфигурации 3.3.1.1.
//
Процедура ОбновлениеДействийПоСобытиям_3_1_1_1() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДействийПоСобытиям.Ссылка КАК Действие,
	|	ВидыДействийПоСобытиям.ВидОформляемогоДокумента КАК ВидОформляемогоДокумента,
	|	ВЫБОР
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОбУбытииИностранногоГражданина_2019""
	|			ТОГДА ""УведомлениеОбУбытииИностранногоГражданина_2020""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НовыйВидОформляемогоДокумента
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям КАК ВидыДействийПоСобытиям
	|ГДЕ
	|	ВидыДействийПоСобытиям.ПометкаУдаления = ЛОЖЬ
	|	И ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОбУбытииИностранногоГражданина_2019""
	|	И ВидыДействийПоСобытиям.ВАрхиве = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.НовыйВидОформляемогоДокумента) Тогда
			Продолжить;
		КонецЕсли;
	
		СправочникОбъект = Справочники.бит_ум_ДействияПоСобытиям.СоздатьЭлемент();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка.Действие, "Наименование, КонтролироватьИсполнение, СрокИсполнения, КонтролирующийОрган, НеРазбиватьНаСтраницы");
		Для Каждого Строка Из Выборка.Действие.ВидыИР Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.ВидыИР.Добавить(), Строка);
		КонецЦикла;
		Для Каждого Строка Из Выборка.Действие.События Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.События.Добавить(), Строка);
		КонецЦикла;
		СправочникОбъект.ВидОформляемогоДокумента = Справочники.бит_ум_ВидыОформляемыхДокументов.НайтиПоРеквизиту("ИмяМакета", Выборка.НовыйВидОформляемогоДокумента);
		СправочникОбъект.УстановитьНовыйКод();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
		СправочникОбъект = Выборка.Действие.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = '(старый)'");
		СправочникОбъект.ВАрхиве = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

// Вызывается при переходе на версию конфигурации 3.1.3.2.
//
Процедура ОбновлениеДействийПоСобытиям_3_1_3_2() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДействийПоСобытиям.Ссылка КАК Действие,
	|	ВидыДействийПоСобытиям.ВидОформляемогоДокумента КАК ВидОформляемогоДокумента,
	|	ВЫБОР
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОЗаключенииТрудовогоДоговора_201909""
	|			ТОГДА ""УведомлениеОЗаключенииТрудовогоДоговора_202101""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОРасторженииТрудовогоДоговора_201909""
	|			ТОГДА ""УведомлениеОРасторженииТрудовогоДоговора_202101""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОбИсполненииРаботодателемОбязательствПоВыплатеЗП_201909""
	|			ТОГДА ""УведомлениеОбИсполненииРаботодателемОбязательствПоВыплатеЗП_202101""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОТрудоустройствеИГОрганизациейПоТрудоустройству_201909""
	|			ТОГДА ""УведомлениеОТрудоустройствеИГОрганизациейПоТрудоустройству_202101""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ХодатайствоИГОПривлеченииЕгоВКачествеВысококвалифицированногоСпец_201909""
	|			ТОГДА ""ХодатайствоИГОПривлеченииЕгоВКачествеВысококвалифицированногоСпец_202101""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОТрудоустройствеИГОрганизациейПоТрудоустройствуДоп_201910""
	|			ТОГДА ""УведомлениеОТрудоустройствеИГОрганизациейПоТрудоустройствуДоп_202101""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОбИсполненииРаботодателемОбязательствПоВыплатеЗПДоп_201910""
	|			ТОГДА ""УведомлениеОбИсполненииРаботодателемОбязательствПоВыплатеЗПДоп_202101""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОЗаключенииТрудовогоДоговораДоп_201910""
	|			ТОГДА ""УведомлениеОЗаключенииТрудовогоДоговораДоп_202101""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОРасторженииТрудовогоДоговораДоп_201910""
	|			ТОГДА ""УведомлениеОРасторженииТрудовогоДоговораДоп_202101""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НовыйВидОформляемогоДокумента
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям КАК ВидыДействийПоСобытиям
	|ГДЕ
	|	ВидыДействийПоСобытиям.ПометкаУдаления = ЛОЖЬ
	|	И (ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОЗаключенииТрудовогоДоговора_201909""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОРасторженииТрудовогоДоговора_201909""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОбИсполненииРаботодателемОбязательствПоВыплатеЗП_201909""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОТрудоустройствеИГОрганизациейПоТрудоустройству_201909""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ХодатайствоИГОПривлеченииЕгоВКачествеВысококвалифицированногоСпец_201909""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОТрудоустройствеИГОрганизациейПоТрудоустройствуДоп_201910""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОбИсполненииРаботодателемОбязательствПоВыплатеЗПДоп_201910""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОЗаключенииТрудовогоДоговораДоп_201910""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОРасторженииТрудовогоДоговораДоп_201910"")
	|	И ВидыДействийПоСобытиям.ВАрхиве = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.НовыйВидОформляемогоДокумента) Тогда
			Продолжить;
		КонецЕсли;
	
		СправочникОбъект = Справочники.бит_ум_ДействияПоСобытиям.СоздатьЭлемент();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка.Действие, "Наименование, КонтролироватьИсполнение, СрокИсполнения, КонтролирующийОрган, НеРазбиватьНаСтраницы");
		Для Каждого Строка Из Выборка.Действие.ВидыИР Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.ВидыИР.Добавить(), Строка);
		КонецЦикла;
		Для Каждого Строка Из Выборка.Действие.События Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.События.Добавить(), Строка);
		КонецЦикла;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = '(с 2021)'");
		СправочникОбъект.ВидОформляемогоДокумента = Справочники.бит_ум_ВидыОформляемыхДокументов.НайтиПоРеквизиту("ИмяМакета", Выборка.НовыйВидОформляемогоДокумента);
		СправочникОбъект.УстановитьНовыйКод();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
		СправочникОбъект = Выборка.Действие.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = '(старый)'");
		СправочникОбъект.ВАрхиве = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

// Вызывается при переходе на версию конфигурации 3.1.4.1.
//
Процедура ОбновлениеДействийПоСобытиям_3_1_4_1() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДействийПоСобытиям.Ссылка КАК Действие,
	|	ВидыДействийПоСобытиям.ВидОформляемогоДокумента КАК ВидОформляемогоДокумента,
	|	ВЫБОР
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОПрибытииВМестоПребывания_202006""
	|			ТОГДА ""УведомлениеОПрибытииВМестоПребывания_202102""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОПрибытииВМестоПребыванияСерыйФон_202006""
	|			ТОГДА ""УведомлениеОПрибытииВМестоПребывания_202102""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НовыйВидОформляемогоДокумента
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям КАК ВидыДействийПоСобытиям
	|ГДЕ
	|	ВидыДействийПоСобытиям.ПометкаУдаления = ЛОЖЬ
	|	И (ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОПрибытииВМестоПребывания_202006""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОПрибытииВМестоПребыванияСерыйФон_202006"")
	|	И ВидыДействийПоСобытиям.ВАрхиве = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.НовыйВидОформляемогоДокумента) Тогда
			Продолжить;
		КонецЕсли;
	
		СправочникОбъект = Справочники.бит_ум_ДействияПоСобытиям.СоздатьЭлемент();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка.Действие, "Наименование, КонтролироватьИсполнение, СрокИсполнения, КонтролирующийОрган, НеРазбиватьНаСтраницы");
		Для Каждого Строка Из Выборка.Действие.ВидыИР Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.ВидыИР.Добавить(), Строка);
		КонецЦикла;
		Для Каждого Строка Из Выборка.Действие.События Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.События.Добавить(), Строка);
		КонецЦикла;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = ''");
		СправочникОбъект.ВидОформляемогоДокумента = Справочники.бит_ум_ВидыОформляемыхДокументов.НайтиПоРеквизиту("ИмяМакета", Выборка.НовыйВидОформляемогоДокумента);
		СправочникОбъект.УстановитьНовыйКод();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
		СправочникОбъект = Выборка.Действие.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = '(старый)'");
		СправочникОбъект.ВАрхиве = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

// Вызывается при переходе на версию конфигурации 3.1.9.1.
//
Процедура ОбновлениеДействийПоСобытиям_3_1_9_1() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДействийПоСобытиям.Ссылка КАК Действие,
	|	ВидыДействийПоСобытиям.ВидОформляемогоДокумента КАК ВидОформляемогоДокумента,
	|	ВЫБОР
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОВыдачеРазрешенияНаРаботу_2017""
	|			ТОГДА ""ЗаявлениеОВыдачеРазрешенияНаРаботу_2021""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОПродленииСрокаДействияРазрешенияНаРаботу_2017""
	|			ТОГДА ""ЗаявлениеОПродленииСрокаДействияРазрешенияНаРаботу_2021""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОВыдачеДубликатаРазрешенияНаРаботу_2017""
	|			ТОГДА ""ЗаявлениеОВыдачеДубликатаРазрешенияНаРаботу_2021""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОВнесенииИзмененийВРазрешениеНаРаботу_2020""
	|			ТОГДА ""ЗаявлениеОВнесенииИзмененийВРазрешениеНаРаботу_2021""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НовыйВидОформляемогоДокумента
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям КАК ВидыДействийПоСобытиям
	|ГДЕ
	|	ВидыДействийПоСобытиям.ПометкаУдаления = ЛОЖЬ
	|	И (ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОВыдачеРазрешенияНаРаботу_2017""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОПродленииСрокаДействияРазрешенияНаРаботу_2017""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОВыдачеДубликатаРазрешенияНаРаботу_2017""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОВнесенииИзмененийВРазрешениеНаРаботу_2020"")
	|	И ВидыДействийПоСобытиям.ВАрхиве = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.НовыйВидОформляемогоДокумента) Тогда
			Продолжить;
		КонецЕсли;
	
		СправочникОбъект = Справочники.бит_ум_ДействияПоСобытиям.СоздатьЭлемент();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка.Действие, "Наименование, КонтролироватьИсполнение, СрокИсполнения, КонтролирующийОрган, НеРазбиватьНаСтраницы");
		Для Каждого Строка Из Выборка.Действие.ВидыИР Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.ВидыИР.Добавить(), Строка);
		КонецЦикла;
		Для Каждого Строка Из Выборка.Действие.События Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.События.Добавить(), Строка);
		КонецЦикла;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование);
		СправочникОбъект.ВидОформляемогоДокумента = Справочники.бит_ум_ВидыОформляемыхДокументов.НайтиПоРеквизиту("ИмяМакета", Выборка.НовыйВидОформляемогоДокумента);
		СправочникОбъект.УстановитьНовыйКод();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
		СправочникОбъект = Выборка.Действие.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = '(старый)'");
		СправочникОбъект.ВАрхиве = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

// Вызывается при переходе на версию конфигурации 3.1.9.3.
//
Процедура ОбновлениеДействийПоСобытиям_3_1_9_3() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДействийПоСобытиям.Ссылка КАК Действие,
	|	ВидыДействийПоСобытиям.ВидОформляемогоДокумента КАК ВидОформляемогоДокумента,
	|	ВЫБОР
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОПрибытииВМестоПребывания_202102""
	|			ТОГДА ""УведомлениеОПрибытииВМестоПребывания_202301""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НовыйВидОформляемогоДокумента
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям КАК ВидыДействийПоСобытиям
	|ГДЕ
	|	ВидыДействийПоСобытиям.ПометкаУдаления = ЛОЖЬ
	|	И ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОПрибытииВМестоПребывания_202102""
	|	И ВидыДействийПоСобытиям.ВАрхиве = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.НовыйВидОформляемогоДокумента) Тогда
			Продолжить;
		КонецЕсли;
	
		СправочникОбъект = Справочники.бит_ум_ДействияПоСобытиям.СоздатьЭлемент();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка.Действие, "Наименование, КонтролироватьИсполнение, СрокИсполнения, КонтролирующийОрган, НеРазбиватьНаСтраницы");
		Для Каждого Строка Из Выборка.Действие.ВидыИР Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.ВидыИР.Добавить(), Строка);
		КонецЦикла;
		Для Каждого Строка Из Выборка.Действие.События Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.События.Добавить(), Строка);
		КонецЦикла;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = ''");
		СправочникОбъект.ВидОформляемогоДокумента = Справочники.бит_ум_ВидыОформляемыхДокументов.НайтиПоРеквизиту("ИмяМакета", Выборка.НовыйВидОформляемогоДокумента);
		СправочникОбъект.УстановитьНовыйКод();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
		СправочникОбъект = Выборка.Действие.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = '(старый)'");
		СправочникОбъект.ВАрхиве = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры        

// Вызывается при переходе на версию конфигурации 3.1.10.1.
//
Процедура ОбновлениеДействийПоСобытиям_3_1_10_1() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДействийПоСобытиям.Ссылка КАК Действие,
	|	ВидыДействийПоСобытиям.ВидОформляемогоДокумента КАК ВидОформляемогоДокумента,
	|	ВЫБОР
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОбИсполненииРаботодателемОбязательствПоВыплатеЗП_202101""
	|			ТОГДА ""УведомлениеОбИсполненииРаботодателемОбязательствПоВыплатеЗП_202401""            
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОбИсполненииРаботодателемОбязательствПоВыплатеЗП_202101_2""
	|			ТОГДА ""УведомлениеОбИсполненииРаботодателемОбязательствПоВыплатеЗП_202401""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НовыйВидОформляемогоДокумента
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям КАК ВидыДействийПоСобытиям
	|ГДЕ
	|	ВидыДействийПоСобытиям.ПометкаУдаления = ЛОЖЬ
	|	И (ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОбИсполненииРаботодателемОбязательствПоВыплатеЗП_202101""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОбИсполненииРаботодателемОбязательствПоВыплатеЗП_202101_2"")
	|	И ВидыДействийПоСобытиям.ВАрхиве = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.НовыйВидОформляемогоДокумента) Тогда
			Продолжить;
		КонецЕсли;
	
		СправочникОбъект = Справочники.бит_ум_ДействияПоСобытиям.СоздатьЭлемент();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка.Действие, "Наименование, КонтролироватьИсполнение, СрокИсполнения, КонтролирующийОрган, НеРазбиватьНаСтраницы");
		Для Каждого Строка Из Выборка.Действие.ВидыИР Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.ВидыИР.Добавить(), Строка);
		КонецЦикла;
		Для Каждого Строка Из Выборка.Действие.События Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.События.Добавить(), Строка);
		КонецЦикла;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = ''");
		СправочникОбъект.ВидОформляемогоДокумента = Справочники.бит_ум_ВидыОформляемыхДокументов.НайтиПоРеквизиту("ИмяМакета", Выборка.НовыйВидОформляемогоДокумента);
		СправочникОбъект.УстановитьНовыйКод();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
		СправочникОбъект = Выборка.Действие.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = '(старый)'");
		СправочникОбъект.ВАрхиве = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры  

// Вызывается при переходе на версию конфигурации 3.1.10.2.
//
Процедура ОбновлениеДействийПоСобытиям_3_1_10_2() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДействийПоСобытиям.Ссылка КАК Действие,
	|	ВидыДействийПоСобытиям.ВидОформляемогоДокумента КАК ВидОформляемогоДокумента,
	|	ВЫБОР
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОРасторженииТрудовогоДоговора_202101""
	|			ТОГДА ""УведомлениеОРасторженииТрудовогоДоговора_202401""            
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОРасторженииТрудовогоДоговора_202101_2""
	|			ТОГДА ""УведомлениеОРасторженииТрудовогоДоговора_202401""      
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОЗаключенииТрудовогоДоговора_202101""
	|			ТОГДА ""УведомлениеОЗаключенииТрудовогоДоговора_202401""            
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОЗаключенииТрудовогоДоговора_202101_2""
	|			ТОГДА ""УведомлениеОЗаключенииТрудовогоДоговора_202401""	  
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОТрудоустройствеИГОрганизациейПоТрудоустройству_202101""
	|			ТОГДА ""УведомлениеОТрудоустройствеИГОрганизациейПоТрудоустройству_202401""            
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОТрудоустройствеИГОрганизациейПоТрудоустройству_202101_2""
	|			ТОГДА ""УведомлениеОТрудоустройствеИГОрганизациейПоТрудоустройству_202401""	    
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОВнесенииИзмененийВРазрешениеНаРаботу_2021""
	|			ТОГДА ""ЗаявлениеОВнесенииИзмененийВРазрешениеНаРаботу_202401""		
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОВыдачеДубликатаРазрешенияНаРаботу_2021""
	|			ТОГДА ""ЗаявлениеОВыдачеДубликатаРазрешенияНаРаботу_202401""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОПродленииСрокаДействияРазрешенияНаРаботу_2021""
	|			ТОГДА ""ЗаявлениеОПродленииСрокаДействияРазрешенияНаРаботу_202401""	        
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОВыдачеРазрешенияНаРаботу_2021""
	|			ТОГДА ""ЗаявлениеОВыдачеРазрешенияНаРаботу_202401""	
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НовыйВидОформляемогоДокумента
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям КАК ВидыДействийПоСобытиям
	|ГДЕ
	|	ВидыДействийПоСобытиям.ПометкаУдаления = ЛОЖЬ
	|	И (ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОРасторженииТрудовогоДоговора_202101""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОРасторженииТрудовогоДоговора_202101_2""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОЗаключенииТрудовогоДоговора_202101""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОЗаключенииТрудовогоДоговора_202101_2""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОТрудоустройствеИГОрганизациейПоТрудоустройству_202101""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОТрудоустройствеИГОрганизациейПоТрудоустройству_202101_2""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОВнесенииИзмененийВРазрешениеНаРаботу_2021""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОВыдачеДубликатаРазрешенияНаРаботу_2021""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОПродленииСрокаДействияРазрешенияНаРаботу_2021""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ЗаявлениеОВыдачеРазрешенияНаРаботу_2021"")
	|	И ВидыДействийПоСобытиям.ВАрхиве = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.НовыйВидОформляемогоДокумента) Тогда
			Продолжить;
		КонецЕсли;
	
		СправочникОбъект = Справочники.бит_ум_ДействияПоСобытиям.СоздатьЭлемент();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка.Действие, "Наименование, КонтролироватьИсполнение, СрокИсполнения, КонтролирующийОрган, НеРазбиватьНаСтраницы");
		Для Каждого Строка Из Выборка.Действие.ВидыИР Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.ВидыИР.Добавить(), Строка);
		КонецЦикла;
		Для Каждого Строка Из Выборка.Действие.События Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.События.Добавить(), Строка);
		КонецЦикла;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = ''");
		СправочникОбъект.ВидОформляемогоДокумента = Справочники.бит_ум_ВидыОформляемыхДокументов.НайтиПоРеквизиту("ИмяМакета", Выборка.НовыйВидОформляемогоДокумента);
		СправочникОбъект.УстановитьНовыйКод();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
		СправочникОбъект = Выборка.Действие.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = '(старый)'");
		СправочникОбъект.ВАрхиве = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

// Вызывается при переходе на версию конфигурации 3.1.10.4.
//
Процедура ОбновлениеДействийПоСобытиям_3_1_10_4() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДействийПоСобытиям.Ссылка КАК Действие,
	|	ВидыДействийПоСобытиям.ВидОформляемогоДокумента КАК ВидОформляемогоДокумента,
	|	ВЫБОР
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ХодатайствоОПривлеченииВысококвалифицированногоИнСпециалиста""
	|			ТОГДА ""ХодатайствоОПривлеченииВысококвалифицированногоИнСпециалиста_202401""            
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НовыйВидОформляемогоДокумента
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям КАК ВидыДействийПоСобытиям
	|ГДЕ
	|	ВидыДействийПоСобытиям.ПометкаУдаления = ЛОЖЬ
	|	И (ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ХодатайствоОПривлеченииВысококвалифицированногоИнСпециалиста"")
	|	И ВидыДействийПоСобытиям.ВАрхиве = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.НовыйВидОформляемогоДокумента) Тогда
			Продолжить;
		КонецЕсли;
	
		СправочникОбъект = Справочники.бит_ум_ДействияПоСобытиям.СоздатьЭлемент();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка.Действие, "Наименование, КонтролироватьИсполнение, СрокИсполнения, КонтролирующийОрган, НеРазбиватьНаСтраницы");
		Для Каждого Строка Из Выборка.Действие.ВидыИР Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.ВидыИР.Добавить(), Строка);
		КонецЦикла;
		Для Каждого Строка Из Выборка.Действие.События Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.События.Добавить(), Строка);
		КонецЦикла;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = ''");
		СправочникОбъект.ВидОформляемогоДокумента = Справочники.бит_ум_ВидыОформляемыхДокументов.НайтиПоРеквизиту("ИмяМакета", Выборка.НовыйВидОформляемогоДокумента);
		СправочникОбъект.УстановитьНовыйКод();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
		СправочникОбъект = Выборка.Действие.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = '(старый)'");
		СправочникОбъект.ВАрхиве = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры 

// Вызывается при переходе на версию конфигурации 3.1.10.6.
//
Процедура ОбновлениеДействийПоСобытиям_3_1_10_6() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДействийПоСобытиям.Ссылка КАК Действие,
	|	ВидыДействийПоСобытиям.ВидОформляемогоДокумента КАК ВидОформляемогоДокумента,
	|	ВЫБОР
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОбИсполненииРаботодателемОбязательствПоВыплатеЗПДоп_202101""
	|			ТОГДА ""УведомлениеОбИсполненииРаботодателемОбязательствПоВыплатеЗПДоп_202401""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОЗаключенииТрудовогоДоговораДоп_202101""
	|			ТОГДА ""УведомлениеОЗаключенииТрудовогоДоговораДоп_202401""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОРасторженииТрудовогоДоговораДоп_202101""
	|			ТОГДА ""УведомлениеОРасторженииТрудовогоДоговораДоп_202401""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОТрудоустройствеИГОрганизациейПоТрудоустройствуДоп_202101""
	|			ТОГДА ""УведомлениеОТрудоустройствеИГОрганизациейПоТрудоустройствуДоп_202401""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НовыйВидОформляемогоДокумента
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям КАК ВидыДействийПоСобытиям
	|ГДЕ
	|	ВидыДействийПоСобытиям.ПометкаУдаления = ЛОЖЬ
	|	И (ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОбИсполненииРаботодателемОбязательствПоВыплатеЗПДоп_202101""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОЗаключенииТрудовогоДоговораДоп_202101""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОРасторженииТрудовогоДоговораДоп_202101""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОТрудоустройствеИГОрганизациейПоТрудоустройствуДоп_202101"")
	|	И ВидыДействийПоСобытиям.ВАрхиве = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.НовыйВидОформляемогоДокумента) Тогда
			Продолжить;
		КонецЕсли;
	
		СправочникОбъект = Справочники.бит_ум_ДействияПоСобытиям.СоздатьЭлемент();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка.Действие, "Наименование, КонтролироватьИсполнение, СрокИсполнения, КонтролирующийОрган, НеРазбиватьНаСтраницы");
		Для Каждого Строка Из Выборка.Действие.ВидыИР Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.ВидыИР.Добавить(), Строка);
		КонецЦикла;
		Для Каждого Строка Из Выборка.Действие.События Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.События.Добавить(), Строка);
		КонецЦикла;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = '(с 2021)'");
		СправочникОбъект.ВидОформляемогоДокумента = Справочники.бит_ум_ВидыОформляемыхДокументов.НайтиПоРеквизиту("ИмяМакета", Выборка.НовыйВидОформляемогоДокумента);
		СправочникОбъект.УстановитьНовыйКод();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
		СправочникОбъект = Выборка.Действие.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = '(старый)'");
		СправочникОбъект.ВАрхиве = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

// Вызывается при переходе на версию конфигурации 3.1.11.1.
//
Процедура ОбновлениеДействийПоСобытиям_3_1_11_1() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДействийПоСобытиям.Ссылка КАК Действие,
	|	ВидыДействийПоСобытиям.ВидОформляемогоДокумента КАК ВидОформляемогоДокумента,
	|	ВЫБОР
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОПрибытииВМестоПребывания_202301""
	|			ТОГДА ""УведомлениеОПрибытииВМестоПребывания_202501""
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ХодатайствоИГОПривлеченииЕгоВКачествеВысококвалифицированногоСпец_202101""
	|			ТОГДА ""ХодатайствоИГОПривлеченииЕгоВКачествеВысококвалифицированногоСпец_202101""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НовыйВидОформляемогоДокумента
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям КАК ВидыДействийПоСобытиям
	|ГДЕ
	|	ВидыДействийПоСобытиям.ПометкаУдаления = ЛОЖЬ
	|	И (ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОПрибытииВМестоПребывания_202301""
	|			ИЛИ ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ХодатайствоИГОПривлеченииЕгоВКачествеВысококвалифицированногоСпец_202101"")
	|	И ВидыДействийПоСобытиям.ВАрхиве = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.НовыйВидОформляемогоДокумента) Тогда
			Продолжить;
		КонецЕсли;
	
		СправочникОбъект = Справочники.бит_ум_ДействияПоСобытиям.СоздатьЭлемент();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка.Действие, "Наименование, КонтролироватьИсполнение, СрокИсполнения, КонтролирующийОрган, НеРазбиватьНаСтраницы");
		Для Каждого Строка Из Выборка.Действие.ВидыИР Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.ВидыИР.Добавить(), Строка);
		КонецЦикла;
		Для Каждого Строка Из Выборка.Действие.События Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.События.Добавить(), Строка);
		КонецЦикла;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = ''");
		СправочникОбъект.ВидОформляемогоДокумента = Справочники.бит_ум_ВидыОформляемыхДокументов.НайтиПоРеквизиту("ИмяМакета", Выборка.НовыйВидОформляемогоДокумента);
		СправочникОбъект.УстановитьНовыйКод();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
		СправочникОбъект = Выборка.Действие.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = '(старый)'");
		СправочникОбъект.ВАрхиве = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

// Вызывается при переходе на версию конфигурации 3.1.11.7.
//
Процедура ОбновлениеДействийПоСобытиям_3_1_11_7() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДействийПоСобытиям.Ссылка КАК Действие,
	|	ВидыДействийПоСобытиям.ВидОформляемогоДокумента КАК ВидОформляемогоДокумента,
	|	ВЫБОР
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОЗаключенииТрудовогоДоговора_202401""
	|			ТОГДА ""УведомлениеОЗаключенииТрудовогоДоговора_202508""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НовыйВидОформляемогоДокумента
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям КАК ВидыДействийПоСобытиям
	|ГДЕ
	|	ВидыДействийПоСобытиям.ПометкаУдаления = ЛОЖЬ
	|	И ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""УведомлениеОЗаключенииТрудовогоДоговора_202401""
	|	И ВидыДействийПоСобытиям.ВАрхиве = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.НовыйВидОформляемогоДокумента) Тогда
			Продолжить;
		КонецЕсли;
	
		СправочникОбъект = Справочники.бит_ум_ДействияПоСобытиям.СоздатьЭлемент();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка.Действие, "Наименование, КонтролироватьИсполнение, СрокИсполнения, КонтролирующийОрган, НеРазбиватьНаСтраницы");
		Для Каждого Строка Из Выборка.Действие.ВидыИР Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.ВидыИР.Добавить(), Строка);
		КонецЦикла;
		Для Каждого Строка Из Выборка.Действие.События Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.События.Добавить(), Строка);
		КонецЦикла;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = ''");
		СправочникОбъект.ВидОформляемогоДокумента = Справочники.бит_ум_ВидыОформляемыхДокументов.НайтиПоРеквизиту("ИмяМакета", Выборка.НовыйВидОформляемогоДокумента);
		СправочникОбъект.УстановитьНовыйКод();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
		СправочникОбъект = Выборка.Действие.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = '(старый)'");
		СправочникОбъект.ВАрхиве = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

// Вызывается при переходе на версию конфигурации 3.1.11.8.
//
Процедура ОбновлениеДействийПоСобытиям_3_1_11_8() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДействийПоСобытиям.Ссылка КАК Действие,
	|	ВидыДействийПоСобытиям.ВидОформляемогоДокумента КАК ВидОформляемогоДокумента,
	|	ВЫБОР
	|		КОГДА ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ХодатайствоОПривлеченииВысококвалифицированногоИнСпециалиста_202401""
	|			ТОГДА ""ХодатайствоОПривлеченииВысококвалифицированногоИнСпециалиста_202509""            
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НовыйВидОформляемогоДокумента
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям КАК ВидыДействийПоСобытиям
	|ГДЕ
	|	ВидыДействийПоСобытиям.ПометкаУдаления = ЛОЖЬ
	|	И (ВидыДействийПоСобытиям.ВидОформляемогоДокумента.ИмяМакета = ""ХодатайствоОПривлеченииВысококвалифицированногоИнСпециалиста_202401"")
	|	И ВидыДействийПоСобытиям.ВАрхиве = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.НовыйВидОформляемогоДокумента) Тогда
			Продолжить;
		КонецЕсли;
	
		СправочникОбъект = Справочники.бит_ум_ДействияПоСобытиям.СоздатьЭлемент();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка.Действие, "Наименование, КонтролироватьИсполнение, СрокИсполнения, КонтролирующийОрган, НеРазбиватьНаСтраницы");
		Для Каждого Строка Из Выборка.Действие.ВидыИР Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.ВидыИР.Добавить(), Строка);
		КонецЦикла;
		Для Каждого Строка Из Выборка.Действие.События Цикл
			ЗаполнитьЗначенияСвойств(СправочникОбъект.События.Добавить(), Строка);
		КонецЦикла;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = ''");
		СправочникОбъект.ВидОформляемогоДокумента = Справочники.бит_ум_ВидыОформляемыхДокументов.НайтиПоРеквизиту("ИмяМакета", Выборка.НовыйВидОформляемогоДокумента);
		СправочникОбъект.УстановитьНовыйКод();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
		СправочникОбъект = Выборка.Действие.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование) + " " + НСтр("ru = '(старый)'");
		СправочникОбъект.ВАрхиве = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли