#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении элемента объекта. 
// Если в процедуре ПриНастройкеНачальногоЗаполненияЭлементов свойство ПриНачальномЗаполненииЭлемента = Истина.
//
// Параметры:
//  Объект                  - Произвольный - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения.
//  ДополнительныеПараметры - Структура - Дополнительные параметры.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
    
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника бит_КомандыБотуТелеграм.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти = Неопределено) Экспорт
	
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	
	// ++ ЕРП 
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтразитьВЗакрытомПериоде";
	Элемент.Код						  = НСтр("ru = 'ОтразитьВЗакрытомПериоде'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Отразить в закрытом периоде'", КодОсновногоЯзыка);
	Элемент.ТипЗначения				  = Новый ОписаниеТипов("Булево");

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "БанковскийСчет";
	Элемент.Код						  = НСтр("ru = 'БанковскийСчет'", КодОсновногоЯзыка);
	Элемент.Наименование 			  = НСтр("ru = 'Банковский счет'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.БанковскиеСчетаКонтрагентов"));
	МассивТипов.Добавить(Тип("СправочникСсылка.БанковскиеСчетаОрганизаций"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДатаПроведенияПоБюджету";
	Элемент.Код						  = НСтр("ru = 'ДатаПроведенияПоБюджету'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Дата проведения по бюджету'", КодОсновногоЯзыка);
	Элемент.ТипЗначения				  = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДатаПроведенияМСФО";
	Элемент.Код						  = НСтр("ru = 'ДатаПроведенияМСФО'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Дата проведения по МСФО'", КодОсновногоЯзыка);
	Элемент.ТипЗначения				  = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДоговорКонтрагента";
	Элемент.Код						  = НСтр("ru = 'ДоговорКонтрагента'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Договор контрагента'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ДоговорыКонтрагентов"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Контрагент";
	Элемент.Код						  = НСтр("ru = 'Контрагент'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Контрагент'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НаправлениеДеятельности";
	Элемент.Код						  = НСтр("ru = 'НаправлениеДеятельности'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Направление деятельности'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.НаправленияДеятельности"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НеВыполнятьТрансляцию";
	Элемент.Код						  = НСтр("ru = 'НеВыполнятьТрансляцию'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Не выполнять трансляцию'", КодОсновногоЯзыка);
	Элемент.ТипЗначения 			  = Новый ОписаниеТипов("Булево");

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НеОтражатьВМСФО";
	Элемент.Код						  = НСтр("ru = 'НеОтражатьВМСФО'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Не отражать в МСФО'", КодОсновногоЯзыка);
	Элемент.ТипЗначения 			  = Новый ОписаниеТипов("Булево");

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НеОтражатьВФакте";
	Элемент.Код						  = НСтр("ru = 'НеОтражатьВФакте'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Не отражать в факте бюджета'", КодОсновногоЯзыка);
	Элемент.ТипЗначения 			  = Новый ОписаниеТипов("Булево");

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НеОтражатьВФактеТрансляция";
	Элемент.Код						  = НСтр("ru = 'НеОтражатьВФактеТрансляция'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Не отражать в факте бюджета трансляцией'", КодОсновногоЯзыка);
	Элемент.ТипЗначения				  = Новый ОписаниеТипов("Булево");

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Номенклатура";
	Элемент.Код						  = НСтр("ru = 'Номенклатура'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Номенклатура'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НоменклатурнаяГруппа";
	Элемент.Код 					  = НСтр("ru = 'НоменклатурнаяГруппа'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Номенклатурная группа'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ГруппыФинансовогоУчетаНоменклатуры"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Организации";
	Элемент.Код						  = НСтр("ru = 'Организации'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Организации (доп. аналитика)'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Организация";
	Элемент.Код						  = НСтр("ru = 'Организация'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Организация'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Проект";
	Элемент.Код						  = НСтр("ru = 'Проект'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Проект'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Проекты"));
	ОписаниеТипа 					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения 			  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПрочиеРасходы";
	Элемент.Код						  = НСтр("ru = 'ПрочиеРасходы'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Прочие расходы'", КодОсновногоЯзыка);
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ПрочиеРасходы"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СтатьиДвиженияДенежныхСредств";
	Элемент.Код						  = НСтр("ru = 'СтатьиДвиженияДенежныхСредств'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Статьи движения денежных средств'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения 			  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СтатьяДоходов";
	Элемент.Код 					  = НСтр("ru = 'СтатьяДоходов'", КодОсновногоЯзыка);
	Элемент.Наименование 			  = НСтр("ru = 'Статьи доходов'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("ПланВидовХарактеристикСсылка.СтатьиДоходов"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения 			  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СтатьяРасходов";
	Элемент.Код						  = НСтр("ru = 'СтатьиЗатрат'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Статьи расходов (статьи затрат)'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СтатьяОборотов";
	Элемент.Код						  = НСтр("ru = 'СтатьяОборотов'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Статья оборотов'", КодОсновногоЯзыка);
	МассивТипов					 	  = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.бит_СтатьиОборотов"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СтруктураПредприятия";
	Элемент.Код						  = НСтр("ru = 'СтруктураПредприятия'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Структура предприятия'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения 			  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетУчета";
	Элемент.Код						  = НСтр("ru = 'СчетУчета'", КодОсновногоЯзыка);
	Элемент.Наименование 			  = НСтр("ru = 'Счет учета'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("ПланСчетовСсылка.Хозрасчетный"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения 			  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ХозяйственнаяОперация";
	Элемент.Код						  = НСтр("ru = 'ХозяйственнаяОперация'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Хозяйственная операция'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ХозяйственныеОперации"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЦФО";
	Элемент.Код						  = НСтр("ru = 'ЦФО'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'ЦФО'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Подразделения"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СводнаяЗаявкаНаЗатраты";
	Элемент.Код						  = НСтр("ru = 'СводнаяЗаявкаНаЗатраты'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Сводная заявка на затраты'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.бит_пз_СводнаяЗаявкаНаЗатраты"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЗаявкаНаЗатраты";
	Элемент.Код 					  = НСтр("ru = 'ЗаявкаНаЗатраты'", КодОсновногоЯзыка);
	Элемент.Наименование 			  = НСтр("ru = 'Заявка на затраты'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.бит_пз_ЗаявкаНаЗатраты"));
	ОписаниеТипа 					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПрочиеДоходыИРасходы";
	Элемент.Код						  = НСтр("ru = 'ПрочиеДоходыИРасходы'", КодОсновногоЯзыка);
	Элемент.Наименование			  = НСтр("ru = 'Статьи прочих расходов'", КодОсновногоЯзыка);
	МассивТипов						  = Новый Массив;
	МассивТипов.Добавить(Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	ОписаниеТипа					  = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения				  = ОписаниеТипа;
	// -- ЕРП 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт

	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);
	
КонецПроцедуры

Процедура ЗаполнитьОрганизациюПриПереходеНаНовуюВерсию() Экспорт

	ПараметрыОбновления = ОбновлениеИнформационнойБазы.ПараметрыОбновленияПредопределенныхЭлементов();
	ПараметрыОбновления.Элементы.Добавить(ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Организации);
	ПараметрыОбновления.Элементы.Добавить(ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Организация);
	
	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта, ПараметрыОбновления);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Код процедур и функций

#КонецОбласти

#КонецЕсли