#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета.
//
// Параметры:
//   Настройки - Коллекция - настройки отчетов и вариантов отчетов конфигурации.
//   ОписаниеОтчета - СтрокаДерева
//                  - ОбъектМетаданных - описание настроек, метаданные или ссылка отчета.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПланФактныйАнализБюджетаИОстаткиПоСчетам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Позволяет выполнить сравнительный анализ оборотов и остатков по сценариям бюджетирования.'");

	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;

КонецПроцедуры

// Удалет варианты отчета.
//
Процедура УдалитьВариантыОтчета() Экспорт

	ВариантыОтчетов.УдалитьВариантОтчета("Отчет.бит_ПланФактныйАнализБюджетаИОстаткиПоСчетам", Неопределено, Неопределено);
	ВариантыОтчетов.СброситьПользовательскиеНастройки(Метаданные.Отчеты.бит_ПланФактныйАнализБюджетаИОстаткиПоСчетам);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли