#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	УстановитьЗаголовкиПолейДопИзмерений();

	ПараметрДополнятьПериод = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ДополнятьПериоды");
	бит_ОтчетыБФСервер.НастроитьДинамическийПериод(СхемаКомпоновкиДанных, КомпоновщикНастроек, ПараметрДополнятьПериод.Значение);

	// Технологический параметр для расшифровки другими отчетами. 
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ПоБюджету", Истина);

	СценарийЭталон = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "СценарийЭталон").Значение;	
	Сценарий 	   = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Сценарий").Значение;	

	ЗаголовокЭталон = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ЗаголовокЭталон").Значение;
	Если ПустаяСтрока(ЗаголовокЭталон) Тогда
		ЗаголовокЭталон = Строка(СценарийЭталон);
	КонецЕсли;
	
	ЗаголовокСравнение = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ЗаголовокСравниваемый").Значение;
	Если ПустаяСтрока(ЗаголовокСравнение) Тогда
		ЗаголовокСравнение = Строка(Сценарий);
	КонецЕсли;
	
	ПараметрСумма	 	  = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ВыводитьСумму");
	ПараметрКоличество 	  = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ВыводитьКоличество");
	ПараметрАбсОтклонение = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ВыводитьАбсОтклонение");
	ПараметрОтнОтклонение = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ВыводитьОтнОтклонение");
	ПараметрНарастИтог	  = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "НарастающийИтог");
	
	ПараметрыОтчета = Новый Структура; 
	ПараметрыОтчета.Вставить("ЗаголовокСравнение", ЗаголовокСравнение);
	ПараметрыОтчета.Вставить("ЗаголовокЭталон",	   ЗаголовокЭталон);
	ПараметрыОтчета.Вставить("Сумма", 	 	   	   ПараметрСумма.Значение);
	ПараметрыОтчета.Вставить("Количество", 	 	   ПараметрКоличество.Значение);
	ПараметрыОтчета.Вставить("АбсОтклонение", 	   ПараметрАбсОтклонение.Значение);
	ПараметрыОтчета.Вставить("ОтнОтклонение", 	   ПараметрОтнОтклонение.Значение);
	ПараметрыОтчета.Вставить("НарастающийИтог",    ПараметрНарастИтог.Значение);
	
	ПоказателиОтчета = ПоказателиОтчета(ПараметрыОтчета);
	
	// В процессе эксплуатации выяснилось, что пользователи расширяют состав таблиц копированием.
	// Что бы заголовки полей были одинаковыми получим все таблицы отчета. 
	ВсеТаблицы = ВсеТаблицы();
	
	Для каждого Таблица Из ВсеТаблицы Цикл
		бит_ОтчетыБФСервер.НастроитьПоляВыбора(ПоказателиОтчета, Таблица.Выбор.Элементы);
	КонецЦикла;
	
	// Подготовка расшифровки этого же отчета, выполненная средствами платформы.
	Если КомпоновщикНастроек.Настройки.Структура.Количество() <> 0 Тогда
		НовыеНастройкиКД = КомпоновщикНастроек.Настройки;
		ПервыйЭлемент 	 = НовыеНастройкиКД.Структура[0];
		ПервыйЭлементДетальныеЗаписи = 
			(ТипЗнч(ПервыйЭлемент) = Тип("ГруппировкаКомпоновкиДанных") И ПервыйЭлемент.ПоляГруппировки.Элементы.Количество() = 0);
		
		Если НЕ ПервыйЭлементДетальныеЗаписи Тогда
			ДетальныеЗаписи = НовыеНастройкиКД.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			
			Если ТипЗнч(ПервыйЭлемент) = Тип("ТаблицаКомпоновкиДанных") Тогда
				Группировка = ДетальныеЗаписи.Структура.Добавить(Тип("ТаблицаКомпоновкиДанных"));
				Группировка.Выбор.Элементы.Очистить();
			Иначе
				Группировка = ДетальныеЗаписи.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
				Группировка.Выбор.Элементы.Очистить();
				Группировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			КонецЕсли;
			
			бит_ОтчетыБФКлиентСервер.СкопироватьНастройкиКомпоновкиДанных(Группировка, ПервыйЭлемент);
			НовыеНастройкиКД.Структура.Удалить(ПервыйЭлемент);
			
			ДобавитьРесурсыОбороты(Группировка, ЗаголовокЭталон, ЗаголовокСравнение);
			бит_ОтчетыБФСервер.НастроитьПоляВыбора(ПоказателиОтчета, Группировка.Выбор.Элементы);
		КонецЕсли;
	КонецЕсли;
	
	// Виды субконто
	МаксКоличествоСубконто = Метаданные.ПланыСчетов.бит_Бюджетирование.МаксКоличествоСубконто;
	КоличествоСубконто	   = 0;

	ПараметрВидСубконто = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ВидСубконто");
	Если ПараметрВидСубконто <> Неопределено И  ПараметрВидСубконто.Использование Тогда
		
		Если ТипЗнч(ПараметрВидСубконто.Значение) = Тип("ПланВидовХарактеристикСсылка.бит_ВидыСубконтоБюджетирования") Тогда
			КоличествоСубконто = 1;
		ИначеЕсли ТипЗнч(ПараметрВидСубконто.Значение) = Тип("СписокЗначений") Тогда
			КоличествоСубконто = ПараметрВидСубконто.Значение.Количество();
		КонецЕсли;
		
		Если КоличествоСубконто < МаксКоличествоСубконто Тогда 
			ГруппировкаСубконто = Неопределено;
			НайтиГруппировкуПоПолю(КомпоновщикНастроек.Настройки.Структура, "Субконто" + (КоличествоСубконто + 1), ГруппировкаСубконто); 
			
			Если ГруппировкаСубконто <> Неопределено Тогда
				ГруппировкаСубконто.Использование = Ложь;
				Ид = КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(ГруппировкаСубконто);
				ПользовательскаяГруппировка = КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьОбъектПоИдентификатору(Ид);
				Если ПользовательскаяГруппировка <> Неопределено Тогда
					ПользовательскаяГруппировка.Использование = Ложь;
					КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
				КонецЕсли;
				
				ОсновнойНаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Результат;
				Если ТипЗнч(ОсновнойНаборДанных) = Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных") Тогда
					ТекстЗапросаОстатки = ОсновнойНаборДанных.Элементы.Найти("Остатки").Запрос;
					Для НомерСубконто = КоличествоСубконто + 1 По МаксКоличествоСубконто Цикл
						ТекстСубконто 		= ".Субконто" + НомерСубконто + " КАК Субконто" + НомерСубконто + "," + Символы.ПС;
						ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапросаОстатки, "ОстаткиИОбороты" + ТекстСубконто, "");
					КонецЦикла;
					ОсновнойНаборДанных.Элементы.Найти("Остатки").Запрос = ТекстЗапросаОстатки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ДокументРезультат.Очистить(); //КомпоновщикНастроек.ФиксированныеНастройки.ДополнительныеСвойства.РежимРасшифровки = истина
	
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета 		  = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 		  = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Параметр = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Бюджет");
	Если НЕ ЗначениеЗаполнено(Параметр.Значение) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,НСтр("ru = 'Бюджет'"));	
	    ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриОпределенииСвойствЭлементовФормыНастроек = Истина;

КонецПроцедуры

Процедура ПриОпределенииСвойствЭлементовФормыНастроек(ТипФормы, СвойстваЭлементов, ПользовательскиеНастройки) Экспорт 
	Если ТипФормы <> ТипФормыОтчета.Основная Тогда 
		Возврат;
	КонецЕсли;
	
	СвойстваГруппы = ОтчетыСервер.СвойстваГруппыЭлементовФормы();
	СвойстваГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СвойстваЭлементов.Группы.Вставить("ФиксированныеПараметры", СвойстваГруппы);
	
	ФиксированныеПараметры = Новый Структура("Период, Бюджет");
	ШиринаПоля = Новый Структура("Бюджет", 25);
	
	Для Каждого ЭлементНастройки Из ПользовательскиеНастройки Цикл 
		Если ТипЗнч(ЭлементНастройки) <> Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			Или Не ФиксированныеПараметры.Свойство(ЭлементНастройки.Параметр) Тогда 
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля = СвойстваЭлементов.Поля.Найти(
			ЭлементНастройки.ИдентификаторПользовательскойНастройки, "ИдентификаторНастройки");
		
		Если СвойстваПоля = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля.ИдентификаторГруппы = "ФиксированныеПараметры";
		
		ИмяПараметра = Строка(ЭлементНастройки.Параметр);
		Если ИмяПараметра <> "Период" Тогда 
			СвойстваПоля.Ширина = ШиринаПоля[ИмяПараметра];
			СвойстваПоля.РастягиватьПоГоризонтали = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПоказателиОтчета(ПараметрыОтчета)

	ЗаголовокСравнение = ПараметрыОтчета.ЗаголовокСравнение;
	ЗаголовокЭталон	   = ПараметрыОтчета.ЗаголовокЭталон;
	ЗаголовокАбс	   = НСтр("ru = 'Отклонение'");
	ЗаголовокОтн	   = НСтр("ru = 'Отклонение (%)'"); 
	Сумма			   = ПараметрыОтчета.Сумма;
	Количество 		   = ПараметрыОтчета.Количество;
	АбсОтклонение 	   = ПараметрыОтчета.АбсОтклонение;
	ОтнОтклонение	   = ПараметрыОтчета.ОтнОтклонение;
	НарастающийИтог	   = ПараметрыОтчета.НарастающийИтог;
	
	ЗаголовокЭталонНарастИтог 	 = ЗаголовокЭталон	  + " " + НСтр("ru = '(нараст. итог)'");
	ЗаголовокСравнениеНарастИтог = ЗаголовокСравнение + " " + НСтр("ru = '(нараст. итог)'");
	
	Если НЕ Сумма И НЕ Количество Тогда
		// Если не выбрано ничего, выведем Сумму.
		Сумма = Истина;
	КонецЕсли;
	
	// Обороты.
	ПоказателиОтчета = Новый Структура;
	ПоказателиОтчета.Вставить("СуммаЭталон", 	  Новый Структура("Использование, Заголовок", Сумма, ЗаголовокЭталон));
	ПоказателиОтчета.Вставить("Сумма", 		 	  Новый Структура("Использование, Заголовок", Сумма, ЗаголовокСравнение));
	ПоказателиОтчета.Вставить("СуммаАбс",    	  Новый Структура("Использование, Заголовок", Сумма И АбсОтклонение, ЗаголовокАбс));
	ПоказателиОтчета.Вставить("СуммаОтн",   	  Новый Структура("Использование, Заголовок", Сумма И ОтнОтклонение, ЗаголовокОтн));
	ПоказателиОтчета.Вставить("СуммаЭталонИтоги", Новый Структура("Использование, Заголовок", Сумма И НарастающийИтог, ЗаголовокЭталонНарастИтог));
	ПоказателиОтчета.Вставить("СуммаИтоги", 	  Новый Структура("Использование, Заголовок", Сумма И НарастающийИтог, ЗаголовокСравнениеНарастИтог));

	ПоказателиОтчета.Вставить("КоличествоЭталон", Новый Структура("Использование, Заголовок", Количество, ЗаголовокЭталон));
	ПоказателиОтчета.Вставить("Количество", 	  Новый Структура("Использование, Заголовок", Количество, ЗаголовокСравнение));
	ПоказателиОтчета.Вставить("КоличествоАбс", 	  Новый Структура("Использование, Заголовок", Количество И АбсОтклонение, ЗаголовокАбс));
	ПоказателиОтчета.Вставить("КоличествоОтн", 	  Новый Структура("Использование, Заголовок", Количество И ОтнОтклонение, ЗаголовокОтн));
	ПоказателиОтчета.Вставить("КоличествоЭталонИтоги", Новый Структура("Использование, Заголовок", Количество И НарастающийИтог, ЗаголовокЭталонНарастИтог));
	ПоказателиОтчета.Вставить("КоличествоИтоги", 	  Новый Структура("Использование, Заголовок", Количество И НарастающийИтог, ЗаголовокСравнениеНарастИтог));

	// Нач. остаток.
	ПоказателиОтчета.Вставить("СуммаНачальныйОстатокЭталон", Новый Структура("Использование, Заголовок", Сумма, ЗаголовокЭталон));
	ПоказателиОтчета.Вставить("СуммаНачальныйОстаток", 		 Новый Структура("Использование, Заголовок", Сумма, ЗаголовокСравнение));
	ПоказателиОтчета.Вставить("СуммаНачальныйОстатокАбс",    Новый Структура("Использование, Заголовок", Сумма И АбсОтклонение, ЗаголовокАбс));
	ПоказателиОтчета.Вставить("СуммаНачальныйОстатокОтн",    Новый Структура("Использование, Заголовок", Сумма И ОтнОтклонение, ЗаголовокОтн));

	ПоказателиОтчета.Вставить("КоличествоНачальныйОстатокЭталон", Новый Структура("Использование, Заголовок", Количество, ЗаголовокЭталон));
	ПоказателиОтчета.Вставить("КоличествоНачальныйОстаток", 	  Новый Структура("Использование, Заголовок", Количество, ЗаголовокСравнение));
	ПоказателиОтчета.Вставить("КоличествоНачальныйОстатокАбс", 	  Новый Структура("Использование, Заголовок", Количество И АбсОтклонение, ЗаголовокАбс));
	ПоказателиОтчета.Вставить("КоличествоНачальныйОстатокОтн", 	  Новый Структура("Использование, Заголовок", Количество И ОтнОтклонение, ЗаголовокОтн));

	// Кон. остаток.
	ПоказателиОтчета.Вставить("СуммаКонечныйОстатокЭталон", Новый Структура("Использование, Заголовок", Сумма, ЗаголовокЭталон));
	ПоказателиОтчета.Вставить("СуммаКонечныйОстаток", 		Новый Структура("Использование, Заголовок", Сумма, ЗаголовокСравнение));
	ПоказателиОтчета.Вставить("СуммаКонечныйОстатокАбс",    Новый Структура("Использование, Заголовок", Сумма И АбсОтклонение, ЗаголовокАбс));
	ПоказателиОтчета.Вставить("СуммаКонечныйОстатокОтн",    Новый Структура("Использование, Заголовок", Сумма И ОтнОтклонение, ЗаголовокОтн));

	ПоказателиОтчета.Вставить("КоличествоКонечныйОстатокЭталон", Новый Структура("Использование, Заголовок", Количество, ЗаголовокЭталон));
	ПоказателиОтчета.Вставить("КоличествоКонечныйОстаток", 	  	 Новый Структура("Использование, Заголовок", Количество, ЗаголовокСравнение));
	ПоказателиОтчета.Вставить("КоличествоКонечныйОстатокАбс", 	 Новый Структура("Использование, Заголовок", Количество И АбсОтклонение, ЗаголовокАбс));
	ПоказателиОтчета.Вставить("КоличествоКонечныйОстатокОтн", 	 Новый Структура("Использование, Заголовок", Количество И ОтнОтклонение, ЗаголовокОтн));
	
	Возврат ПоказателиОтчета;
	
КонецФункции

Процедура ДобавитьРесурсыОбороты(ТаблицаОбороты, ЗаголовокЭталон, ЗаголовокСравнение)
  
	ГруппаПолей = ТаблицаОбороты.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаПолей.Заголовок = НСтр("ru = 'Сумма'");
	бит_ОтчетыБФКлиентСервер.ДобавитьВыбранноеПоле(ГруппаПолей, "СуммаЭталон",   ЗаголовокЭталон);
	бит_ОтчетыБФКлиентСервер.ДобавитьВыбранноеПоле(ГруппаПолей, "Сумма",     ЗаголовокСравнение);
	бит_ОтчетыБФКлиентСервер.ДобавитьВыбранноеПоле(ГруппаПолей, "СуммаАбс",   НСтр("ru = 'Отклонение'"));
	бит_ОтчетыБФКлиентСервер.ДобавитьВыбранноеПоле(ГруппаПолей, "СуммаОтн",   НСтр("ru = 'Отклонение (%)'"));
	
	ГруппаПолей = ТаблицаОбороты.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаПолей.Заголовок = НСтр("ru = 'Количество'");
	бит_ОтчетыБФКлиентСервер.ДобавитьВыбранноеПоле(ГруппаПолей, "КоличествоЭталон", ЗаголовокЭталон);
	бит_ОтчетыБФКлиентСервер.ДобавитьВыбранноеПоле(ГруппаПолей, "Количество",     ЗаголовокСравнение);
	бит_ОтчетыБФКлиентСервер.ДобавитьВыбранноеПоле(ГруппаПолей, "КоличествоАбс",   НСтр("ru = 'Отклонение'"));
	бит_ОтчетыБФКлиентСервер.ДобавитьВыбранноеПоле(ГруппаПолей, "КоличествоОтн",   НСтр("ru = 'Отклонение (%)'"));
	
КонецПроцедуры

Процедура УстановитьЗаголовкиПолейДопИзмерений()
	
	Префиксы = Новый Массив; 
	Префиксы.Добавить("Остатки");
	Префиксы.Добавить("Обороты");
	
	бит_МеханизмДопИзмерений.НастроитьПоляДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, "Результат", , Префиксы);
	
КонецПроцедуры

Функция ВсеТаблицы()
	
	ВсеТаблицы = Новый Массив;

	// Поиск данных в дереве без рекурсии.
	Стек = Новый Массив; 
	Для каждого ЭлементСтруктуры Из КомпоновщикНастроек.Настройки.Структура Цикл
		
		Стек.Добавить(ЭлементСтруктуры);
	
		Пока Стек.Количество() > 0 Цикл
			
			ТекущийОбъект = Стек.Получить(Стек.ВГраница());
			Стек.Удалить(Стек.ВГраница());
			
			Если ТипЗнч(ТекущийОбъект) = Тип("ТаблицаКомпоновкиДанных") Тогда
				ВсеТаблицы.Добавить(ТекущийОбъект);
			ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") Тогда
				Для каждого Элемент Из ТекущийОбъект.Структура Цикл
					Стек.Добавить(Элемент);
				КонецЦикла; 
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
	Возврат ВсеТаблицы;
	
КонецФункции

Процедура НайтиГруппировкуПоПолю(Группировки, ИмяПоля, НайденнаяГруппировка)
	
	Для каждого Группировка Из Группировки Цикл
		Если ТипЗнч(Группировка) = Тип("ТаблицаКомпоновкиДанных") Тогда
			
			НайтиГруппировкуПоПолю(Группировка.Строки, ИмяПоля, НайденнаяГруппировка);
			Если НайденнаяГруппировка <> Неопределено Тогда
				Возврат;
			КонецЕсли;
			НайтиГруппировкуПоПолю(Группировка.Колонки, ИмяПоля, НайденнаяГруппировка);
			Если НайденнаяГруппировка <> Неопределено Тогда
				Возврат;
			КонецЕсли; 
			
		ИначеЕсли ТипЗнч(Группировка) = Тип("ГруппировкаКомпоновкиДанных") Тогда
			
			Если Группировка.ПоляГруппировки.Элементы.Количество() 
				И Группировка.ПоляГруппировки.Элементы[0].Поле = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
				НайденнаяГруппировка = Группировка;
				Возврат;
			КонецЕсли;
			
			НайтиГруппировкуПоПолю(Группировка.Структура, ИмяПоля, НайденнаяГруппировка);
			
			Если НайденнаяГруппировка <> Неопределено Тогда
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

УстановитьЗаголовкиПолейДопИзмерений();

#КонецОбласти

#КонецЕсли
