
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Обработки.бит_СводныйБюджет.ФормироватьВРазрезеБюджета(ЭтотОбъект.ВариантВывода) Тогда
		ПроверяемыеРеквизиты.Добавить("ОтборБюджет");
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'; en = 'Invalid call of the object on the client.'");
#КонецЕсли