
&ИзменениеИКонтроль("ФизическиеЛицаПриЗаписиНаСервере")
Процедура УВМ_ФизическиеЛицаПриЗаписиНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ДополнительныеСвойства = Новый Структура;

	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ПропускатьПроверкуРегулярнойОтправки") Тогда
		ДополнительныеСвойства.Вставить("ПропускатьПроверкуРегулярнойОтправки", ТекущийОбъект.ДополнительныеСвойства["ПропускатьПроверкуРегулярнойОтправки"]);
	КонецЕсли;

	ДоступноДобавлениеИзменениеДанныхФизическихЛиц = Пользователи.РолиДоступны("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры");

	Если Форма.СозданиеНового Тогда

		ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);

		ГражданствоПоУмолчанию =
		НЕ ДоступноДобавлениеИзменениеДанныхФизическихЛиц ИЛИ Форма.ГражданствоФизическихЛиц.Период = ЗарплатаКадрыКлиентСервер.ДатаОтсчетаПериодическихСведений();

		СотрудникиФормы.ЗаписатьЗначенияПоУмолчанию(Форма.ФизическоеЛицоСсылка, ГражданствоПоУмолчанию);

	КонецЕсли;

	СотрудникиФормы.ЛичныеДанныеФизическогоЛицаПриЗаписи(Форма, Форма.ФизическоеЛицоСсылка);
	Если ДоступноДобавлениеИзменениеДанныхФизическихЛиц Тогда

		РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(
		Форма,
		"ГражданствоФизическихЛиц",
		Форма.ФизическоеЛицоСсылка,
		,
		ДополнительныеСвойства);
		
		#Вставка
		//+dar 20221128 (11805)
		ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
		//-dar 20221128 (11805)
		#КонецВставки
		
		РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФормеПоСтруктуре(
		Форма,
		"ДокументыФизическихЛиц",
		Новый Структура("Физлицо", Форма.ФизическоеЛицоСсылка),
		,
		ДополнительныеСвойства);

	КонецЕсли;

КонецПроцедуры
