
&НаКлиенте
&ИзменениеИКонтроль("ВыполнитьРасчетНачислений")
Процедура УВМ_ВыполнитьРасчетНачислений()

    #Вставка
	//++dar 10.04.23 (99225) выводим кадровикам инфу об ученических договорах
	Если НЕ РегистрацияНачисленийДоступна Тогда
		ОбучениеРазвитиеВызовСервера.УведомитьОбОбязательствахСотрудниковПоУченическимДоговорамСервер(Объект.ФизическоеЛицо, Объект.Организация, Объект.ДатаУвольнения);
	КонецЕсли;
	//--dar 10.04.23 (99225)
	#КонецВставки
	
	Если Не ИспользуетсяРасчетЗарплаты Тогда
		Возврат;
	КонецЕсли;

	ЗарплатаКадрыРасширенныйКлиент.ПодключитьОбработчикОжиданияАвтоматическогоРасчета(
	ЭтотОбъект, РегистрацияНачисленийДоступна, "РассчитатьНачисленияНаКлиенте", , "ОчиститьРассчитанныеДанныеНаКлиенте");

	ПодключитьОбработчикОжиданияФормы("РассчитатьНачисленияНаКлиенте", Ложь);

КонецПроцедуры

&НаСервере
Процедура УВМ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++dar 08.11.23 (146623)
	СвойстваФактическаяПричинаУвольнения = Новый Структура;
	СвойстваФактическаяПричинаУвольнения.Вставить("МногострочныйРежим", Истина);
	УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_ФактическаяПричинаУвольнения", Элементы.Дополнительно, Истина,,,,СвойстваФактическаяПричинаУвольнения);
	УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_КатегорияПричиныУвольнения", Элементы.Дополнительно, Истина);
	//--dar 08.11.23 (146623)
	
	//++dar 25.06.25 (255715)
	Если Объект.Дата >= УВМ_КэшированиеЗначений.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_Руководитель", "УсловияУвольнения", Истина, , , "ИО сотрудника");
	КонецЕсли;
	//--dar 25.06.25 (255715)
	
КонецПроцедуры
