
&ИзменениеИКонтроль("ОбъявитьПространстваИмен")
Процедура УВМ_ОбъявитьПространстваИмен(ФайлОбмена, Знач КомпонентыОбмена)

	ФайлОбмена.ЗаписатьСоответствиеПространстваИмен("", КомпонентыОбмена.XMLСхема);

	Счетчик = 1;
	ИспользованныеПсевдонимы = Новый Структура;
	#Вставка
	//++dar 16.01.25 (304514)
	лРасширенияФормата = Новый Соответствие;
	Для Каждого ПространствоИмен Из КомпонентыОбмена.РасширенияФормата Цикл
		лРасширенияФормата.Вставить(ПространствоИмен.Ключ, ПространствоИмен.Значение);
		лЗначение = лРасширенияФормата.Получить(ПространствоИмен.Ключ);
		
		Если ПустаяСтрока(ПространствоИмен.Значение) 
			Или ИспользованныеПсевдонимы.Свойство(ПространствоИмен.Значение) Тогда
			
			лЗначение = СтрЗаменить("ex%1", "%1", XMLСтрока(Счетчик));
			лРасширенияФормата.Вставить(ПространствоИмен.Ключ, лЗначение);
			//ПространствоИмен.Значение = СтрЗаменить("ex%1", "%1", XMLСтрока(Счетчик));

			Счетчик = Счетчик + 1;
		КонецЕсли;

		//ФайлОбмена.ЗаписатьСоответствиеПространстваИмен(ПространствоИмен.Значение, ПространствоИмен.Ключ);
		ФайлОбмена.ЗаписатьСоответствиеПространстваИмен(лЗначение, ПространствоИмен.Ключ);

		//ИспользованныеПсевдонимы.Вставить(ПространствоИмен.Значение);
		ИспользованныеПсевдонимы.Вставить(лЗначение);
	КонецЦикла;
	
	//обновляем расширения формата
	КомпонентыОбмена.РасширенияФормата.Очистить();
	Для Каждого лПространствоИмен Из лРасширенияФормата Цикл
		КомпонентыОбмена.РасширенияФормата.Вставить(лПространствоИмен.Ключ, лПространствоИмен.Значение);
	КонецЦикла;
	//--dar 16.01.25 (304514)
	#КонецВставки
	#Удаление
	Для Каждого ПространствоИмен Из КомпонентыОбмена.РасширенияФормата Цикл
		Если ПустаяСтрока(ПространствоИмен.Значение) 
			Или ИспользованныеПсевдонимы.Свойство(ПространствоИмен.Значение) Тогда

			ПространствоИмен.Значение = СтрЗаменить("ex%1", "%1", XMLСтрока(Счетчик));

			Счетчик = Счетчик + 1;
		КонецЕсли;

		ФайлОбмена.ЗаписатьСоответствиеПространстваИмен(ПространствоИмен.Значение, ПространствоИмен.Ключ);

		ИспользованныеПсевдонимы.Вставить(ПространствоИмен.Значение);
	КонецЦикла;
	#КонецУдаления

КонецПроцедуры
