#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	ИмяПараметра = "";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ (ТипЗначения.СодержитТип(Тип("Строка")) И ТипЗначения.Типы().Количество() = 1) Тогда
		ПолеАдреса = Ложь;
	КонецЕсли;
	
	Автозаполнение = ТипЗначения.Типы().Количество() = 1 И ТипЗначения.СодержитТип(Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ (ТипЗначения.Типы().Количество() = 1 И ТипЗначения.СодержитТип(Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"))) Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
			ПроверяемыеРеквизиты,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Свойство"));
	КонецЕсли;
	            
	Если НЕ СтроковыеФункцииКлиентСерверРФ.ТолькоКириллицаВСтроке(ИмяПараметра, Истина, "0123456789") Тогда
		ТекстСообщения = НСтр("ru = 'Имя параметра может содержать только буквы и цифры.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ИмяПараметра", , Отказ);
	КонецЕсли;
	
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Лев(ИмяПараметра, 1)) Тогда
		ТекстСообщения = НСтр("ru = 'Имя параметра не может начинаться с цифры.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ИмяПараметра", , Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ИмяПараметра", ИмяПараметра);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеПараметрыПечати.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати КАК ДополнительныеПараметрыПечати
		|ГДЕ
		|	ДополнительныеПараметрыПечати.Ссылка <> &Ссылка
		|	И ДополнительныеПараметрыПечати.ИмяПараметра = &ИмяПараметра";
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			ТекстСообщения = НСтр("ru = 'Такое имя параметра уже используется.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ИмяПараметра", , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗначения.Типы().Количество() > 1 Тогда
		ТекстСообщения = НСтр("ru = 'Нужно выбрать один тип значения.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ТипЗначения", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли