
&ИзменениеИКонтроль("ВывестиНаПечатьТ6")
Процедура УВМ_ВывестиНаПечатьТ6(ПараметрыПечати, ДокументРезультат, ДанныеСсылок, МакетПечатнойФормы, ИдентификаторыМакета, ОбъектыПечати)

	ДокументРезультат.КлючПараметровПечати = "ПараметрыПечати_ПриказОПредоставленииОтпуска";

	Для Каждого ДанныеСотрудников Из ДанныеСсылок Цикл

		ПерваяСтрокаПечатнойФормы = ДокументРезультат.ВысотаТаблицы + 1;

		Для Каждого ДанныеНаПечать Из ДанныеСотрудников.Строки Цикл

			Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;

			НомерСтрокиНачалаОбласти = ДокументРезультат.ВысотаТаблицы + 1;

			ДатаНачалаВсего = ?(ЗначениеЗаполнено(ДанныеНаПечать.СсылкаНаОбъектДатаНачалаОсновногоОтпуска), ДанныеНаПечать.СсылкаНаОбъектДатаНачалаОсновногоОтпуска, '00010101');
			Если Не ЗначениеЗаполнено(ДатаНачалаВсего) 
				И ДанныеНаПечать.СсылкаНаОбъектДанныеОтпусковОсновной = Истина
				И ЗначениеЗаполнено(ДанныеНаПечать.СсылкаНаОбъектДанныеОтпусковДатаНачала) Тогда 
				ДатаНачалаВсего = ДанныеНаПечать.СсылкаНаОбъектДанныеОтпусковДатаНачала;
			КонецЕсли;

			ДатаОкончанияВсего = ?(ЗначениеЗаполнено(ДанныеНаПечать.СсылкаНаОбъектДатаОкончанияОсновногоОтпуска), ДанныеНаПечать.СсылкаНаОбъектДатаОкончанияОсновногоОтпуска, '00010101');
			Если Не ЗначениеЗаполнено(ДатаОкончанияВсего) 
				И ДанныеНаПечать.СсылкаНаОбъектДанныеОтпусковОсновной = Истина
				И ЗначениеЗаполнено(ДанныеНаПечать.СсылкаНаОбъектДанныеОтпусковДатаОкончания) Тогда 
				ДатаОкончанияВсего = ДанныеНаПечать.СсылкаНаОбъектДанныеОтпусковДатаОкончания;
			КонецЕсли;

			СсылкаНаОбъектДанныеОтпусковОснование = "";
			ОснованиеОтпусков = Новый Структура("СсылкаНаОбъектДанныеОтпусковОснование");
			ЗаполнитьЗначенияСвойств(ОснованиеОтпусков, ДанныеНаПечать); 
			Если ЗначениеЗаполнено(ОснованиеОтпусков["СсылкаНаОбъектДанныеОтпусковОснование"]) Тогда 
				СсылкаНаОбъектДанныеОтпусковОснование = ОснованиеОтпусков["СсылкаНаОбъектДанныеОтпусковОснование"];
			КонецЕсли;

			Если ДанныеНаПечать.Строки.Количество() = 0 Тогда

				ДанныеВычисляемыеНаХоду = Новый Структура;
				ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектДанныеОтпусковВидОтпускаНаименованиеОтпускаНаПечать");
				ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектДанныеОтпусковПродолжительность");
				ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектДанныеОтпусковДатаНачалаНаПечать", ЗарплатаКадрыОтчеты.ФорматДатыЧислоВКавычкахМесяцПрописью('00010101'));
				ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектДанныеОтпусковДатаОкончанияНаПечать", ЗарплатаКадрыОтчеты.ФорматДатыЧислоВКавычкахМесяцПрописью('00010101'));
				ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектПродолжительностьВсего", ДанныеНаПечать.СсылкаНаОбъектПродолжительностьОсновногоОтпуска);
				ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектДатаНачалаВсегоНаПечать", ДанныеНаПечать.СсылкаНаОбъектДатаНачалаОсновногоОтпускаНаПечать);
				ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектДатаОкончанияВсегоНаПечать", ДанныеНаПечать.СсылкаНаОбъектДатаОкончанияОсновногоОтпускаНаПечать);

				Если Не ЗначениеЗаполнено(ДанныеНаПечать.СсылкаНаОбъектОснование) Тогда 
					ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектОснование", СсылкаНаОбъектДанныеОтпусковОснование);
				КонецЕсли;

				ДанныеПользовательскихПолей = ЗарплатаКадрыОтчеты.ЗначенияЗаполненияПользовательскихПолей(ИдентификаторыМакета, ДанныеНаПечать);

				ЗарплатаКадрыОтчеты.ВывестиВДокументРезультатОбластиМакета(
				ДокументРезультат, МакетПечатнойФормы, "Шапка,Работник,Подвал",
				ДанныеНаПечать,
				ДанныеПользовательскихПолей,
				ДанныеВычисляемыеНаХоду);

			Иначе

				ДанныеВычисляемыеНаХоду = Новый Структура;
				Если Не ЗначениеЗаполнено(ДанныеНаПечать.СсылкаНаОбъектОснование) Тогда 
					ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектОснование", СсылкаНаОбъектДанныеОтпусковОснование);
				КонецЕсли;

				Для Каждого ДанныеДетальныхЗаписей Из ДанныеНаПечать.Строки Цикл

					Если Не ЗначениеЗаполнено(ДатаНачалаВсего)
						Или ЗначениеЗаполнено(ДанныеДетальныхЗаписей.СсылкаНаОбъектДанныеОтпусковДатаНачала)
						И ДатаНачалаВсего > ДанныеДетальныхЗаписей.СсылкаНаОбъектДанныеОтпусковДатаНачала Тогда

						ДатаНачалаВсего = ДанныеДетальныхЗаписей.СсылкаНаОбъектДанныеОтпусковДатаНачала;

					КонецЕсли;

					Если ЗначениеЗаполнено(ДанныеДетальныхЗаписей.СсылкаНаОбъектДанныеОтпусковДатаОкончания)
						И ДатаОкончанияВсего < ДанныеДетальныхЗаписей.СсылкаНаОбъектДанныеОтпусковДатаОкончания Тогда

						ДатаОкончанияВсего = ДанныеДетальныхЗаписей.СсылкаНаОбъектДанныеОтпусковДатаОкончания;

					КонецЕсли;

					Если Не ЗначениеЗаполнено(ДанныеНаПечать.СсылкаНаОбъектПродолжительностьОсновногоОтпуска) Тогда

						Если ДанныеНаПечать.СсылкаНаОбъектНачалоПериодаЗаКоторыйПредоставляетсяОтпускНаПечать <>
							ДанныеНаПечать.СсылкаНаОбъектДанныеОтпусковНачалоПериодаЗаКоторыйПредоставляетсяОтпускНаПечать Тогда

							ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектНачалоПериодаЗаКоторыйПредоставляетсяОтпускНаПечать",
							ДанныеНаПечать.СсылкаНаОбъектДанныеОтпусковНачалоПериодаЗаКоторыйПредоставляетсяОтпускНаПечать);

							ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектКонецПериодаЗаКоторыйПредоставляетсяОтпускНаПечать",
							ДанныеНаПечать.СсылкаНаОбъектДанныеОтпусковКонецПериодаЗаКоторыйПредоставляетсяОтпускНаПечать);

						КонецЕсли;

						Если ЗначениеЗаполнено(СсылкаНаОбъектДанныеОтпусковОснование) Тогда
							ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектОснование", СсылкаНаОбъектДанныеОтпусковОснование);
						КонецЕсли;

					КонецЕсли;

				КонецЦикла;

				ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектДатаНачалаВсегоНаПечать", ЗарплатаКадрыОтчеты.ФорматДатыЧислоВКавычкахМесяцПрописью(ДатаНачалаВсего));
				ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектДатаОкончанияВсегоНаПечать", ЗарплатаКадрыОтчеты.ФорматДатыЧислоВКавычкахМесяцПрописью(ДатаОкончанияВсего));
				ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектПродолжительностьОсновногоОтпуска", ДанныеНаПечать.СсылкаНаОбъектПродолжительностьОсновногоОтпуска);
				ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектДатаНачалаОсновногоОтпускаНаПечать", ДанныеНаПечать.СсылкаНаОбъектДатаНачалаОсновногоОтпускаНаПечать);
				ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектДатаОкончанияОсновногоОтпускаНаПечать", ДанныеНаПечать.СсылкаНаОбъектДатаОкончанияОсновногоОтпускаНаПечать);

				Если ЗначениеЗаполнено(ДанныеНаПечать.СсылкаНаОбъектПродолжительностьОсновногоОтпуска) Тогда
					ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектНачалоПериодаЗаКоторыйПредоставляетсяОтпускНаПечать", ДанныеНаПечать.СсылкаНаОбъектНачалоПериодаЗаКоторыйПредоставляетсяОтпускНаПечать);
					ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектКонецПериодаЗаКоторыйПредоставляетсяОтпускНаПечать", ДанныеНаПечать.СсылкаНаОбъектКонецПериодаЗаКоторыйПредоставляетсяОтпускНаПечать);
				КонецЕсли;

				Если ЗначениеЗаполнено(ДанныеНаПечать.СсылкаНаОбъектПродолжительностьДополнительныхОтпусков) Тогда
					ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектПродолжительностьВсего", ДанныеНаПечать.СсылкаНаОбъектПродолжительностьОсновногоОтпуска + ДанныеНаПечать.СсылкаНаОбъектПродолжительностьДополнительныхОтпусков);
				Иначе
					ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектПродолжительностьВсего", ДанныеНаПечать.СсылкаНаОбъектПродолжительностьОсновногоОтпуска);
				КонецЕсли;

				ВыводитьРасшифровку = ДанныеНаПечать.Строки.Количество() > 1;
				Если Не ВыводитьРасшифровку
					И ДанныеНаПечать.Строки.Количество() = 1
					И ЗначениеЗаполнено(ДанныеНаПечать.СсылкаНаОбъектПродолжительностьОсновногоОтпуска) Тогда
					ВыводитьРасшифровку = ДанныеНаПечать.Строки[0].СсылкаНаОбъектДанныеОтпусковВидОтпускаОтпускЯвляетсяЕжегодным;
				КонецЕсли;

				Если ВыводитьРасшифровку Тогда

					ДокументРезультатПриложений = Новый ТабличныйДокумент;

					ЗарплатаКадрыОтчеты.ВывестиВДокументРезультатОбластиМакета(
					ДокументРезультатПриложений, МакетПечатнойФормы, "ПриложениеШапка",
					ДанныеНаПечать,
					ДанныеВычисляемыеНаХоду);

					НаименованияОтпусковНаПечать = Новый Массив;

					ДанныеДополнительныхОтпусков = Новый Структура;
					ДанныеДополнительныхОтпусков.Вставить("СсылкаНаОбъектДанныеОтпусковВидОтпускаНаименованиеОтпускаНаПечать", "");
					ДанныеДополнительныхОтпусков.Вставить("СсылкаНаОбъектДанныеОтпусковПродолжительность", 0);
					ДанныеДополнительныхОтпусков.Вставить("СсылкаНаОбъектДанныеОтпусковДатаНачала", '00010101');
					ДанныеДополнительныхОтпусков.Вставить("СсылкаНаОбъектДанныеОтпусковДатаНачалаНаПечать");
					ДанныеДополнительныхОтпусков.Вставить("СсылкаНаОбъектДанныеОтпусковДатаОкончания", '00010101');
					ДанныеДополнительныхОтпусков.Вставить("СсылкаНаОбъектДанныеОтпусковДатаОкончанияНаПечать");

					Для ИндексСтроки = 0 По ДанныеНаПечать.Строки.Количество() - 1 Цикл

						ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектДанныеОтпусковНомерПоПорядку", ИндексСтроки + 1);

						ДанныеСтроки = ДанныеНаПечать.Строки[ИндексСтроки];
						Если ДанныеСтроки.СсылкаНаОбъектДанныеОтпусковВидОтпускаОтпускЯвляетсяЕжегодным = Истина Тогда
							ИменаОбластей = "ПриложениеСтрокаОтпуск,ПриложениеСтрокаПериод,ПриложениеСтрокаОснование";
						Иначе
							ИменаОбластей = "ПриложениеСтрокаОтпуск,ПриложениеСтрокаОснование";
						КонецЕсли;

						ЗарплатаКадрыОтчеты.ВывестиВДокументРезультатОбластиМакета(
						ДокументРезультатПриложений, МакетПечатнойФормы, ИменаОбластей,
						ДанныеНаПечать,
						ДанныеНаПечать.Строки[ИндексСтроки],
						ДанныеВычисляемыеНаХоду);

						НаименованияОтпусковНаПечать.Добавить(ДанныеСтроки.СсылкаНаОбъектДанныеОтпусковВидОтпускаНаименованиеОтпускаНаПечать);

						Если ЗначениеЗаполнено(ДанныеСтроки.СсылкаНаОбъектДанныеОтпусковПродолжительность) Тогда

							ДанныеДополнительныхОтпусков.СсылкаНаОбъектДанныеОтпусковПродолжительность = ДанныеДополнительныхОтпусков.СсылкаНаОбъектДанныеОтпусковПродолжительность
							+ ДанныеСтроки.СсылкаНаОбъектДанныеОтпусковПродолжительность;

						КонецЕсли;

						Если ЗначениеЗаполнено(ДанныеСтроки.СсылкаНаОбъектДанныеОтпусковДатаНачала) Тогда

							Если Не ЗначениеЗаполнено(ДанныеДополнительныхОтпусков.СсылкаНаОбъектДанныеОтпусковДатаНачала)
								Или ДанныеДополнительныхОтпусков.СсылкаНаОбъектДанныеОтпусковДатаНачала > ДанныеСтроки.СсылкаНаОбъектДанныеОтпусковДатаНачала Тогда

								ДанныеДополнительныхОтпусков.СсылкаНаОбъектДанныеОтпусковДатаНачала = ДанныеСтроки.СсылкаНаОбъектДанныеОтпусковДатаНачала;
								ДанныеДополнительныхОтпусков.СсылкаНаОбъектДанныеОтпусковДатаНачалаНаПечать = ДанныеСтроки.СсылкаНаОбъектДанныеОтпусковДатаНачалаНаПечать;

							КонецЕсли;

						КонецЕсли;

						Если ЗначениеЗаполнено(ДанныеСтроки.СсылкаНаОбъектДанныеОтпусковДатаОкончания) Тогда

							Если ДанныеДополнительныхОтпусков.СсылкаНаОбъектДанныеОтпусковДатаОкончания < ДанныеСтроки.СсылкаНаОбъектДанныеОтпусковДатаОкончания Тогда

								ДанныеДополнительныхОтпусков.СсылкаНаОбъектДанныеОтпусковДатаОкончания = ДанныеСтроки.СсылкаНаОбъектДанныеОтпусковДатаОкончания;
								ДанныеДополнительныхОтпусков.СсылкаНаОбъектДанныеОтпусковДатаОкончанияНаПечать = ДанныеСтроки.СсылкаНаОбъектДанныеОтпусковДатаОкончанияНаПечать;

							КонецЕсли;

						КонецЕсли;

					КонецЦикла;

					ДанныеДополнительныхОтпусков.СсылкаНаОбъектДанныеОтпусковВидОтпускаНаименованиеОтпускаНаПечать =
					СтрСоединить(НаименованияОтпусковНаПечать, ", ");

					ДанныеПользовательскихПолей = ЗарплатаКадрыОтчеты.ЗначенияЗаполненияПользовательскихПолей(ИдентификаторыМакета, ДанныеНаПечать);

					ЗарплатаКадрыОтчеты.ВывестиВДокументРезультатОбластиМакета(
					ДокументРезультат, МакетПечатнойФормы, "Шапка,Работник,Подвал",
					ДанныеНаПечать,
					ДанныеПользовательскихПолей,
					ДанныеДополнительныхОтпусков,
					ДанныеВычисляемыеНаХоду);

					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();

					#Удаление
					ДокументРезультат.Вывести(ДокументРезультатПриложений);
					#КонецУдаления

				Иначе

					Если ЗначениеЗаполнено(ДанныеНаПечать.СсылкаНаОбъектПродолжительностьДополнительныхОтпусков) Тогда
						ДанныеВычисляемыеНаХоду.Вставить("СсылкаНаОбъектДанныеОтпусковПродолжительность", ДанныеНаПечать.СсылкаНаОбъектПродолжительностьДополнительныхОтпусков);
					КонецЕсли;

					ДанныеПользовательскихПолей = ЗарплатаКадрыОтчеты.ЗначенияЗаполненияПользовательскихПолей(ИдентификаторыМакета, ДанныеНаПечать);

					ЗарплатаКадрыОтчеты.ВывестиВДокументРезультатОбластиМакета(
					ДокументРезультат, МакетПечатнойФормы, "Шапка,Работник,Подвал",
					ДанныеНаПечать,
					ДанныеПользовательскихПолей,
					ДанныеНаПечать.Строки[0],
					ДанныеВычисляемыеНаХоду);

				КонецЕсли;

			КонецЕсли;

			ЭДОБЗК.ЗадатьДетальнуюОбластьПечати(ПараметрыПечати, ДокументРезультат, "ПФ_MXL_Т6", НомерСтрокиНачалаОбласти,
			ДанныеНаПечать, ДанныеНаПечать.СсылкаНаОбъект);

		КонецЦикла;

		Если ОбъектыПечати <> Неопределено Тогда
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, ПерваяСтрокаПечатнойФормы, ОбъектыПечати, ДанныеНаПечать.СсылкаНаОбъект);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
