#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеПоПоставкам() Экспорт
		
	СортировкаПодсистем = СортировкаПодсистем();
	
	ТипЧисло  = ОбщегоНазначения.ОписаниеТипаЧисло(1);
	ТипСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(60);
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	Таблица = Новый ТаблицаЗначений(); 
	Таблица.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных"));
	Таблица.Колонки.Добавить("Представление", ТипСтрока); 
	Таблица.Колонки.Добавить("Подсистема", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных")); 
	Таблица.Колонки.Добавить("ПодсистемаПредставление", ТипСтрока); 
	Таблица.Колонки.Добавить("ПодсистемаРодитель", ТипСтрока); 
	Таблица.Колонки.Добавить("ПорядокПодсистемы", ТипЧисло); 
	Таблица.Колонки.Добавить("Стандарт", ТипБулево); 
	Таблица.Колонки.Добавить("УУ",       ТипБулево); 
	Таблица.Колонки.Добавить("МСФО",     ТипБулево); 
	Таблица.Колонки.Добавить("УХ",       ТипБулево); 
	Таблица.Колонки.Добавить("ПРОФ",     ТипБулево); 
	
	СоставФункциональныхОпций = СоставФункциональныхОпций();
	
	Классы = Новый Массив(); 
	Классы.Добавить(Метаданные.Справочники);
	Классы.Добавить(Метаданные.Документы);
	Классы.Добавить(Метаданные.Отчеты);
	Классы.Добавить(Метаданные.Обработки);
	Классы.Добавить(Метаданные.ПланыСчетов);
	Классы.Добавить(Метаданные.ПланыВидовХарактеристик);
	Классы.Добавить(Метаданные.РегистрыСведений);
	Классы.Добавить(Метаданные.РегистрыНакопления);
	Классы.Добавить(Метаданные.РегистрыБухгалтерии);
	Классы.Добавить(Метаданные.БизнесПроцессы);
	Классы.Добавить(Метаданные.Задачи);
	
	Для каждого Класс Из Классы Цикл
		Для каждого Элемент Из Класс Цикл
			Если ВывестиВОтчет(Элемент.Имя) Тогда 				
								
				Если Элемент = Метаданные.Обработки.бит_Служебный Тогда
					Продолжить;
				КонецЕсли;
				
				ВключенВСистему = Ложь;
				Для каждого ОписаниеПодсистемы Из СортировкаПодсистем Цикл
					Если ПодсистемаСодержитЭлемент(ОписаниеПодсистемы.Подсистема, Элемент) Тогда
						ДобавитьСтрокуТаблица(Таблица, Элемент, СоставФункциональныхОпций, ОписаниеПодсистемы.ИдентифкаторОМД, 
							ОписаниеПодсистемы.Представление, ОписаниеПодсистемы.Порядок, ОписаниеПодсистемы.Представление);
						ВключенВСистему = Истина;
					КонецЕсли;
				КонецЦикла; 
				
				Если Не ВключенВСистему Тогда
					ДобавитьСтрокуТаблица(Таблица, Элемент, СоставФункциональныхОпций, Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка(), 
						НСтр("ru='Общие объекты';en='Shared objects'"), 8, 
						НСтр("ru='Технологические возможности';en='Technological possibilities'"));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла; 
	
	Возврат Таблица;
	
КонецФункции // ДанныеПоПоставкам()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВывестиВОтчет(ИмяОбъекта)

	ВывестиВОтчет = (СтрНайти(ИмяОбъекта, "бит_")>0 
				ИЛИ ВРег(ИмяОбъекта) =  ВРег("Подразделения")
				ИЛИ ВРег(ИмяОбъекта) =  ВРег("ВидыЦФО") 
				ИЛИ ВРег(ИмяОбъекта) =  ВРег("СценарииПланирования")
				ИЛИ ВРег(ИмяОбъекта) =  ВРег("Проекты"));
				
	Если СтрЧислоВхождений(ИмяОбъекта, "удалить") > 0 Тогда
		ВывестиВОтчет = Ложь;
	КонецЕсли;
				
	Возврат ВывестиВОтчет;			

КонецФункции
 
Функция СортировкаПодсистем()

	СортировкаПодсистем = Новый ТаблицаЗначений(); 
	СортировкаПодсистем.Колонки.Добавить("Подсистема",  	Новый ОписаниеТипов("ОбъектМетаданных"));
	СортировкаПодсистем.Колонки.Добавить("ИдентифкаторОМД", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных"));
	СортировкаПодсистем.Колонки.Добавить("Порядок", 		ОбщегоНазначения.ОписаниеТипаЧисло(4));
	СортировкаПодсистем.Колонки.Добавить("Группировка", 	ОбщегоНазначения.ОписаниеТипаСтрока(100));
	СортировкаПодсистем.Колонки.Добавить("Представление", 	ОбщегоНазначения.ОписаниеТипаСтрока(250));
	
	ДобавитьВСортировкуПодсистем(СортировкаПодсистем, Метаданные.Подсистемы.бит_КомИнт_Казначейство, 
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Подсистема.бит_КомИнт_Казначейство"), 1, 
		НСтр("ru='Основные подсистемы';en='Main subsystems'"));
		
	ДобавитьВСортировкуПодсистем(СортировкаПодсистем, Метаданные.Подсистемы.бит_Бюджетирование, 
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Подсистема.бит_Бюджетирование"), 2, 
		НСтр("ru='Основные подсистемы';en='Main subsystems'"));
				
	ДобавитьВСортировкуПодсистем(СортировкаПодсистем, Метаданные.Подсистемы.бит_КомИнт_МДМ, 
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Подсистема.бит_КомИнт_МДМ"), 4, 
		НСтр("ru='Основные подсистемы';en='Main subsystems'"), 
		НСтр("ru='Управление нормативно - справочной информацией (MDM)';en='Management standard - reference information (MDM)'"));
		
	ДобавитьВСортировкуПодсистем(СортировкаПодсистем, Метаданные.Подсистемы.бит_КомИнт_ПолучениеДанных, 
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Подсистема.бит_КомИнт_ПолучениеДанных"), 9, 
		НСтр("ru='Технологические возможности';en='Technological possibilities'"));
		
	ДобавитьВСортировкуПодсистем(СортировкаПодсистем, Метаданные.Подсистемы.бит_КомИнт_ПреобразованиеДанных, 
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Подсистема.бит_КомИнт_ПреобразованиеДанных"), 10, 
		НСтр("ru='Технологические возможности';en='Technological possibilities'"));
		
	ДобавитьВСортировкуПодсистем(СортировкаПодсистем, Метаданные.Подсистемы.бит_КомИнт_УправлениеДоговорамиЗатратами, 
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Подсистема.бит_КомИнт_УправлениеДоговорамиЗатратами"), 3, 
		НСтр("ru='Основные подсистемы';en='Main subsystems'"));
		
	ДобавитьВСортировкуПодсистем(СортировкаПодсистем, Метаданные.Подсистемы.бит_КомИнт_УправлениеПроцессами, 
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Подсистема.бит_КомИнт_УправлениеПроцессами"), 11, 
		НСтр("ru='Технологические возможности';en='Technological possibilities'"));
		
	ДобавитьВСортировкуПодсистем(СортировкаПодсистем, Метаданные.Подсистемы.бит_КомИнт_УправленческийУчет, 
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Подсистема.бит_КомИнт_УправленческийУчет"), 7, 
		НСтр("ru='Основные подсистемы';en='Main subsystems'"));

	// ++ НЕ УТ 
	ДобавитьВСортировкуПодсистем(СортировкаПодсистем, Метаданные.Подсистемы.бит_КомИнт_Консолидация, 
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Подсистема.бит_КомИнт_Консолидация"), 5, 
		НСтр("ru='Основные подсистемы';en='Main subsystems'"));
		
	ДобавитьВСортировкуПодсистем(СортировкаПодсистем, Метаданные.Подсистемы.бит_КомИнт_МСФО, 
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Подсистема.бит_КомИнт_МСФО"), 6, 
		НСтр("ru='Основные подсистемы';en='Main subsystems'"));
	// -- НЕ УТ
	
	Возврат СортировкаПодсистем;
	
КонецФункции

Процедура ДобавитьВСортировкуПодсистем(СортировкаПодсистем, Подсистема, ИдентифкаторОМД, Порядок, Группировка, Представление = "")

	НоваяСтрока = СортировкаПодсистем.Добавить();
	НоваяСтрока.Подсистема 		= Подсистема;
	НоваяСтрока.ИдентифкаторОМД = ИдентифкаторОМД;
	НоваяСтрока.Порядок 		= Порядок;
	НоваяСтрока.Группировка 	= Группировка;
	
	Если ПустаяСтрока(Представление) Тогда
		НоваяСтрока.Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентифкаторОМД, "Синоним");
	Иначе	
		НоваяСтрока.Представление = Представление;
	КонецЕсли; 

КонецПроцедуры
 
Функция ПодсистемаСодержитЭлемент(Подсистема, ОбъектКонфигурации)
		
	Результат = Подсистема.Состав.Содержит(ОбъектКонфигурации);
	
	Если Не Результат Тогда	
		Если Подсистема.Подсистемы.Количество() > 0 Тогда
			Для Каждого ДочерняяПодсистема Из Подсистема.Подсистемы Цикл
				Результат = ПодсистемаСодержитЭлемент(ДочерняяПодсистема, ОбъектКонфигурации); 
				Если Результат Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуТаблица(Таблица, Элемент, СоставФункциональныхОпций, 
				Подсистема, ПредставлениеПодсистемы, ПорядокПодсистемы, ПодсистемаРодитель = "")
	
	УУ 	     = Метаданные.ФункциональныеОпции.бит_УУ;
	МСФО 	 = Метаданные.ФункциональныеОпции.бит_ФинансМСФО;
	УХ	     = Метаданные.ФункциональныеОпции.бит_УХ;
	ПРОФ	 = Метаданные.ФункциональныеОпции.бит_ПРОФ;
	Стандарт = Метаданные.ФункциональныеОпции.бит_СТ;

	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.Ссылка        = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Элемент);
	НоваяСтрока.Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Ссылка, "Синоним");
	НоваяСтрока.Подсистема    = Подсистема;
	НоваяСтрока.ПодсистемаРодитель = ПодсистемаРодитель;
	НоваяСтрока.ПорядокПодсистемы = ПорядокПодсистемы;
	НоваяСтрока.ПодсистемаПредставление = ПредставлениеПодсистемы;
	
	НаборФункций = Новый Массив();
	НаборФункций.Добавить(УХ);
	НаборФункций.Добавить(УУ);
	НаборФункций.Добавить(ПРОФ);
	НаборФункций.Добавить(Стандарт);
	НаборФункций.Добавить(МСФО);
	НоваяСтрока.УХ = ФункциональностьПоддерживается(НаборФункций, Элемент, СоставФункциональныхОпций);
	
	НаборФункций = Новый Массив();
	НаборФункций.Добавить(УУ);
	НаборФункций.Добавить(ПРОФ);
	НаборФункций.Добавить(Стандарт);
	НаборФункций.Добавить(МСФО);
	НоваяСтрока.УУ = ФункциональностьПоддерживается(НаборФункций, Элемент, СоставФункциональныхОпций);
	
	НаборФункций = Новый Массив();
	НаборФункций.Добавить(ПРОФ);
	НаборФункций.Добавить(Стандарт);
	НоваяСтрока.ПРОФ = ФункциональностьПоддерживается(НаборФункций, Элемент, СоставФункциональныхОпций);
						
	НоваяСтрока.МСФО = ФункциональностьПоддерживается(МСФО, Элемент, СоставФункциональныхОпций);
	
	НаборФункций = Новый Массив();
	НаборФункций.Добавить(Стандарт);
	НоваяСтрока.Стандарт = ФункциональностьПоддерживается(НаборФункций, Элемент, СоставФункциональныхОпций);
	
КонецПроцедуры

Функция ФункциональностьПоддерживается(Функциональность, Объект, СоставФункциональныхОпций)

	Если ТипЗнч(Функциональность) = Тип("Массив") Тогда
		НаборФункций = Функциональность;
	Иначе
		НаборФункций = Новый Массив(); 
		НаборФункций.Добавить(Функциональность);
	КонецЕсли; 
	
	Успех = Ложь;
	Для каждого Элемент Из НаборФункций Цикл
		Состав = СоставФункциональныхОпций.Получить(Элемент);
		Если ЗначениеЗаполнено(Состав) Тогда
			Успех = (Состав.Найти(Объект) <> Неопределено);
			Если Успех Тогда
				Прервать;		
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 

	Возврат Успех;
	
КонецФункции

Функция СоставФункциональныхОпций()

	Модуль = бит_ОбщегоНазначенияПовтИсп.МодульЛицензированияБФ();

	Опции = Новый Соответствие; 
	Опции.Вставить(Метаданные.ФункциональныеОпции.бит_УУ, 		  Модуль.ОбъектыУУ());
	Опции.Вставить(Метаданные.ФункциональныеОпции.бит_УХ, 		  Модуль.ОбъектыУХ());
	Опции.Вставить(Метаданные.ФункциональныеОпции.бит_ПРОФ, 	  Модуль.ОбъектыПРОФ());
	Опции.Вставить(Метаданные.ФункциональныеОпции.бит_СТ, 		  Модуль.ОбъектыСТАНДАРТ());
	Опции.Вставить(Метаданные.ФункциональныеОпции.бит_ФинансМСФО, Модуль.ОбъектыМСФО());

	Возврат Опции;
	
КонецФункции

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
		
    НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Общий");
	НастройкиВарианта.Описание = НСтр("ru='Отчет по поставкам БИТ:Финанс (расширенный).';
									  |en='Report on the delivery time a bit: Finance (advanced).'");
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПоПодсистемам");
	НастройкиВарианта.Описание = НСтр("ru='Отчет по поставкам БИТ:Финанс (по подсистемам).';
									  |en='Report on the delivery time a bit: Finance (by facility).'");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецЕсли