#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СКД = ЭтотОбъект.СхемаКомпоновкиДанных;
	
	// Очистка табличного поля.
	ДокументРезультат.Очистить();
	
	ТаблицаДанных = Отчеты.бит_ОтчетПоПоставкам.ДанныеПоПоставкам();  // каркас - пустая таблица
	
	НаборДанных = СКД.НаборыДанных.НаборДанных1;
	Настройки   = КомпоновщикНастроек.ПолучитьНастройки();
	
	Таблица 	  = бит_ЛицензированиеБФСерверПереопределяемый.ВерсииБФ();
	ТекущаяВерсия = "" + Таблица.Найти(Константы.бит_ТекущаяВерсияПродукта.Получить(),"Ключ").Представление;
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(Настройки, "ТекущаяВерсия", ТекущаяВерсия);
	
	// Формирование макета, с помощью компоновщика макета.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	            	
	// Передача схемы, настроек и данных расшифровки в макет компоновки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки);
	
	// Внешние наборы данных	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ТаблицаДанных);
	
	// Выполнение компоновки с помощью процессора компоновки.
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
                  
	// Вывод таблицы.   	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	// Ищем в табличном документе "Итого" и заменяем.
	ТекОбласть = ДокументРезультат.НайтиТекст("Итого", ТекОбласть, ДокументРезультат.Область(),
	                                             Истина, Истина, Истина, Ложь);

	Если ТекОбласть <> Неопределено Тогда
	    ТекОбласть.Текст = НСтр("ru='Поставки БИТ.ФИНАНС';en='Deliveries BIT.FINANS'");
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли