
&НаСервере
Процедура УВМ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// + СБит 2025-11-25 #УВМ 293680 
	УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_РабочееМесто", Элементы.ГруппаПричиныСовмещения, "Объект.УВМ_РабочееМесто", 1);
	// - СБит 2025-11-25 #УВМ
КонецПроцедуры


&НаКлиенте
Процедура УВМ_ОтсутствующийСотрудникПриИзмененииПосле(Элемент)
	// + СБит 2025-12-01 #УВМ 293680
	Объект.УВМ_РабочееМесто = ПолучитьРабочееМестоСотрудника(Объект.ОтсутствующийСотрудник);
	// - СБит 2025-12-01 #УВМ
КонецПроцедуры

// + СБит 2025-12-01 #УВМ 293680
&НаСервере
Функция ПолучитьРабочееМестоСотрудника(Сотрудник) 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаСотрудников.РабочееМесто КАК РабочееМесто
	|ИЗ
	|	РегистрСведений.РабочиеМестаСотрудников.СрезПоследних(
	|			,
	|			ФизическоеЛицо = &ФизическоеЛицо
	|				И Сотрудник = &Сотрудник
	|				И ГоловнаяОрганизация = &Организация) КАК РабочиеМестаСотрудников";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо"));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.РабочееМесто;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции

