
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура удаляет историю записей регистра бит_ИсторияВзаимодействияСИИ.
// 
// Параметры:
//  РежимСообщений    - Строка.
// 
Процедура УдалитьИсториюЗаписей(РежимСообщений = "Нет") Экспорт
	
	РежимыВывода = бит_ОбщегоНазначения.ОпределитьРежимыВывода(РежимСообщений);		
	
	РезультатЗапроса = УстаревшиеДиалоги();
	
	Если РезультатЗапроса.Пустой() Тогда		
		ТекстСообщения = НСтр("ru='Нет данных для обработки.';en='No data was provided.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Ном = 1;
	КоличествоЗаписей = Выборка.Количество();	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.бит_ИсторияВзаимодействияСИИ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторДиалога.Установить(Выборка.ИдентификаторДиалога);
		Попытка			
			НаборЗаписей.Записать();			
		Исключение			
			Если РежимыВывода.ВыводитьОшибки Тогда
				ТекстСообщения = НСтр("ru = 'Не удалось удалить историю записей регистра %1.';
									  |en = 'Failed to delete the history records for %1.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Метаданные.РегистрыСведений.бит_ИсторияВзаимодействияСИИ.Представление());
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецЕсли;			
		КонецПопытки; 
		
		Ном = Ном + 1;
	КонецЦикла; 
	
	Если РежимыВывода.ВыводитьИнформацию Тогда		
		ТекстСообщения = НСтр("ru='Удаление истории записей завершено.';
							  |en='Removing history records completed'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УстаревшиеДиалоги()
	
	АктуальнаяДата = бит_ИскусственныйИнтеллект.ГраницаАктуальнойИстории();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсторияВзаимодействия.ИдентификаторДиалога КАК ИдентификаторДиалога
	|ИЗ
	|	РегистрСведений.бит_ИсторияВзаимодействияСИИ.СрезПоследних КАК ИсторияВзаимодействия
	|ГДЕ
	|	ИсторияВзаимодействия.Период < &АктуальнаяДата";
	Запрос.УстановитьПараметр("АктуальнаяДата", АктуальнаяДата);
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#КонецЕсли