#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	УстановитьЗаголовкиПолейДопИзмерений();
	
	ПараметрКоличество 	  	= бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ВыводитьКоличество");
	ПараметрНарастающийИтог = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "НарастающийИтог");
	ПараметрДополнятьПериод = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ДополнятьПериоды");
	
	ПоказателиОтчета = Новый Соответствие;
	ПоказателиОтчета.Вставить("Показатели.Сумма", 				 Новый Структура("Использование", Истина));
	ПоказателиОтчета.Вставить("Показатели.СуммаНарастающийИтог", Новый Структура("Использование", ПараметрНарастающийИтог.Значение));
	ПоказателиОтчета.Вставить("Показатели.Количество", 			 Новый Структура("Использование", ПараметрКоличество.Значение));
	ПоказателиОтчета.Вставить("Показатели.КоличествоНарастающийИтог", 
		Новый Структура("Использование", ПараметрКоличество.Значение И ПараметрНарастающийИтог.Значение));

	// Динамический период.
	бит_ОтчетыБФСервер.НастроитьДинамическийПериод(СхемаКомпоновкиДанных, КомпоновщикНастроек, ПараметрДополнятьПериод.Значение);
	
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	бит_ОтчетыБФСервер.НастроитьПоляВыбора(ПоказателиОтчета, НастройкиКомпоновкиДанных);
	Если НастройкиКомпоновкиДанных.Структура.Количество() > 0 
	   И ТипЗнч(НастройкиКомпоновкиДанных.Структура[0]) = Тип("ТаблицаКомпоновкиДанных") Тогда
		бит_ОтчетыБФСервер.НастроитьПоляВыбора(ПоказателиОтчета, НастройкиКомпоновкиДанных.Структура[0]);
	КонецЕсли;
		
	ОтображатьПустыеСтроки = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ОтображатьПустыеСтроки").Значение;
	
	// Добавление данных по расчетам.
	ИзменитьСКДДляРасчетов(СхемаКомпоновкиДанных, КомпоновщикНастроек);	
	
	// Вывод результата.
	ДокументРезультат.Очистить();

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
	
	СкорректироватьСвязиНаборовДанныхМакетаКомпоновки(МакетКомпоновки, ОтображатьПустыеСтроки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПоБюджету = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПоБюджету").Значение;
	Если ПоБюджету Тогда
		Бюджет = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Бюджет").Значение;
		Если НЕ ЗначениеЗаполнено(Бюджет) Тогда
			ТекстСообщения = НСтр("ru = 'Не установлен ""Бюджет"".';en='""Budget"" is not set'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , ,Отказ); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма 		  - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки 	  - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриСозданииНаСервере 				 = Истина;
	Настройки.События.ПередЗагрузкойВариантаНаСервере    = Истина;
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;

	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = Отчеты.бит_ОборотыБюджетаСРасчетами.ЗагрузитьНастройкиПриИзмененииПараметров();
	Настройки.События.ПриОпределенииСвойствЭлементовФормыНастроек = Истина;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   ЭтаФорма 			  - ФормаКлиентскогоПриложения - Форма отчета.
//   Отказ 	  			  - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОтборСценарий = Новый СписокЗначений;
		
КонецПроцедуры

Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, Настройки, ПользовательскиеНастройки) Экспорт
		
	ТекущийКлючСхемы = Неопределено;
	
	Если Настройки = Неопределено Тогда 
		Настройки = КомпоновщикНастроек.Настройки;
	КонецЕсли;
	
	ЭтоЗагруженнаяСхема = Ложь;
	ДвоичныеДанныеСхемы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Настройки.ДополнительныеСвойства, "СхемаКомпоновкиДанных");
	
	Если ТипЗнч(ДвоичныеДанныеСхемы) = Тип("ДвоичныеДанные") Тогда
		ТекущийКлючСхемы = ХешДвоичныхДанных(ДвоичныеДанныеСхемы);
		Если ТекущийКлючСхемы <> КлючСхемы Тогда
			Схема = Отчеты.бит_ОборотыБюджетаСРасчетами.ИзвлечьСхемуИзДвоичныхДанных(ДвоичныеДанныеСхемы);
			ЭтоЗагруженнаяСхема = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ДоступныеЗначения = Неопределено;
	ФиксированныеПараметры = Отчеты.бит_ОборотыБюджетаСРасчетами.ФиксированныеПараметры(
		Настройки, ПользовательскиеНастройки, ДоступныеЗначения);
	
	Если ТекущийКлючСхемы = Неопределено Тогда 
		ТекущийКлючСхемы = ФиксированныеПараметры.ПоБюджету;
		ТекущийКлючСхемы = ОбщегоНазначения.СократитьСтрокуКонтрольнойСуммой(ТекущийКлючСхемы, 100);
		
		Если ТекущийКлючСхемы <> КлючСхемы Тогда
			КлючСхемы = "";
			Схема = Отчеты.бит_ОборотыБюджетаСРасчетами.СхемаКомпоновкиДанных(ФиксированныеПараметры);
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийКлючСхемы <> Неопределено И ТекущийКлючСхемы <> КлючСхемы Тогда
		КлючСхемы = ТекущийКлючСхемы;
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, Схема, КлючСхемы);
		
		Если ЭтоЗагруженнаяСхема Тогда
			Отчеты.бит_ОборотыБюджетаСРасчетами.УстановитьСтандартныеНастройкиЗагруженнойСхемы(
				ЭтотОбъект, ДвоичныеДанныеСхемы, Настройки, ПользовательскиеНастройки);
		Иначе
			Отчеты.бит_ОборотыБюджетаСРасчетами.УстановитьСтандартныеНастройки(
				ЭтотОбъект, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
		КонецЕсли;
		
		Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
			// Переопределение.
			// АПК:278-выкл Допустимое исключение.
			ИнтеграцияПодсистемБСП.ПередЗагрузкойВариантаНаСервере(Контекст, Настройки);
			// АПК:278-вкл
			ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере(Контекст, Настройки);
			ПередЗагрузкойВариантаНаСервере(Контекст, Настройки);
		КонецЕсли;
	Иначе
		Отчеты.бит_ОборотыБюджетаСРасчетами.УстановитьФиксированныеПараметры(
			ЭтотОбъект, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ДоступныеЗначения", ДоступныеЗначения);

КонецПроцедуры

Процедура ПередЗагрузкойВариантаНаСервере(Форма, Настройки) Экспорт
	
	ТекущийКлючСхемы = Неопределено;
	Схема = Неопределено;
	
	ЭтоЗагруженнаяСхема = Ложь;
	
	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Или Настройки = Неопределено Тогда
		Если Настройки = Неопределено Тогда
			ДополнительныеСвойстваНастроек = КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
		Иначе
			ДополнительныеСвойстваНастроек = Настройки.ДополнительныеСвойства;
		КонецЕсли;
		
		Если Форма.Параметры.Свойство("Расшифровка") И Форма.Параметры.Расшифровка <> Неопределено Тогда
			// Изменение отборов по статьям расчетов для расшифровки.
			Для каждого ЭлементОтбора Из Настройки.Отбор.Элементы Цикл
				Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда			
					ПолеОтбора = ЭлементОтбора.ЛевоеЗначение;
					Если ПолеОтбора = Новый ПолеКомпоновкиДанных("Статья") Тогда
						ЗначениеОтбора = ЭлементОтбора.ПравоеЗначение;
						Если ТипЗнч(ЗначениеОтбора) = Тип("СписокЗначений") Тогда
							Продолжить;				
						КонецЕсли;
						Если ЗначениеЗаполнено(ЗначениеОтбора) И НЕ ЗначениеОтбора.ЭтоГруппа И ЗначениеОтбора.ЭтоРасчет Тогда
							// Для расчетов.
							ПараметрыРасчета = Новый СписокЗначений;
							бит_ОтчетыСРасчетамиСервер.ПараметрыРасчета(ЗначениеОтбора, ПараметрыРасчета);
							ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
							ЭлементОтбора.ПравоеЗначение = ПараметрыРасчета;			
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Форма.ТипФормыОтчета = ТипФормыОтчета.Основная
			И (Форма.РежимРасшифровки
			ИЛИ (Форма.КлючТекущегоВарианта <> "ОборотыБюджета"
			И Форма.КлючТекущегоВарианта <> "ОборотыБюджетаПолнаяВерсия"
			И Форма.КлючТекущегоВарианта <> "ДанныеБюджета")) Тогда 
			
			ДополнительныеСвойстваНастроек.Вставить("ОтчетИнициализирован", Истина);
		КонецЕсли;
		
		ДвоичныеДанныеСхемы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДополнительныеСвойстваНастроек, "СхемаКомпоновкиДанных");
		
		Если ТипЗнч(ДвоичныеДанныеСхемы) = Тип("ДвоичныеДанные") Тогда
			ЭтоЗагруженнаяСхема = Истина;
			ТекущийКлючСхемы = ХешДвоичныхДанных(ДвоичныеДанныеСхемы);
			Схема = Отчеты.бит_ОборотыБюджетаСРасчетами.ИзвлечьСхемуИзДвоичныхДанных(ДвоичныеДанныеСхемы);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоЗагруженнаяСхема Тогда
		КлючСхемы = ТекущийКлючСхемы;
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Форма, Схема, КлючСхемы);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииСвойствЭлементовФормыНастроек(ТипФормы, СвойстваЭлементов, ПользовательскиеНастройки) Экспорт 
	
	Если ТипФормы <> ТипФормыОтчета.Основная Тогда 
		Возврат;
	КонецЕсли;
	
	СвойстваГруппы = ОтчетыСервер.СвойстваГруппыЭлементовФормы();
	СвойстваГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СвойстваЭлементов.Группы.Вставить("ФиксированныеПараметры", СвойстваГруппы);
	
	ФиксированныеПараметры = Новый Структура("Период, ПоБюджету, Бюджет");
	ШиринаПоля = Новый Структура("ПоБюджету, Бюджет", 5, 35);
	
	Для Каждого ЭлементНастройки Из ПользовательскиеНастройки Цикл 
		Если ТипЗнч(ЭлементНастройки) <> Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			Или Не ФиксированныеПараметры.Свойство(ЭлементНастройки.Параметр) Тогда 
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля = СвойстваЭлементов.Поля.Найти(
			ЭлементНастройки.ИдентификаторПользовательскойНастройки, "ИдентификаторНастройки");
		
		Если СвойстваПоля = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля.ИдентификаторГруппы = "ФиксированныеПараметры";
		
		ИмяПараметра = Строка(ЭлементНастройки.Параметр);
		Если ИмяПараметра <> "Период" Тогда 
			СвойстваПоля.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			СвойстваПоля.Ширина = ШиринаПоля[ИмяПараметра];
			СвойстваПоля.РастягиватьПоГоризонтали = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
#Область ИзменениеЗапросаПоРасчетам

// Процедура меняет текст запроса для СКД и подставляет фиксированные параметры.
//
// Параметры:
//  СхемаКомпоновкиДанных - СхемаКомпоновкиДанных.
//  КомпоновщикНастроек   - КомпоновщикНастроекКомпановкиДанных.
//
Процедура ИзменитьСКДДляРасчетов(СхемаКомпоновкиДанных, КомпоновщикНастроек)
	
	ПараметрыМодификации = бит_ОтчетыСРасчетамиСервер.НовыеПараметрыМодификацииСКДДляРасчетов();
	ПараметрыМодификации.МенеджерОтчета        = Отчеты.бит_ОборотыБюджетаСРасчетами;
	ПараметрыМодификации.СхемаКомпоновкиДанных = СхемаКомпоновкиДанных;
	ПараметрыМодификации.КомпоновщикНастроек   = КомпоновщикНастроек;
	ПараметрыМодификации.ПутьКНаборуДанных     = "Обороты";
	ПараметрыМодификации.ШаблонТекстаРасчета   = ШаблонТекстаРасчета();
	ПараметрыМодификации.СхемаКомпоновкиДанныхПоУмолчанию = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	ЗаполнитьОписаниеРесурсов(ПараметрыМодификации);
	бит_ОтчетыСРасчетамиСервер.ИзменитьСКДДляРасчетов(ПараметрыМодификации);

КонецПроцедуры

Функция ШаблонТекстаРасчета()
	
	Возврат
	"ВЫБРАТЬ
	|	ОборотыРезультат.Сценарий КАК Сценарий,
	|	ОборотыРезультат.ЦФО КАК ЦФО,
	|	ОборотыРезультат.Организация КАК Организация,
	|	&СтатьяРасчета КАК Статья,
	|	ОборотыРезультат.СтатьяБюджета КАК СтатьяБюджета,
	|	ОборотыРезультат.СтатьяОборотов КАК СтатьяОборотов,
	|	ОборотыРезультат.Валюта КАК Валюта,
	|	ОборотыРезультат.Аналитика_1 КАК Аналитика_1,
	|	ОборотыРезультат.Аналитика_2 КАК Аналитика_2,
	|	ОборотыРезультат.Аналитика_3 КАК Аналитика_3,
	|	ОборотыРезультат.Аналитика_4 КАК Аналитика_4,
	|	ОборотыРезультат.Аналитика_5 КАК Аналитика_5,
	|	ОборотыРезультат.Аналитика_6 КАК Аналитика_6,
	|	ОборотыРезультат.Аналитика_7 КАК Аналитика_7,
	|	ОборотыРезультат.Аналитика_8 КАК Аналитика_8,
	|	ОборотыРезультат.Аналитика_9 КАК Аналитика_9,
	|	ОборотыРезультат.Аналитика_10 КАК Аналитика_10,
	|	ОборотыРезультат.Аналитика_11 КАК Аналитика_11,
	|	ОборотыРезультат.Аналитика_12 КАК Аналитика_12,
	|	ОборотыРезультат.ТипДокумента КАК ТипДокумента,
	|	ОборотыРезультат.СтатусДокумента КАК СтатусДокумента,
	|	ОборотыРезультат.Регистратор КАК Регистратор,
	|	ОборотыРезультат.НомерСтроки КАК НомерСтроки,
	|	ОборотыРезультат.ПериодСекунда КАК ПериодСекунда,
	|	ОборотыРезультат.ПериодДень КАК ПериодДень,
	|	ОборотыРезультат.ПериодНеделя КАК ПериодНеделя,
	|	ОборотыРезультат.ПериодДекада КАК ПериодДекада,
	|	ОборотыРезультат.ПериодМесяц КАК ПериодМесяц,
	|	ОборотыРезультат.ПериодКвартал КАК ПериодКвартал,
	|	ОборотыРезультат.ПериодПолугодие КАК ПериодПолугодие,
	|	ОборотыРезультат.ПериодГод КАК ПериодГод,
	|	ИСТИНА КАК ЭтоРасчет,
	|	0 КАК Сумма,
	|	0 КАК Количество,
	|	&ОбластьРасчетныхПараметров КАК ОбластьРасчетныхПараметров
	|ИЗ
	|	ВТОборотыИсточник КАК ОборотыРезультат
	|ГДЕ
	|	ОборотыРезультат.СтатьяБюджета В ИЕРАРХИИ(&ЗначениеОтбораПараметра)";
	
КонецФункции

Процедура ЗаполнитьОписаниеРесурсов(ПараметрыМодификации)
	
	ОписаниеРесурсов = ПараметрыМодификации.ОписаниеРесурсов;
	
	НовоеОписание = ОписаниеРесурсов.Добавить();
	НовоеОписание.ИмяРесурса = "Показатели.Сумма";
	НовоеОписание.ВидРесурса = "Сумма";
	
	НовоеОписание = ОписаниеРесурсов.Добавить();
	НовоеОписание.ИмяРесурса = "Показатели.Количество";
	НовоеОписание.ВидРесурса = "Количество";
	
КонецПроцедуры

#КонецОбласти

Процедура УстановитьЗаголовкиПолейДопИзмерений()
	
	Отчеты.бит_ОборотыБюджетаСРасчетами.УстановитьЗаголовкиПолейДопИзмерений(СхемаКомпоновкиДанных);
	
КонецПроцедуры

// Возвращает хеш-сумму двоичных данных.
//
// Параметры:
//   ДвоичныеДанные - ДвоичныеДанные - Данные, от которых считается хеш-сумма.
//
Функция ХешДвоичныхДанных(ДвоичныеДанные)
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеДанных.Добавить(ДвоичныеДанные);
	Возврат СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "") + "_" + Формат(ДвоичныеДанные.Размер(), "ЧГ=");
КонецФункции

Процедура СкорректироватьСвязиНаборовДанныхМакетаКомпоновки(МакетКомпоновки, ОтображатьПустыеСтроки)
	
	Для каждого СвязьНаборовДанных Из МакетКомпоновки.СвязиНаборовДанных Цикл
		Если СвязьНаборовДанных.НаборДанныхИсточник = "Статьи"
			И СвязьНаборовДанных.НаборДанныхПриемник = "Обороты" Тогда
			Если ОтображатьПустыеСтроки Тогда
				СвязьНаборовДанных.ТипСвязи = ТипСвязиНаборовДанныхКомпоновкиДанных.Внешняя;
			Иначе	
				СвязьНаборовДанных.ТипСвязи = ТипСвязиНаборовДанныхКомпоновкиДанных.Внутренняя;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
 	
#КонецОбласти

#Область Инициализация

УстановитьЗаголовкиПолейДопИзмерений();

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли

