#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПеренестиНастройкиПриПереходеНаНовуюВерсию() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтарыеЗаписи.Период КАК Период,
	|	СтарыеЗаписи.ПравилоЗаполнения КАК ПравилоЗаполнения,
	|	СтарыеЗаписи.ОбъектСистемы КАК ОбъектСистемы,
	|	СтарыеЗаписи.Приоритет КАК Приоритет,
	|	СтарыеЗаписи.ЭтоИсключение КАК ЭтоИсключение,
	|	СтарыеЗаписи.УсловиеПрименения КАК УсловиеПрименения,
	|	СтарыеЗаписи.ДатаОкончания КАК ДатаОкончания,
	|	СтарыеЗаписи.Комментарий КАК Комментарий,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтарыеЗаписи.ПравилоЗаполнения) КАК ПравилоЗаполненияПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтарыеЗаписи.ОбъектСистемы) КАК ОбъектСистемыПредставление
	|ИЗ
	|	РегистрСведений.бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции КАК СтарыеЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПравилаЗаполненияПолейПриТрансляцииОбъектов КАК НовыеЗаписи
	|		ПО СтарыеЗаписи.Период = НовыеЗаписи.Период
	|			И СтарыеЗаписи.ПравилоЗаполнения = НовыеЗаписи.ПравилоЗаполнения
	|			И СтарыеЗаписи.ОбъектСистемы = НовыеЗаписи.ОбъектСистемы
	|			И СтарыеЗаписи.ЭтоИсключение = НовыеЗаписи.ЭтоИсключение
	|			И СтарыеЗаписи.УсловиеПрименения = НовыеЗаписи.УсловиеПрименения
	|ГДЕ
	|	НовыеЗаписи.ПравилоЗаполнения ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка			 = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			НаборЗаписей = РегистрыСведений.бит_ПравилаЗаполненияПолейПриТрансляцииОбъектов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектСистемы.Установить(Выборка.ОбъектСистемы);
			НаборЗаписей.Отбор.ПравилоЗаполнения.Установить(Выборка.ПравилоЗаполнения);
			НаборЗаписей.Отбор.УсловиеПрименения.Установить(Выборка.УсловиеПрименения);
			НаборЗаписей.Отбор.ЭтоИсключение.Установить(Выборка.ЭтоИсключение);
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
						
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ПредставлениеЗаписи = НСтр("ru = '%1, %2 от %3'");
			ПредставлениеЗаписи = СтрШаблон(ПредставлениеЗаписи, Выборка.ПравилоЗаполненияПредставление, 
									Выборка.ОбъектСистемыПредставление, Формат(Выборка.Период, "ДЛФ=D"));
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать запись: %1 по причине:
									|%2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПредставлениеЗаписи, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.РегистрыСведений.бит_ПравилаЗаполненияПолейПриТрансляцииОбъектов,, ТекстСообщения);
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Код процедур и функций

#КонецОбласти

#КонецЕсли