
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() > 0 Тогда
		НайтиКонкурирующиеЗаписи(Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НайтиКонкурирующиеЗаписи(Отказ)

	ДанныеДляПроверки = Выгрузить();
	Для каждого СтрокаТаблицы Из ДанныеДляПроверки Цикл
		СтрокаТаблицы.ДатаОкончания = ?(ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания), СтрокаТаблицы.ДатаОкончания, '2036-12-31');
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеДляПроверки", ДанныеДляПроверки);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсходныеДанные.Период КАК Период,
	|	ИсходныеДанные.ДатаОкончания КАК ДатаОкончания,
	|	ИсходныеДанные.ПравилоЗаполнения КАК ПравилоЗаполнения,
	|	ИсходныеДанные.ОбъектСистемы КАК ОбъектСистемы
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	&ДанныеДляПроверки КАК ИсходныеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляПроверки.Период КАК Период,
	|	ДанныеДляПроверки.ДатаОкончания КАК ДатаОкончания,
	|	ДанныеДляПроверки.ПравилоЗаполнения КАК ПравилоЗаполнения,
	|	ДанныеДляПроверки.ОбъектСистемы КАК ОбъектСистемы,
	|	ПравилаЗаполнения.Источник КАК Источник,
	|	ПравилаЗаполнения.Приемник КАК Приемник
	|ПОМЕСТИТЬ ДанныеДляПроверки
	|ИЗ
	|	ИсходныеДанные КАК ДанныеДляПроверки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ПравилаЗаполненияПолейПриТрансляции КАК ПравилаЗаполнения
	|		ПО ДанныеДляПроверки.ПравилоЗаполнения = ПравилаЗаполнения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначениеПравил.Период КАК Период,
	|	НазначениеПравил.ПравилоЗаполнения КАК ПравилоЗаполнения,
	|	НазначениеПравил.ОбъектСистемы КАК ОбъектСистемы,
	|	ПравилаЗаполнения.Источник КАК ПравилоЗаполненияИсточник,
	|	ПравилаЗаполнения.Приемник КАК ПравилоЗаполненияПриемник,
	|	НазначениеПравил.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции КАК НазначениеПравил
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ПравилаЗаполненияПолейПриТрансляции КАК ПравилаЗаполнения
	|		ПО НазначениеПравил.ПравилоЗаполнения = ПравилаЗаполнения.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДляПроверки КАК ДанныеДляПроверки
	|		ПО НазначениеПравил.ПравилоЗаполнения <> ДанныеДляПроверки.ПравилоЗаполнения
	|			И НазначениеПравил.ОбъектСистемы = ДанныеДляПроверки.ОбъектСистемы
	|			И (ПравилаЗаполнения.Источник = ДанныеДляПроверки.Источник)
	|			И (ПравилаЗаполнения.Приемник = ДанныеДляПроверки.Приемник)
	|ГДЕ
	|	(НазначениеПравил.Период МЕЖДУ ДанныеДляПроверки.Период И ДанныеДляПроверки.ДатаОкончания
	|			ИЛИ  НазначениеПравил.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ  НазначениеПравил.ДатаОкончания МЕЖДУ ДанныеДляПроверки.Период И ДанныеДляПроверки.ДатаОкончания)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		ПериодДействия = НСтр("ru = 'с %1 по %2'");
		ПериодДействия = СтрШаблон(ПериодДействия, 
							?(ЗначениеЗаполнено(Выборка.Период), Формат(Выборка.Период, "ДЛФ=D"), "..."), 
							?(ЗначениеЗаполнено(Выборка.ДатаОкончания), Формат(Выборка.ДатаОкончания, "ДЛФ=D"), "..."));
							
		ТекстСообщения = НСтр("ru = 'Найдена запись, пересекающаяся по периоду действия с этой записью. Правило: ""%1"", период действия %2 ';
								|en = 'An entry was found that overlaps with this entry in the validity period'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.ПравилоЗаполнения, ПериодДействия); 
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , ,Отказ);
	КонецЦикла;


КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'; en = 'Invalid call of the object on the client.'");
#КонецЕсли