#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ бит_ум_УчетМигрантовВызовСервера.ПолучитьЛицензию(Истина) Тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Сотрудники") Тогда
		Физлицо = СотрудникиВызовСервера.ФизическиеЛицаСотрудников(ПараметрКоманды)[0];
	Иначе
		Физлицо = ПараметрКоманды;
	КонецЕсли;
	
	КлючЗаписиДополнительныхДанных = ПолучитьКлючЗаписиДополнительныхДанных(Физлицо);

	ПараметрыФормы = Новый Структура;
	Если КлючЗаписиДополнительныхДанных = Неопределено Тогда
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Физлицо", Физлицо));
	Иначе	
		ПараметрыФормы.Вставить("Ключ", КлючЗаписиДополнительныхДанных);
	КонецЕсли;
	ОткрытьФорму("РегистрСведений.бит_ум_ДопДанныеФизЛиц.Форма.ФормаЗаписиРасширенная", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,
		ПараметрКоманды, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьКлючЗаписиДополнительныхДанных(Физлицо)
	
	Возврат бит_ум_УчетМигрантовСервер.ПолучитьКлючЗаписиДополнительныхДанных(Физлицо);
	
КонецФункции

#КонецОбласти