
&После("ПриЗаписи")
Процедура УВМ_ПриЗаписи(Отказ, Замещение)
	Если Не Отказ И ЭтотОбъект.Количество() > 0 Тогда 
		Если ЗначениеЗаполнено(Константы.УВМ_ДатаНачалаРассылки.Получить()) И ЭтотОбъект[0].Период >= Константы.УВМ_ДатаНачалаРассылки.Получить() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ 
			|	НаборЗаписей.Период,
			|	НаборЗаписей.ФизическоеЛицо,
			|	НаборЗаписей.Фамилия,
			|	НаборЗаписей.Имя,
			|	НаборЗаписей.Отчество
			|ПОМЕСТИТЬ НаборЗаписей
			|ИЗ
			|	&НаборЗаписей КАК НаборЗаписей
			|;
			|
			// 1 есть похожие
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ФИОФизическихЛиц.ФизическоеЛицо,
			|	ФИОФизическихЛиц.Период
			|ИЗ
			|	НаборЗаписей КАК НаборЗаписей
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
			|		ПО НаборЗаписей.Фамилия = ФИОФизическихЛиц.Фамилия
			|		И НаборЗаписей.Имя = ФИОФизическихЛиц.Имя
			|		И НаборЗаписей.Отчество = ФИОФизическихЛиц.Отчество
			|		И НаборЗаписей.Период <> ФИОФизическихЛиц.Период
			|;
			|
			// 2 есть отправки
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УВМ_Уведомления.КадровыйДокумент КАК ФизическоеЛицо,
			|	УВМ_Уведомления.ДатаИзменения КАК ДатаИзменения
			|ИЗ
			|	РегистрСведений.УВМ_Уведомления КАК УВМ_Уведомления
			|ГДЕ
			|	(УВМ_Уведомления.КадровыйДокумент, УВМ_Уведомления.ДатаИзменения) В (ВЫБРАТЬ ФизическоеЛицо, Период ИЗ НаборЗаписей)
			|	И УВМ_Уведомления.УведомлениеОтправлено
			|;
			|
			// 3 данные физлица
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НаборЗаписей.ФизическоеЛицо,
			|	МАКСИМУМ(КадроваяИсторияСотрудников.Организация),
			|	МАКСИМУМ(КадроваяИсторияСотрудников.Подразделение),
			|	МАКСИМУМ(КадроваяИсторияСотрудников.Должность),
			|	МАКСИМУМ(ШтатноеРасписание.Подразделение) КАК ПодразделениеСтруктуры, 
			|	МАКСИМУМ(ШтатноеРасписание.УВМ_ДолжностьУпр) КАК УВМ_ДолжностьУпр, 
			|	МАКСИМУМ(КадроваяИсторияСотрудников.КоличествоСтавок),
			|	МАКСИМУМ(ФизическиеЛица.ДатаРождения) КАК ФизическоеЛицоДатаРождения,
			|	МАКСИМУМ(ФизическиеЛица.СтраховойНомерПФР) КАК ФизическоеЛицоСтраховойНомерПФР,
			|	МАКСИМУМ(ФИОФизическихЛицСрезПоследних.Фамилия),
			|	МАКСИМУМ(ФИОФизическихЛицСрезПоследних.Имя),
			|	МАКСИМУМ(ФИОФизическихЛицСрезПоследних.Отчество)
			|ИЗ
			|	НаборЗаписей КАК НаборЗаписей
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудников
			|		ПО НаборЗаписей.ФизическоеЛицо = КадроваяИсторияСотрудников.ФизическоеЛицо
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание 
			|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
			|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
			|		ПО НаборЗаписей.ФизическоеЛицо = ФизическиеЛица.Ссылка
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, -1), ) КАК ФИОФизическихЛицСрезПоследних
			|		ПО НаборЗаписей.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
			|СГРУППИРОВАТЬ ПО
			|	НаборЗаписей.ФизическоеЛицо
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МАКСИМУМ(КадроваяИсторияСотрудников.Организация) КАК Организация,
			|	МАКСИМУМ(ШтатноеРасписание.Подразделение) КАК ПодразделениеСтруктуры, 
			|	МАКСИМУМ(ШтатноеРасписание.УВМ_ДолжностьУпр) КАК УВМ_ДолжностьУпр 
			|ПОМЕСТИТЬ ПодразделенияФизлица	
			|ИЗ
			|	НаборЗаписей КАК НаборЗаписей
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудников
			|		ПО НаборЗаписей.ФизическоеЛицо = КадроваяИсторияСотрудников.ФизическоеЛицо
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание 
			|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
			|;	
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсполнителиЗадач.Исполнитель КАК Исполнитель,
			|	СтруктураПредприятия.Ссылка КАК Подразделение,
			|	ПодразделенияФизлица.ПодразделениеСтруктуры КАК ПодразделениеСтруктуры,
			|	ВЫБОР КОГДА СтруктураПредприятия.Ссылка = ПодразделенияФизлица.ПодразделениеСтруктуры ТОГДА Истина ИНАЧЕ Ложь КОНЕЦ КАК ЕстьПодразделение
			|ПОМЕСТИТЬ ПодразделенияИсполнителя	
			|ИЗ
			|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
			|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
			|	по СтруктураПредприятия.Ссылка = ИсполнителиЗадач.ДополнительныйОбъектАдресации
			|	или СтруктураПредприятия.Ссылка.Родитель = ИсполнителиЗадач.ДополнительныйОбъектАдресации 
			|	или СтруктураПредприятия.Ссылка.Родитель.Родитель = ИсполнителиЗадач.ДополнительныйОбъектАдресации 
			|	или СтруктураПредприятия.Ссылка.Родитель.Родитель.Родитель = ИсполнителиЗадач.ДополнительныйОбъектАдресации 
			|	или СтруктураПредприятия.Ссылка.Родитель.Родитель.Родитель.Родитель = ИсполнителиЗадач.ДополнительныйОбъектАдресации,
			|	ПодразделенияФизлица КАК ПодразделенияФизлица
			|ГДЕ
			|	НЕ СтруктураПредприятия.Ссылка Есть NULL
			|;	
			|
			// 6 кому отправить
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсполнителиЗадач.Исполнитель КАК Исполнитель
			|ИЗ
			|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
			|ГДЕ
			|	ИсполнителиЗадач.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.ОтветственныйЗаИзменениеКадровыхДанных)
			|	И (ИсполнителиЗадач.ОсновнойОбъектАдресации = Неопределено 
			|		ИЛИ ИсполнителиЗадач.ОсновнойОбъектАдресации В (ВЫБРАТЬ Организация ИЗ ПодразделенияФизлица))
			|	И (ИсполнителиЗадач.ДополнительныйОбъектАдресации = Неопределено 
			|		ИЛИ (ИсполнителиЗадач.Исполнитель, Истина) В (ВЫБРАТЬ Исполнитель, ЕстьПодразделение ИЗ ПодразделенияИсполнителя)) 
			|"; 
			
			НаборЗаписей = ЭтотОбъект.Выгрузить();
			Запрос.УстановитьПараметр("НаборЗаписей", НаборЗаписей);
			Запрос.УстановитьПараметр("НачалоПериода", НаборЗаписей[0].Период);
			РезультатЗапроса = Запрос.ВыполнитьПакет();
			
			ВыборкаПохожие = РезультатЗапроса[1].Выбрать();
			ВыборкаОтправки = РезультатЗапроса[2].Выбрать();
			ВыборкаДанныеФизлица = РезультатЗапроса[3].Выбрать();
			Получатели = РезультатЗапроса[6].Выгрузить().ВыгрузитьКолонку("Исполнитель"); 
			Если Получатели.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;	
			
			ЗаголовокСообщения = "Уведомление о кадровых изменениях";
			ТекстСообщения = "";
			Для Каждого Строка Из НаборЗаписей Цикл 
				ВыборкаПохожие.Сбросить();
				Если ВыборкаПохожие.НайтиСледующий(Строка.ФизическоеЛицо, "ФизическоеЛицо") Тогда
					Продолжить;
				КонецЕсли;
				ВыборкаОтправки.Сбросить();
				Если ВыборкаОтправки.НайтиСледующий(Строка.ФизическоеЛицо, "ФизическоеЛицо") Тогда
					Продолжить;
				КонецЕсли;	
				
				МенеджерЗаписи = РегистрыСведений.УВМ_Уведомления.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.КадровыйДокумент = Строка.ФизическоеЛицо;
				МенеджерЗаписи.ДатаУведомить = ТекущаяДата();
				МенеджерЗаписи.ДатаИзменения = Строка.Период;
				МенеджерЗаписи.УведомлениеОтправлено = Ложь;
				МенеджерЗаписи.Записать(Истина);
				
				ТекстСообщения = ТекстСообщения + " Изменение ФИО: " + Строка.ФизическоеЛицо + Символы.ПС;
				ВыборкаДанныеФизлица.Сбросить();
				Если ВыборкаДанныеФизлица.НайтиСледующий(Строка.ФизическоеЛицо, "ФизическоеЛицо") Тогда
					ТекстСообщения = ТекстСообщения + 
					СтрШаблон(НСтр("ru = ' 
					|Дата изменения 	%1
					|Организация 	%2
					|Подразделение 	%3
					|Кол-во ставок 	%4
					|Должность 	%5
					|Дата рождения	%6
					|СНИЛС	%7
					|Предыдущие ФИО	%8
					|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
					Формат(Строка.Период, "ДФ=dd.MM.yyyy"),
					ВыборкаДанныеФизлица.Организация,
					ВыборкаДанныеФизлица.Подразделение,
					ВыборкаДанныеФизлица.КоличествоСтавок,
					ВыборкаДанныеФизлица.Должность,
					Формат(ВыборкаДанныеФизлица.ФизическоеЛицоДатаРождения, "ДФ=dd.MM.yyyy"),
					ВыборкаДанныеФизлица.ФизическоеЛицоСтраховойНомерПФР,
					СтрШаблон("%1 %2 %3", ВыборкаДанныеФизлица.Фамилия, ВыборкаДанныеФизлица.Имя, ВыборкаДанныеФизлица.Отчество)
					) + Символы.ПС;
				КонецЕсли;	
			КонецЦикла;
			
			Если ТекстСообщения <> "" Тогда
				УспешныйУспех = ОбменДаннымиПереопределяемый.ОтправитьУведомлениеПоEmail(Получатели, ЗаголовокСообщения, ТекстСообщения, , ТипТекстаПочтовогоСообщения.ПростойТекст); 
				Если УспешныйУспех Тогда
					Для Каждого Строка Из НаборЗаписей Цикл
						МенеджерЗаписи = РегистрыСведений.УВМ_Уведомления.СоздатьМенеджерЗаписи();
						МенеджерЗаписи.КадровыйДокумент = Строка.ФизическоеЛицо;
						МенеджерЗаписи.Прочитать(); 
						Если ЗначениеЗаполнено(МенеджерЗаписи.КадровыйДокумент) Тогда
							МенеджерЗаписи.УведомлениеОтправлено = Истина;
							МенеджерЗаписи.Записать(Истина);
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;	
			КонецЕсли; 
			
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
