
//++dar 20221128 (11805)
&После("ЗаполнитьПравилаОбработкиДанных")
Процедура УВМ_ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных)
	Если НаправлениеОбмена = "Отправка" Тогда
		ДобавитьПОД_Справочник_УВМ_ДолжностиУпр_Отправка(ПравилаОбработкиДанных); // + СБит 2024-01-12
		ДобавитьПОД_Справочник_Должности_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Сотрудники_Отправка(ПравилаОбработкиДанных);
	КонецЕсли;
КонецПроцедуры

&После("ЗаполнитьПравилаКонвертацииОбъектов")
Процедура УВМ_ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации)
	Если НаправлениеОбмена = "Отправка" Тогда
		ДобавитьПКО_Справочник_УВМ_ДолжностиУпр_Отправка(ПравилаКонвертации);  // + СБит 2024-01-12
		ДобавитьПКО_Справочник_Должности_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Сотрудники_Отправка(ПравилаКонвертации);
	КонецЕсли;
КонецПроцедуры

&После("ВыполнитьПроцедуруМодуляМенеджера")
Процедура УВМ_ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры)
	Если ИмяПроцедуры = "ПКО_Справочник_Сотрудники_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_Сотрудники_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьПОД_Справочник_Должности_Отправка(ПравилаОбработкиДанных)
	
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_Должности_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.Должности;
	ПравилоОбработки.ОчисткаДанных           = Ложь;

	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_Должности_Отправка");
	
КонецПроцедуры

Процедура ДобавитьПОД_Справочник_Сотрудники_Отправка(ПравилаОбработкиДанных)
	
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_Сотрудники_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.Сотрудники;
	ПравилоОбработки.ОчисткаДанных           = Ложь;

	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_Сотрудники_Отправка");

КонецПроцедуры

Процедура ДобавитьПКО_Справочник_Должности_Отправка(ПравилаКонвертации)
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Справочник_Должности_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Справочники.Должности;
	ПравилоКонвертации.ОбъектФормата     = "Справочник.Должности";
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование");

	
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_Сотрудники_Отправка(ПравилаКонвертации)
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Справочник_Сотрудники_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Справочники.Сотрудники;
	ПравилоКонвертации.ОбъектФормата     = "Справочник.Сотрудники";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_Сотрудники_Отправка_ПриОтправкеДанных";
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "",                    "Актуальность", 1);
	ДобавитьПКС(СвойстваШапки, "ГоловнаяОрганизация", "Организация", , "Справочник_Организации_Отправка");
	ДобавитьПКС(СвойстваШапки, "",                    "ДатаПриема", 1);
	ДобавитьПКС(СвойстваШапки, "",                    "ДатаУвольнения", 1);
	ДобавитьПКС(СвойстваШапки, "",                    "Должность", 1);
	ДобавитьПКС(СвойстваШапки, "Наименование",        "Наименование");
	ДобавитьПКС(СвойстваШапки, "",                    "Подразделение", 1);
	ДобавитьПКС(СвойстваШапки, "ФизическоеЛицо",      "Физлицо", , "Справочник_ФизическиеЛица_Отправка");

	
КонецПроцедуры 

Процедура ПКО_Справочник_Сотрудники_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	ТекущиеКадровыеДанные.ДатаПриема КАК ДатаПриема,
	|	ТекущиеКадровыеДанные.ДатаУвольнения КАК ДатаУвольнения,
	|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение КАК Подразделение,
	|	ДанныеДляПодбора.Должность КАК Должность,
	|	ВидыЗанятостиСотрудниковДляПодбора.ВидЗанятости КАК ВидЗанятости,
	|	ЕСТЬNULL(ДанныеДляПодбора.ВидДоговора, ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровССотрудниками.ПустаяСсылка)) КАК ВидДоговора
	|ИЗ
	|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО (ДанныеДляПодбора.Сотрудник = Сотрудники.Ссылка)
	|			И (ДанныеДляПодбора.Наименование = Сотрудники.Наименование)
	|			И (ДанныеДляПодбора.ИдентификаторЗаписи В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ДанныеДляПодбораСотрудниковОтбор.ИдентификаторЗаписи
	|				ИЗ
	|					РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудниковОтбор
	|				ГДЕ
	|					ДанныеДляПодбораСотрудниковОтбор.Сотрудник = ДанныеДляПодбора.Сотрудник
	|					И ДанныеДляПодбораСотрудниковОтбор.Наименование = ДанныеДляПодбора.Наименование
	|					И ДанныеДляПодбораСотрудниковОтбор.Начало <= &ДатаОкончания
	|					И (ДанныеДляПодбораСотрудниковОтбор.Окончание = ДАТАВРЕМЯ(1, 1, 1)
	|						ИЛИ ДанныеДляПодбораСотрудниковОтбор.Окончание >= &ДатаНачала)
	|				УПОРЯДОЧИТЬ ПО
	|					ДанныеДляПодбораСотрудниковОтбор.ПоДоговоруГПХ,
	|					ДанныеДляПодбораСотрудниковОтбор.Начало УБЫВ,
	|					ДанныеДляПодбораСотрудниковОтбор.Организация,
	|					ДанныеДляПодбораСотрудниковОтбор.Филиал,
	|					ДанныеДляПодбораСотрудниковОтбор.Подразделение))
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанные
	|		ПО (ДанныеДляПодбора.ФизическоеЛицо = ТекущиеКадровыеДанные.ФизическоеЛицо)
	|			И (ДанныеДляПодбора.Сотрудник = ТекущиеКадровыеДанные.Сотрудник)
	|			И (ДанныеДляПодбора.Организация = ТекущиеКадровыеДанные.ГоловнаяОрганизация)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыЗанятостиСотрудниковИнтервальный КАК ВидыЗанятостиСотрудниковДляПодбора
	|		ПО (ДанныеДляПодбора.Сотрудник = ВидыЗанятостиСотрудниковДляПодбора.Сотрудник)
	|			И (ВЫБОР
	|				КОГДА ДанныеДляПодбора.Окончание = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ КОНЕЦПЕРИОДА(ДанныеДляПодбора.Окончание, ДЕНЬ)
	|			КОНЕЦ МЕЖДУ ВидыЗанятостиСотрудниковДляПодбора.ДатаНачала И ВидыЗанятостиСотрудниковДляПодбора.ДатаОкончания)}
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
	|		ПО (МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция = ДанныеДляПодбора.ДолжностьПоШтатномуРасписанию)
	|ГДЕ
	|	Сотрудники.Ссылка = &Сотрудник";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Сотрудник", ДанныеИБ.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	//Простые типы
	ДанныеXDTO.Вставить("Актуальность", НЕ ЗначениеЗаполнено(Выборка.ДатаУвольнения));//НЕ ДанныеИБ.ВАрхиве);
	ДанныеXDTO.Вставить("ДатаПриема", Выборка.ДатаПриема);
	ДанныеXDTO.Вставить("ДатаУвольнения", Выборка.ДатаУвольнения);
	
	//Должность
	ДанныеXDTO.Вставить("Должность", Новый Структура("Значение, ИмяПКО", Выборка.Должность,"Справочник_Должности_Отправка"));
	
	//Подразделение
	ДанныеXDTO.Вставить("Подразделение", Новый Структура("Значение, ИмяПКО", Выборка.Подразделение,"Справочник_Подразделения_Отправка"));

КонецПроцедуры
//--dar 20221128 (11805)


// + СБит 2024-01-12
Процедура ДобавитьПОД_Справочник_УВМ_ДолжностиУпр_Отправка(ПравилаОбработкиДанных)
	
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_УВМ_ДолжностиУпр_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.УВМ_ДолжностиУпр;
	ПравилоОбработки.ОчисткаДанных           = Ложь;

	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_УВМ_ДолжностиУпр_Отправка");
	
КонецПроцедуры

// + СБит 2024-01-12
Процедура ДобавитьПКО_Справочник_УВМ_ДолжностиУпр_Отправка(ПравилаКонвертации)
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Справочник_УВМ_ДолжностиУпр_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Справочники.УВМ_ДолжностиУпр;
	ПравилоКонвертации.ОбъектФормата     = "Справочник.УВМ_ДолжностиУпр";
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование");

	
КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьПКО_Справочник_Подразделения_Отправка")
Процедура УВМ_ДобавитьПКО_Справочник_Подразделения_Отправка(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Справочник_Подразделения_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Справочники.СтруктураПредприятия;
	ПравилоКонвертации.ОбъектФормата     = "Справочник.Подразделения";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_Подразделения_Отправка_ПриОтправкеДанных";

	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование");
	ДобавитьПКС(СвойстваШапки, "Родитель",     "ВышестоящееПодразделение", , "Справочник_Подразделения_Отправка");

#Удаление
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "ДополнительныеРеквизиты");
	ДобавитьПКС(СвойстваТЧ, "", "ЗначениеСвойства", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Свойство", 1);
#КонецУдаления

КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Справочник_Подразделения_Отправка_ПриОтправкеДанных")
Процедура УВМ_ПКО_Справочник_Подразделения_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;

#Удаление
	Если ТипЗнч(ДанныеИБ) = Тип("СправочникОбъект.СтруктураПредприятия") Тогда
		Если Не ДанныеИБ.Метаданные().ТабличныеЧасти.Найти("ДополнительныеРеквизиты") = Неопределено Тогда
			ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Истина);
		КонецЕсли;
	КонецЕсли;
#КонецУдаления
КонецПроцедуры


