
&НаСервере
&После("ПриСозданииНаСервере")
Процедура УВМ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++dar 13.02.24 (166614)
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_Разряд", "ГлавноеСтраницаГруппаЛевая", Истина);
	//--dar 13.02.24 (166614)
	
	//++dar 25.06.25 (255715)
	Если Объект.Дата >= УВМ_КэшированиеЗначений.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		СвойстваПоля_Руководитель = Новый Структура;
		СвойстваПоля_Руководитель.Вставить("АвтоОтметкаНезаполненного", Истина);
		УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_Руководитель", "ГлавноеСтраницаГруппаЛевая", Истина, , , , СвойстваПоля_Руководитель);
	КонецЕсли;
	//--dar 25.06.25 (255715)

КонецПроцедуры

//++dar 31.05.24 (183874)
&НаКлиенте
Процедура Подключаемый_РабочееМестоПриСоздании(Элемент, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	РабочееМестоПриСозданииНаСервере();
КонецПроцедуры                         

&НаСервере
Процедура РабочееМестоПриСозданииНаСервере()
	НовоеРМ = УВМ_ОбщиеДоработки.СоздатьНовоеРабочееМесто(Объект.Организация, Объект.Подразделение, Объект.Должность);
	Объект.РабочееМесто = НовоеРМ;
КонецПроцедуры
//--dar 31.05.24 (183874)
