#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
#Область СлужебныйПрограммныйИнтерфейс

Функция НовыеСохраняемыеНастройки() Экспорт

	СохраняемыеНастройки = Новый Структура;
	
	ИсключаемыеРеквизиты = Новый Структура;
	ИсключаемыеРеквизиты.Вставить("ТаблицаДанныеОтчета");
	ИсключаемыеРеквизиты.Вставить("СтандартныйПериод");
	
	РеквизитыОбъекта = Метаданные.Отчеты.бит_ПроизвольныйОтчет.Реквизиты;
	Для Каждого Реквизит Из РеквизитыОбъекта Цикл
		Если ИсключаемыеРеквизиты.Свойство(Реквизит.Имя) Тогда
			Продолжить;
		КонецЕсли; 
		СохраняемыеНастройки.Вставить(Реквизит.Имя);
	КонецЦикла;
	
	СохраняемыеНастройки.Вставить("ОтборВОтчете",
		Новый ХранилищеЗначения(Новый ТаблицаЗначений, Новый СжатиеДанных(9))); 
	СохраняемыеНастройки.Вставить("ТаблицаПараметры",
		Новый ХранилищеЗначения(Новый ТаблицаЗначений, Новый СжатиеДанных(9)));
	СохраняемыеНастройки.Вставить("ВариантПериода", ВариантСтандартногоПериода.ЭтотГод);
	
	Возврат СохраняемыеНастройки;
	
КонецФункции

Функция НовыеПараметрыФормированияОтчета() Экспорт

	НовыеПараметры = Новый Структура;
	НовыеПараметры.Вставить("НастройкаОтчета", 			Неопределено);
	НовыеПараметры.Вставить("ДатаНачала", 				'0001-01-01');
	НовыеПараметры.Вставить("ДатаОкончания", 			'0001-01-01');
	НовыеПараметры.Вставить("ФорматЧисел", 				"");
	НовыеПараметры.Вставить("ОтборВОтчете", 			Новый ТаблицаЗначений);
	НовыеПараметры.Вставить("Язык", 					Неопределено);
	НовыеПараметры.Вставить("Организация", 				Неопределено);
	НовыеПараметры.Вставить("УдалитьПримечания", 		Ложь);
	НовыеПараметры.Вставить("ТаблицаПараметры", 		Новый ТаблицаЗначений);
	НовыеПараметры.Вставить("ТаблицаДанныеОтчета", 		Новый ТаблицаЗначений);
	НовыеПараметры.Вставить("ВалютаДокумента", 			Неопределено);
	НовыеПараметры.Вставить("КурсДокумента", 			0);
	НовыеПараметры.Вставить("КратностьДокумента", 		0);
	НовыеПараметры.Вставить("НастройкаПулаПодключений", Неопределено);
	НовыеПараметры.Вставить("Результат", 				Новый ТабличныйДокумент());
	НовыеПараметры.Вставить("ИмяОбласти", 				"");
	
	Возврат НовыеПараметры;
	
КонецФункции

Функция РезультатФормированияОтчета(ПараметрыЗаполнения) Экспорт
	
	бит_МеханизмПолученияДанных.СформироватьПроизвольныйОтчет(ПараметрыЗаполнения,
		ПараметрыЗаполнения.Результат, ПараметрыЗаполнения.ОтборВОтчете, ПараметрыЗаполнения.ТаблицаПараметры, 
		ПараметрыЗаполнения.ТаблицаДанныеОтчета, ПараметрыЗаполнения.НастройкаПулаПодключений);
		
	Если ПараметрыЗаполнения.УдалитьПримечания Тогда
		УдалениеПримечания(ПараметрыЗаполнения.Результат);
	КонецЕсли;	
		
	РезультатФормирования = Новый Структура("Результат, ДанныеОтчета", 
								ПараметрыЗаполнения.Результат, ПараметрыЗаполнения.ТаблицаДанныеОтчета);
	
	Возврат РезультатФормирования;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалениеПримечания(ДокументРезультат)
	
	Для каждого Область Из ДокументРезультат.Области Цикл
		Область.Примечание.Текст = "";
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли