
#Область СлужебныйПрограммныйИнтерфейс

// Параметры проверки пользовательского условия.
//
// Параметры:
//  ПользовательскоеУсловие - СправочникСсылка.бит_ПользовательскиеУсловия.
//	ИмяПроверяемогоОбъекта - Строка - Полное имя метаданных проверяемого объекта.
// 
// Возвращаемое значение:
//  Структура - параметры проверки:
//   * КодУсловия - Строка - Код условия пользовательского условия.
//   * УсловиеПодходитТекущемуОбъекту - Булево.
//
Функция ПараметрыПроверкиПользовательскогоУсловия(ПользовательскоеУсловие, ИмяПроверяемогоОбъекта) Экспорт
	
	ПараметрыПроверки = Справочники.бит_ПользовательскиеУсловия.ПараметрыПроверкиСсылкиПользовательскогоУсловия(
																					ПользовательскоеУсловие,
																					ИмяПроверяемогоОбъекта);
	Возврат Новый ФиксированнаяСтруктура(ПараметрыПроверки);
	
КонецФункции

Функция ТипСтатусаОбъкта(Статус) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Статус, "ТипСтатуса");
	
КонецФункции

// Возвращает настройки для объекта визирования из регистра сведений бит_НастройкиОбъектовВизирования.
// 
// Параметры:
//  Объект - ДокументОбъект; СправочникОбъект; ДокументСсылка; СправочникСсылка.
// 
// Возвращаемое значение:
//   Структура
//		* ИспользоватьВизирование - Булево, 
//		* РежимОбновленияВиз      - ПеречислениеСсылка.бит_РежимыОбновленияПеречняВиз.
//
Функция НастройкиОбъектаВизирования(Объект) Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить("ИспользоватьВизирование", Ложь);
	Настройки.Вставить("РежимОбновленияВиз",      Перечисления.бит_РежимыОбновленияПеречняВиз.ОбновлятьПриПерепроведении);
	Настройки.Вставить("РежимКонтроляВложений",   Перечисления.бит_ВидыКонтроля.НеКонтролировать);
	Настройки.Вставить("ПриниматьКУчетуПослеУтверждения", Ложь);
	
	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат Настройки;
	КонецЕсли;
	
	ТипОбъекта = ТипЗнч(Объект);
	Если ТипОбъекта = Тип("Строка") Тогда
		ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(Объект);
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.бит_ОбъектыСистемы") Тогда
		ОбъектСистемы = Объект;
	Иначе
		Возврат Настройки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиОбъектовВизирования.ОбъектСистемы КАК ОбъектСистемы,
	|	НастройкиОбъектовВизирования.ИспользоватьВизирование КАК ИспользоватьВизирование,
	|	ВЫБОР
	|		КОГДА НастройкиОбъектовВизирования.РежимОбновленияВиз = ЗНАЧЕНИЕ(Перечисление.бит_РежимыОбновленияПеречняВиз.ПоУмолчанию)
	|			ТОГДА &РежимОбновленияВизПоУмолчанию
	|		ИНАЧЕ НастройкиОбъектовВизирования.РежимОбновленияВиз
	|	КОНЕЦ КАК РежимОбновленияВиз,
	|	ВЫБОР
	|		КОГДА НастройкиОбъектовВизирования.РежимКонтроляВложений = ЗНАЧЕНИЕ(Перечисление.бит_ВидыКонтроля.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ВидыКонтроля.НеКонтролировать)
	|		ИНАЧЕ НастройкиОбъектовВизирования.РежимКонтроляВложений
	|	КОНЕЦ КАК РежимКонтроляВложений,
	|	НастройкиОбъектовВизирования.ПриниматьКУчетуПослеУтверждения КАК ПриниматьКУчетуПослеУтверждения
	|ИЗ
	|	РегистрСведений.бит_НастройкиОбъектовВизирования КАК НастройкиОбъектовВизирования
	|ГДЕ
	|	НастройкиОбъектовВизирования.ОбъектСистемы = &ОбъектСистемы";
	Запрос.УстановитьПараметр("ОбъектСистемы", ОбъектСистемы);
	Запрос.УстановитьПараметр("РежимОбновленияВизПоУмолчанию",
								бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_РежимОбновленияПеречняВиз"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Настройки, Выборка);
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти