
&После("ПередВыполнениемКомандыПечатиВнешнейПечатнойФормы")
Процедура УВМ_ПередВыполнениемКомандыПечатиВнешнейПечатнойФормы(ПечатаемыеОбъекты, СтандартнаяОбработка)
	//++dar 15.06.26
	Если ПечатаемыеОбъекты = Неопределено
		Или ТипЗнч(ПечатаемыеОбъекты) <> Тип("Массив")
		Или ПечатаемыеОбъекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если Не УВМ_ПечатьВызовСервера.ПечатаемыйОбъектДокумент(ПечатаемыеОбъекты[0]) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	//--dar 15.06.26
КонецПроцедуры
