////////////////////////////////////////////////////////////////////////////////
// Модуль содержит методы работы со строками.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область РаботаСоСложнымиСтроками

// Устаревшая. Используй "бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями".
// 
// Параметры: 
//  Стр - Строка, которую необходимо разложить на подстроки.
//  Разделитель - Строка-разделитель, по умолчанию - запятая.
// 
// Возвращаемое значение:
//  Массив - Массив значений, элементы которого - подстроки.
// 
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	Возврат бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(Стр, Разделитель);
		
КонецФункции

// Разбирает строку с разделителями и упаковывает значения в массив.
// 
// Параметры:
//  ИсходнаяСтрока  - Строка
//  Разделитель     - Строка
//  ПоНарастающей   - Булево (По умолчанию = Ложь).
//
// Возвращаемое значение:
//  Массив
// 
Функция РазобратьСтрокуСРазделителями(ИсходнаяСтрока, Разделитель, ПоНарастающей = Ложь) Экспорт
	
	РезМассив = Новый Массив;

	Список = бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(ИсходнаяСтрока, Разделитель);
	Если ПоНарастающей Тогда
	     НарастающаяСтрока = "";
		 Для каждого СтрокаСписка Из Список Цикл
		 	 НарастающаяСтрока = ?(ПустаяСтрока(НарастающаяСтрока), СтрокаСписка, НарастающаяСтрока + "." + СтрокаСписка);
			 РезМассив.Добавить(НарастающаяСтрока);
		 КонецЦикла; 
	Иначе
		РезМассив = Список; 
	КонецЕсли;
	
	Возврат РезМассив;
	
КонецФункции

// Разбирает строку с разделителями и упаковывает значения в массив.
// 
// Параметры:
//  ИсходнаяСтрока - Строка
//  МассивРазделителей - Массив
//
// Возвращаемое значение:
//  Массив
//
Функция РазобратьСтрокуСМассивомРазделителей(ИсходнаяСтрока, МассивРазделителей) Экспорт
	
	РезМассив = Новый Массив;
	
	// Функция возвращает строки, разделенные различными разделителями.
	// Возможные разделители передаются в виде массива. 
	// Например: есть Строка "(П1)(П2)" - получаем массив с элементами "П1", "П2". 
	РезМассив = СтрРазделить(ИсходнаяСтрока, СтрСоединить(МассивРазделителей), Ложь);
	
	Возврат РезМассив;
	
КонецФункции

// Формирует из исходной строки СтрокаПоиска строку для поиска данных в запросе.
// 
// Параметры:
// 	СтрокаПоиска - Строка - исходная строка, содержащая запрещенные символы.
// 
// Возвращаемое значение:
//  Строка - строка подготовленная для поиска данных в запросе.
// 
Функция СформироватьСтрокуДляПоискаВЗапросе(Знач СтрокаПоиска) Экспорт
	
	ИтоговаяСтрокаДляПоиска = СтрокаПоиска;
	ИтоговаяСтрокаДляПоиска = СтрЗаменить(ИтоговаяСтрокаДляПоиска, "~", "~~");
	ИтоговаяСтрокаДляПоиска = СтрЗаменить(ИтоговаяСтрокаДляПоиска, "%", "~%");
	ИтоговаяСтрокаДляПоиска = СтрЗаменить(ИтоговаяСтрокаДляПоиска, "_", "~_");
	ИтоговаяСтрокаДляПоиска = СтрЗаменить(ИтоговаяСтрокаДляПоиска, "[", "~[");
	ИтоговаяСтрокаДляПоиска = СтрЗаменить(ИтоговаяСтрокаДляПоиска, "-", "~-");
	
	Возврат ИтоговаяСтрокаДляПоиска;
	
КонецФункции // СформироватьСтрокуДляПоискаВЗапросе()

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Устарела. Следует использовать методы работы со строками. Заполнение массива и СтрСоединить.
// см. Стандарты разработки "Массовая конкатенация строк".
// Удалить после 01.01.2026 г.
Функция ДобавитьСтрокуСРазделителем(ИсходнаяСтрока, СтрокаДополнение, Разделитель = "") Экспорт

	РезСтрока = ИсходнаяСтрока+?(ПустаяСтрока(ИсходнаяСтрока), "", Разделитель) + СтрокаДополнение;
	
    Возврат РезСтрока;
	
КонецФункции

// Функция выделяет из строки формулы имена аргументов.
// 
// Параметры:
//  Формула  - Строка.
// 
// Возвращаемое значение:
//   Массив - значения массива: имена реквизитов.
// 
Функция РазобратьФормулу(Формула) Экспорт
	
	Результат = Новый Массив;
	ТекСтрока = Формула;
	ТекСтрока = СтрЗаменить(ТекСтрока, "[", "[@");
	ЧастиФормулы = СтрРазделить(ТекСтрока, "[", Ложь);
	Для каждого Часть Из ЧастиФормулы Цикл
		ПодстрокиФормулы = СтрРазделить(Часть, "]", Ложь);
		Для каждого ЧастьПодстроки Из ПодстрокиФормулы Цикл
			Если СтрНачинаетсяС(ЧастьПодстроки, "@") Тогда
				Результат.Добавить(Сред(ЧастьПодстроки, 2));
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла; 
	Результат = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
