
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ГотовностьТрансляции");
	ОписаниеВарианта.Описание = НСтр("ru = 'Показывает готовность правил трансляции к работе.'");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.бит_КомИнт_ПреобразованиеДанных.Подсистемы.бит_КомИнт_МеханизмТрансляции, "");
	ОписаниеВарианта.Включен = Истина;

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли