
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.РежимКонтроляВложений.Пустая() Тогда
		Запись.РежимКонтроляВложений = ПредопределенноеЗначение("Перечисление.бит_ВидыКонтроля.НеКонтролировать");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектСистемыПриИзменении(Элемент)
	
	Запись.ПриниматьКУчетуПослеУтверждения = Ложь;
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	УправлениеРежимомКонтроляВложений();
	УправлениеПринятиемКУчету();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеРежимомКонтроляВложений()
	
	Элементы.РежимКонтроляВложений.Видимость = Истина;
	
	ОбъектСистемы = Запись.ОбъектСистемы;
	Если ОбъектСистемы.Пустая() Тогда
		Возврат;
	КонецЕсли;

	ИмяТипа    = ОбъектСистемы.ИмяОбъектаПолное;
	ИмяТипа    = СтрЗаменить(ИмяТипа, "Документ.", "ДокументОбъект.");
	ИмяТипа    = СтрЗаменить(ИмяТипа, "Справочник.", "СправочникОбъект.");
	ТипОбъекта = Тип(ИмяТипа);
	
	Если Метаданные.ОпределяемыеТипы.бит_ОбъектыКонтроляВложений.Тип.СодержитТип(ТипОбъекта)
		ИЛИ бит_ОбщегоНазначенияПереопределяемый.ИспользуетсяМеханизмПозиций(ТипОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	Запись.РежимКонтроляВложений = Перечисления.бит_ВидыКонтроля.НеКонтролировать;
	Элементы.РежимКонтроляВложений.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеПринятиемКУчету()
	
	Элементы.ПриниматьКУчетуПослеУтверждения.Видимость = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Запись.ОбъектСистемы) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыСистемы = бит_ВизированиеСервер.ОбъектыСистемыСДоступнымМеханизмомПринятияКУчету();
	Элементы.ПриниматьКУчетуПослеУтверждения.Видимость =
		(ОбъектыСистемы.НайтиПоЗначению(Запись.ОбъектСистемы) <> Неопределено);
	
КонецПроцедуры

#КонецОбласти