
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Шаблон = Параметры.Шаблон;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДиапазонДобавить(Команда)
	
	ДобавитьТекст("[" + ДиапазонСодержит + "]");
	ДиапазонСодержит = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПроизвольныйСимвол(Команда)
	
	ДобавитьТекст("_");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Закрыть(Шаблон);
	
КонецПроцедуры

&НаКлиенте
Процедура НеДиапазонДобавить(Команда)
	
	ДобавитьТекст("[^" + ДиапазонНеСодержит + "]");
	ДиапазонНеСодержит = "";
	
КонецПроцедуры

&НаКлиенте
Процедура СловоДобавить(Команда)
	
	ДобавитьТекст("%" + Слово + "%");
	Слово = "";
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИ(Команда)
	
	ДобавитьТекст("&");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИЛИ(Команда)
	
	ДобавитьТекст("~");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтрицание(Команда)
	
	ДобавитьТекст("-");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкобка1(Команда)
	
	ДобавитьТекст("{");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкобка2(Команда)
	
	ДобавитьТекст("}");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьШаблонПоТексту(Команда)
	
	УсловиеВыполнено = ПроверитьШаблонПоТекстуСервер(ПроверочныйТекст, Шаблон);
	
	Если УсловиеВыполнено Тогда
		ТекстСообщения = Нстр("ru='Текст пройден.';en='The text passed.'"); 
	Иначе	
		ТекстСообщения = Нстр("ru='Текст не пройден.';en='The text is not passed.'"); 
	КонецЕсли; 
	
	ПоказатьПредупреждение(, ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьТекст(Текст)

	Элементы.Шаблон.ВыделенныйТекст = Текст;
	ЭтотОбъект.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьШаблонПоТекстуСервер(ПроверяемыйТекст, Шаблон)

	УсловиеВыполнено = бит_МеханизмДопИзмерений.ТекстСоответствуетШаблону(ПроверяемыйТекст, Шаблон);
	
	Возврат УсловиеВыполнено;
	
КонецФункции

#КонецОбласти
