#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект = Форма.Запись;
	Элементы = Форма.Элементы;	
	
	ДополнительныеПоля = НастройкаДополнительныхПолей(Объект.ВидДокумента);
	
	Элементы.ГруппаДополнительноеПоле.Видимость = ДополнительныеПоля.ИспользоватьДопПоле = Истина;
	Если Элементы.ГруппаДополнительноеПоле.Видимость Тогда
		Элементы.ДопПоле.Заголовок = ДополнительныеПоля.НазваниеДопПоля;
	КонецЕсли;
	
	Элементы.ГруппаДополнительноеПоле2.Видимость = ДополнительныеПоля.ИспользоватьДопПоле2 = Истина;
	Если Элементы.ГруппаДополнительноеПоле2.Видимость Тогда
		Элементы.ДопПоле2.Заголовок = ДополнительныеПоля.НазваниеДопПоля2;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкаДополнительныхПолей(ВидДокумента)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидДокумента, "ИспользоватьДопПоле, ИспользоватьДопПоле2, НазваниеДопПоля, НазваниеДопПоля2");
	
КонецФункции

#КонецОбласти