
&ИзменениеИКонтроль("УстановитьПрефикс")
Процедура УВМ_УстановитьПрефикс(Источник, Префикс, УстановитьПрефиксИнформационнойБазы, УстановитьПрефиксОрганизации)

	ПрефиксИнформационнойБазы = "";
	ПрефиксОрганизации        = "";

	Если УстановитьПрефиксИнформационнойБазы Тогда

		ПриОпределенииПрефиксаИнформационнойБазы(ПрефиксИнформационнойБазы);

		ДополнитьСтрокуНулямиСлева(ПрефиксИнформационнойБазы, 2);
	КонецЕсли;

	Если УстановитьПрефиксОрганизации Тогда

		Если РеквизитОрганизацияДоступен(Источник) Тогда

			ПриОпределенииПрефиксаОрганизации(
			Источник[ИмяРеквизитаОрганизация(Источник.Метаданные())], ПрефиксОрганизации);
			// Если задана пустая ссылка на организацию.
			Если ПрефиксОрганизации = Ложь Тогда

				ПрефиксОрганизации = "";

			КонецЕсли;
			#Вставка
			//++dar 27.09.23 (147515)
			МассивДокументовДляПроверкиПрефикса = Новый Массив;
			МассивДокументовДляПроверкиПрефикса.Добавить(Тип("ДокументОбъект.Увольнение"));
			МассивДокументовДляПроверкиПрефикса.Добавить(Тип("ДокументОбъект.Отпуск"));
			МассивДокументовДляПроверкиПрефикса.Добавить(Тип("ДокументОбъект.ОтпускБезСохраненияОплаты"));
			МассивДокументовДляПроверкиПрефикса.Добавить(Тип("ДокументОбъект.КадровыйПеревод"));
			МассивДокументовДляПроверкиПрефикса.Добавить(Тип("ДокументОбъект.Командировка"));
			//--dar 27.09.23 (147515)
			
			// + БаринбергГМ 20230829 (143191)
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Подразделение", Источник.Метаданные()) Тогда
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("УВМ_Префикс", Источник.Подразделение.Метаданные()) Тогда
					ПрефиксПодразделения = Источник.Подразделение.УВМ_Префикс;
					Если ЗначениеЗаполнено(ПрефиксПодразделения) Тогда
						ПрефиксОрганизации = ПрефиксПодразделения;
					КонецЕсли;                                                                                          
				КонецЕсли;
			// - БаринбергГМ 20230829 (143191)
			
			//++dar 27.09.23 (147515)
			ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("УВМ_Подразделение", Источник.Метаданные()) Тогда
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("УВМ_Префикс", Источник.УВМ_Подразделение.Метаданные()) Тогда
					ПрефиксПодразделения = Источник.УВМ_Подразделение.УВМ_Префикс;
					Если ЗначениеЗаполнено(ПрефиксПодразделения) Тогда
						ПрефиксОрганизации = ПрефиксПодразделения;
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли МассивДокументовДляПроверкиПрефикса.Найти(ТипЗнч(Источник)) <> Неопределено И ОбщегоНазначения.ЕстьРеквизитОбъекта("Сотрудник", Источник.Метаданные()) Тогда
				СтрокаКадровыхДанных = КадровыйУчет.КадровыеДанныеСотрудника(Истина, Источник.Сотрудник, "Подразделение", ТекущаяДатаСеанса()); 
				Если СтрокаКадровыхДанных <> Неопределено Тогда
					ПодразделениеСотрудника = СтрокаКадровыхДанных.Подразделение;
					ПрефиксПодразделения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПодразделениеСотрудника, "УВМ_Префикс", Истина);
					Если ЗначениеЗаполнено(ПрефиксПодразделения) Тогда
						ПрефиксОрганизации = ПрефиксПодразделения;
					КонецЕсли; 
				КонецЕсли;
				
			КонецЕсли;
			//--dar 27.09.23 (147515)
			#КонецВставки

		КонецЕсли;

		ДополнитьСтрокуНулямиСлева(ПрефиксОрганизации, 2);
	КонецЕсли;

	ШаблонПрефикса = "[ОР][ИБ]-[Префикс]";
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ОР]", ПрефиксОрганизации);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ИБ]", ПрефиксИнформационнойБазы);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[Префикс]", Префикс);

	Префикс = ШаблонПрефикса;

КонецПроцедуры
