
&НаСервере
Процедура УВМ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//+ dar 20220825 (14517)
	УВМ_УстановитьПрограммныеНастройки();
	//- dar 20220825 (14517)
КонецПроцедуры

&НаСервере
Процедура УВМ_УстановитьПрограммныеНастройки()
	//+ dar 20220825 (14517)
	Если Элементы.Найти("УВМ_Организация") = Неопределено Тогда
		УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_Организация", Элементы.ДоставкаПоЭлектроннойПочте, "Объект.УВМ_Организация", , Элементы.ГруппаДоставкаПоЭлектроннойПочте);
	КонецЕсли;
	//- dar 20220825 (14517)
	// + СБит 2023-12-28 161905 
	Если Элементы.Найти("УВМ_ВидАдреса") = Неопределено Тогда
		УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_ВидАдреса", Элементы.ДоставкаПоЭлектроннойПочте, "Объект.УВМ_ВидАдреса", , Элементы.ГруппаДоставкаПоЭлектроннойПочте);
	КонецЕсли;
    // - СБит 2023-12-28
КонецПроцедуры
