
&НаСервере
Процедура ПоменятьРуководителяНаСервере()
	
	МсвПодчиненных = УВМ_ОбщиеДоработки.ПодчиненныеСотрудника(СтарыйРуководитель);
	
	Для Каждого ТекущийПодчиненный Из МсвПодчиненных Цикл
		МенеджерЗаписи = РегистрыСведений.УВМ_Руководители.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ДатаСмены;
		МенеджерЗаписи.Физлицо = ТекущийПодчиненный;
		МенеджерЗаписи.Руководитель = НовыйРуководитель;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоменятьРуководителя(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДатаСмены) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен реквизит 'Дата смены'", , "ДатаСмены");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтарыйРуководитель) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен реквизит 'Старый руководитель'", , "СтарыйРуководитель");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(НовыйРуководитель) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен реквизит 'Новый руководитель'", , "НовыйРуководитель");
		Возврат;
	КонецЕсли;

	ПоменятьРуководителяНаСервере();
КонецПроцедуры

&НаСервере
Процедура НазначитьРуководителяНаСервере()

	Для Каждого СтрокаТЧ Из Подчиненные Цикл	
		МенеджерЗаписи = РегистрыСведений.УВМ_Руководители.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ДатаНазначения;
		МенеджерЗаписи.Физлицо = СтрокаТЧ.Значение;
		МенеджерЗаписи.Руководитель = Руководитель;
		МенеджерЗаписи.Записать();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура НазначитьРуководителя(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДатаНазначения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен реквизит 'Дата назначения'", , "ДатаНазначения");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Руководитель) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен реквизит 'Руководитель'", , "Руководитель");
		Возврат;
	КонецЕсли;

	НазначитьРуководителяНаСервере();
	
КонецПроцедуры
