#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПодборКандидатов");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьПроцессыНаграждения");
	НастройкиВарианта.Описание = НСтр("ru = 'Подбор кандидатов к награждению 
		|по различным критериям отбора.'");

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СтатусыНаграждения");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьПроцессыНаграждения");
	НастройкиВарианта.Описание = НСтр("ru = 'История статусов награждения
		|по физическим лицам и наградам.'");

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецЕсли
