#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ТекущийКлючВарианта;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если ТекущийКлючВарианта = "ПодборКандидатов" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДокументРезультат.Очистить();
		
		НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
		ПараметрыДанных = НастройкиОтчета.ПараметрыДанных;
		
		ПараметрПериод = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета"));
		ПараметрОрганизация = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация")); 
		ПараметрИнтервалыНаграждения = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИнтервалыНаграждения"));
		ПараметрМинимальныеСтажиРаботы = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МинимальныеСтажиРаботы"));
		
		ИсключаемыеНаграды = Неопределено;
		ПараметрИсключаемыеНаграды = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИсключаемыеНаграды"));
		Если Не ПараметрИсключаемыеНаграды = Неопределено И ПараметрИсключаемыеНаграды.Использование Тогда
			ИсключаемыеНаграды = ПараметрИсключаемыеНаграды.Значение;
			Если Не СокрЛП(ПараметрИсключаемыеНаграды.ИдентификаторПользовательскойНастройки) = "" Тогда
				ПользовательскаяНастройка = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрИсключаемыеНаграды.ИдентификаторПользовательскойНастройки);
				ИсключаемыеНаграды = ПользовательскаяНастройка.Значение;
			КонецЕсли;
		КонецЕсли;
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		ИнтервалыНаграждения = Новый ТаблицаЗначений;
		КолонкиТаблицыИнтервалыНаграждения = Метаданные.Справочники.Награды.ТабличныеЧасти.ИнтервалыНаграждения.Реквизиты;
		Для Каждого Реквизит Из КолонкиТаблицыИнтервалыНаграждения Цикл
			ИнтервалыНаграждения.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип, Реквизит.Синоним);
		КонецЦикла;
		
		Если Не ПараметрИнтервалыНаграждения = Неопределено И Не СокрЛП(ПараметрИнтервалыНаграждения.ИдентификаторПользовательскойНастройки) = "" Тогда
			ПользовательскаяНастройка = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрИнтервалыНаграждения.ИдентификаторПользовательскойНастройки);
			Если Не СокрЛП(ПользовательскаяНастройка.Значение) = "" Тогда
				ИнтервалыНаграждения = ОбщегоНазначения.ЗначениеИзСтрокиXML(ПользовательскаяНастройка.Значение);
			КонецЕсли;
		КонецЕсли;
		
		ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, ИнтервалыНаграждения, "ВТИнтервалыНаграждения", Истина);
		
		МинимальныеСтажиРаботы = Новый ТаблицаЗначений;
		КолонкиТаблицыМинимальныеСтажиРаботы = Метаданные.Справочники.Награды.ТабличныеЧасти.МинимальныеСтажиРаботы.Реквизиты;
		Для Каждого Реквизит Из КолонкиТаблицыМинимальныеСтажиРаботы Цикл
			МинимальныеСтажиРаботы.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип, Реквизит.Синоним);
		КонецЦикла;
		
		Если Не ПараметрМинимальныеСтажиРаботы = Неопределено И Не СокрЛП(ПараметрМинимальныеСтажиРаботы.ИдентификаторПользовательскойНастройки) = "" Тогда
			ПользовательскаяНастройка = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрМинимальныеСтажиРаботы.ИдентификаторПользовательскойНастройки);
			Если Не СокрЛП(ПользовательскаяНастройка.Значение) = "" Тогда
				МинимальныеСтажиРаботы = ОбщегоНазначения.ЗначениеИзСтрокиXML(ПользовательскаяНастройка.Значение);
			КонецЕсли;
		КонецЕсли;
		
		ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, МинимальныеСтажиРаботы, "ВТМинимальныеСтажиРаботы", Истина);
		
		ПараметрыКадровыхДанных = Новый Структура("Организация,НачалоПериода,ОкончаниеПериода");
		Если ПараметрПериод <> Неопределено Тогда
			Если ТипЗнч(ПараметрПериод.Значение) = Тип("Дата") Тогда
				ПараметрыКадровыхДанных.ОкончаниеПериода = КонецДня(ПараметрПериод.Значение);
			ИначеЕсли ТипЗнч(ПараметрПериод.Значение) = Тип("СтандартнаяДатаНачала") Тогда
				ПараметрыКадровыхДанных.ОкончаниеПериода = КонецДня(ПараметрПериод.Значение.Дата);
			КонецЕсли;
			ПараметрыКадровыхДанных.НачалоПериода = ПараметрыКадровыхДанных.ОкончаниеПериода;
		КонецЕсли;
		Если ПараметрОрганизация <> Неопределено И ПараметрОрганизация.Использование Тогда
			ПараметрыКадровыхДанных.Организация = ПараметрОрганизация.Значение;
		КонецЕсли;
		
		СоздатьВТСотрудникиОрганизации(ПараметрыКадровыхДанных, МенеджерВременныхТаблиц);
		
		УстановитьПривилегированныйРежим(Истина);

		КатегорииСтажа = МинимальныеСтажиРаботы.Скопировать();
		КатегорииСтажа.Свернуть("КатегорияСтажа");
		КатегорииСтажа = КатегорииСтажа.ВыгрузитьКолонку("КатегорияСтажа");
		ГруппировкаФизическиеЛица = ПолучитьГруппировкуПоИмени(НастройкиОтчета, "ФизическиеЛица");
		
		Для Каждого КатегорияСтажа Из КатегорииСтажа Цикл
			
			ИмяЗначенияПеречисления = ОбщегоНазначения.ИмяЗначенияПеречисления(КатегорияСтажа);
			
			ИспользоватьГосударственнуюМуниципальнуюСлужбу = Ложь;
			Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
				ИспользоватьГосударственнуюМуниципальнуюСлужбу = ПолучитьФункциональнуюОпцию("ИспользоватьГосударственнуюСлужбу") ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьМуниципальнуюСлужбу");
			КонецЕсли;
			
			Если Не ИспользоватьГосударственнуюМуниципальнуюСлужбу
				И Не СтрРазделить("ВыслугаЛетНаГосударственнойСлужбе,ВыслугаЛетНаВоеннойСлужбе",",").Найти(ИмяЗначенияПеречисления) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ВыбранноеПоле Из ГруппировкаФизическиеЛица.Выбор.Элементы Цикл
				Если ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрШаблон("%1Стаж", ИмяЗначенияПеречисления)) Тогда
					ВыбранноеПоле.Использование = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки,,,МенеджерВременныхТаблиц);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		СкрытыеПараметрыОтчета = Новый Массив;
		СкрытыеПараметрыОтчета.Добавить("ИнтервалыНаграждения");
		СкрытыеПараметрыОтчета.Добавить("МинимальныеСтажиРаботы");
		Если Не ЗначениеЗаполнено(ИсключаемыеНаграды) Тогда
			СкрытыеПараметрыОтчета.Добавить("ИсключаемыеНаграды");
		КонецЕсли;
		ЗарплатаКадрыОтчеты.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, СкрытыеПараметрыОтчета);
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередФормированиемОтчета = Истина;
	Настройки.События.ПриСозданииНаСервере = Истина;
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	Настройки.События.ПослеЗаполненияПанелиБыстрыхНастроек = Истина;
	
КонецПроцедуры

// Параметры:
//   Контекст - Произвольный
//   КлючСхемы - Строка
//   КлючВарианта - Строка, Неопределено
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных, Неопределено
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных, Неопределено
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ТекущийКлючВарианта = КлючВарианта;

	Если КлючСхемы <> КлючВарианта Тогда
		
		Если КлючВарианта = "СтатусыНаграждения" Тогда
			
			ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, ПолучитьМакет("СтатусыНаграждения"), КлючСхемы);
			НовыеНастройкиКД = СхемаКомпоновкиДанных.ВариантыНастроек.СтатусыНаграждения.Настройки;
			
		Иначе
			
			ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"), КлючСхемы);
			НовыеНастройкиКД = СхемаКомпоновкиДанных.ВариантыНастроек[КлючВарианта].Настройки;
			
		КонецЕсли;
		
		КлючСхемы = КлючВарианта;
		
	КонецЕсли;
	
	Если Не ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(НовыеНастройкиКД) <> Тип("НастройкиКомпоновкиДанных") Тогда
		НовыеНастройкиКД = КомпоновщикНастроек.Настройки;
	КонецЕсли;
	
	Если ТипЗнч(НовыеПользовательскиеНастройкиКД) <> Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		НовыеПользовательскиеНастройкиКД = КомпоновщикНастроек.ПользовательскиеНастройки;
	КонецЕсли;
	
	ГруппаСвоиПараметры = Контекст.Элементы.Найти("ГруппаСвоиПараметры");
	Если Не ГруппаСвоиПараметры = Неопределено Тогда
		ГруппаСвоиПараметры.Видимость = КлючВарианта = "ПодборКандидатов";
	КонецЕсли;
	
	Если Контекст.Параметры.Свойство("Награда") И ТекущийКлючВарианта = "ПодборКандидатов" И Не Контекст.Параметры.Награда.ЭтоГруппа Тогда
		
		Награда = Контекст.Параметры.Награда;
		
		УстановитьПользовательсткуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "ПериодОтчета", ТекущаяДатаСеанса());
		
		Если Награда.ОтсутствиеДисциплинарныхВзысканий Тогда
			УстановитьПользовательсткуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "Дисциплинарные взыскания отсутствуют", Награда.ОтсутствиеДисциплинарныхВзысканий);
		КонецЕсли;
		
		УстановитьПользовательсткуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "ИсключатьРанееНагражденных", Не Награда.ИнтервалыНаграждения.Количество() = 0);
		УстановитьПользовательсткуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "ИнтервалыНаграждения", ПроцессыНагражденияВызовСервера.СериализоватьКоллекцию(Награда.ИнтервалыНаграждения));

		УстановитьПользовательсткуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "ИсключатьПоСтажу", Не Награда.МинимальныеСтажиРаботы.Количество() = 0);
		УстановитьПользовательсткуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "МинимальныеСтажиРаботы", ПроцессыНагражденияВызовСервера.СериализоватьКоллекцию(Награда.МинимальныеСтажиРаботы));
		
		Если Награда.ПовторноеНаграждениеНеПредусмотрено Тогда
			ИсключаемыеНаграды = Новый СписокЗначений;
			ИсключаемыеНаграды.Добавить(Награда);
			УстановитьПользовательсткуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "ИсключаемыеНаграды", ИсключаемыеНаграды);
		КонецЕсли;
		Если Не Награда.МинимальныйВозраст = 0 Тогда
			УстановитьПользовательсткуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "МинимальныйВозраст", Награда.МинимальныйВозраст);
		КонецЕсли;
		Если Не Награда.МаксимальныйВозраст = 0 Тогда
			УстановитьПользовательсткуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "МаксимальныйВозраст", Награда.МаксимальныйВозраст);
		КонецЕсли;
		Если Не Награда.ОграничениеДолжностей.Количество() = 0 Тогда
			ОграничениеДолжностей = Новый СписокЗначений;
			ОграничениеДолжностей.ЗагрузитьЗначения(Награда.ОграничениеДолжностей.ВыгрузитьКолонку("ОграничениеДолжности"));
			УстановитьПользовательсткуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "ОграничениеДолжностей", ОграничениеДолжностей);
		КонецЕсли;
		
		Если Награда.НаличиеНаград.Количество() > 0 ИЛИ Награда.СоблюдатьПоследовательностьНаграждения Тогда
			НаличиеНаград = Новый СписокЗначений;
			НаличиеНаград.ЗагрузитьЗначения(Награда.НаличиеНаград.ВыгрузитьКолонку("Награда"));
			ДобавитьНаградыПредыдущихСтепеней(Награда, НаличиеНаград);
			Если НаличиеНаград.Количество() > 0 Тогда
				УстановитьПользовательсткуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "НаличиеНаград", НаличиеНаград);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Параметры:
//   Форма - ФормаКлиентскогоПриложения
//   ПараметрыЗаполнения - Структура
//
Процедура ПослеЗаполненияПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт
	
	Если Не Форма.ИмяФормы = "Отчет.ОтчетыПоПроцессамНаграждения.Форма" Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.КлючТекущегоВарианта = "ПодборКандидатов" Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОтчета = Форма.Отчет.КомпоновщикНастроек.Настройки;
	ПараметрыДанных = НастройкиОтчета.ПараметрыДанных;
	ПараметрИнтервалыНаграждения = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИнтервалыНаграждения"));
	ПараметрИсключатьРанееНагражденных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИсключатьРанееНагражденных"));
	ПараметрИсключатьПоСтажу = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИсключатьПоСтажу"));
	ПараметрМинимальныеСтажиРаботы = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МинимальныеСтажиРаботы"));

	Если Не ПараметрИнтервалыНаграждения = Неопределено И Не СокрЛП(ПараметрИнтервалыНаграждения.ИдентификаторПользовательскойНастройки) = "" Тогда
		ПользовательскаяНастройка = Форма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрИнтервалыНаграждения.ИдентификаторПользовательскойНастройки);
		Если Не СокрЛП(ПользовательскаяНастройка.Значение) = "" Тогда
			Форма.ИнтервалыНаграждения.Загрузить(ОбщегоНазначения.ЗначениеИзСтрокиXML(ПользовательскаяНастройка.Значение));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПараметрМинимальныеСтажиРаботы = Неопределено И Не СокрЛП(ПараметрМинимальныеСтажиРаботы.ИдентификаторПользовательскойНастройки) = "" Тогда
		ПользовательскаяНастройка = Форма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрМинимальныеСтажиРаботы.ИдентификаторПользовательскойНастройки);
		Если Не СокрЛП(ПользовательскаяНастройка.Значение) = "" Тогда
			Форма.МинимальныеСтажиРаботы.Загрузить(ОбщегоНазначения.ЗначениеИзСтрокиXML(ПользовательскаяНастройка.Значение));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПараметрИсключатьРанееНагражденных = Неопределено И Не СокрЛП(ПараметрИсключатьРанееНагражденных.ИдентификаторПользовательскойНастройки) = "" Тогда
		ПользовательскаяНастройка = Форма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрИсключатьРанееНагражденных.ИдентификаторПользовательскойНастройки);
		Форма.ИсключатьРанееНагражденных = ПользовательскаяНастройка.Значение;
	КонецЕсли;
	
	Если Не ПараметрИсключатьПоСтажу = Неопределено И Не СокрЛП(ПараметрИсключатьПоСтажу.ИдентификаторПользовательскойНастройки) = "" Тогда
		ПользовательскаяНастройка = Форма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрИсключатьПоСтажу.ИдентификаторПользовательскойНастройки);
		Форма.ИсключатьПоСтажу = ПользовательскаяНастройка.Значение;
	КонецЕсли;
	
	ПроцессыНагражденияКлиентСервер.УстановитьДоступностьЭлементовОтчетаНаградыФизическихЛиц(Форма);
	
КонецПроцедуры

// Параметры:
//   ФормаОтчета - ФормаКлиентскогоПриложения
//   ДополнительныеПараметры - Структура:
//     * ТекстПредупреждения - Строка
//     * ИмяПараметраХраненияОтказаОтПредупреждения - Строка
//
Процедура ПередФормированиемОтчета(Форма, ДополнительныеПараметры) Экспорт
	
	Если Не Форма.КлючТекущегоВарианта = "ПодборКандидатов" Тогда
		Возврат;
	КонецЕсли;
	
	ПроцессыНагражденияКлиентСервер.ЗаполнитьПараметрыОтчетаНаградыФизическихЛиц(Форма);
	
КонецПроцедуры

// См. ОтчетыПереопределяемый.ПриСозданииНаСервере.
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ИнтервалыНаграждения",
							Новый ОписаниеТипов("ТаблицаЗначений"),,
							НСтр("ru='Интервалы между награждениями'")));
							
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ИсключатьРанееНагражденных",
							Новый ОписаниеТипов("Булево"),,
							НСтр("ru='Исключать ранее награжденных лиц, если не подошел срок повторного награждения'")));
							
	КолонкиТаблицыИнтервалыНаграждения = Метаданные.Справочники.Награды.ТабличныеЧасти.ИнтервалыНаграждения.Реквизиты;
	Для Каждого Реквизит Из КолонкиТаблицыИнтервалыНаграждения Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Реквизит.Имя, Реквизит.Тип, "ИнтервалыНаграждения", Реквизит.Синоним));
	КонецЦикла;
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ИсключатьПоСтажу",
							Новый ОписаниеТипов("Булево"),,
							НСтр("ru='Исключать лиц, не удовлетворящих ни одному отбору по стажу работы'")));
							
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("МинимальныеСтажиРаботы",
							Новый ОписаниеТипов("ТаблицаЗначений"),,
							НСтр("ru='Отбор по стажу работы'")));
							
	КолонкиТаблицыМинимальныеСтажиРаботы = Метаданные.Справочники.Награды.ТабличныеЧасти.МинимальныеСтажиРаботы.Реквизиты;
	Для Каждого Реквизит Из КолонкиТаблицыМинимальныеСтажиРаботы Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Реквизит.Имя, Реквизит.Тип, "МинимальныеСтажиРаботы", Реквизит.Синоним));
	КонецЦикла;
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	ЭлементГруппаСвоиПараметры = Форма.Элементы.Вставить("ГруппаСвоиПараметры", Тип("ГруппаФормы"),,Форма.Элементы.КомандыИПоказатели);
	ЭлементГруппаСвоиПараметры.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппаСвоиПараметры.ОтображатьЗаголовок = Ложь;
	ЭлементГруппаСвоиПараметры.Отображение = ОтображениеОбычнойГруппы.Нет;
	ЭлементГруппаСвоиПараметры.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ЭлементГруппаСвоиПараметрыЛевая = Форма.Элементы.Добавить("ГруппаСвоиПараметрыЛевая", Тип("ГруппаФормы"),ЭлементГруппаСвоиПараметры);
	ЭлементГруппаСвоиПараметрыЛевая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппаСвоиПараметрыЛевая.ОтображатьЗаголовок = Ложь;
	ЭлементГруппаСвоиПараметрыЛевая.Отображение = ОтображениеОбычнойГруппы.Нет;
	ЭлементГруппаСвоиПараметрыЛевая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ЭлементГруппаСвоиПараметрыЛевая.Ширина = 80;
	
	ЭлементГруппаСвоиПараметрыПравая = Форма.Элементы.Добавить("ГруппаСвоиПараметрыПравая", Тип("ГруппаФормы"),ЭлементГруппаСвоиПараметры);
	ЭлементГруппаСвоиПараметрыПравая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппаСвоиПараметрыПравая.ОтображатьЗаголовок = Ложь;
	ЭлементГруппаСвоиПараметрыПравая.Отображение = ОтображениеОбычнойГруппы.Нет;
	ЭлементГруппаСвоиПараметрыПравая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	ЭлементФлажок = Форма.Элементы.Добавить("ИсключатьРанееНагражденных", Тип("ПолеФормы"),ЭлементГруппаСвоиПараметрыЛевая);
	ЭлементФлажок.ПутьКДанным = "ИсключатьРанееНагражденных";
	ЭлементФлажок.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФлажок.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементФлажок.УстановитьДействие("ПриИзменении","Подключаемый_Команда");

	ЭлементГруппа = Форма.Элементы.Добавить("ГруппаИнтервалыНаграждения", Тип("ГруппаФормы"),ЭлементГруппаСвоиПараметрыЛевая);
	ЭлементГруппа.Заголовок = НСтр("ru='Интервалы между награждениями'");
	ЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	ЭлементГруппа.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	ЭлементГруппа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	ЭлементГруппа.РастягиватьПоГоризонтали = Ложь;
	ЭлементГруппа.РастягиватьПоВертикали = Ложь;
	ЭлементГруппа.Скрыть();

	ЭлементТаблица = Форма.Элементы.Добавить("ИнтервалыНаграждения", Тип("ТаблицаФормы"), ЭлементГруппа);
	ЭлементТаблица.ПутьКДанным = "ИнтервалыНаграждения";
	ЭлементТаблица.РастягиватьПоВертикали = Ложь;
	ЭлементТаблица.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементТаблица.Высота = 4;
	ЭлементТаблица.Ширина = 80;
	ЭлементТаблица.УстановитьДействие("ПриОкончанииРедактирования","Подключаемый_Команда");
	ЭлементТаблица.УстановитьДействие("ПослеУдаления","Подключаемый_Команда");

	Для Каждого Реквизит Из КолонкиТаблицыИнтервалыНаграждения Цикл
		ПолеПолеТаблицы = Форма.Элементы.Добавить(СтрШаблон("ИнтервалыНаграждения%1", Реквизит.Имя), Тип("ПолеФормы"), ЭлементТаблица);
		ПолеПолеТаблицы.ПутьКДанным = СтрШаблон("ИнтервалыНаграждения.%1", Реквизит.Имя);
		ПолеПолеТаблицы.Заголовок = Реквизит.Синоним;
		ПолеПолеТаблицы.Вид = ВидПоляФормы.ПолеВвода;
		ПолеПолеТаблицы.АвтоОтметкаНезаполненного = Истина;
	КонецЦикла;
	
	ЭлементФлажок = Форма.Элементы.Добавить("ИсключатьПоСтажу", Тип("ПолеФормы"),ЭлементГруппаСвоиПараметрыПравая);
	ЭлементФлажок.ПутьКДанным = "ИсключатьПоСтажу";
	ЭлементФлажок.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФлажок.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементФлажок.УстановитьДействие("ПриИзменении","Подключаемый_Команда");

	ЭлементГруппа = Форма.Элементы.Добавить("ГруппаМинимальныеСтажиРаботы", Тип("ГруппаФормы"),ЭлементГруппаСвоиПараметрыПравая);
	ЭлементГруппа.Заголовок = НСтр("ru='Минимальные стажи работы'");
	ЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	ЭлементГруппа.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	ЭлементГруппа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	ЭлементГруппа.РастягиватьПоГоризонтали = Ложь;
	ЭлементГруппа.РастягиватьПоВертикали = Ложь;
	ЭлементГруппа.Скрыть();

	ЭлементТаблица = Форма.Элементы.Добавить("МинимальныеСтажиРаботы", Тип("ТаблицаФормы"), ЭлементГруппа);
	ЭлементТаблица.ПутьКДанным = "МинимальныеСтажиРаботы";
	ЭлементТаблица.РастягиватьПоГоризонтали = Ложь;
	ЭлементТаблица.РастягиватьПоВертикали = Ложь;
	ЭлементТаблица.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементТаблица.Высота = 4;
	ЭлементТаблица.Ширина = 80;
	ЭлементТаблица.УстановитьДействие("ПриОкончанииРедактирования","Подключаемый_Команда");
	ЭлементТаблица.УстановитьДействие("ПослеУдаления","Подключаемый_Команда");

	Для Каждого Реквизит Из КолонкиТаблицыМинимальныеСтажиРаботы Цикл
		ПолеПолеТаблицы = Форма.Элементы.Добавить(СтрШаблон("МинимальныеСтажиРаботы%1", Реквизит.Имя), Тип("ПолеФормы"), ЭлементТаблица);
		ПолеПолеТаблицы.ПутьКДанным = СтрШаблон("МинимальныеСтажиРаботы.%1", Реквизит.Имя);
		ПолеПолеТаблицы.Заголовок = Реквизит.Синоним;
		ПолеПолеТаблицы.Вид = ВидПоляФормы.ПолеВвода;
		ПолеПолеТаблицы.АвтоОтметкаНезаполненного = Истина;
	КонецЦикла;

	ПроцессыНагражденияКлиентСервер.УстановитьДоступностьЭлементовОтчетаНаградыФизическихЛиц(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФукнции

Процедура УстановитьПользовательсткуюНастройку(КомпоновщикНастроекОтчета, НовыеПользовательскиеНастройкиКД, ИмяНастройки, Знач Значение)
	
	НастройкиОтчета = КомпоновщикНастроекОтчета.ПолучитьНастройки();
	ПараметрыДанных = НастройкиОтчета.ПараметрыДанных;

	ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяНастройки));
	Если ПараметрДанных = Неопределено Тогда
		Для Каждого ЭлементОтбора Из НастройкиОтчета.Отбор.Элементы Цикл
			Если ЭлементОтбора.Представление = ИмяНастройки Тогда
				ПользовательскаяНастройка = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
				ПользовательскаяНастройка.Использование = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если Не СокрЛП(ПараметрДанных.ИдентификаторПользовательскойНастройки) = "" Тогда
			ПользовательскаяНастройка = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
			ПользовательскаяНастройка.Значение = Значение;
			ПользовательскаяНастройка.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьГруппировкуПоИмени(Настройки, ИмяСтруктуры)
	
	Структура = Настройки.Структура;
	Если Структура.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Пока Истина Цикл
		ЭлементСтруктуры = Структура[0];
		Если ЭлементСтруктуры.Имя = ИмяСтруктуры Тогда
			Возврат ЭлементСтруктуры;
		КонецЕсли;
		Структура = ЭлементСтруктуры.Структура;
		
		Если Структура.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДобавитьНаградыПредыдущихСтепеней(Награда, СписокНаград)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Награда);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Награды.Родитель КАК Родитель,
	|	Награды.Ссылка КАК Награда,
	|	МАКСИМУМ(НаградыПредшествующие.КодОКИН) КАК КодОКИНПредшествующейНаграды
	|ПОМЕСТИТЬ ВТКодыОКИНПредшествующихНаград
	|ИЗ
	|	Справочник.Награды КАК Награды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Награды КАК НаградыПредшествующие
	|		ПО Награды.Родитель = НаградыПредшествующие.Родитель
	|			И Награды.КодОКИН > НаградыПредшествующие.КодОКИН
	|			И (НЕ НаградыПредшествующие.ПометкаУдаления)
	|ГДЕ
	|	Награды.Ссылка = &Ссылка
	|	И Награды.СоблюдатьПоследовательностьНаграждения
	|
	|СГРУППИРОВАТЬ ПО
	|	Награды.Ссылка,
	|	Награды.Родитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыОКИНПредшествующихНаград.Награда КАК Награда,
	|	Награды.Ссылка КАК НаличиеНаграды
	|ИЗ
	|	ВТКодыОКИНПредшествующихНаград КАК КодыОКИНПредшествующихНаград
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Награды КАК Награды
	|		ПО КодыОКИНПредшествующихНаград.Родитель = Награды.Родитель
	|			И КодыОКИНПредшествующихНаград.КодОКИНПредшествующейНаграды = Награды.КодОКИН";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокНаград.Добавить(Выборка.НаличиеНаграды);
	КонецЦикла;
	
КонецПроцедуры

#Область ФормированиеДанных

Процедура СоздатьВТСотрудникиОрганизации(ПараметрыКадровыхДанных, МенеджерВременныхТаблиц)
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ЗаполнитьЗначенияСвойств(ПараметрыПолучения, ПараметрыКадровыхДанных);
	ПараметрыПолучения.КадровыеДанные = "Организация,ВидЗанятости,Должность,Подразделение,Возраст,ДатаРождения,ОбщийСтажЛет,СеверныйСтажЛет,НепрерывныйСтажЛет,СтажНаНадбавкуЗаВыслугуЛетЛет,ОбщийНаучноПедагогическийСтажЛет,ПедагогическийСтажЛет,СтраховойСтажЛет,РасширенныйСтраховойСтажЛет,ПрочийСтажЛет,МедицинскийСтажЛет";
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		
		ИспользоватьГосударственнуюМуниципальнуюСлужбу = ПолучитьФункциональнуюОпцию("ИспользоватьГосударственнуюСлужбу") ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьМуниципальнуюСлужбу");
		Если ИспользоватьГосударственнуюМуниципальнуюСлужбу Тогда
			ПараметрыПолучения.КадровыеДанные = ПараметрыПолучения.КадровыеДанные + ",ВидДолжностиГосударственнойСлужбы,ВыслугаЛетНаГосударственнойСлужбеЛет";
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьВоеннуюСлужбу") Тогда
			ПараметрыПолучения.КадровыеДанные = ПараметрыПолучения.КадровыеДанные + ",ВыслугаЛетНаВоеннойСлужбеЛет";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.ВоинскиеСпециальныеЗвания") Тогда
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьВоеннуюСлужбу") Тогда
			ПараметрыПолучения.КадровыеДанные = ПараметрыПолучения.КадровыеДанные + ",ВоинскоеСпециальноеЗвание";
		КонецЕсли;
		
	КонецЕсли;
	
	СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
	Если СотрудникиОрганизации.Колонки.Найти("ВидДолжностиГосударственнойСлужбы") = Неопределено Тогда
		СотрудникиОрганизации.Колонки.Добавить("ВидДолжностиГосударственнойСлужбы", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	КонецЕсли;
	Если СотрудникиОрганизации.Колонки.Найти("ВоинскоеСпециальноеЗвание") = Неопределено Тогда
		СотрудникиОрганизации.Колонки.Добавить("ВоинскоеСпециальноеЗвание", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	КонецЕсли;
	
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, СотрудникиОрганизации, "ВТСотрудникиОрганизации");

	ОписательВременныхТаблиц = КадровыйУчетРасширенный.ОписательВременнойТаблицыОтборовДляВТСтажиФизическихЛиц("ВТСотрудникиОрганизации", "ФизическоеЛицо", "Период");
	КадровыйУчетРасширенный.СоздатьВТСтажиФизическихЛиц(МенеджерВременныхТаблиц, Истина, ОписательВременныхТаблиц, "ВТСтажиФизическихЛиц");

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли