
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Отчет);
		
	Если ЗначениеЗаполнено(Параметры.РФ_РегистрБухгалтерии) Тогда
		РФ_РегистрБухгалтерии = Параметры.РФ_РегистрБухгалтерии;	
	КонецЕсли;
	
	// АПК:282-выкл
	// Закомментировано для НУНВ
	// 1. Заполним список регистров бухгалтерии
	// СписокВыбораРегистров = Элементы.РегистрБухгалтерии.СписокВыбора;
	// ЗаполнитьСписокРегистровБухгалтерииНаСервере(СписокВыбораРегистров);
	// 
	// Если не ЗначениеЗаполнено(Отчет.РегистрБухгалтерии) И СписокВыбораРегистров.Количество() > 0 Тогда
	// 	Отчет.РегистрБухгалтерии = СписокВыбораРегистров.Получить(0).Значение;
	// КонецЕсли;
	//
	// 2. После того как выбран РБ, необходимо заполнить данные формы его параметрами
	// ЗаполнитьПараметрыРегистраБухгалтерииНаСервере(Отчет.РегистрБухгалтерии);
	// АПК:282-вкл
	
	// НУНВ...
	ЗаполнитьПараметрыРегистраБухгалтерииНаСервере(Отчет.РегистрБухгалтерии.ИмяОбъекта);
	// Получим доступные виды объектов и объекты системы.
	СписокДоступныхРегистров.Добавить(Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии);
	// ...НУВН
	
	ЗаполнитьКэшЗначений();
	УстановитьЗначенияПоУмолчанию();
	
	бит_ОтчетыСервер.УстановитьВидимостьПанелиНастроекПоУмолчаниюТакси(Элементы.ФормаКомандаПанельНастроек,
																	   Элементы.ГруппаПанельНастроек,
																	   СкрытьПанельНастроек,
																	   ТаксиОткрытьПанельНастроек);
														
КонецПроцедуры // ПриСозданииНаСервере()
												 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	Если ЗначениеЗаполнено(РФ_РегистрБухгалтерии) Тогда
		Отчет.РегистрБухгалтерии = РФ_РегистрБухгалтерии;
		ЗаполнитьПараметрыРегистраБухгалтерииНаСервере(Отчет.РегистрБухгалтерии);
	КонецЕсли;
		
	ВидимостьИнформацииВалютнаяСумма();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Видимость панели настроек.
	бит_ОтчетыСервер.УстановитьВидимостьПанелиНастроек(Элементы.ФормаКомандаПанельНастроек,
													   Элементы.ГруппаПанельНастроек,
													   СкрытьПанельНастроек,
													   ТаксиОткрытьПанельНастроек);
		
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()
													
&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	РегистрИзНастроек = Настройки.Получить("Отчет.РегистрБухгалтерии");
	
	Если НЕ ОбщегоНазначения.СсылкаСуществует(РегистрИзНастроек) Тогда
	
		 РегистрИзНастроек = Неопределено;
		 Отчет.РегистрБухгалтерии = Неопределено;
	
	КонецЕсли; 
	
	Если РегистрИзНастроек <> Неопределено И ТипЗнч(РегистрИзНастроек) = Тип("СправочникСсылка.бит_ОбъектыСистемы") 
		И ЗначениеЗаполнено(РегистрИзНастроек) Тогда
		// ВидимостьОрганизацииНаСервере(РегистрИзНастроек);
		// НУНВ...
		ВидимостьОрганизацииНаСервере(РегистрИзНастроек.ИмяОбъекта);
		// ...НУНВ
	КонецЕсли;
	
КонецПроцедуры													

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РегистрБухгалтерииПриИзменении(Элемент)
	
	// НУНВ...
	ЗаполнитьПараметрыРегистраБухгалтерииНаСервере(Отчет.РегистрБухгалтерии);
	// ...НУНВ
	ИзмененыНастройкиОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПометкаПриИзменении(Элемент)
	
	ИДСписка 		= Элементы.Показатели.ТекущаяСтрока;
	ТекущийСписка 	= Показатели.НайтиПоИдентификатору(ИДСписка);
	
	Если ТекущийСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОтмеченные = Ложь;
	                 
	Для Каждого СтрокаСписка Из Показатели Цикл
		ЕстьОтмеченные = СтрокаСписка.Пометка;
		Если ЕстьОтмеченные Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ТекущийСписка.Пометка И НЕ ЕстьОтмеченные Тогда
		ТекущийСписка.Пометка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ИзмененыНастройкиОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ИзмененыНастройкиОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПериодаПриИзменении(Элемент)
	
	ИзмененыНастройкиОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоИзмерениямПриИзменении(Элемент)
	
	ИзмененыНастройкиОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоИзмерениямПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ОтборПоИзмерениям.ТекущиеДанные;
	
	Если НЕ НоваяСтрока Тогда
		бит_МеханизмПолученияДанныхКлиентСервер.УстановитьСвойствоВыборГруппИЭлементов(Элементы.ОтборПоИзмерениямЗначение, 
			ТекущиеДанные.ВидСравнения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоИзмерениямВидСравненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОтборПоИзмерениям.ТекущиеДанные;
	
	Элемент.СписокВыбора.Очистить();
	
	СписокВидов = СформироватьСписокВыбораВидаСравнения(ТекущиеДанные.ПолучитьИдентификатор());
	Элемент.СписокВыбора.ЗагрузитьЗначения(СписокВидов.ВыгрузитьЗначения());

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоИзмерениямВидСравненияАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОтборПоИзмерениям.ТекущиеДанные;
		
	Элемент.СписокВыбора.Очистить();

	СписокВидов = СформироватьСписокВыбораВидаСравнения(ТекущиеДанные.ПолучитьИдентификатор());
	Элемент.СписокВыбора.ЗагрузитьЗначения(СписокВидов.ВыгрузитьЗначения());

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоИзмерениямВидСравненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборПоИзмерениям.ТекущиеДанные;  	
	ИзменениеВидаСравненияСервер(ТекущиеДанные.ПолучитьИдентификатор());

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоИзмерениямЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборПоИзмерениям.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Значение) Тогда
		ТекущиеДанные.Использование = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоИзмерениямЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОтборПоИзмерениям.ТекущиеДанные;
	
	Если ТипЗнч(ТекущиеДанные.ТипЗначения) = Тип("ОписаниеТипов") 
		И ТекущиеДанные.ТипЗначения.Типы().Количество() > 1 
		И ТекущиеДанные.Значение = Неопределено Тогда
		
		Элементы.ОтборПоИзмерениямЗначение.ВыбиратьТип     = Истина;	
		Элементы.ОтборПоИзмерениямЗначение.ОграничениеТипа = ТекущиеДанные.ТипЗначения;
	Иначе	
		Элементы.ОтборПоИзмерениямЗначение.ВыбиратьТип     = Ложь;	
		Элементы.ОтборПоИзмерениямЗначение.ОграничениеТипа = Новый ОписаниеТипов;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоИзмерениямЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ОтборПоИзмерениям.ТекущиеДанные;
	
	Если ТипЗнч(ТекущаяСтрока.ТипЗначения) = Тип("ОписаниеТипов") 
		И ТекущаяСтрока.ТипЗначения.Типы().Количество() > 1 Тогда
		
		ТекущаяСтрока.Значение = Неопределено;
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПриИзменении(Элемент)
	
	ВидимостьИнформацииВалютнаяСумма();
	
КонецПроцедуры
 
&НаКлиенте
Процедура ДокументРезультатПриАктивизацииОбласти(Элемент)
	
	БухгалтерскиеОтчетыКлиент.НачатьРасчетСуммыВыделенныхЯчеек(
		Элементы.ДокументРезультат,
		ЭтотОбъект,
		"Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры // ДокументРезультатПриАктивизацииОбласти()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПанельНастроек(Команда)
	
	ОбработкаКомандыПанелиНастроекСервер();	
	
КонецПроцедуры // КомандаПанельНастроек()

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Если НЕ ЗначениеЗаполнено(Отчет.РегистрБухгалтерии) Тогда
		Возврат;
	КонецЕсли;
	
	ОграничениеПоДатамКорректно = ПроверитьКорректностьОграниченийПоДатам(Отчет.СтандартныйПериод.ДатаНачала, Отчет.СтандартныйПериод.ДатаОкончания);
	
	Если НЕ ОграничениеПоДатамКорректно Тогда
        Возврат;
	КонецЕсли;
	
	ИзмененыНастройкиОтчета(Ложь);
	
	СформироватьОтчетНаСервере();
	
	ОтчетСформирован = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыИФункцииРаботыСоСпискомРазворотов

// Заполняет список предопределенными (служебными) разворотами.
// 
&НаСервереБезКонтекста
Процедура ЗаполнитьПредопределенныеРазвороты(СписокРазворотов, МножественныйРазворот = Ложь, СтрокаОСВ = Неопределено)
	
	Если МножественныйРазворот Тогда
		Возврат;
	КонецЕсли;
	
	СписокРазворотов.Добавить("ОткрытьЭлемент", НСтр("ru='Открыть';en='Open'"),, БиблиотекаКартинок.Лупа);
	
	Если СтрокаОСВ <> Неопределено Тогда
		
		Если ТипЗнч(СтрокаОСВ.Расшифровка) = Тип("ТаблицаЗначений") Тогда
			
			// Добавим возможность уничтожить группировку.
			СписокРазворотов.Добавить("СвернутьГруппировку", НСтр("ru='Свернуть';en='Collapse'"),, БиблиотекаКартинок.Очистить);
			СписокРазворотов.Добавить("Сортировка", НСтр("ru='Сортировка';en='Sorting'"),, БиблиотекаКартинок.СортироватьСписок);
						
		КонецЕсли;
		
		Если СтрокаОСВ.ИмяМакета = "Счет" Тогда
			
			СписокРазворотов.Добавить("ПоСубсчетам"	, НСтр("ru='По субсчетам...';en='По субсчетам...'"));
			ТекстСальдо = ?(СтрокаОСВ.РазвернутоеСальдо, 
							НСтр("ru='Скрыть развернутое сальдо';en='Скрыть развернутое сальдо'"),
							НСтр("ru='Показать развернутое сальдо';en='Показать развернутое сальдо'"));
			СписокРазворотов.Добавить("РазвернутоеСальдо", ТекстСальдо);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует список всех возможных разворотов актуальные для данного контекста расшифровки.
// 
&НаСервере
Функция ВозможныеРазворотыРасшифровки(ИмяРегистраБухгалтерии_, Знач Расшифровка, МножественныйРазворот = Ложь)
	
	// НУНВ.
	ИмяРегистраБухгалтерии = ИмяРегистраБухгалтерии_.ИмяОбъекта;
		
	// Получим строку таблицы ОСВ.
	ТаблицаОСВ 	= ПолучитьИзВременногоХранилища(АдресГлобальногоПредставления);
	СтрокаОСВ	= ПолучитьСтрокуПоИндексу(ТаблицаОСВ, Расшифровка.ИндексСтроки);
	
	Если МножественныйРазворот Тогда
		
		Если ТипЗнч(СтрокаОСВ.Расшифровка) <> Тип("ТаблицаЗначений") ИЛИ СтрокаОСВ.Расшифровка.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ЧистаяРасшифровка = СтрокаОСВ.Расшифровка.Получить(0);
		
	Иначе
		
		ЧистаяРасшифровка = СтрокаОСВ;
		
	КонецЕсли;
	
	ОснованияРазворотовПоРеквизитам.Очистить();
	
	СписокРазворотов 	= Новый СписокЗначений;
	РегистрБухгалтерии 	= ИмяРегистраБухгалтерии;
	
	// Получим счет из отбора.
	Отбор 	= ЧистаяРасшифровка.Отбор;
	Счет 	= Отбор.Счет;
	
	ИмяМакета 		= ЧистаяРасшифровка.ИмяМакета;
	ИсключитьПериод = ЕстьПериод(Отбор);
	
	ИмяМакета = СтрЗаменить(ИмяМакета, ".", "");
	
	// На предмет периода.
	Если ЕстьПериодВИмени(ИмяМакета) Тогда
		ИмяМакета = "Период";
	КонецЕсли;

	Если ИмяМакета = "СубСчет" Тогда
		ИмяМакета = "Счет";
	КонецЕсли;
						
	// Получим значение текущего разворота.
	ЗначениеРазворота = ЧистаяРасшифровка[ИмяМакета];
	
	// Заполним предопределенные обязательные развороты.
	ЗаполнитьПредопределенныеРазвороты(СписокРазворотов, МножественныйРазворот, СтрокаОСВ);
	
	Если НЕ МножественныйРазворот И ТипЗнч(СтрокаОСВ.Расшифровка) = Тип("ТаблицаЗначений") Тогда
		// Добавим разворот "Множественный разворот".
		Если ВозможнаИерархия(СтрокаОСВ) Тогда
			ТекстПредставление = НСтр("ru='Иерархия элементов...';en='Element hierarchy...'");
			СписокРазворотов.Добавить("ИерархияЭлементов", ТекстПредставление);
		КонецЕсли;
		ТекстПредставление = НСтр("ru='Множественный разворот...';en='Multiple reversal...'");
		СписокРазворотов.Добавить("МножественныйРазворот", ТекстПредставление);
	КонецЕсли;
	
	Если ИмяМакета <> "ПоПроводкам" Тогда
		
		// Добавим необходимые развороты.
		ДобавитьРазворотыПоСубконтоСчета(СписокРазворотов, Счет,, БиблиотекаКартинок.НоваяГруппировкаКомпоновкиДанных);
		// Добавим развороты по аналитическим разрезам.
		ДобавитьРазворотыПоИзмерениямРегистраБухгалтерии(СписокРазворотов, РегистрБухгалтерии, БиблиотекаКартинок.ПланВидовРасчетаОбъект);
		// Добавим разворот по корсчету.
		СписокРазворотов.Добавить("КорСчет", НСтр("ru='Кор. счет';en='Кор. счет'"));
		
		Если ИмяМакета <> "Счет" Тогда
			// Добавим разворот по субсчетам
			СписокРазворотов.Добавить("СубСчет", НСтр("ru='По субсчетам';en='По субсчетам'"));
		КонецЕсли;
		
		// Добавим развороты по корреспондирующим аналитическим разрезам.
		ДобавитьРазворотыПоИзмерениямРегистраБухгалтерии(СписокРазворотов, РегистрБухгалтерии, БиблиотекаКартинок.ПланВидовРасчетаОбъект, Истина);
		
		// Добавим необходимые развороты по кор. субконто.
		ДобавитьРазворотыПоКорСубконто(СписокРазворотов, Отбор);
		Если НЕ ИсключитьПериод Тогда
			// По периодам.
			ДобавитьРазворотыПоПериодам(СписокРазворотов, БиблиотекаКартинок.УстановитьВремя);
		КонецЕсли;	
		
		Если ИмяМакета <> "Регистратор" Тогда
			// Добавим разворот документам.
			ТекстПредставление = НСтр("ru='По документам';en='По документам'");
			СписокРазворотов.Добавить("Регистратор", ТекстПредставление,, БиблиотекаКартинок.ДокументОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяМакета = "Регистратор" Тогда // Для регистратора возможна расшифровка по проводкам.
		// Добавим разворот по проводкам.
		ТекстПредставление = НСтр("ru='По проводкам';en='По проводкам'");
		СписокРазворотов.Добавить("ПоПроводкам", ТекстПредставление,, БиблиотекаКартинок.ДебетКредит);
	КонецЕсли;
	
	// Необходимо исключить расшифровку, которая уже присутствует в отборе.
	ИсключитьВхождениеРасшифровок(СписокРазворотов, Отбор);
	
	// По реквизитам.
	Если ЭтоСсылочноеЗначение(ЗначениеРазворота) Тогда
		ТекстПредставление = НСтр("ru='По реквизитам...';en='По реквизитам...'");
		СписокРазворотов.Добавить("ПоРеквизитам", ТекстПредставление);
	КонецЕсли;
	
	Возврат СписокРазворотов;
	
КонецФункции

// В зависимости от текущего отбора расшифровки, исключает из списка неактуальные развороты.
// 
&НаСервере
Процедура ИсключитьВхождениеРасшифровок(СписокРазворотов, Отбор)
	
	ОснованиеРазворотов = РеквизитФормыВЗначение("ОснованияРазворотовПоРеквизитам");
	
	Для Каждого ЭлементОтбора Из Отбор Цикл
		// Проверим вхождение отбора в список расшифровок.
		ЭлементСписка = СписокРазворотов.НайтиПоЗначению(ЭлементОтбора.Ключ);
		
		Если ЭлементСписка <> Неопределено И ЭлементОтбора.Ключ <> "Счет" Тогда
			// Удалим разворот.
			СписокРазворотов.Удалить(ЭлементСписка);
		КонецЕсли;	
		
		ЭлементОснования = ОснованиеРазворотов.Найти(ЭлементОтбора.Ключ, "Измерение");
		
		Если ЭлементОснования <> Неопределено Тогда
			// Удалим разворот.
			 ОснованиеРазворотов.Удалить(ЭлементОснования);
		КонецЕсли;
		
	КонецЦикла;     
		
КонецПроцедуры

// Добавляет в список разворотов развороты по измерениям регистра бухгалтерии.
// 
&НаСервере
Процедура ДобавитьРазворотыПоИзмерениямРегистраБухгалтерии(СписокРазворотов, РегистрБухгалтерии, Картинка = Неопределено, ДобавитьКор = Ложь)
	
	МетаданныеРегистра = Метаданные.РегистрыБухгалтерии[РегистрБухгалтерии];
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
	    БалансовоеИзмерение = Измерение.Балансовый;
				
		Если НЕ БалансовоеИзмерение И ДобавитьКор Тогда
			СписокРазворотов.Добавить(Измерение.Имя + "Кор", Измерение.Синоним + " (кор.)",, ПолучитьКартинку(Картинка));
		ИначеЕсли НЕ ДобавитьКор Тогда
			СписокРазворотов.Добавить(Измерение.Имя, Измерение.Синоним,, ПолучитьКартинку(Картинка));
		КонецЕсли;
		Значение = Измерение.Тип.ПривестиЗначение();
		
		Если ЭтоСсылочноеЗначение(Значение) Тогда
			Если НЕ БалансовоеИзмерение И ДобавитьКор Тогда
				НовыйЭлементОснованияРазворотов(Измерение.Имя + "Кор", Измерение.Тип.ПривестиЗначение());
			ИначеЕсли НЕ ДобавитьКор Тогда
				НовыйЭлементОснованияРазворотов(Измерение.Имя, Измерение.Тип.ПривестиЗначение());
			КонецЕсли;
		Иначе
			Если НЕ БалансовоеИзмерение И ДобавитьКор Тогда
				НовыйЭлементОснованияРазворотов(Измерение.Имя + "Кор", Неопределено);
			ИначеЕсли НЕ ДобавитьКор Тогда
				НовыйЭлементОснованияРазворотов(Измерение.Имя, Неопределено);
			КонецЕсли;
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

// Добавляет в список разворотов развороты по периодам.
// 
&НаСервереБезКонтекста
Процедура ДобавитьРазворотыПоПериодам(СписокРазворотов, Картинка = Неопределено)
	
	СписокРазворотов.Добавить("ПериодГод"		, "Год"			,, ПолучитьКартинку(Картинка));
	СписокРазворотов.Добавить("ПериодКвартал"	, "Квартал"		,, ПолучитьКартинку(Картинка));
	СписокРазворотов.Добавить("ПериодМесяц"		, "Месяц"		,, ПолучитьКартинку(Картинка));
	СписокРазворотов.Добавить("ПериодНеделя"	, "Неделя"		,, ПолучитьКартинку(Картинка));
	СписокРазворотов.Добавить("ПериодДень"		, "День"		,, ПолучитьКартинку(Картинка));
     	
КонецПроцедуры

// Добавляет в список разворотов развороты по субконто переданного счета.
// 
&НаСервере
Процедура ДобавитьРазворотыПоСубконтоСчета(СписокРазворотов, Счет, Префикс = "", Картинка = Неопределено)
	
	ВидыСубконто = Счет.ВидыСубконто;
	
	Для Каждого Субконто Из ВидыСубконто Цикл
		
		СписокРазворотов.Добавить(Префикс + "Субконто" + Строка(Субконто.НомерСтроки), 
									"По " + Префикс + "Субконто " + Субконто.НомерСтроки + ": " + Субконто.ВидСубконто.Наименование,
									, 
									ПолучитьКартинку(Картинка));
		
		Если Субконто.ВидСубконто.ТипЗначения.Типы().Количество() = 1 Тогда
			НовыйЭлементОснованияРазворотов(Префикс + "Субконто" + Субконто.НомерСтроки,  
											Субконто.ВидСубконто.ТипЗначения.ПривестиЗначение());
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет в список разворотов развороты по кор. субконто.
// 
&НаСервереБезКонтекста
Процедура ДобавитьРазворотыПоКорСубконто(СписокРазворотов, СтруктураСКорСчетом, Картинка = Неопределено)
	
	КорСчет = Неопределено;
	
	СтруктураСКорСчетом.Свойство("КорСчет", КорСчет);
	
	Если КорСчет = Неопределено Тогда
		
		СписокРазворотов.Добавить("КорСубконто1", "Кор. субконто1",, ПолучитьКартинку(Картинка));
		СписокРазворотов.Добавить("КорСубконто2", "Кор. субконто2",, ПолучитьКартинку(Картинка));
		СписокРазворотов.Добавить("КорСубконто3", "Кор. субконто3",, ПолучитьКартинку(Картинка));
		
	Иначе
		
		ВидыСубконто = КорСчет.ВидыСубконто;
		
		Для Каждого Субконто Из ВидыСубконто Цикл
			ТекстПредставления = СтрШаблон(НСтр("ru='По Кор. субконто %1: %2';en='По Кор. субконто %1: %2'"), 
										   Субконто.НомерСтроки, 
										   Субконто.ВидСубконто.Наименование);
			СписокРазворотов.Добавить("КорСубконто" + Строка(Субконто.НомерСтроки), ТекстПредставления,, ПолучитьКартинку(Картинка));
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Добавляет новый элемент в структуру разворотов, для определения возможных реквизитов разворота.
// 
&НаСервере
Процедура НовыйЭлементОснованияРазворотов(Измерение, МетаданныеИзмерения)
	
	НовСтрокаОснование = ОснованияРазворотовПоРеквизитам.Добавить();
		
	НовСтрокаОснование.Измерение  = Измерение;
	НовСтрокаОснование.Метаданные = МетаданныеИзмерения;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииЗаполненияИФорматированияТабличногоДокументаДокументрезультат

// Формирует и возвращает структуру параметров вывода оборотно-сальдовой ведомости.
// 
&НаСервереБезКонтекста
Функция ПараметрыВыводаОСВ(СтруктураПараметров, Макет, Знач ПоЗабалансовымСчетам)
	
	СтруктураФорматовПоказателей   = СформироватьСтруктуруФорматовПоказателей(СтруктураПараметров.СписокПоказателей, СтруктураПараметров.ИмяРегистраБухгалтерии);
	СтруктураПараметровОграничений = СформироватьСтруктуруОграниченийДляОборотноСальдовойВедомости(СтруктураПараметров, ПоЗабалансовымСчетам);

	// В этой структуре будут храниться постоянные значения, передаваемые в другие процедуры.
	СтруктураПараметровОСВ = Новый Структура;
		
	// Переменная, содержащая имена показателей отчета (ресурсов) в виде массива.
	СтруктураПараметровОСВ.Вставить("СписокПоказателей"				, СтруктураПараметров.СписокПоказателей);
	СтруктураПараметровОСВ.Вставить("ОбластьСтрокаПоказателяЧисла"	, Макет.ПолучитьОбласть("СтрокаПоказателя|Числа"));
	СтруктураПараметровОСВ.Вставить("ОбластьСтрокаЧисла"			, Макет.ПолучитьОбласть("Строка|Числа"));
	
	СтруктураПараметровОСВ.Вставить("ОбластьСтрокаПоказателяЧислаРазвернутый", Макет.ПолучитьОбласть("СтрокаПоказателяРазвернутый|Числа"));
	СтруктураПараметровОСВ.Вставить("ОбластьСтрокаЧислаРазвернутый"			 , Макет.ПолучитьОбласть("СтрокаРазвернутый|Числа"));
	СтруктураПараметровОСВ.Вставить("ОбластьСтрокаПоказателяСчетРазвернутый" , Макет.ПолучитьОбласть("СтрокаПоказателяРазвернутый|Счет"));
	
	СтруктураПараметровОСВ.Вставить("ОбластьСтрокаПоказателяСчет"	, Макет.ПолучитьОбласть("СтрокаПоказателя|Счет"));
	СтруктураПараметровОСВ.Вставить("НетЛинии"						, Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии, 1));
    СтруктураПараметровОСВ.Вставить("ФорматПоказателей"				, СтруктураФорматовПоказателей);
	СтруктураПараметровОСВ.Вставить("СтруктураОграничений"			, СтруктураПараметровОграничений);
	
	Возврат СтруктураПараметровОСВ;
	
КонецФункции

// Функция возвращает структуру форматов показателей по массиву показателей.
// 
&НаСервереБезКонтекста
Функция СформироватьСтруктуруФорматовПоказателей(Знач СписокПоказателей, Знач ИмяРегистраБухгалтерии)
	
	ФорматПоказателей = Новый Структура();
	
	Для Каждого ТекПоказатель Из СписокПоказателей Цикл
		
		Ресурс = Метаданные.РегистрыБухгалтерии[ИмяРегистраБухгалтерии].Ресурсы.Найти(ТекПоказатель.Значение);
		Если Ресурс <> Неопределено Тогда
			
			ФорматПоказателей.Вставить(ТекПоказатель.Значение, "ЧЦ = " + Ресурс.Тип.КвалификаторыЧисла.Разрядность
			+ " ; ЧДЦ = " + Ресурс.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти);
			
		Иначе 
			
			// По умолчанию - сумма
			ФорматПоказателей.Вставить(ТекПоказатель.Значение , "ЧЦ = 15 ; ЧДЦ = 2");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ФорматПоказателей;
	
КонецФункции

// Функция формирует структуру параметров ограничений для оборотно-сальдовой ведомости.
// 
&НаСервереБезКонтекста
Функция СформироватьСтруктуруОграниченийДляОборотноСальдовойВедомости(СтруктураПараметров, Знач ПоЗабалансовымСчетам)
	
	Структура = Новый Структура();
	Структура.Вставить("ИспользоватьОграниченияПоЗабалансовымСчетам", НЕ ПоЗабалансовымСчетам);
	Структура.Вставить("ПоЗабалансовымСчетам", ПоЗабалансовымСчетам);
	Возврат Структура; 
	
КонецФункции

// Инициализирует структуру в которой хранятся итоговые суммы документа.
// 
&НаСервереБезКонтекста
Процедура ИнициализироватьСтруктуруХраненияИтоговОборотка(Знач СписокПоказателей, СтруктураОбщийИтог)
	
	Для Каждого ТекПоказатель Из СписокПоказателей Цикл
		
		СтруктураОбщийИтог.Вставить(ТекПоказатель.Значение + "НачальныйОстатокДт", 0);
		СтруктураОбщийИтог.Вставить(ТекПоказатель.Значение + "НачальныйОстатокКт", 0);
		СтруктураОбщийИтог.Вставить(ТекПоказатель.Значение + "КонечныйОстатокДт", 0);
		СтруктураОбщийИтог.Вставить(ТекПоказатель.Значение + "КонечныйОстатокКт", 0);
		СтруктураОбщийИтог.Вставить(ТекПоказатель.Значение + "ОборотДт", 0);
		СтруктураОбщийИтог.Вставить(ТекПоказатель.Значение + "ОборотКт", 0);
						
	КонецЦикла;
	
КонецПроцедуры

// Заполняет параметры расшифровки переданной области перед выводом в отчет.
// 
&НаСервереБезКонтекста
Процедура ЗаполнитьПараметрыРасшифровкиОборотноСальдовойВедомости(Область, Выборка, Расшифровка = Неопределено, ВыведенныйСчет = Неопределено)
	
	// Заполение значений для расшифровки.
	СчетДляРасшифровки = ?(Выборка.Счет <> NULL, Выборка.Счет, ВыведенныйСчет);
	
	Если Расшифровка = Неопределено Тогда
		Область.Параметры.Расшифровка = СчетДляРасшифровки;
	Иначе		
		Область.Параметры.Расшифровка = Расшифровка;				
	КонецЕсли;
	
КонецПроцедуры

// Процедура добавляет в итоговое хранилище сумм текущие данных.
// 
&НаСервереБезКонтекста
Процедура ДополнитьСтруктуруХраненияИтоговОбороткаОстатки(Знач ИмяПоказателя, СтруктураОбщийИтог,
	Знач НачальныйОстатокДт, Знач НачальныйОстатокКт, Знач КонечныйОстатокДт, Знач КонечныйОстатокКт)
	
	СтруктураОбщийИтог[ИмяПоказателя + "НачальныйОстатокДт"] = СтруктураОбщийИтог[ИмяПоказателя + "НачальныйОстатокДт"] + НачальныйОстатокДт;
	СтруктураОбщийИтог[ИмяПоказателя + "НачальныйОстатокКт"] = СтруктураОбщийИтог[ИмяПоказателя + "НачальныйОстатокКт"] + НачальныйОстатокКт;
	СтруктураОбщийИтог[ИмяПоказателя + "КонечныйОстатокДт"] =  СтруктураОбщийИтог[ИмяПоказателя + "КонечныйОстатокДт" ] + КонечныйОстатокДт;
	СтруктураОбщийИтог[ИмяПоказателя + "КонечныйОстатокКт"] =  СтруктураОбщийИтог[ИмяПоказателя + "КонечныйОстатокКт" ] + КонечныйОстатокКт;
		
КонецПроцедуры

// Процедура добавляет в итоговое хранилище сумм текущие данных.
// 
&НаСервереБезКонтекста
Процедура ДополнитьСтруктуруХраненияИтоговОбороткаОбороты(Знач ИмяПоказателя, СтруктураОбщийИтог, Знач ОборотДт, Знач ОборотКт)
	
	СтруктураОбщийИтог[ИмяПоказателя + "ОборотДт"] = СтруктураОбщийИтог[ИмяПоказателя + "ОборотДт"] + ОборотДт;
	СтруктураОбщийИтог[ИмяПоказателя + "ОборотКт"] = СтруктураОбщийИтог[ИмяПоказателя + "ОборотКт"] + ОборотКт;
	
КонецПроцедуры

// Процедура выводит текущие данные оборотки в область вывода.
// 
&НаСервереБезКонтекста
Процедура ЗаполнитьДаннымиОбластьВыводаОбороткаОстатки(Область, Знач ФорматПоказателя, 
	Знач НачальныйОстатокДт, Знач НачальныйОстатокКт, Знач КонечныйОстатокДт, Знач КонечныйОстатокКт)
		
	Область.Параметры.НачальныйОстатокДт = Формат(НачальныйОстатокДт, ФорматПоказателя);
	Область.Параметры.НачальныйОстатокКт = Формат(НачальныйОстатокКт, ФорматПоказателя);
	Область.Параметры.КонечныйОстатокДт  = Формат(КонечныйОстатокДт,  ФорматПоказателя);
	Область.Параметры.КонечныйОстатокКт  = Формат(КонечныйОстатокКт,  ФорматПоказателя);
	
КонецПроцедуры

// Процедура выводит текущие данные оборотки в область вывода.
// 
&НаСервереБезКонтекста
Процедура ЗаполнитьДаннымиОбластьВыводаОбороткаОбороты(Область, Знач ФорматПоказателя, Знач ОборотДт, Знач ОборотКт)
		
	Область.Параметры.ОборотДт = Формат(ОборотДт, ФорматПоказателя);
	Область.Параметры.ОборотКт = Формат(ОборотКт, ФорматПоказателя);
	
КонецПроцедуры

// Выводит показатели в оборотно-сальдовую ведомость.
// 
&НаСервереБезКонтекста
Процедура ВывестиПоказателиОборотноСальдовойВедомости(ДокументРезультат, Выборка, Счет, 
	СтруктураОбщийИтог, СтруктураПараметров, СтруктураПараметровОСВ, ДополнительныеПараметры)

	Уровень 				  = ДополнительныеПараметры.Уровень;
	СтруктураКолонок 		  = ДополнительныеПараметры.СтруктураКолонок;
	ВыводитьРазвернутоеСальдо = ДополнительныеПараметры.ВыводитьРазвернутоеСальдо;
	ВключитьВИтог 			  = ДополнительныеПараметры.ВключитьВИтог;
	ОбластьРазвернутогоСальдо = ДополнительныеПараметры.ОбластьРазвернутогоСальдо;
	
	ВыведеноПоказателей = 0;	
	
	ИмяГруппировки = "Счет";
	
	ВыводитьРазвернутыйОстаток 	= Ложь;
	ПоСубсчетам					= Истина;
	
	Если Выборка.РазвернутоеСальдо И ВыводитьРазвернутоеСальдо Тогда
		
		Если ТипЗнч(Выборка.Расшифровка) = Тип("ТаблицаЗначений") И Выборка.Расшифровка.Количество() > 0 Тогда
			
			ОбразецРасшифровки 	= Выборка.Расшифровка[0]; 
			ИмяРазворота 		= ОбразецРасшифровки.ИмяМакета;
			
			ЭтоИзмерениеРегистраКор = Ложь;
			ЭтоИзмерениеРегистра = ЭтоИзмерениеРегистра(СтруктураПараметров.ИмяРегистраБухгалтерии, ИмяРазворота, ЭтоИзмерениеРегистраКор);
			Если (ИмяРазворота = "Счет"
				  ИЛИ Лев(ИмяРазворота, 8) = "Субконто"
				  ИЛИ ЭтоИзмерениеРегистра)
			   И НЕ (ОтборИсключаетОстатки(ОбразецРасшифровки.Отбор, СтруктураПараметров.ИмяРегистраБухгалтерии)
			   		 ИЛИ (ЭтоИзмерениеРегистра И ЭтоИзмерениеРегистраКор)) Тогда
				
				// Можно выводить развернутое сальдо. Оно равно сумме дебетового сальдо и кредитового по расшифровке.
				ВремСтрокаИмяРазворота = ИмяРазворота;
				Если ЭтоИзмерениеРегистра Тогда
					ВремСтрокаИмяРазворота = Метаданные.РегистрыБухгалтерии[СтруктураПараметров.ИмяРегистраБухгалтерии].Измерения[ИмяРазворота].Представление();
				КонецЕсли;
				ОбластьРазвернутогоСальдо.Параметры.ТекстРазвернутогоСальдо = СтрШаблон(НСтр("ru='Развернутое сальдо по: ""%1""'; 
																							 |en='Развернутое сальдо по: ""%1""'"), 
																						ВремСтрокаИмяРазворота);
				ДокументРезультат.Вывести(ОбластьРазвернутогоСальдо, Уровень, НСтр("ru='Для данной строки отчета расшифровки не предусмотрены'; 
																				   |en='Для данной строки отчета расшифровки не предусмотрены'"));
				
				ВыводитьРазвернутыйОстаток = Истина;
				ПоСубсчетам				   = Ложь;
				
			Иначе
				
				ВыводитьРазвернутыйОстаток = Ложь;
				Возврат;
				
			КонецЕсли;
						
		Иначе
			
			ОбластьРазвернутогоСальдо.Параметры.ТекстРазвернутогоСальдо = НСтр("ru='Развернутое сальдо по: ""Субсчета""'; 
																			   |en='Развернутое сальдо по: ""Субсчета""'");
			ДокументРезультат.Вывести(ОбластьРазвернутогоСальдо, Уровень, НСтр("ru='Для данной строки отчета расшифровки не предусмотрены'; 
																			   |en='Для данной строки отчета расшифровки не предусмотрены'"));
				
			ВыводитьРазвернутыйОстаток = Истина;
			
		КонецЕсли;
		
	Иначе
		
		ВыводитьРазвернутыйОстаток = Ложь;
		
	КонецЕсли;
	
	Для Каждого ТекПоказатель Из СтруктураПараметров.СписокПоказателей Цикл

		// Проверим, есть ли колонка показателя в выборке.
		Если СтруктураКолонок <> Неопределено И СтруктураКолонок.Найти(ТекПоказатель.Значение + "НачальныйОстатокДт") = Неопределено Тогда
			// Не выводим показатель.
			Продолжить;
		КонецЕсли;
		
		// Сумму в валюте выводим только по группировке Валюта.
		Если ТекПоказатель.Значение = "ВалютнаяСумма" И ИмяГруппировки <> "Валюта" Тогда
			Продолжить;			
		КонецЕсли;
		
		Если ТекПоказатель.Значение = "НДС" И Счет.НДС = Ложь Тогда
			Продолжить;
		КонецЕсли;

		ФорматПоказателя = "";
		СтруктураПараметровОСВ.ФорматПоказателей.Свойство(ТекПоказатель.Значение, ФорматПоказателя);

		ВыведеноПоказателей = ВыведеноПоказателей + 1;
		
		Если ВыводитьРазвернутыйОстаток Тогда
			
			Если ВыведеноПоказателей > 1 Тогда
				// Без подчеркивания вверху.
				Область = СтруктураПараметровОСВ.ОбластьСтрокаПоказателяЧислаРазвернутый;
			Иначе
				// Есть подчеркивание вверху.
				Область = СтруктураПараметровОСВ.ОбластьСтрокаЧислаРазвернутый;
			КонецЕсли;
			
		Иначе	
			
			Если ВыведеноПоказателей > 1 Тогда
				// Без подчеркивания вверху.
				Область = СтруктураПараметровОСВ.ОбластьСтрокаПоказателяЧисла;
			Иначе
				// Есть подчеркивание вверху.
				Область = СтруктураПараметровОСВ.ОбластьСтрокаЧисла;
			КонецЕсли;
			
		КонецЕсли;
		
		ОборотДт = Выборка[ТекПоказатель.Значение + "ОборотДт"];
		ОборотКт = Выборка[ТекПоказатель.Значение + "ОборотКт"];

		СуффиксОстатка = ?(Выборка.РазвернутоеСальдо И ВыводитьРазвернутыйОстаток, "Развернутый", "");
		
		Если ВыводитьРазвернутыйОстаток Тогда
			
			Если ПоСубсчетам Тогда
				
				НачальныйОстатокДт = Выборка[ТекПоказатель.Значение + "Начальный" 	+ СуффиксОстатка + "ОстатокДт"];
				НачальныйОстатокКт = Выборка[ТекПоказатель.Значение + "Начальный" 	+ СуффиксОстатка + "ОстатокКт"];
				КонечныйОстатокДт  = Выборка[ТекПоказатель.Значение + "Конечный" 	+ СуффиксОстатка + "ОстатокДт"];
				КонечныйОстатокКт  = Выборка[ТекПоказатель.Значение + "Конечный" 	+ СуффиксОстатка + "ОстатокКт"];
				
			Иначе
				
				НачальныйОстатокДт = Выборка.Расшифровка.Итог(ТекПоказатель.Значение + "НачальныйОстатокДт");
				НачальныйОстатокКт = Выборка.Расшифровка.Итог(ТекПоказатель.Значение + "НачальныйОстатокКт");
				КонечныйОстатокДт  = Выборка.Расшифровка.Итог(ТекПоказатель.Значение + "КонечныйОстатокДт");
				КонечныйОстатокКт  = Выборка.Расшифровка.Итог(ТекПоказатель.Значение + "КонечныйОстатокКт");
							
			КонецЕсли;
			
		Иначе
			
			НачальныйОстатокДт = Выборка[ТекПоказатель.Значение + "Начальный" 	+ СуффиксОстатка + "ОстатокДт"];
			НачальныйОстатокКт = Выборка[ТекПоказатель.Значение + "Начальный" 	+ СуффиксОстатка + "ОстатокКт"];
			КонечныйОстатокДт  = Выборка[ТекПоказатель.Значение + "Конечный" 	+ СуффиксОстатка + "ОстатокДт"];
			КонечныйОстатокКт  = Выборка[ТекПоказатель.Значение + "Конечный" 	+ СуффиксОстатка + "ОстатокКт"];
			
		КонецЕсли;
			
		
		// ЕСЛИ НЕ ПОНРАВИТСЯ ИТОГ.
		
		// Накопление итогов по счетам.
		// Группировки.
		НужноДополнятьИтоги = (ИмяГруппировки = "Счет") И (Уровень = 0) И ВключитьВИтог;
		Если СтруктураПараметровОСВ.СтруктураОграничений.ИспользоватьОграниченияПоЗабалансовымСчетам = Истина Тогда			
			НужноДополнятьИтоги = НужноДополнятьИтоги И	НЕ Выборка.СчетЗабалансовый;			
		КонецЕсли;
			
		Если НужноДополнятьИтоги Тогда
			ДополнитьСтруктуруХраненияИтоговОбороткаОстатки(ТекПоказатель.Значение, СтруктураОбщийИтог,
				НачальныйОстатокДт, НачальныйОстатокКт, КонечныйОстатокДт, КонечныйОстатокКт);
			ДополнитьСтруктуруХраненияИтоговОбороткаОбороты(ТекПоказатель.Значение, СтруктураОбщийИтог, ОборотДт, ОборотКт);				
		КонецЕсли;

		// Заполняет данными область вывода.
		ЗаполнитьДаннымиОбластьВыводаОбороткаОстатки(Область, ФорматПоказателя, 
			НачальныйОстатокДт, НачальныйОстатокКт, КонечныйОстатокДт, КонечныйОстатокКт);
		ЗаполнитьДаннымиОбластьВыводаОбороткаОбороты(Область, ФорматПоказателя, ОборотДт, ОборотКт);
			
		Если ВыведеноПоказателей > 1 Тогда

			Если ВыводитьРазвернутыйОстаток Тогда
				ОбластьСтрокаПоказателяСчет = СтруктураПараметровОСВ.ОбластьСтрокаПоказателяСчетРазвернутый;			
			Иначе
				ОбластьСтрокаПоказателяСчет = СтруктураПараметровОСВ.ОбластьСтрокаПоказателяСчет;
			КонецЕсли;
			
			ОбластьСтрокаПоказателяСчет.Параметры.СубконтоПредставление = ТекПоказатель.Представление;
			ОбластьСтрокаПоказателяСчет.Область(1,7).ЦветТекста = ЦветаСтиля.бит_ЦветТекстаОхра;
			ОбластьСтрокаПоказателяСчет.Область(1,7).Шрифт = Новый Шрифт(, 8, , Истина);
			ОбластьСтрокаПоказателяСчет.Область(1,7).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				
            ВыведеннаяОбласть = ДокументРезультат.Вывести(ОбластьСтрокаПоказателяСчет);
			
			ВыведеннаяОбласть.ГраницаСверху = СтруктураПараметровОСВ.НетЛинии;
			
		КонецЕсли;

		ДокументРезультат.Присоединить(Область);
				
	КонецЦикла;

КонецПроцедуры

// Применяет оформление области-источника к области-приемнику.
// 
&НаСервере
Процедура ОформитьОбластьПоПодобию(ОбластьПриемник, ОбластьИсточник, СтартЯчейка, ФинишЯчейка, НомерСтроки, Группа = Ложь)
	
	ОбластьПрототип   = ОбластьИсточник.ТекущаяОбласть;             
	ОбластьПолучатель = ОбластьПриемник.Область(НомерСтроки, СтартЯчейка, НомерСтроки, ФинишЯчейка);
	
	ОбластьПолучатель.ЦветФона = ОбластьПрототип.ЦветФона;
	
	Если Группа Тогда
		ОбластьПолучатель.Шрифт = ШрифтыСтиля.бит_ШрифтТекстаОбычныйПолужирный;
		ОбластьПолучатель.ЦветТекста = ЦветаСтиля.бит_ТекстНедоступнойНадписи;
	КонецЕсли;	
	
КонецПроцедуры

// Применяет оформление к области, в зависимости от отступа этой области.
// 
&НаСервере
Процедура ФорматироватьОбластьПоОтступу(Область, Отступ, ДопОтступ, ИмяМакета, ИмяВыводимойОбласти, МакетОбщий, Группа = Ложь)
	
	// Если макет - счет, а уровень ненулевой - рассматриваем как нулевой.
	Если ИмяМакета = "Счет" Тогда
		Отступ = 1;
	КонецЕсли;
	
	Отступ_ = Отступ + ДопОтступ;
	
	ОбластьДляОбъединения = Область.Область(1,2 + Отступ_,1, 14);
	ОбластьДляОбъединения.Объединить();
	
	ОбластьДляЗаполнения = Область.Область(1,2,1, 1 + Отступ_);
	ОбластьДляЗаполнения.Заполнение 		= ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьДляЗаполнения.Текст				= "";
	ГраницаБезЛиний							= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	ОбластьДляЗаполнения.ГраницаСверху    	= ГраницаБезЛиний;
	ОбластьДляЗаполнения.ГраницаСнизу    	= ГраницаБезЛиний;
	
	// Оформим область.
	ИмяОбластиПодобия 	= "ОформлениеУровень" + Строка(Отступ_ - ДопОтступ);
	МакетОформление     = МакетОбщий.ПолучитьОбласть(ИмяОбластиПодобия);
	ОформитьОбластьПоПодобию(Область, МакетОформление, 2 + Отступ_, 20, 1, Группа);
	
	Если Найти(ИмяВыводимойОбласти, "_Количество") > 0 ИЛИ Найти(ИмяВыводимойОбласти, "_Вал") > 0 Тогда
		
		ОбластьДляФорматирования = Область.Область(1, 2 + Отступ_, 1, 20);
		ОбластьДляФорматирования.ГраницаСнизу		= ГраницаБезЛиний;
		
		ОбластьДляОбъединения = Область.Область(2,2 + Отступ_,2, 14);
		ОбластьДляОбъединения.Объединить();
	
		ОбластьДляЗаполнения = Область.Область(2,2,2, 1 + Отступ_);
		ОбластьДляЗаполнения.Заполнение 		= ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ОбластьДляЗаполнения.Текст				= "";
		ГраницаБезЛиний							= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		ОбластьДляЗаполнения.ГраницаСверху    	= ГраницаБезЛиний;
		ОбластьДляЗаполнения.ГраницаСнизу    	= ГраницаБезЛиний;
		
		ОбластьДляФорматирования = Область.Область(2, 2 + Отступ_, 2, 20);
		ОбластьДляФорматирования.ГраницаСверху		= ГраницаБезЛиний;
		
		ОформитьОбластьПоПодобию(Область, МакетОформление, 2 + Отступ_, 20, 2);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура формирует заголовок отчета.
// 
&НаСервере
Процедура СформироватьИВывестиЗаголовокОтчета(СтруктураПараметров, ДокументРезультат, ВысотаЗаголовка, ПоказыватьЗаголовок)
	
	ОбластьЗаголовка 	= СформироватьЗаголовок(СтруктураПараметров);
	ВысотаЗаголовка 	= ОбластьЗаголовка.ВысотаТаблицы;
	
	ДокументРезультат.Вывести(ОбластьЗаголовка, 1);
	
	Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;
	
	Если РекомендацияПользователю Тогда
		
		ОбластьПредупреждения = ДокументРезультат.Область("R4C2:R4C20");
		
		Текст = "";
		Текст = Текст + НСтр("ru='Внимание. Изменены ключевые настройки отчета. Рекомендуется нажать на кнопку ""Сформировать""'; 
							 |en='Attention. Key report settings have been changed. It is recommended to click on the ""Generate"" button'");
		ОбластьПредупреждения.Текст 	 = Текст;
		ОбластьПредупреждения.ЦветТекста = ЦветаСтиля.бит_ЦветТекстаКрасный;
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует табличный документ с заголовком отчета.
// 
&НаСервереБезКонтекста
Функция СформироватьЗаголовок(СтруктураПараметров)

	ОписаниеПериода = СформироватьСтрокуВыводаПараметровПоДатам(СтруктураПараметров.НачалоПериода, СтруктураПараметров.ОкончаниеПериода);
	          
	Макет = СтруктураПараметров.ОтчетОбъектМакет;
	
	ЗаголовокОтчета = Макет.ПолучитьОбласть("Заголовок");

	НазваниеОрганизации = "";
	
	Для Каждого СтрокаОрганизация Из СтруктураПараметров.МассивОрганизаций Цикл
		
		Если ЗначениеЗаполнено(СтрокаОрганизация) Тогда
			НазваниеОрганизации_ = СтрокаОрганизация.НаименованиеПолное;
		КонецЕсли;
	
		Если ПустаяСтрока(НазваниеОрганизации) Тогда
			НазваниеОрганизации_ = СтрокаОрганизация;
		КонецЕсли;
		
		НазваниеОрганизации = НазваниеОрганизации + " " + НазваниеОрганизации_ + ";";
		
	КонецЦикла;
	
	ЗаголовокОтчета.Параметры.НазваниеОрганизации 	= НазваниеОрганизации;
	ЗаголовокОтчета.Параметры.Заголовок 			= НСтр("ru='Оборотно-сальдовая ведомость';en='Оборотно-сальдовая ведомость'");
    ЗаголовокОтчета.Параметры.ОписаниеПериода 		= ОписаниеПериода;

	ТекстСписокПоказателей = "";
	
	Для Каждого ТекПоказатель Из СтруктураПараметров.ПредставлениеПоказателей Цикл
		
		ТекстСписокПоказателей = ТекстСписокПоказателей + ?(ТекстСписокПоказателей = "", "", ", ") + ТекПоказатель;
		
	КонецЦикла;
	
	ТекстСписокПоказателей = СтрШаблон(НСтр("ru='Выводимые данные: %1';en='Output data: %1'"), ТекстСписокПоказателей);

	ЗаголовокОтчета.Параметры.СписокПоказателей = ТекстСписокПоказателей;

	Возврат ЗаголовокОтчета;
	
КонецФункции

// Формирует строку ограничений по датам отчета для показа в заголовке формы.
// 
&НаСервереБезКонтекста
Функция СформироватьСтрокуВыводаПараметровПоДатам(Знач ДатаНач, Знач ДатаКон)

	Если ЗначениеЗаполнено(ДатаНач) И ЗначениеЗаполнено(ДатаКон) Тогда
		
		// Даты заполнены.
		ТекстПериод = НСтр("ru='Период: %1';en='Period: %1'");
		ТекстИстина = НСтр("ru='ФП=Истина';en='Л=en; ФП=Истина'");
		ОписаниеПериода = СтрШаблон(ТекстПериод, ПредставлениеПериода(НачалоДня(ДатаНач), КонецДня(ДатаКон), ТекстИстина));
										
	ИначеЕсли НЕ ЗначениеЗаполнено(ДатаНач) И НЕ ЗначениеЗаполнено(ДатаКон) Тогда									
		
		// Даты не заполнены.
		ОписаниеПериода = НСтр("ru='Период: без ограничения.';en='Period: no limits.'");
												
	ИначеЕсли ЗначениеЗаполнено(ДатаНач) Тогда									
		
		// Заполнена только дата начала.
		ТекстПериод = НСтр("ru='Период: %1 - без ограничения.';en='Period: %1 - no limits.'");
		ОписаниеПериода = СтрШаблон(ТекстПериод, Формат(ДатаНач, "ДЛФ=D"));										
		
	ИначеЕсли ЗначениеЗаполнено(ДатаКон) Тогда
										
		// Заполнена только дата окончания.
		ТекстПериод = НСтр("ru='Период: без ограничения - %1.';en='Period: no limits - %1.'");
		ОписаниеПериода = СтрШаблон(ТекстПериод, Формат(ДатаКон, "ДЛФ=D"));
		
	КонецЕсли;

	Возврат ОписаниеПериода;

КонецФункции

// Выводит в табличный документ подчиненные расшифровки ОСВ.
// 
&НаСервере
Процедура ВывестиПодчиненнуюРасшифровку(ДокументРезультат, СтрокаСРасшифровкой, СтруктураСтроки, Макет, СписокПоказателей, Уровень = 1)
	
	ПодчиненнаяТЗ = СтрокаСРасшифровкой.Расшифровка;
	
	Если Уровень > 10 Тогда // А то есть любители...
		Уровень = 10;
	КонецЕсли;
	
	ЕстьИерархия = Ложь;
	
	Для Каждого СтрокаПодчиненной Из ПодчиненнаяТЗ Цикл
		
		ДопУровень = ?(ПодчиненнаяТЗ.Колонки.Найти("Уровень_") <> Неопределено, СтрокаПодчиненной.Уровень_, 0);
		
		// Получим необходимый макет.
		ИмяМакетаОбласти 	= СтрокаПодчиненной.ИмяМакета;
		ИмяМакетаОбласти 	= ПолучитьИмяРазворотаДляОтбора(ИмяМакетаОбласти);
		
		ИмяОбласти			= "";
		
		ЭтоГруппаВТаблице = ?(ПодчиненнаяТЗ.Колонки.Найти("ЭтоГруппа_") <> Неопределено, СтрокаПодчиненной.ЭтоГруппа_, Ложь);
		
		Если ЭтоГруппаВТаблице Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаПодчиненной[СтрЗаменить(ИмяМакетаОбласти, ".", "")]) Тогда
				ЕстьИерархия = Ложь;
				Продолжить;
			КонецЕсли;
			ЕстьИерархия = Истина;
		КонецЕсли;

		ИмяОбласти = "Субконто1";
		
		ПерваяСтрока = Истина;
		
		ВыборкаСтруктура = СтокаТЧВСтруктуруНаСервере(СтрокаПодчиненной, ПодчиненнаяТЗ.Колонки, ПодчиненнаяТЗ.Индекс(СтрокаПодчиненной), СтруктураСтроки);
		
		Если ИмяМакетаОбласти <> "ПоПроводкам" Тогда
		
			Для Каждого ТекПоказатель Из СписокПоказателей Цикл
				
				// Проверим, есть ли колонка показателя в выборке.
				Если НЕ ВыборкаСтруктура.Свойство(ТекПоказатель.Значение + "НачальныйОстатокДт") Тогда
					// Не выводим показатель.
					Продолжить;
				КонецЕсли;
				
				Область = Макет.ПолучитьОбласть(ИмяОбласти + ?(ПерваяСтрока, "", "_ДопСумма"));
				
				// Получим необходимый отступ по ячейкам.
				Отступ = Уровень;
				
				Если ПерваяСтрока Тогда
					ФорматироватьОбластьПоОтступу(Область, Отступ, ?(ЕстьИерархия, ДопУровень, 0), СтрокаСРасшифровкой.ИмяМакета, ИмяОбласти, Макет, ЭтоГруппаВТаблице);
				Иначе
					ФорматироватьОбластьПоОтступу(Область, Отступ, ?(ЕстьИерархия, ДопУровень, 0), СтрокаСРасшифровкой.ИмяМакета, ИмяОбласти, Макет, ЭтоГруппаВТаблице);
				КонецЕсли;
				
				Уровень = Отступ;
				
				Область.Параметры.Заполнить(СтрокаПодчиненной);
				Область.Параметры.НачальныйОстатокДт = СтрокаПодчиненной[ТекПоказатель.Значение + "НачальныйОстатокДт"];
				Область.Параметры.НачальныйОстатокКт = СтрокаПодчиненной[ТекПоказатель.Значение + "НачальныйОстатокКт"];
				Область.Параметры.ОборотДт = СтрокаПодчиненной[ТекПоказатель.Значение + "ОборотДт"];
				Область.Параметры.ОборотКт = СтрокаПодчиненной[ТекПоказатель.Значение + "ОборотКт"];
				Область.Параметры.КонечныйОстатокДт = СтрокаПодчиненной[ТекПоказатель.Значение + "КонечныйОстатокДт"];
				Область.Параметры.КонечныйОстатокКт = СтрокаПодчиненной[ТекПоказатель.Значение + "КонечныйОстатокКт"];
								
				Если ПерваяСтрока Тогда
					Область.Параметры.Субконто1 = СтрокаПодчиненной[СтрЗаменить(ИмяМакетаОбласти, ".", "")];
				Иначе
					Область.Параметры.Ресурс = ТекПоказатель.Представление;
				КонецЕсли;
				
				Область.Параметры.Расшифровка = ВыборкаСтруктура;
				
				ДокументРезультат.Вывести(Область, Уровень, "Счет", Истина);
				
				ПерваяСтрока = Ложь;
				
			КонецЦикла;
		
		Иначе
			
			Область = Макет.ПолучитьОбласть("СтрокаПоПроводкам");
			
			// Получим необходимый отступ по ячейкам.
			Отступ = Уровень;
			
			ФорматироватьОбластьПоОтступу(Область, Отступ, 0, СтрокаСРасшифровкой.ИмяМакета, ИмяОбласти, Макет, ЭтоГруппаВТаблице);
			
			Уровень = Отступ;
			
			Область.Параметры.Заполнить(СтрокаПодчиненной);
		
			ДокументРезультат.Вывести(Область, Уровень, "Счет", Истина);
			
		КонецЕсли;
		
		Если ТипЗнч(СтрокаПодчиненной.Расшифровка) = Тип("ТаблицаЗначений") Тогда
			ВывестиПодчиненнуюРасшифровку(ДокументРезультат, СтрокаПодчиненной, ВыборкаСтруктура, Макет, СписокПоказателей, Уровень + 1);
		КонецЕсли;
		
	КонецЦикла;
			
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииФормированияИсходныхЗапросовОсвИРазворотов

// Процедура формирует строку ограничений для выборки из таблицы оборотов и остатков регистров бухгалтерии.
// 
&НаСервереБезКонтекста
Процедура ДополнитьСтрокуОграниченийПоРеквизитамВСписке(СтрокаОграничения, Знач ИмяОграниченияПоРеквизиту, Знач ОграничениеПоРеквизиту)
	
	Если НЕ ЗначениеЗаполнено(ОграничениеПоРеквизиту) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаНовогоОграничения = ИмяОграниченияПоРеквизиту + " В(&" + ИмяОграниченияПоРеквизиту + ") ";
	
	СтрокаОграничения = ОбъединитьОграничения(СтрокаОграничения, СтрокаНовогоОграничения);
    
КонецПроцедуры

// Процедура формирует строку ограничений для выборки из таблицы оборотов и остатков регистров бухгалтерии.
// 
&НаСервереБезКонтекста
Процедура ДополнитьСтрокуОграниченийПоРеквизитам(Запрос, СтрокаОграничения, Знач ИмяОграниченияПоРеквизиту, Знач ОграничениеПоРеквизиту, ВидСравнения)
			
	Запрос.УстановитьПараметр(ИмяОграниченияПоРеквизиту, ОграничениеПоРеквизиту);
	
	СтрокаОтбора = бит_БухгалтерскиеОтчетыСервер.ПолучитьСтрокуОтбора(ВидСравнения, "&"+ИмяОграниченияПоРеквизиту, ИмяОграниченияПоРеквизиту);
	СтрокаНовогоОграничения = СтрокаОтбора + " ";
	
	СтрокаОграничения = ОбъединитьОграничения(СтрокаОграничения, СтрокаНовогоОграничения);
    
КонецПроцедуры

// Функция формирует текст строки запроса для выборки данных оборотов и остатков регистра бухгалтерии.
// 
&НаСервереБезКонтекста
Функция СформироватьТекстВыборкиИзТаблицыОборотовИОстатковРегистраБухгалтерии(Запрос, СтруктураПараметров, СтруктураПараметровОСВ, 
	Знач ИмяАлиасаТаблицы = "ОстаткиИОбороты", Знач ДопОграничениеПоСчету = "" )
	
	СтрокаОграниченийПоРеквизитам = "";
	
	Если ЕстьОрганизация(СтруктураПараметров.ИмяРегистраБухгалтерии) Тогда
		ДополнитьСтрокуОграниченийПоРеквизитамВСписке(СтрокаОграниченийПоРеквизитам, "Организация", СтруктураПараметров.МассивОрганизаций);
	КонецЕсли;
		
	Для Каждого ОграничениеИзмерение Из СтруктураПараметров.ТаблицаОтбора Цикл
		
		Если ОграничениеИзмерение.Использование Тогда
			
			ДополнитьСтрокуОграниченийПоРеквизитам(Запрос, 
												СтрокаОграниченийПоРеквизитам, 
												ОграничениеИзмерение.Измерение, 
												ОграничениеИзмерение.Значение, 
												ОграничениеИзмерение.ВидСравнения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаСвязкиДопОграниченияПоСчету = ?(ПустаяСтрока(ДопОграничениеПоСчету), "", " И ");
	
	СтрокаЧастиЗапроса = "
			|ИЗ
			|	РегистрБухгалтерии." + СтруктураПараметров.ИмяРегистраБухгалтерии + ".ОстаткиИОбороты( "
			+ ?(СтруктураПараметров.НачалоПериода = '00010101000000', "", "&НачПериода") + ", "
			+ ?(СтруктураПараметров.ОкончаниеПериода = '00010101000000', "", "&КонПериода") 
			+ ", , , " + ДопОграничениеПоСчету  
			+ ?(СтруктураПараметровОСВ.СтруктураОграничений.ИспользоватьОграниченияПоЗабалансовымСчетам = Ложь 
				ИЛИ СтруктураПараметровОСВ.СтруктураОграничений.ПоЗабалансовымСчетам = Истина, "", СтрокаСвязкиДопОграниченияПоСчету + " НЕ Счет.Забалансовый ") + ", "
			+ ", "
			+ СтрокаОграниченийПоРеквизитам + ") КАК " + ИмяАлиасаТаблицы;
			
	Возврат СтрокаЧастиЗапроса;		
	
КонецФункции

// Функция дополняет текст часть сформированного запроса по определенным полям.
// 
&НаСервереБезКонтекста
Функция ВернутьЧастьЗапросаПоВыборкеПолейОборотноСальдоваяВедомость(СписокПоказателей, Знач ПоляДляВыборки = Истина)
		
	СтрокаЗапроса = "";	
				
	Если ПоляДляВыборки Тогда
		
		МассивСуффиксов = Новый Массив;
		МассивСуффиксов.Добавить("");
		МассивСуффиксов.Добавить("Развернутый");
		
		Для Каждого ТекПоказатель Из СписокПоказателей Цикл
			
			Для Каждого РазвернутыйОстаток Из МассивСуффиксов Цикл
				
				СтрокаЗапроса =  СтрокаЗапроса + ",
				|	" + ТекПоказатель.Значение + "Начальный" + РазвернутыйОстаток + "ОстатокДт,
				|	" + ТекПоказатель.Значение + "Начальный" + РазвернутыйОстаток + "ОстатокКт,
				|	" + ТекПоказатель.Значение + "Конечный" + РазвернутыйОстаток + "ОстатокДт,
				|	" + ТекПоказатель.Значение + "Конечный" + РазвернутыйОстаток + "ОстатокКт";
				
			КонецЦикла;
			
			СтрокаЗапроса = СтрокаЗапроса + ",
			|	" + ТекПоказатель.Значение + "ОборотДт,
			|	" + ТекПоказатель.Значение + "ОборотКт";
			
		КонецЦикла;
		
	Иначе
		
		МассивСуффиксов = Новый Массив;
		МассивСуффиксов.Добавить("");
		МассивСуффиксов.Добавить("Развернутый");
		
		// Выборка для суммирования.
		Для Каждого ТекПоказатель Из СписокПоказателей Цикл
			
			Для Каждого РазвернутыйОстаток Из МассивСуффиксов Цикл
				
				СтрокаЗапроса = СтрокаЗапроса + ",
				|	СУММА(" + ТекПоказатель.Значение + "Начальный" + РазвернутыйОстаток + "ОстатокДт),
				|	СУММА(" + ТекПоказатель.Значение + "Начальный" + РазвернутыйОстаток + "ОстатокКт),
				|	СУММА(" + ТекПоказатель.Значение + "Конечный" + РазвернутыйОстаток + "ОстатокДт),
				|	СУММА(" + ТекПоказатель.Значение + "Конечный" + РазвернутыйОстаток + "ОстатокКт)";
				
			КонецЦикла;
			
			СтрокаЗапроса = СтрокаЗапроса + ",
			|	СУММА(" + ТекПоказатель.Значение + "ОборотДт),
			|	СУММА(" + ТекПоказатель.Значение + "ОборотКт)";
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтрокаЗапроса;
	
КонецФункции

// Формирует запрос по установленным условия, фильтрам и группировкам.
// 
&НаСервере
Функция СформироватьЗапрос(СтруктураПараметров, СтруктураПараметровОСВ)

	Запрос = Новый Запрос;
	
    ГраницаКонецДня = Новый Граница(КонецДня(СтруктураПараметров.ОкончаниеПериода), ВидГраницы.Включая);
	
	Запрос.УстановитьПараметр("НачПериода"	,  НачалоДня(СтруктураПараметров.НачалоПериода));
	Запрос.УстановитьПараметр("КонПериода"	,  ГраницаКонецДня);
	Запрос.УстановитьПараметр("Организация"	,  СтруктураПараметров.МассивОрганизаций);

	ТекстЗапроса = "";
	ТекстИтогов  = "";
	// АПК:254-выкл.
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Счет КАК Счет,
	|	Счет.Код КАК СчетКод,
	|	Счет.Наименование КАК СчетНаименование,
	|	Счет.Представление КАК СчетПредставление,
	|	Счет.Забалансовый КАК СчетЗабалансовый,
	|	ЛОЖЬ КАК ПоСубсчетам,
	|   ЛОЖЬ КАК РазвернутоеСальдо,
	|   ЛОЖЬ КАК Иерархия";
	// АПК:254-вкл.
	
	// Добавим в текст запроса все выбранные ресурсы.
	ТекстЗапроса = ТекстЗапроса + ВернутьЧастьЗапросаПоВыборкеПолейОборотноСальдоваяВедомость(СтруктураПараметров.СписокПоказателей, Истина);
			
	ТекстИтогов = ТекстИтогов + ВернутьЧастьЗапросаПоВыборкеПолейОборотноСальдоваяВедомость(СтруктураПараметров.СписокПоказателей, Ложь);		
				
	СтрокаТекстаВыборкиИзТаблицы = СформироватьТекстВыборкиИзТаблицыОборотовИОстатковРегистраБухгалтерии(Запрос, СтруктураПараметров, СтруктураПараметровОСВ);
		
	ТекстЗапроса = ТекстЗапроса + СтрокаТекстаВыборкиИзТаблицы;
	
	ТекстЗапроса = ТекстЗапроса + "
	|АВТОУПОРЯДОЧИВАНИЕ
	|ИТОГИ " + Сред(ТекстИтогов, 2) + "
	|ПО
	|	Счет ИЕРАРХИЯ";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Хозрасчетный", СтруктураПараметров.ИмяРегистраБухгалтерии);
	
	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос;

КонецФункции // СформироватьЗапрос()

// Формирует таблицу остатков и оборотов для расшифровки из временных таблиц остатков и оборотов.
//
&НаСервере
Функция ПолучитьОстаткиИОборотыДляПоляПоОтбору(Знач ИмяРазворота, Отбор, ИерархияЭлементов = Ложь, РазвернутоеСальдо = Ложь)
	
	Если ИмяРазворота = "СубСчет" Тогда
		ИмяРазворота = "Счет";
	КонецЕсли;
	
	ПодготовитьСтруктуруПараметровФормированияОтчетаНаСервере();
	
	СтруктураПараметров = ПолучитьИзВременногоХранилища(АдресСтруктурыПараметров);
	
	// Подготовим менеджер временных таблиц и поместим остатки и обороты во временные таблицы.
	Запрос 							= Новый Запрос;
	МенеджерТаблиц 					= Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц 	= МенеджерТаблиц;
	СписокПоказателей 				= СтруктураПараметров.СписокПоказателей;
	
	РезультатОстатковПоОтбору(Запрос, ИмяРазворота, Отбор, СтруктураПараметров, РазвернутоеСальдо);
	РезультатОборотовПоОтбору(Запрос, ИмяРазворота, Отбор, СтруктураПараметров);
	
	ИмяРазворота_ = ИмяРазворота;
	
	Если ЕстьПериодВИмени(ИмяРазворота)  Тогда
		ИмяРазворота_ 	= "Период";
	КонецЕсли;
	
	ПсевдонимРазворота = СтрЗаменить(ИмяРазворота_, ".", "");
	
	// Необходимо объединить данные из временных таблиц.
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   1 КАК Уровень_,
	|   ЛОЖЬ КАК ЭтоГруппа_,	
	|	Обороты.Счет"; 
	
	Для Каждого ТекПоказатель Из СписокПоказателей Цикл
		
		Запрос.Текст = Запрос.Текст + ",
		|	Обороты." + ТекПоказатель.Значение + "ОборотДт КАК " + ТекПоказатель.Значение + "ОборотДт,
		|	Обороты." + ТекПоказатель.Значение + "ОборотКт КАК " + ТекПоказатель.Значение + "ОборотКт,
		|	0 КАК " + ТекПоказатель.Значение + "НачальныйОстатокДт,
		|	0 КАК " + ТекПоказатель.Значение + "НачальныйОстатокКт,
		|	0 КАК " + ТекПоказатель.Значение + "КонечныйОстатокДт,
		|	0 КАК " + ТекПоказатель.Значение + "КонечныйОстатокКт";
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|ИЗ
	|	Обороты КАК Обороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	1 КАК Уровень_,
	|   ЛОЖЬ КАК ЭтоГруппа_,	
	|	Остатки.Счет";
	
	Для Каждого ТекПоказатель Из СписокПоказателей Цикл
		
		Запрос.Текст = Запрос.Текст + ",
		|	0 КАК " + ТекПоказатель.Значение + "ОборотДт,
		|	0 КАК " + ТекПоказатель.Значение + "ОборотКт,
		|	Остатки." + ТекПоказатель.Значение + "НачальныйОстатокДт КАК " + ТекПоказатель.Значение + "НачальныйОстатокДт,
		|	Остатки." + ТекПоказатель.Значение + "НачальныйОстатокКт КАК " + ТекПоказатель.Значение + "НачальныйОстатокКт,
		|	Остатки." + ТекПоказатель.Значение + "КонечныйОстатокДт КАК " + ТекПоказатель.Значение + "КонечныйОстатокДт,
		|	Остатки." + ТекПоказатель.Значение + "КонечныйОстатокКт КАК " + ТекПоказатель.Значение + "КонечныйОстатокКт";
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|ИЗ
	|	Остатки КАК Остатки";
	
	Если ИерархияЭлементов Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|ИТОГИ
		|	0 КАК Уровень_,
		|   ИСТИНА КАК ЭтоГруппа_";
		
		Для Каждого ТекПоказатель Из СписокПоказателей Цикл
			Запрос.Текст = Запрос.Текст + ",
			|	СУММА(" + ТекПоказатель.Значение + "ОборотДт),
			|	СУММА(" + ТекПоказатель.Значение + "ОборотКт),
			|	СУММА(" + ТекПоказатель.Значение + "НачальныйОстатокДт),
			|	СУММА(" + ТекПоказатель.Значение + "НачальныйОстатокКт),
			|	СУММА(" + ТекПоказатель.Значение + "КонечныйОстатокДт),
			|	СУММА(" + ТекПоказатель.Значение + "КонечныйОстатокКт)";
		КонецЦикла;
		
		Запрос.Текст = Запрос.Текст + "
		|ПО
		|	Счет Только ИЕРАРХИЯ";
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Счет", ПсевдонимРазворота);
    
    Если ИмяРазворота = "Регистратор" Тогда		
		Запрос.Текст = Запрос.Текст + "          
        |УПОРЯДОЧИТЬ ПО
        |    Регистратор
        |АВТОУПОРЯДОЧИВАНИЕ";   
    КонецЕсли;
    
	Результат = Запрос.Выполнить().Выгрузить();
	// Получим сводную таблицу остатков и оборотов в разрезе разворота.
	
	СтрокаРесурсов = "";
	
	Для Каждого ТекПоказатель Из СписокПоказателей Цикл
		
		СтрокаРесурсов = СтрокаРесурсов + ?(ПустаяСтрока(СтрокаРесурсов), "", ",")
						 + ТекПоказатель.Значение + "ОборотДт," + ТекПоказатель.Значение + "ОборотКт,"
						 + ТекПоказатель.Значение + "НачальныйОстатокДт," + ТекПоказатель.Значение + "НачальныйОстатокКт,"
						 + ТекПоказатель.Значение + "КонечныйОстатокДт," + ТекПоказатель.Значение + "КонечныйОстатокКт";
	КонецЦикла;
					 
	Результат.Свернуть(ПсевдонимРазворота + ", Уровень_, ЭтоГруппа_ ", СтрокаРесурсов);

	Результат.Колонки.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

// Получает обороты для поля по отбору.
// 
&НаСервереБезКонтекста 
Процедура РезультатОборотовПоОтбору(Запрос, Знач ИмяРазворота, Расшифровка, СтруктураПараметров)
	
	РегистрБухгалтерии 	= СтруктураПараметров.ИмяРегистраБухгалтерии;
	ИмяРегистра 		= РегистрБухгалтерии;
	
	ТекстВыборкиПолейЗапроса 	= "";
	ТекстУсловияЗапроса 		= "";
	ТекстПодвалаЗапроса			= "";
	
	Отбор 						= Расшифровка.Отбор; 
	ИмяРазворота_ 				= ИмяРазворота;
	Периодичность 				= ""; 
	Периодичность				= ПолучитьПериодичностьОтбора(Отбор);
	
	ОтборПоИзмерениям			= СтруктураПараметров.ТаблицаОтбора;
	СписокПоказателей			= СтруктураПараметров.СписокПоказателей;
	
	Если ЕстьПериодВИмени(ИмяРазворота)  Тогда
		
		Периодичность	= СтрЗаменить(ИмяРазворота, "Период", "");
		ИмяРазворота_ 	= "Период";
		
	КонецЕсли;
	
	Если ИмяРазворота = "Регистратор" Тогда
		
		Периодичность = ИмяРазворота;
		
	КонецЕсли;

	// Заполним текст выбора полей запроса.
	// Проверим, нужна ли сортировка.
	Если ВозможноНаименование(ИмяРазворота_) Тогда
		ТекстВыборкиПолейЗапроса = ТекстВыборкиПолейЗапроса + "ВЫБРАТЬ РАЗРЕШЕННЫЕ ХозрасчетныйОбороты.Счет КАК Счет";
	Иначе
		ТекстВыборкиПолейЗапроса = ТекстВыборкиПолейЗапроса + "ВЫБРАТЬ РАЗРЕШЕННЫЕ ХозрасчетныйОбороты.Счет КАК Счет";
	КонецЕсли;
    	
	Для Каждого ТекПоказатель Из СписокПоказателей Цикл
		
		ТекстВыборкиПолейЗапроса = ТекстВыборкиПолейЗапроса + ",
		|ХозрасчетныйОбороты." + ТекПоказатель.Значение + "ОборотДт,
		|ХозрасчетныйОбороты." + ТекПоказатель.Значение + "ОборотКт";
		
	КонецЦикла;
	
	// Заполним текст условий запроса.
	
	ВОтбореДопРеквизит 		= Ложь;
	УсловиеДляПодвалаДопов 	= "";
	ТекстПодвалаЗапросаДоп	= "";
	СчетчикУсловий 			= 0;
	СчетчикДопов			= 0;
	

	ТекстУсловияЗапроса = ТекстУсловияЗапроса + " ГДЕ ";
	
	ЕстьУсловияОтбора = Ложь;
	
	Если Отбор.Количество() > 1 Тогда // Счет всегда присутствует в отборах и указываем его в параметрах вирт. таблицы.
		
		Для Каждого СтрокаОтбора Из Отбор Цикл
			
			СчетчикУсловий = СчетчикУсловий + 1;
			
			Если СтрокаОтбора.Ключ = "Счет" ИЛИ ЕстьПериодВИмени(СтрокаОтбора.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			// Дополнительные реквизиты.
			Если Найти(СтрокаОтбора.Ключ, "ПоДопРеквизитам") <> 0 Тогда
				
				СчетчикДопов = СчетчикДопов + 1;
				
				ЕстьУсловияОтбора = Истина;
				
				Если СтрокаОтбора.Значение.Значение = NULL Тогда
					
					ТекстУсловияЗапроса = ТекстУсловияЗапроса +
					" ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Значение Есть NULL";
					
				Иначе	
					
					ТекстУсловияЗапроса = ТекстУсловияЗапроса +
					" ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Значение = &ПараметрУсловие" + Строка(СчетчикУсловий);
					
					// Сразу параметр.
					Запрос.УстановитьПараметр("ПараметрУсловие" + Строка(СчетчикУсловий), СтрокаОтбора.Значение.Значение);
					
				КонецЕсли;
			
				ТекстУсловияЗапроса = ТекстУсловияЗапроса + " И ";
				
				ИмяОбъектаСоСвойствами = СтрЗаменить(СтрокаОтбора.Значение.ИмяПредопределенныхДанных, "_", ".");
	
				ТекстПодвалаЗапросаДоп = ТекстПодвалаЗапросаДоп + "
				|		ЛЕВОЕ СОЕДИНЕНИЕ [ИмяОбъектаСоСвойствами].ДополнительныеРеквизиты КАК ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + " 
				|		ПО (ХозрасчетныйОбороты." + СтрокаОтбора.Значение.Измерение + " = ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Ссылка
				|			И ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Свойство = &СсылкаПВХ" + Строка(СчетчикУсловий) + ")";
				ТекстПодвалаЗапросаДоп = СтрЗаменить(ТекстПодвалаЗапросаДоп, "[ИмяОбъектаСоСвойствами]", ИмяОбъектаСоСвойствами);
				
				// Сразу параметр.                                                                                                                                    ест
				Запрос.УстановитьПараметр("СсылкаПВХ" + Строка(СчетчикУсловий), СтрокаОтбора.Значение.СсылкаПВХ);
				
				ВОтбореДопРеквизит = Истина;
				
			Иначе
				
				ЕстьУсловияОтбора = Истина;
				
				ТекстУсловияЗапроса = ТекстУсловияЗапроса + " ХозрасчетныйОбороты." + ПолучитьИмяРазворотаДляОтбора(СтрокаОтбора.Ключ) + " = &ПараметрУсловие" + Строка(СчетчикУсловий);
				
				// Сразу параметр.
				Запрос.УстановитьПараметр("ПараметрУсловие" + Строка(СчетчикУсловий), СтрокаОтбора.Значение);
				
				ТекстУсловияЗапроса = ТекстУсловияЗапроса + " И ";
								
			КонецЕсли;
		
		КонецЦикла;
		 		
	КонецЕсли;
	
	Если СтруктураПараметров.МассивОрганизаций.Количество() > 0 Тогда
		ТекстУсловияЗапроса = ТекстУсловияЗапроса + "Организация В(&СписокОрганизаций) ";
		// Сразу параметр.
		Запрос.УстановитьПараметр("СписокОрганизаций", СтруктураПараметров.МассивОрганизаций);
	Иначе
		ТекстУсловияЗапроса = ТекстУсловияЗапроса + "Истина ";
	КонецЕсли;
	
	// Если есть доппараметры - установим их.
	СтрокаДопПараметры = "";
	
	Для Каждого ДопПараметр Из ОтборПоИзмерениям Цикл
		
		// Сформируем условие по доппараметрам.
		
		Если ДопПараметр.Использование Тогда
			СчетчикУсловий = СчетчикУсловий + 1;
			СтрокаОтбора = бит_БухгалтерскиеОтчетыСервер.ПолучитьСтрокуОтбора(ДопПараметр.ВидСравнения, "&"+ДопПараметр.Измерение, ДопПараметр.Измерение);

			СтрокаДопПараметры = СтрокаДопПараметры + " И " + СтрокаОтбора;
			
			Запрос.УстановитьПараметр(ДопПараметр.Измерение, ДопПараметр.Значение);
		КонецЕсли;
	
	КонецЦикла;
	
	ТекстУсловияЗапроса = ТекстУсловияЗапроса + СтрокаДопПараметры;
	
	КонецПериодаНужен = СтруктураПараметров.ОкончаниеПериода <> Дата("00010101000000");
	
	// Заполним подвал запроса.
	ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + "ИЗ РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНач, " + ?(КонецПериодаНужен, "&ДатаКон, ", ", ") + Периодичность;
	
	ГраницаКонецДня = Новый Граница(КонецДня(СтруктураПараметров.ОкончаниеПериода), ВидГраницы.Включая);
	
	// Нужно ограничить период по первому верхнему в отборе.
	ДатаНачПсевдо = СтруктураПараметров.НачалоПериода;
	ДатаКонПсевдо = ГраницаКонецДня;
	
	ЗаполнитьПсевдоПериод(Отбор, ДатаНачПсевдо, ДатаКонПсевдо);
	
	// Сразу параметр.
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачПсевдо);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКонПсевдо);
	
	СчетДляОтбора 		= Неопределено;
	
	Если Отбор.Свойство("Счет", СчетДляОтбора) Тогда
		
		Если СчетДляОтбора <> Неопределено Тогда
			// АПК:1297-выкл Текст запроса.
			ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + ", Счет В Иерархии (&Счет)";
			// АПК:1297-вкл Текст запроса.
			// Сразу - параметр
			Запрос.УстановитьПараметр("Счет", СчетДляОтбора);
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + ") КАК ХозрасчетныйОбороты";
		
	ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + ТекстПодвалаЗапросаДоп;
	
	// Необходимо выбрать в качестве разреза переданное в качестве параметра поле.
	ТекстВыборкиПолейЗапроса = СтрЗаменить(ТекстВыборкиПолейЗапроса, "Счет КАК Счет", ИмяРазворота_);
	ТекстВыборкиПолейЗапроса = СтрЗаменить(ТекстВыборкиПолейЗапроса, ".Счет.", "." + ИмяРазворота_ + ".");
		
	ТекстЗапроса 	= ТекстВыборкиПолейЗапроса + Символы.ПС + "ПОМЕСТИТЬ Обороты" + Символы.ПС + ТекстПодвалаЗапроса + Символы.ПС + ТекстУсловияЗапроса;
	
	// Укажем реальный регистр бухгалтерии.
	ТекстЗапроса 	= СтрЗаменить(ТекстЗапроса, "Хозрасчетный", СтруктураПараметров.ИмяРегистраБухгалтерии);
	
	Запрос.Текст 	= ТекстЗапроса;
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Получает остатки для поля по отбору.
// 
&НаСервереБезКонтекста
Процедура РезультатОстатковПоОтбору(Запрос, Знач ИмяРазворота, Расшифровка, СтруктураПараметров, РазвернутоеСальдо = Ложь)
	
	ТекстВыборкиПолейЗапроса 	= "";
	ТекстУсловияЗапроса 		= "";
	ТекстПодвалаЗапроса			= "";
	
	Отбор 						= Расшифровка.Отбор; 
	
	ИмяРазворота_ 				= ИмяРазворота;
	Периодичность 				= ""; 
	Периодичность				= ПолучитьПериодичностьОтбора(Отбор);
	
	СписокПоказателей			= СтруктураПараметров.СписокПоказателей;
	ОтборПоИзмерениям			= СтруктураПараметров.ТаблицаОтбора;
	ИмяРегистраБухгалтерии 		= СтруктураПараметров.ИмяРегистраБухгалтерии;
	РазвернутыйСуффикс 			= ?(РазвернутоеСальдо, "Развернутый", "");	
		
	// Нужно определить счет-родитель разворота.
	Счет = Расшифровка.Отбор.Счет;
    	
	НачДт = "Начальный" + РазвернутыйСуффикс + "ОстатокДт";
	КонДт = "Конечный" 	+ РазвернутыйСуффикс + "ОстатокДт";
	НачКт = "Начальный" + РазвернутыйСуффикс + "ОстатокКт";
	КонКт = "Конечный" 	+ РазвернутыйСуффикс + "ОстатокКт";
	
	// Разворот по периодам может быть разный, в зависимости от периодичности разворота.
	// Необходимо выделить периодичность из наименования разворота.
	Если ЕстьПериодВИмени(ИмяРазворота)  Тогда
		
		Периодичность	= СтрЗаменить(ИмяРазворота, "Период", "");
		ИмяРазворота_ 	= "Период";
		
	КонецЕсли;
	
	// Если выполняется разворот по регистратору, то периодичность разворота также
	// должна быть "по позиции регистратора". 
	Если ИмяРазворота = "Регистратор" Тогда
		Периодичность = ИмяРазворота;
	КонецЕсли;
	
	ЭтоИзмерениеРегистраКор = Ложь;
	ЭтоИзмерениеРегистра = ЭтоИзмерениеРегистра(ИмяРегистраБухгалтерии, ИмяРазворота, ЭтоИзмерениеРегистраКор);
	
	Если (ИмяРазворота_ <> "Счет" И Лев(ИмяРазворота, 8) <> "Субконто"
	   И НЕ ЭтоИзмерениеРегистра)
	   ИЛИ ОтборИсключаетОстатки(Отбор, ИмяРегистраБухгалтерии)
	   ИЛИ (ЭтоИзмерениеРегистра И ЭтоИзмерениеРегистраКор) Тогда
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	NULL КАК Счет, NULL КАК Наименование";
		
		Для Каждого ТекПоказатель Из СписокПоказателей Цикл
			
			Запрос.Текст = Запрос.Текст + ",
			|	0 КАК " + ТекПоказатель.Значение + "НачальныйОстатокДт,
			|	0 КАК " + ТекПоказатель.Значение + "НачальныйОстатокКт,
			|	0 КАК " + ТекПоказатель.Значение + "КонечныйОстатокДт,
			|	0 КАК " + ТекПоказатель.Значение + "КонечныйОстатокКт";
			
		КонецЦикла;
		
		Запрос.Текст = Запрос.Текст + "
		|ПОМЕСТИТЬ Остатки
		|ГДЕ
		|	ИСТИНА = ЛОЖЬ";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Счет", СтрЗаменить(ИмяРазворота_, ".", ""));
			
		Запрос.Выполнить();
		
		Возврат;
		
	КонецЕсли;
	
	// Заполним текст выбора полей запроса.
	Если ВозможноНаименование(ИмяРазворота_) Тогда
		ТекстВыборкиПолейЗапроса = ТекстВыборкиПолейЗапроса + "ВЫБРАТЬ РАЗРЕШЕННЫЕ ХозрасчетныйОстаткиИОбороты.Счет КАК Счет";
	Иначе
		ТекстВыборкиПолейЗапроса = ТекстВыборкиПолейЗапроса + "ВЫБРАТЬ РАЗРЕШЕННЫЕ ХозрасчетныйОстаткиИОбороты.Счет КАК Счет";
	КонецЕсли;
	
	Для Каждого ТекПоказатель Из СписокПоказателей Цикл
		
		ТекстВыборкиПолейЗапроса = ТекстВыборкиПолейЗапроса + ",
		|ХозрасчетныйОстаткиИОбороты." + ТекПоказатель.Значение + НачДт + " КАК " + ТекПоказатель.Значение + "НачальныйОстатокДт,
		|ХозрасчетныйОстаткиИОбороты." + ТекПоказатель.Значение + НачКт + " КАК " + ТекПоказатель.Значение + "НачальныйОстатокКт,
		|ХозрасчетныйОстаткиИОбороты." + ТекПоказатель.Значение + КонДт + " КАК " + ТекПоказатель.Значение + "КонечныйОстатокДт,
		|ХозрасчетныйОстаткиИОбороты." + ТекПоказатель.Значение + КонКт + " КАК " + ТекПоказатель.Значение + "КонечныйОстатокКт";
		
	КонецЦикла;
	
	// Заполним текст условий запроса.
	СчетчикУсловий = 0;
	
	// Если будет в отборе допреквизит - все меняется в корне.
	ВОтбореДопРеквизит 		= Ложь;
	УсловиеДляПодвалаДопов 	= "";
	ТекстПодвалаЗапросаДоп	= "";
	СчетчикДопов			= 0;
	
	ТекстУсловияЗапроса 	= ТекстУсловияЗапроса + " ГДЕ ";
		
	Если Отбор.Количество() > 1 Тогда // Счет всегда присутствует в отборах и указываем его в параметрах вирт. таблицы.
		
		Для Каждого СтрокаОтбора Из Отбор Цикл
			
			СчетчикУсловий = СчетчикУсловий + 1;
			
			Если СтрокаОтбора.Ключ = "Счет" Тогда
				Продолжить;
			КонецЕсли;
            			
			// Дополнительные реквизиты.
			Если Найти(СтрокаОтбора.Ключ, "ПоДопРеквизитам") <> 0 Тогда
				
				СчетчикДопов = СчетчикДопов + 1;
				
				ЕстьУсловияОтбора = Истина;
				
				Если СтрокаОтбора.Значение.Значение = NULL Тогда
					
					ТекстУсловияЗапроса = ТекстУсловияЗапроса +
					" ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Значение Есть NULL";
					
				Иначе	
					
					ТекстУсловияЗапроса = ТекстУсловияЗапроса +
					" ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Значение = &ПараметрУсловие" + Строка(СчетчикУсловий);
					
					// Сразу параметр.
					Запрос.УстановитьПараметр("ПараметрУсловие" + Строка(СчетчикУсловий), СтрокаОтбора.Значение.Значение);
					
				КонецЕсли;
							
				Если СчетчикУсловий <> Отбор.Количество() Тогда
					ТекстУсловияЗапроса = ТекстУсловияЗапроса + " И ";
				КонецЕсли;
				
				ИмяОбъектаСоСвойствами = СтрЗаменить(СтрокаОтбора.Значение.ИмяПредопределенныхДанных, "_", ".");
	
				ТекстПодвалаЗапросаДоп = ТекстПодвалаЗапросаДоп + "
				|		ЛЕВОЕ СОЕДИНЕНИЕ [ИмяОбъектаСоСвойствами].ДополнительныеРеквизиты КАК ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + " 
				|		ПО (ХозрасчетныйОстаткиИОбороты." + СтрокаОтбора.Значение.Измерение + " = ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Ссылка
				|			И ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Свойство = &СсылкаПВХ" + Строка(СчетчикУсловий) + ")";
				ТекстПодвалаЗапросаДоп = СтрЗаменить(ТекстПодвалаЗапросаДоп, "[ИмяОбъектаСоСвойствами]", ИмяОбъектаСоСвойствами);
				
				// Сразу параметр.
				Запрос.УстановитьПараметр("СсылкаПВХ" + Строка(СчетчикУсловий), СтрокаОтбора.Значение.СсылкаПВХ);
				
				ВОтбореДопРеквизит = Истина;
				
			Иначе	
				
				ВремИмяРазворотаДляОтбора = ПолучитьИмяРазворотаДляОтбора(СтрокаОтбора.Ключ);
				ТекстУсловияЗапроса = ТекстУсловияЗапроса +
				" ХозрасчетныйОстаткиИОбороты." + ВремИмяРазворотаДляОтбора + " = &ПараметрУсловие" + Строка(СчетчикУсловий);
				
				// Сразу параметр.
				Запрос.УстановитьПараметр("ПараметрУсловие" + Строка(СчетчикУсловий), СтрокаОтбора.Значение);
				
				Если СчетчикУсловий <> Отбор.Количество() Тогда
					ТекстУсловияЗапроса = ТекстУсловияЗапроса + " И ";
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
					
	КонецЕсли;
	
	Если Отбор.Количество() > 1 Тогда
		ТекстУсловияЗапроса = ТекстУсловияЗапроса + " И ";
	КонецЕсли;
	
	ТекстУсловияЗапроса = ТекстУсловияЗапроса + "Истина ";
	
	ТекстВиртПараметры = "";
	
	Если СтруктураПараметров.МассивОрганизаций.Количество() > 0 Тогда
		ТекстВиртПараметры = ТекстВиртПараметры + "Организация В(&СписокОрганизаций) И ";
		// Сразу параметр.
		Запрос.УстановитьПараметр("СписокОрганизаций", СтруктураПараметров.МассивОрганизаций);
	КонецЕсли;
	
	// Если есть доппараметры - установим их.
	СтрокаДопПараметры = "";
	
	Для Каждого ДопПараметр Из ОтборПоИзмерениям Цикл
		
		Если ДопПараметр.Использование Тогда
			
			// Сформируем условие по доппараметрам.
			СчетчикУсловий = СчетчикУсловий + 1;
			
			СтрокаОтбора = бит_БухгалтерскиеОтчетыСервер.ПолучитьСтрокуОтбора(ДопПараметр.ВидСравнения, "&"+ДопПараметр.Измерение, ДопПараметр.Измерение);

			СтрокаДопПараметры = СтрокаДопПараметры + " И " + СтрокаОтбора;
			
			Запрос.УстановитьПараметр(ДопПараметр.Измерение, ДопПараметр.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтрокаДопПараметры <> "" Тогда
		ТекстВиртПараметры = ТекстВиртПараметры + " Истина " + СтрокаДопПараметры;
	Иначе
		ТекстВиртПараметры = ТекстВиртПараметры + "Истина";
	КонецЕсли;	
			
	КонецПериодаНужен = СтруктураПараметров.ОкончаниеПериода <> Дата("00010101000000");
	
	// Заполним подвал запроса.
	ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + "ИЗ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНач, " + ?(КонецПериодаНужен, "&ДатаКон, ", ", ") + Периодичность;

	ГраницаКонецДня = Новый Граница(КонецДня(СтруктураПараметров.ОкончаниеПериода), ВидГраницы.Включая);
	
	ДатаНачПсевдо = СтруктураПараметров.НачалоПериода;
	ДатаКонПсевдо = ГраницаКонецДня;
	
	ЗаполнитьПсевдоПериод(Отбор, ДатаНачПсевдо, ДатаКонПсевдо);
	
	// Сразу параметр.
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачПсевдо);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКонПсевдо);
	
	СчетДляОтбора = Неопределено;
	
	Если Отбор.Свойство("Счет", СчетДляОтбора) Тогда
		Если СчетДляОтбора <> Неопределено Тогда
			// АПК:1297-выкл Текст запроса.
			ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + ",, Счет В Иерархии (&Счет)";
			// АПК:1297-вкл Текст запроса.
			// Сразу параметр.
			Запрос.УстановитьПараметр("Счет", СчетДляОтбора);
		КонецЕсли;
	КонецЕсли;
	
	ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + ", ," + ТекстВиртПараметры + ") КАК ХозрасчетныйОстаткиИОбороты";
		
	ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + ТекстПодвалаЗапросаДоп;
	
	// Необходимо выбрать в качестве разреза переданное в качестве параметра поле.
	ТекстВыборкиПолейЗапроса = СтрЗаменить(ТекстВыборкиПолейЗапроса, "Счет КАК Счет", ИмяРазворота_);
	ТекстВыборкиПолейЗапроса = СтрЗаменить(ТекстВыборкиПолейЗапроса, ".Счет.", "." + ИмяРазворота_ + ".");
	
	// Поместить остатки.
	ТекстЗапроса = ТекстВыборкиПолейЗапроса + Символы.ПС + "ПОМЕСТИТЬ Остатки" + Символы.ПС + ТекстПодвалаЗапроса + Символы.ПС + ТекстУсловияЗапроса;
	
	// Укажем реальный регистр бухгалтерии.
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Хозрасчетный", ИмяРегистраБухгалтерии);
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует таблицу остатков и оборотов для расшифровки из временных таблиц остатков и оборотов.
//
&НаСервере
Функция ПолучитьОстаткиИОборотыДляПоляПоОтборуДопРеквизиты(Знач ИмяРазворота, Отбор, ДопИмяРазворота, ИерархияЭлементов = Ложь, РазвернутоеСальдо = Ложь) 
	
	Если ИмяРазворота = "СубСчет" Тогда
		ИмяРазворота = "Счет";
	КонецЕсли;
	
	ПодготовитьСтруктуруПараметровФормированияОтчетаНаСервере();
	
	СтруктураПараметров = ПолучитьИзВременногоХранилища(АдресСтруктурыПараметров);
	
	// Подготовим менеджер временных таблиц и поместим остатки и обороты во временные таблицы.
	Запрос 							= Новый Запрос;
	МенеджерТаблиц 					= Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц 	= МенеджерТаблиц;
	СписокПоказателей 				= СтруктураПараметров.СписокПоказателей;
	СчетчикДопУсловий 				= 0;
	
	Для Каждого СтрокаОтбора Из Отбор.Отбор Цикл
		Если Найти(СтрокаОтбора.Ключ, "ПоДопРеквизитам") Тогда
			СчетчикДопУсловий = СчетчикДопУсловий + 1;
		КонецЕсли;
	КонецЦикла;
	
	ПсевдонимРазворота = "ПоДопРеквизитам" + Строка(СчетчикДопУсловий);

	
	ДопИмяРазворота = ПсевдонимРазворота;
	
	РезультатОстатковПоОтборуДопРеквизиты(Запрос, ИмяРазворота, Отбор, СтруктураПараметров, ПсевдонимРазворота, РазвернутоеСальдо);
	РезультатОборотовПоОтборуДопРеквизиты(Запрос, ИмяРазворота, Отбор, СтруктураПараметров, ПсевдонимРазворота);
		
	// Необходимо объединить данные из временных таблиц.
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   1 КАК Уровень_,
	|   ЛОЖЬ КАК ЭтоГруппа_,	
	|	Обороты.Счет"; 
	
	Для Каждого ТекПоказатель Из СписокПоказателей Цикл
		
		Запрос.Текст = Запрос.Текст + ",
		|	Обороты." + ТекПоказатель.Значение + "ОборотДт КАК " + ТекПоказатель.Значение + "ОборотДт,
		|	Обороты." + ТекПоказатель.Значение + "ОборотКт КАК " + ТекПоказатель.Значение + "ОборотКт,
		|	0 КАК " + ТекПоказатель.Значение + "НачальныйОстатокДт,
		|	0 КАК " + ТекПоказатель.Значение + "НачальныйОстатокКт,
		|	0 КАК " + ТекПоказатель.Значение + "КонечныйОстатокДт,
		|	0 КАК " + ТекПоказатель.Значение + "КонечныйОстатокКт";
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|ИЗ
	|	Обороты КАК Обороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	1 КАК Уровень_,
	|   ЛОЖЬ КАК ЭтоГруппа_,	
	|	Остатки.Счет";
	
	Для Каждого ТекПоказатель Из СписокПоказателей Цикл
		
		Запрос.Текст = Запрос.Текст + ",
		|	0 КАК " + ТекПоказатель.Значение + "ОборотДт,
		|	0 КАК " + ТекПоказатель.Значение + "ОборотКт,
		|	Остатки." + ТекПоказатель.Значение + "НачальныйОстатокДт КАК " + ТекПоказатель.Значение + "НачальныйОстатокДт,
		|	Остатки." + ТекПоказатель.Значение + "НачальныйОстатокКт КАК " + ТекПоказатель.Значение + "НачальныйОстатокКт,
		|	Остатки." + ТекПоказатель.Значение + "КонечныйОстатокДт КАК " + ТекПоказатель.Значение + "КонечныйОстатокДт,
		|	Остатки." + ТекПоказатель.Значение + "КонечныйОстатокКт КАК " + ТекПоказатель.Значение + "КонечныйОстатокКт";
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|ИЗ
	|	Остатки КАК Остатки";
	
	Если ИерархияЭлементов Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|ИТОГИ
		|	0 КАК Уровень_,
		|   ИСТИНА КАК ЭтоГруппа_";
		
		Для Каждого ТекПоказатель Из СписокПоказателей Цикл
			Запрос.Текст = Запрос.Текст + ",
			|	СУММА(" + ТекПоказатель.Значение + "ОборотДт),
			|	СУММА(" + ТекПоказатель.Значение + "ОборотКт),
			|	СУММА(" + ТекПоказатель.Значение + "НачальныйОстатокДт),
			|	СУММА(" + ТекПоказатель.Значение + "НачальныйОстатокКт),
			|	СУММА(" + ТекПоказатель.Значение + "КонечныйОстатокДт),
			|	СУММА(" + ТекПоказатель.Значение + "КонечныйОстатокКт)";
		КонецЦикла;
		
		Запрос.Текст = Запрос.Текст + "
		|ПО
		|	Счет Только ИЕРАРХИЯ";
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Счет", ПсевдонимРазворота);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	// Получим сводную таблицу остатков и оборотов в разрезе разворота.
	
	СтрокаРесурсов = "";
	
	Для Каждого ТекПоказатель Из СписокПоказателей Цикл
		
		СтрокаРесурсов = СтрокаРесурсов + ?(ПустаяСтрока(СтрокаРесурсов), "", ",")
						 + ТекПоказатель.Значение + "ОборотДт," + ТекПоказатель.Значение + "ОборотКт,"
						 + ТекПоказатель.Значение + "НачальныйОстатокДт," + ТекПоказатель.Значение + "НачальныйОстатокКт,"
						 + ТекПоказатель.Значение + "КонечныйОстатокДт," + ТекПоказатель.Значение + "КонечныйОстатокКт";
	КонецЦикла;
					 
	Результат.Свернуть(ПсевдонимРазворота + ", Уровень_, ЭтоГруппа_ ", СтрокаРесурсов);

	Результат.Колонки.Добавить("Код");
		
	Возврат Результат;
	
КонецФункции

// Получает обороты для поля по отбору.
// 
&НаСервереБезКонтекста 
Процедура РезультатОборотовПоОтборуДопРеквизиты(Запрос, Знач ИмяРазворота, Расшифровка, СтруктураПараметров, ПсевдонимРазворота)
	
	РегистрБухгалтерии 	= СтруктураПараметров.ИмяРегистраБухгалтерии;
	ИмяРегистра 		= РегистрБухгалтерии;
	
	ТекстВыборкиПолейЗапроса 	= "";
	ТекстУсловияЗапроса 		= "";
	ТекстПодвалаЗапроса			= "";
	
	Отбор 						= Расшифровка.Отбор; 
	ИмяРазворота_ 				= ИмяРазворота;
	Периодичность 				= ""; 
	Периодичность				= ПолучитьПериодичностьОтбора(Отбор);
	
	ОтборПоИзмерениям			= СтруктураПараметров.ТаблицаОтбора;
	СписокПоказателей			= СтруктураПараметров.СписокПоказателей;
	
	Измерение					= ИмяРазворота.Измерение;
		
	ТекстВыборкиПолейЗапроса = ТекстВыборкиПолейЗапроса + "ВЫБРАТЬ РАЗРЕШЕННЫЕ ЗначенияСвойствОбъектов.Значение КАК " + ПсевдонимРазворота;
    	
	Для Каждого ТекПоказатель Из СписокПоказателей Цикл
		
		ТекстВыборкиПолейЗапроса = ТекстВыборкиПолейЗапроса + ",
		|ХозрасчетныйОбороты." + ТекПоказатель.Значение + "ОборотДт,
		|ХозрасчетныйОбороты." + ТекПоказатель.Значение + "ОборотКт";
		
	КонецЦикла;
	
	// Заполним текст условий запроса.
	
	ВОтбореДопРеквизит 		= Ложь;
	УсловиеДляПодвалаДопов 	= "";
	
	СчетчикУсловий 	= 0;
	СчетчикДопов	= 0;
	
	ТекстУсловияЗапроса 	= ТекстУсловияЗапроса + " ГДЕ ";
	ТекстПодвалаЗапросаДоп 	= "";
	
	ЕстьУсловияОтбора = Ложь;
	
	Если Отбор.Количество() > 1 Тогда // Счет всегда присутствует в отборах и указываем его в параметрах вирт. таблицы.
		
		Для Каждого СтрокаОтбора Из Отбор Цикл
			
			СчетчикУсловий 	= СчетчикУсловий + 1;
			
			Если СтрокаОтбора.Ключ = "Счет" ИЛИ ЕстьПериодВИмени(СтрокаОтбора.Ключ) Тогда
				Продолжить;
			КонецЕсли;
						
			// Дополнительные реквизиты.
			Если Найти(СтрокаОтбора.Ключ, "ПоДопРеквизитам") <> 0 Тогда
				
				СчетчикДопов = СчетчикДопов + 1;
				
				ЕстьУсловияОтбора = Истина;
				
				Если СтрокаОтбора.Значение.Значение = NULL Тогда
					
					ТекстУсловияЗапроса = ТекстУсловияЗапроса +
					" ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Значение Есть NULL";
					
				Иначе	
					
					ТекстУсловияЗапроса = ТекстУсловияЗапроса +
					" ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Значение = &ПараметрУсловие" + Строка(СчетчикУсловий);
					
					// Сразу - параметр
					Запрос.УстановитьПараметр("ПараметрУсловие" + Строка(СчетчикУсловий), СтрокаОтбора.Значение.Значение);
					
				КонецЕсли;
			
				ТекстУсловияЗапроса = ТекстУсловияЗапроса + " И ";
				
				ИмяОбъектаСоСвойствами = СтрЗаменить(СтрокаОтбора.Значение.ИмяПредопределенныхДанных, "_", ".");
	
				ТекстПодвалаЗапросаДоп = ТекстПодвалаЗапросаДоп + "
				|		ЛЕВОЕ СОЕДИНЕНИЕ [ИмяОбъектаСоСвойствами].ДополнительныеРеквизиты КАК ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + " 
				|		ПО (ХозрасчетныйОбороты." + СтрокаОтбора.Значение.Измерение + " = ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Ссылка
				|			И ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Свойство = &СсылкаПВХ" + Строка(СчетчикУсловий) + ")";
				ТекстПодвалаЗапросаДоп = СтрЗаменить(ТекстПодвалаЗапросаДоп, "[ИмяОбъектаСоСвойствами]", ИмяОбъектаСоСвойствами);
				
				// Сразу параметр.
				Запрос.УстановитьПараметр("СсылкаПВХ" + Строка(СчетчикУсловий), СтрокаОтбора.Значение.СсылкаПВХ);
								
				ВОтбореДопРеквизит = Истина;
				
			Иначе
				
				ЕстьУсловияОтбора = Истина;
				ТекстУсловияЗапроса = ТекстУсловияЗапроса + " ХозрасчетныйОбороты." + ПолучитьИмяРазворотаДляОтбора(СтрокаОтбора.Ключ) + " = &ПараметрУсловие" + Строка(СчетчикУсловий);
				
				// Сразу параметр.
				Запрос.УстановитьПараметр("ПараметрУсловие" + Строка(СчетчикУсловий), СтрокаОтбора.Значение);
				
				ТекстУсловияЗапроса = ТекстУсловияЗапроса + " И ";
								
			КонецЕсли;
		
		КонецЦикла;
		 		
	КонецЕсли;
	
	Если СтруктураПараметров.МассивОрганизаций.Количество() > 0 Тогда
		ТекстУсловияЗапроса = ТекстУсловияЗапроса + "Организация В(&СписокОрганизаций) ";
		// Сразу параметр.
		Запрос.УстановитьПараметр("СписокОрганизаций", СтруктураПараметров.МассивОрганизаций);
	Иначе
		ТекстУсловияЗапроса = ТекстУсловияЗапроса + "Истина ";
	КонецЕсли;
	
	// Если есть дополнительные параметры - установим их.
	СтрокаДопПараметры = "";
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Использование", истина);
	
	МассивОтборов = ОтборПоИзмерениям.НайтиСтроки(СтруктураОтбора);
	
	Для Каждого ДопПараметр Из МассивОтборов Цикл
		
		// Сформируем условие по дополнительным параметрам.
		
		СчетчикУсловий = СчетчикУсловий + 1;
		СтрокаДопПараметры = СтрокаДопПараметры + " И " + ДопПараметр.Измерение + " = &ПараметрУсловие" + Строка(СчетчикУсловий);
		
		Запрос.УстановитьПараметр("ПараметрУсловие" + Строка(СчетчикУсловий), ДопПараметр.Значение);
		
	КонецЦикла;
	
	ТекстУсловияЗапроса = ТекстУсловияЗапроса + СтрокаДопПараметры;
	
	КонецПериодаНужен = СтруктураПараметров.ОкончаниеПериода <> Дата("00010101000000");
	
	// Заполним подвал запроса.
	ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + "ИЗ РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНач, " + ?(КонецПериодаНужен, "&ДатаКон, ", ", ") + Периодичность;
	
	ГраницаКонецДня = Новый Граница(КонецДня(СтруктураПараметров.ОкончаниеПериода), ВидГраницы.Включая);
	
	// Нужно ограничить период по первому верхнему в отборе.
	ДатаНачПсевдо = СтруктураПараметров.НачалоПериода;
	ДатаКонПсевдо = ГраницаКонецДня;
	
	ЗаполнитьПсевдоПериод(Отбор, ДатаНачПсевдо, ДатаКонПсевдо);
	
	// Сразу параметр.
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачПсевдо);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКонПсевдо);
	
	СчетДляОтбора 		= Неопределено;
	
	Если Отбор.Свойство("Счет", СчетДляОтбора) Тогда
		
		Если СчетДляОтбора <> Неопределено Тогда
			// АПК:1297-выкл Текст запроса.
			ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + ", Счет В Иерархии (&Счет)";
			// АПК:1297-вкл Текст запроса.
			// Сразу параметр.
			Запрос.УстановитьПараметр("Счет", СчетДляОтбора);
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + ") КАК ХозрасчетныйОбороты";
	
	ИмяОбъектаСоСвойствами = СтрЗаменить(ИмяРазворота.ИмяПредопределенныхДанных, "_", ".");
	ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ [ИмяОбъектаСоСвойствами].ДополнительныеРеквизиты КАК ЗначенияСвойствОбъектов
	|		ПО ХозрасчетныйОбороты." + Измерение + " = ЗначенияСвойствОбъектов.Ссылка
	|			И (ЗначенияСвойствОбъектов.Свойство = &СсылкаПВХ)";
	ТекстПодвалаЗапроса = СтрЗаменить(ТекстПодвалаЗапроса, "[ИмяОбъектаСоСвойствами]", ИмяОбъектаСоСвойствами);
	
	ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + ТекстПодвалаЗапросаДоп;
				
	Запрос.УстановитьПараметр("СсылкаПВХ", ИмяРазворота.СсылкаПВХ);
	
	ТекстЗапроса = ТекстВыборкиПолейЗапроса + Символы.ПС + "ПОМЕСТИТЬ Обороты" + Символы.ПС + ТекстПодвалаЗапроса + Символы.ПС + ТекстУсловияЗапроса;
	
	// Укажем реальный регистр бухгалтерии.
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Хозрасчетный", СтруктураПараметров.ИмяРегистраБухгалтерии);
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Получает остатки для поля по отбору.
// 
&НаСервереБезКонтекста
Процедура РезультатОстатковПоОтборуДопРеквизиты(Запрос, Знач ИмяРазворота, Расшифровка, СтруктураПараметров, ПсевдонимРазворота, РазвернутоеСальдо = Ложь)
	
	ТекстВыборкиПолейЗапроса 	= "";
	ТекстУсловияЗапроса 		= "";
	ТекстПодвалаЗапроса			= "";
	
	Отбор 						= Расшифровка.Отбор; 
	
	ИмяРазворота_ 				= ИмяРазворота;
	Периодичность 				= ""; 
	Периодичность				= ПолучитьПериодичностьОтбора(Отбор);
	
	СписокПоказателей			= СтруктураПараметров.СписокПоказателей;
	ОтборПоИзмерениям			= СтруктураПараметров.ТаблицаОтбора;
	ИмяРегистраБухгалтерии 		= СтруктураПараметров.ИмяРегистраБухгалтерии;
	РазвернутыйСуффикс 			= ?(РазвернутоеСальдо, "Развернутый", "");	
	Измерение					= ИмяРазворота.Измерение;
	
	// Нужно определить счет-родитель разворота.
	Счет = Расшифровка.Отбор.Счет;
    	
	НачДт = "Начальный" + РазвернутыйСуффикс + "ОстатокДт";
	КонДт = "Конечный" 	+ РазвернутыйСуффикс + "ОстатокДт";
	НачКт = "Начальный" + РазвернутыйСуффикс + "ОстатокКт";
	КонКт = "Конечный" 	+ РазвернутыйСуффикс + "ОстатокКт";
	
	// Разворот по периодам может быть разный, в зависимости от периодичности разворота.
	// Необходимо выделить периодичность из наименования разворота.
	Если ЕстьПериодВИмени(ИмяРазворота)  Тогда
		
		Периодичность	= СтрЗаменить(ИмяРазворота, "Период", "");
		ИмяРазворота_ 	= "Период";
		
	КонецЕсли;
	
	// Если выполняется разворот по регистратору, то периодичность разворота также
	// должна быть "по позиции регистратора". 
	Если ИмяРазворота = "Регистратор" Тогда
		Периодичность = ИмяРазворота;
	КонецЕсли;
	
	ЭтоИзмерениеРегистраКор = Ложь;
	ЭтоИзмерениеРегистра = ЭтоИзмерениеРегистра(ИмяРегистраБухгалтерии, ИмяРазворота.Измерение, ЭтоИзмерениеРегистраКор);
	
	Если (ИмяРазворота_ <> "Счет" И Лев(Измерение, 8) <> "Субконто"
	   И НЕ ЭтоИзмерениеРегистра)
	   ИЛИ ОтборИсключаетОстатки(Отбор, ИмяРегистраБухгалтерии)
	   ИЛИ (ЭтоИзмерениеРегистра И ЭтоИзмерениеРегистраКор) Тогда
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	NULL КАК Счет, NULL КАК " + ПсевдонимРазворота;
		
		Для Каждого ТекПоказатель Из СписокПоказателей Цикл
			
			Запрос.Текст = Запрос.Текст + ",
			|	0 КАК " + ТекПоказатель.Значение + "НачальныйОстатокДт,
			|	0 КАК " + ТекПоказатель.Значение + "НачальныйОстатокКт,
			|	0 КАК " + ТекПоказатель.Значение + "КонечныйОстатокДт,
			|	0 КАК " + ТекПоказатель.Значение + "КонечныйОстатокКт";
			
		КонецЦикла;
		
		Запрос.Текст = Запрос.Текст + "
		|ПОМЕСТИТЬ Остатки
		|ГДЕ
		|	ИСТИНА = ЛОЖЬ";
					
		Запрос.Выполнить();
		
		Возврат;
		
	КонецЕсли;
	
	// Заполним текст выбора полей запроса.
	ТекстВыборкиПолейЗапроса = ТекстВыборкиПолейЗапроса + "ВЫБРАТЬ РАЗРЕШЕННЫЕ ЗначенияСвойствОбъектов.Значение КАК " + ПсевдонимРазворота;
	
	Для Каждого ТекПоказатель Из СписокПоказателей Цикл
		
		ТекстВыборкиПолейЗапроса = ТекстВыборкиПолейЗапроса + ",
		|ХозрасчетныйОстаткиИОбороты." + ТекПоказатель.Значение + НачДт + " КАК " + ТекПоказатель.Значение + "НачальныйОстатокДт,
		|ХозрасчетныйОстаткиИОбороты." + ТекПоказатель.Значение + НачКт + " КАК " + ТекПоказатель.Значение + "НачальныйОстатокКт,
		|ХозрасчетныйОстаткиИОбороты." + ТекПоказатель.Значение + КонДт + " КАК " + ТекПоказатель.Значение + "КонечныйОстатокДт,
		|ХозрасчетныйОстаткиИОбороты." + ТекПоказатель.Значение + КонКт + " КАК " + ТекПоказатель.Значение + "КонечныйОстатокКт";
		
	КонецЦикла;
	
	// Заполним текст условий запроса.
	СчетчикУсловий 	= 0;
	СчетчикДопов	= 0;
	
	// Если будет в отборе допреквизит - все меняется в корне.
	ВОтбореДопРеквизит 		= Ложь;
	УсловиеДляПодвалаДопов 	= "";
	
	ТекстУсловияЗапроса = ТекстУсловияЗапроса + " ГДЕ ";
	ТекстПодвалаЗапросаДоп = "";
	
	Если Отбор.Количество() > 1 Тогда // Счет всегда присутствует в отборах и указываем его в параметрах вирт. таблицы.
		
		Для Каждого СтрокаОтбора Из Отбор Цикл
			
			СчетчикУсловий = СчетчикУсловий + 1;
			
			Если СтрокаОтбора.Ключ = "Счет" Тогда
				Продолжить;
			КонецЕсли;
			
			// ДОПРЕКВИЗИТЫ
			Если Найти(СтрокаОтбора.Ключ, "ПоДопРеквизитам") <> 0 Тогда
				
				СчетчикДопов = СчетчикДопов + 1;
				
				ЕстьУсловияОтбора = Истина;
				
				Если СтрокаОтбора.Значение.Значение = NULL Тогда
					
					ТекстУсловияЗапроса = ТекстУсловияЗапроса +
					" ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Значение Есть NULL";
					
				Иначе	
					
					ТекстУсловияЗапроса = ТекстУсловияЗапроса +
					" ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Значение = &ПараметрУсловие" + Строка(СчетчикУсловий);
					
					// Сразу параметр.
					Запрос.УстановитьПараметр("ПараметрУсловие" + Строка(СчетчикУсловий), СтрокаОтбора.Значение.Значение);
					
				КонецЕсли;
							
				Если СчетчикУсловий <> Отбор.Количество() Тогда
					ТекстУсловияЗапроса = ТекстУсловияЗапроса + " И ";
				КонецЕсли;
				
				ИмяОбъектаСоСвойствами = СтрЗаменить(СтрокаОтбора.Значение.ИмяПредопределенныхДанных, "_", ".");
	
				ТекстПодвалаЗапросаДоп = ТекстПодвалаЗапросаДоп + "
				|		ЛЕВОЕ СОЕДИНЕНИЕ [ИмяОбъектаСоСвойствами].ДополнительныеРеквизиты КАК ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + " 
				|		ПО (ХозрасчетныйОстаткиИОбороты." + СтрокаОтбора.Значение.Измерение + " = ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Ссылка
				|			И ЗначенияСвойствОбъектов" + Строка(СчетчикДопов) + ".Свойство = &СсылкаПВХ" + Строка(СчетчикУсловий) + ")";
				ТекстПодвалаЗапросаДоп = СтрЗаменить(ТекстПодвалаЗапросаДоп, "[ИмяОбъектаСоСвойствами]", ИмяОбъектаСоСвойствами);
				
				// Сразу параметр.
				Запрос.УстановитьПараметр("СсылкаПВХ" + Строка(СчетчикУсловий), СтрокаОтбора.Значение.СсылкаПВХ);
				
				ВОтбореДопРеквизит = Истина;
				
			Иначе
				
				ВремИмяРазворотаДляОтбора = ПолучитьИмяРазворотаДляОтбора(СтрокаОтбора.Ключ);
				ТекстУсловияЗапроса = ТекстУсловияЗапроса +
				" ХозрасчетныйОстаткиИОбороты." + ВремИмяРазворотаДляОтбора + " = &ПараметрУсловие" + Строка(СчетчикУсловий);
				
				// Сразу параметр.
				Запрос.УстановитьПараметр("ПараметрУсловие" + Строка(СчетчикУсловий), СтрокаОтбора.Значение);
				
				Если СчетчикУсловий <> Отбор.Количество() Тогда
					ТекстУсловияЗапроса = ТекстУсловияЗапроса + " И ";
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЦикла;
					
	КонецЕсли;
	
	Если Отбор.Количество() > 1 Тогда
		ТекстУсловияЗапроса = ТекстУсловияЗапроса + " И ";
	КонецЕсли;
	
	ТекстУсловияЗапроса = ТекстУсловияЗапроса + "Истина ";
	
	ТекстВиртПараметры = "";
	
	Если СтруктураПараметров.МассивОрганизаций.Количество() > 0 Тогда
		ТекстВиртПараметры = ТекстВиртПараметры + "Организация В(&СписокОрганизаций) И ";
		// Сразу параметр.
		Запрос.УстановитьПараметр("СписокОрганизаций", СтруктураПараметров.МассивОрганизаций);
	КонецЕсли;
	
	// Если есть доппараметры - установим их.
	СтрокаДопПараметры = "";
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Использование", истина);
	
	МассивОтборов = ОтборПоИзмерениям.НайтиСтроки(СтруктураОтбора);
	
	Для Каждого ДопПараметр Из МассивОтборов Цикл
		// Сформируем условие по доппараметрам.
		
		СчетчикУсловий = СчетчикУсловий + 1;
		СтрокаДопПараметры = СтрокаДопПараметры + " И " + ДопПараметр.Измерение + " = &ПараметрУсловие" + Строка(СчетчикУсловий);
		
		Запрос.УстановитьПараметр("ПараметрУсловие" + Строка(СчетчикУсловий), ДопПараметр.Значение);
	КонецЦикла;
	
	Если СтрокаДопПараметры <> "" Тогда
		ТекстВиртПараметры = ТекстВиртПараметры + " Истина " + СтрокаДопПараметры;
	Иначе
		ТекстВиртПараметры = ТекстВиртПараметры + "Истина";
	КонецЕсли;	
			
	КонецПериодаНужен = СтруктураПараметров.ОкончаниеПериода <> Дата("00010101000000");
	
	// Заполним подвал запроса.
	ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + "ИЗ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНач, " + ?(КонецПериодаНужен, "&ДатаКон, ", ", ") + Периодичность;

	ГраницаКонецДня = Новый Граница(КонецДня(СтруктураПараметров.ОкончаниеПериода), ВидГраницы.Включая);
	
	ДатаНачПсевдо = СтруктураПараметров.НачалоПериода;
	ДатаКонПсевдо = ГраницаКонецДня;
	
	ЗаполнитьПсевдоПериод(Отбор, ДатаНачПсевдо, ДатаКонПсевдо);
	
	// Сразу параметр.
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачПсевдо);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКонПсевдо);
	
	СчетДляОтбора = Неопределено;
	
	Если Отбор.Свойство("Счет", СчетДляОтбора) Тогда
		Если СчетДляОтбора <> Неопределено Тогда
			// АПК:1297-выкл Текст запроса.
			ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + ",, Счет В Иерархии (&Счет)";
			// АПК:1297-вкл Текст запроса.
			// Сразу - параметр
			Запрос.УстановитьПараметр("Счет", СчетДляОтбора);
		КонецЕсли;
	КонецЕсли;
	
	ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + ", ," + ТекстВиртПараметры + ") КАК ХозрасчетныйОстаткиИОбороты";
		
	ИмяОбъектаСоСвойствами = СтрЗаменить(ИмяРазворота.ИмяПредопределенныхДанных, "_", ".");
	ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ [ИмяОбъектаСоСвойствами].ДополнительныеРеквизиты КАК ЗначенияСвойствОбъектов
	|		ПО ХозрасчетныйОстаткиИОбороты." + Измерение + " = ЗначенияСвойствОбъектов.Ссылка
	|			И (ЗначенияСвойствОбъектов.Свойство = &СсылкаПВХ)";
	ТекстПодвалаЗапроса = СтрЗаменить(ТекстПодвалаЗапроса, "[ИмяОбъектаСоСвойствами]", ИмяОбъектаСоСвойствами);
	
	ТекстПодвалаЗапроса = ТекстПодвалаЗапроса + ТекстПодвалаЗапросаДоп;
			
	Запрос.УстановитьПараметр("СсылкаПВХ", ИмяРазворота.СсылкаПВХ);
	
	// Поместить остатки.
	ТекстЗапроса = ТекстВыборкиПолейЗапроса + Символы.ПС + "ПОМЕСТИТЬ Остатки" + Символы.ПС + ТекстПодвалаЗапроса + Символы.ПС + ТекстУсловияЗапроса;
	
	// Укажем реальный регистр бухгалтерии.
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Хозрасчетный", ИмяРегистраБухгалтерии);
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Открывает форму параметров сортировки и сортирует таблицу, в соответствии с
// выбранными параметрами.
// 
&НаКлиенте
Процедура СортироватьТаблицу(АдресВХранилище, Расшифровка, ИмяРазворота, МножественныйРазворот)
	
	ПараметрыФормы 	= Новый Структура("ТаблицаСортировки", АдресВХранилище);
		
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Расшифровка", Расшифровка);
	ДополнительныеПараметры.Вставить("ИмяРазворота", ИмяРазворота);
	ДополнительныеПараметры.Вставить("МножественныйРазворот", МножественныйРазворот);
	Оповещение = Новый ОписаниеОповещения("СортировкаТаблицыЗавершение", ЭтотОбъект, ДополнительныеПараметры); 
	
	ОткрытьФорму("Отчет.бит_осв_ИнтерактивнаяОборотноСальдоваяВедомость.Форма.ФормаСортировки"
					, ПараметрыФормы, ЭтотОбъект, , , ,Оповещение , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
						 
КонецПроцедуры

// Обработчик оповещения завершения сортировки таблицы.
// 
&НаКлиенте 
Процедура СортировкаТаблицыЗавершение(АдресОтсортированнойТаблицы, ДополнительныеДанные) Экспорт

	Если ЭтоАдресВременногоХранилища(АдресОтсортированнойТаблицы) Тогда
		
		АдресВХранилище = ПерепаковатьТаблицу(АдресОтсортированнойТаблицы);
		ОбработатьВыбраннуюРасшифровку(ДополнительныеДанные.Расшифровка, ДополнительныеДанные.ИмяРазворота, 
			ДополнительныеДанные.МножественныйРазворот, АдресВХранилище);  
		
	КонецЕсли; 				
	
КонецПроцедуры	// СортировкаТаблицыЗавершение

// Функция повторно упаковывает таблицу во временное хранилище. 
// Необходимо для предотвращения "исчезания" таблицы из временного хранилища.
// 
// Параметры:
//  АдресОтсортированнойТаблицы - Строка.
// 
// Возвращаемое значение:
//  АдресВХранилище - Строка.
// 
&НаСервере
Функция ПерепаковатьТаблицу(АдресОтсортированнойТаблицы)
	
	ТаблицаСортировки = ПолучитьИзВременногоХранилища(АдресОтсортированнойТаблицы);
	АдресВХранилище = ПоместитьВоВременноеХранилище(ТаблицаСортировки, УникальныйИдентификатор);
	
	Возврат АдресВХранилище;
	
КонецФункции // ПерепаковатьТаблицу()

// Формирует таблицу проводок для документа, чьи проводки пользователь хочет увидеть.
// 
&НаСервере
Функция ДанныеПоПроводкам(Расшифровка, ИмяРазворота)
	
	ПодготовитьСтруктуруПараметровФормированияОтчетаНаСервере();
	СтруктураПараметров = ПолучитьИзВременногоХранилища(АдресСтруктурыПараметров);
	ИмяРегистра			= СтруктураПараметров.ИмяРегистраБухгалтерии;
	
	Документ = Расшифровка.Регистратор;
	
	ТекстПоПоказателям 	= "";
	ТекстПоСубконто		= "";
	КоличествоСубконто 	= Метаданные.РегистрыБухгалтерии[ИмяРегистра].ПланСчетов.МаксКоличествоСубконто;
	
	Для Жи = 1 По КоличествоСубконто Цикл
		
		ТекстПоСубконто = ТекстПоСубконто + ",
		|" + ИмяРегистра + "ДвиженияССубконто.СубконтоДт" + Строка(Жи) + " КАК СубконтоДт" + Строка(Жи);
		ТекстПоСубконто = ТекстПоСубконто + ",
		|" + ИмяРегистра + "ДвиженияССубконто.СубконтоКт" + Строка(Жи) + " КАК СубконтоКт" + Строка(Жи);
		
	КонецЦикла;
	
	Для Каждого Показатель Из СтруктураПараметров.СписокПоказателей Цикл
		
		Если БалансовыйПоказатель(Показатель, ИмяРегистра) Тогда
			ТекстПоПоказателям = ТекстПоПоказателям + ",
			|" + ИмяРегистра + "ДвиженияССубконто." + Показатель.Значение + " КАК " + Показатель.Значение + "ОборотДт";
		Иначе
			ТекстПоПоказателям = ТекстПоПоказателям + ",
			|" + ИмяРегистра + "ДвиженияССубконто." + Показатель.Значение + "Дт КАК " + Показатель.Значение + "ОборотДт";
			ТекстПоПоказателям = ТекстПоПоказателям + ",
			|" + ИмяРегистра + "ДвиженияССубконто." + Показатель.Значение + "Кт КАК " + Показатель.Значение + "ОборотКт";
		КонецЕсли;
		
	КонецЦикла;
	
	// Получим таблицу движений по заданному регистру.
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозрасчетныйДвиженияССубконто.СчетДт,
	|	ХозрасчетныйДвиженияССубконто.СчетКт,
	|	ХозрасчетныйДвиженияССубконто.Содержание,
	|	1 КАК Уровень_ " + ТекстПоПоказателям + ТекстПоСубконто + "
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(, , Регистратор = &Регистратор) КАК ХозрасчетныйДвиженияССубконто");
	
	Запрос.УстановитьПараметр("Регистратор", Документ);
	
	Запрос.Текст 	= СтрЗаменить(Запрос.Текст, "Хозрасчетный", ИмяРегистра);
	Результат 		= Запрос.Выполнить().Выгрузить();
	
	Результат.Колонки.Добавить("ПоПроводкам");
	
	Для Каждого Проводка Из Результат Цикл
		Проводка.ПоПроводкам = "Дт " + Проводка.СчетДт + " Кт " + Проводка.СчетКт + Символы.ПС + СокрЛП(Проводка.Содержание);
	КонецЦикла;
	
	РезультатПоПроводкам = Новый ТаблицаЗначений;
	РезультатПоПроводкам.Колонки.Добавить("ПоПроводкам");
	РезультатПоПроводкам.Колонки.Добавить("Содержание");
	РезультатПоПроводкам.Колонки.Добавить("СчетДт");
	РезультатПоПроводкам.Колонки.Добавить("СубконтоДт");
	РезультатПоПроводкам.Колонки.Добавить("ПоказателиДт");
	РезультатПоПроводкам.Колонки.Добавить("СчетКт");
	РезультатПоПроводкам.Колонки.Добавить("СубконтоКт");
	РезультатПоПроводкам.Колонки.Добавить("ПоказателиКт");
	
	Для Каждого Элемент Из Результат Цикл
		
		// Выведем счета и субконто.
		НовРезультатПоПроводкам = РезультатПоПроводкам.Добавить();
		НовРезультатПоПроводкам.СчетДт = Элемент.СчетДт;
		НовРезультатПоПроводкам.СчетКт = Элемент.СчетКт;
		
		СубконтоДт = "";
		СубконтоКт = "";
		
		Для Жи = 1 По КоличествоСубконто Цикл
			СубконтоДт = СубконтоДт + Строка(Элемент["СубконтоДт" + Строка(Жи)]) + "
			|";
			СубконтоКт = СубконтоКт + Строка(Элемент["СубконтоКт" + Строка(Жи)]) + "
			|";
		КонецЦикла;
		
		ПоказателиДт = "";
		ПоказателиКт = "";
		
		Для Каждого Показатель Из СтруктураПараметров.СписокПоказателей Цикл
			
			Если БалансовыйПоказатель(Показатель, ИмяРегистра) Тогда
				ЗначениеКт = Элемент[Показатель.Значение + "ОборотДт"];
				ПоказателиДт = ПоказателиДт + "" + "
				|";
				ПоказателиКт = ПоказателиКт + Строка(?(ЗначениеКт = 0, "", ЗначениеКт)) + "
				|";
            Иначе
				ЗначениеДт = Элемент[Показатель.Значение + "ОборотДт"];
				ЗначениеКт = Элемент[Показатель.Значение + "ОборотКт"];
				ПоказателиДт = ПоказателиДт + Строка(?(ЗначениеДт = 0, "", ЗначениеДт)) + "
				|";
				ПоказателиКт = ПоказателиКт + Строка(?(ЗначениеКт = 0, "", ЗначениеКт)) + "
				|";
			КонецЕсли;
			
		КонецЦикла;
		
		НовРезультатПоПроводкам.СубконтоДт 		= СубконтоДт;
		НовРезультатПоПроводкам.СубконтоКт 		= СубконтоКт;
		НовРезультатПоПроводкам.ПоказателиДт 	= ПоказателиДт;
		НовРезультатПоПроводкам.ПоказателиКт 	= ПоказателиКт;
		НовРезультатПоПроводкам.Содержание = Элемент.Содержание;
		
	КонецЦикла;
	
	Возврат РезультатПоПроводкам;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииОсновные

// Обработка расшифровки поля табличного документа "ДокументРезультат".
// 
&НаКлиенте
Процедура ДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) <> Тип("Структура") Тогда
		ПоказатьЗначение( , Расшифровка);
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка 	= Ложь;
	МножественныйРазворот	= Ложь;
	   
	// НУНВ...
	СписокРазворотов = ВозможныеРазворотыРасшифровки(Отчет.РегистрБухгалтерии, Расшифровка, МножественныйРазворот);	
	Если СписокРазворотов = Неопределено Тогда
		ИмяРазворота = Неопределено;
	Иначе
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Расшифровка"			 , Расшифровка);
		ДопПараметры.Вставить("МножественныйРазворот", МножественныйРазворот);
		ОбработчикВСР1 = Новый ОписаниеОповещения("ОбработкаВыбораИзМеню1", ЭтотОбъект, ДопПараметры);
		ПоказатьВыборИзМеню(ОбработчикВСР1, СписокРазворотов);	
	КонецЕсли;  
	// ...НУНВ
					
КонецПроцедуры // ДокументРезультатОбработкаРасшифровки()

// Процедура - завершение выбора из меню расшифровки 1.
// 
&НаКлиенте
Процедура ОбработкаВыбораИзМеню1(ЗапросРасшифровки, ДопПараметры) Экспорт
	
	АдресВХранилище		  = Неопределено;
	Расшифровка 		  = ДопПараметры.Расшифровка;
	МножественныйРазворот = ДопПараметры.МножественныйРазворот;
		
	Если ЗапросРасшифровки = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	ИмяРазворота = ЗапросРасшифровки.Значение;	
	Если ИмяРазворота = "МножественныйРазворот" Тогда
		
		МножественныйРазворот = Истина;
		
		// НУНВ...
		СписокРазворотов = ВозможныеРазворотыРасшифровки(Отчет.РегистрБухгалтерии, Расшифровка, МножественныйРазворот);	
		Если СписокРазворотов = Неопределено Тогда
			ИмяРазворота = Неопределено;
		Иначе
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Расшифровка"			 , Расшифровка);
			ДопПараметры.Вставить("МножественныйРазворот", МножественныйРазворот);
			ОбработчикВСР2 = Новый ОписаниеОповещения("ОбработкаВыбораИзМеню2", ЭтотОбъект, ДопПараметры);
			ПоказатьВыборИзМеню(ОбработчикВСР2, СписокРазворотов);	
		КонецЕсли;  

		// ...НУНВ
				
	Иначе
		
		ЗавершениеОбработкиРасшифровки(Расшифровка, ИмяРазворота, МножественныйРазворот, АдресВХранилище);
		
	КонецЕсли;
	 	
КонецПроцедуры // ОбработкаВыбораИзМеню1()

// Процедура - завершение выбора из меню расшифровки 2.
// 
&НаКлиенте
Процедура ОбработкаВыбораИзМеню2(ЗапросРасшифровки, ДопПараметры) Экспорт
	
	АдресВХранилище	= Неопределено;
	Расшифровка 		  = ДопПараметры.Расшифровка;
	МножественныйРазворот = ДопПараметры.МножественныйРазворот;
	
	Если ЗапросРасшифровки = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ИмяРазворота = ЗапросРасшифровки.Значение;
	
	ЗавершениеОбработкиРасшифровки(Расшифровка, ИмяРазворота, МножественныйРазворот, АдресВХранилище);
		
КонецПроцедуры // ОбработкаВыбораИзМеню2()

&НаКлиенте
Процедура ЗавершениеОбработкиРасшифровки(Расшифровка, ИмяРазворота, МножественныйРазворот, АдресВХранилище) 
	
	Если ИмяРазворота = "ПоРеквизитам" Тогда
		
		ПараметрыФормы = Новый Структура("ОснованиеРазворотов", ОснованияРазворотовПоРеквизитам); 		
		ДопПараметры = Новый Структура();
		ДопПараметры.Вставить("Расшифровка"			 , Расшифровка);
		ДопПараметры.Вставить("МножественныйРазворот", МножественныйРазворот); 		
		ОбработчикИР = Новый ОписаниеОповещения("ОбработчикПолученияИмяРеквизитаЗавершение", ЭтотОбъект, ДопПараметры);		
		ОткрытьФорму("Отчет.бит_осв_ИнтерактивнаяОборотноСальдоваяВедомость.Форма.ФормаВыбораРеквизита"
					, ПараметрыФормы, ЭтотОбъект, , , , ОбработчикИР, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		
		Если ИмяРазворота = "ОткрытьЭлемент" Тогда
			ОткрытьРасшифровку(Расшифровка);
			Возврат;
		КонецЕсли;
		
		Если ИмяРазворота = "Сортировка" Тогда 			
			// Подготовим таблицу для сортировки.
			АдресВХранилище = ПодготовитьТаблицуДляСортировки(Расшифровка);
			// Откроем диалоговое окно сортировки.
			СортироватьТаблицу(АдресВХранилище, Расшифровка, ИмяРазворота, МножественныйРазворот);
			
		Иначе
			
			ОбработатьВыбраннуюРасшифровку(Расшифровка, ИмяРазворота, МножественныйРазворот, АдресВХранилище);
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры // ЗавершениеОбработкиРасшифровки()

&НаКлиенте
Процедура ОбработчикПолученияИмяРеквизитаЗавершение(ИмяРазворота, ДопПараметры) Экспорт
	
	Если ИмяРазворота = "ОткрытьЭлемент" Тогда
		ОткрытьРасшифровку(ДопПараметры.Расшифровка);
		Возврат;
	КонецЕсли;
	
	АдресВХранилище	= Неопределено;
	
	Если ИмяРазворота = "Сортировка" Тогда 		
		// Подготовим таблицу для сортировки.
		АдресВХранилище = ПодготовитьТаблицуДляСортировки(ДопПараметры.Расшифровка);
		// Откроем диалоговое окно сортировки.
		СортироватьТаблицу(АдресВХранилище, ДопПараметры.Расшифровка, ИмяРазворота, ДопПараметры.МножественныйРазворот);
	Иначе	
		
		ОбработатьВыбраннуюРасшифровку(ДопПараметры.Расшифровка, ИмяРазворота, ДопПараметры.МножественныйРазворот, АдресВХранилище);  
		
	КонецЕсли;    
	
КонецПроцедуры // ОбработчикПолученияИмяРеквизитаЗавершение()

// Формирует отчет "Оборотно-сальдовая ведомость" и выводит результат в "ДокументРезультат".
// 
&НаСервере
Процедура СформироватьОборотноСальдовуюВедомостьНаСервере(ДокументРезультат, 
	ПоказыватьЗаголовок = Истина, ВысотаЗаголовка = 0, Знач ПоЗабалансовымСчетам = Ложь)
														  
	СтруктураПараметров    = ПолучитьИзВременногоХранилища(АдресСтруктурыПараметров);
	СтруктураПараметровОСВ = ПараметрыВыводаОСВ(СтруктураПараметров, 
								СтруктураПараметров.ОтчетОбъектМакет, СтруктураПараметров.ПоЗабалансовымСчетам);
	
	Если АдресГлобальногоПредставления = Неопределено Тогда
		// Необходимо подготовить глобальное представление ОСВ (начальное).
		ПодготовитьГлобальноеПредставлениеОСВ(СтруктураПараметров, СтруктураПараметровОСВ);
	Иначе
		
		// Скопируем глобальное представление отчета.
		КопияГлобальногоПредставления = ПолучитьИзВременногоХранилища(АдресГлобальногоПредставления).Скопировать();
		// Необходимо сформировать новое глобальное представление в соответствии с имеющимися расшифровками.
		ПодготовитьГлобальноеПредставлениеОСВ(СтруктураПараметров, СтруктураПараметровОСВ);
		// В цикле пройдем по копии глобального представления, и, находя расшифровки, выведем их в
		// новом глобальном представлении.
		ПривестиГлобальноеПредставлениеКСтруктуреКопии(ПолучитьИзВременногоХранилища(АдресГлобальногоПредставления), КопияГлобальногоПредставления);
				
	КонецЕсли;
	
	// Сформируем отчет по глобальному представлению.
	СформироватьОСВПоГлобальномуПредставлениюНаСервере(ДокументРезультат, СтруктураПараметров, СтруктураПараметровОСВ,,);
			
КонецПроцедуры

// Инициализация структуры глобального представления ОСВ.
// 
&НаСервере
Процедура ИнициализацияГлобальногоПредставления(мГлобальнаяТаблицаОСВ, СписокПоказателей)
	
	Если мГлобальнаяТаблицаОСВ <> Неопределено И мГлобальнаяТаблицаОСВ.Колонки.Количество() > 0 Тогда
		мГлобальнаяТаблицаОСВ.Очистить();
	Иначе
		
		мГлобальнаяТаблицаОСВ = Новый ТаблицаЗначений;
		
		мГлобальнаяТаблицаОСВ.Колонки.Добавить("Валюта");
		мГлобальнаяТаблицаОСВ.Колонки.Добавить("ВалютаПредставление");
		Для Каждого ТекПоказатель Из СписокПоказателей Цикл
			мГлобальнаяТаблицаОСВ.Колонки.Добавить(ТекПоказатель.Значение + "КонечныйОстатокДт");
			мГлобальнаяТаблицаОСВ.Колонки.Добавить(ТекПоказатель.Значение + "КонечныйОстатокКт");
			мГлобальнаяТаблицаОСВ.Колонки.Добавить(ТекПоказатель.Значение + "НачальныйОстатокДт");
			мГлобальнаяТаблицаОСВ.Колонки.Добавить(ТекПоказатель.Значение + "НачальныйОстатокКт");
			мГлобальнаяТаблицаОСВ.Колонки.Добавить(ТекПоказатель.Значение + "КонечныйРазвернутыйОстатокДт");
			мГлобальнаяТаблицаОСВ.Колонки.Добавить(ТекПоказатель.Значение + "КонечныйРазвернутыйОстатокКт");
			мГлобальнаяТаблицаОСВ.Колонки.Добавить(ТекПоказатель.Значение + "НачальныйРазвернутыйОстатокДт");
			мГлобальнаяТаблицаОСВ.Колонки.Добавить(ТекПоказатель.Значение + "НачальныйРазвернутыйОстатокКт");
			мГлобальнаяТаблицаОСВ.Колонки.Добавить(ТекПоказатель.Значение + "ОборотДт");
			мГлобальнаяТаблицаОСВ.Колонки.Добавить(ТекПоказатель.Значение + "ОборотКт");
		КонецЦикла;
		мГлобальнаяТаблицаОСВ.Колонки.Добавить("Счет");
		мГлобальнаяТаблицаОСВ.Колонки.Добавить("СчетЗабалансовый");
		мГлобальнаяТаблицаОСВ.Колонки.Добавить("СчетКод");
		мГлобальнаяТаблицаОСВ.Колонки.Добавить("СчетНаименование");
		мГлобальнаяТаблицаОСВ.Колонки.Добавить("СчетПредставление");
		мГлобальнаяТаблицаОСВ.Колонки.Добавить("ИмяМакета");
		мГлобальнаяТаблицаОСВ.Колонки.Добавить("Уровень");
		мГлобальнаяТаблицаОСВ.Колонки.Добавить("Расшифровка");
		мГлобальнаяТаблицаОСВ.Колонки.Добавить("Отбор");
		мГлобальнаяТаблицаОСВ.Колонки.Добавить("ПоСубсчетам"		, Новый ОписаниеТипов("Булево"));
		мГлобальнаяТаблицаОСВ.Колонки.Добавить("РазвернутоеСальдо"	, Новый ОписаниеТипов("Булево"));
		мГлобальнаяТаблицаОСВ.Колонки.Добавить("Иерархия"		    , Новый ОписаниеТипов("Булево"));
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет стартовое формирование глобального представления ОСВ.
// 
&НаСервере
Процедура ПодготовитьГлобальноеПредставлениеОСВ(СтруктураПараметров, СтруктураПараметровОСВ)
	
	ТаблицаОСВ 	= Неопределено;
	ТаблицаОСВ 	= Новый ТаблицаЗначений;
	Запрос 		= СформироватьЗапрос(СтруктураПараметров, СтруктураПараметровОСВ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Счет");
	
	Пока Выборка.Следующий() Цикл
		
		Уровень 	= Выборка.Уровень();
		Расшифровка = ДобавитьВГлобальноеПредставление(ТаблицаОСВ, Выборка, СтруктураПараметров.СписокПоказателей, "Счет");
		
	КонецЦикла;	
	
	Если АдресГлобальногоПредставления <> Неопределено Тогда
		УдалитьИзВременногоХранилища(АдресГлобальногоПредставления);
	КонецЕсли;
	
	АдресГлобальногоПредставления = ПоместитьВоВременноеХранилище(ТаблицаОСВ, УникальныйИдентификатор);
	
КонецПроцедуры

// Формирует отчет "Оборотно-сальдовая ведомость" и выводит результат в "ДокументРезультат".
// 
&НаСервере
Процедура СформироватьОСВПоГлобальномуПредставлениюНаСервере(ДокументРезультат
														  , СтруктураПараметров
														  , СтруктураПараметровОСВ
														  , ПоказыватьЗаголовок = Истина
														  , ВысотаЗаголовка = 0)
	
	ДокументРезультат.Очистить(); 
	
	ГлобальнаяТаблицаОСВ = ПолучитьИзВременногоХранилища(АдресГлобальногоПредставления);
	
	СформироватьИВывестиЗаголовокОтчета(СтруктураПараметров, ДокументРезультат, ВысотаЗаголовка, ПоказыватьЗаголовок);
	
	Макет = СтруктураПараметров.ОтчетОбъектМакет;
		
	ЗаголовокОтчета = Макет.ПолучитьОбласть("ЗаголовокОтчета");
	
	ДокументРезультат.Вывести(ЗаголовокОтчета, 1);
	
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	
	// Используемые области макета.
	ОбластьСтрокаСчет           	= Макет.ПолучитьОбласть("Строка|Счет");
	ОбластьСтрокаСчетРазвернутый  	= Макет.ПолучитьОбласть("СтрокаРазвернутый|Счет");
	ОбластьСтрокаПоказателяСчет 	= Макет.ПолучитьОбласть("СтрокаПоказателя|Счет");

    СтруктураОбщийИтог = Новый Структура;
	ИнициализироватьСтруктуруХраненияИтоговОборотка(СтруктураПараметров.СписокПоказателей, СтруктураОбщийИтог);
		
	СоотвПодчСчета 				= Новый Соответствие;
	ТаблицаРазворотаСчетов 		= Новый ТаблицаЗначений;
	ТаблицаРазвернутогоСальдо   = Новый ТаблицаЗначений;
	
	ПравилаВыводаИтогов 		= Новый Массив;
	
	КопияГлавногоПредставления 	= ГлобальнаяТаблицаОСВ.Скопировать();
	
	РезультатЗапроса = ГлобальнаяТаблицаОСВ;

	КопияРезультата = РезультатЗапроса.Скопировать();
 	КопияРезультата.Очистить();
	СтруктураКолонок = КопияРезультата.Колонки;
	
	Для Каждого Выборка Из РезультатЗапроса Цикл
		
		Уровень = Выборка.Уровень;
		
		Если (НЕ СтруктураПараметров.ПоСубсчетамИСубконто И НЕ Выборка.ПоСубсчетам) И Уровень > 0 Тогда						
			Продолжить;			
		КонецЕсли;
		
		ВыборкаСтруктура = СтокаТЧВСтруктуруНаСервере(Выборка, КопияРезультата.Колонки, РезультатЗапроса.Индекс(Выборка));
		
		ОбластьСтрокаСчет.Параметры.Заполнить(Выборка);
		
		// Заполнение параметров расшифровки.
		ЗаполнитьПараметрыРасшифровкиОборотноСальдовойВедомости(ОбластьСтрокаСчет, Выборка, ВыборкаСтруктура);
		
		// Выводим текущую строку отчета.
		ДокументРезультат.Вывести(ОбластьСтрокаСчет, Уровень, "Счет");
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Уровень"					, Уровень);
		ДополнительныеПараметры.Вставить("СтруктураКолонок"			, СтруктураКолонок);
		ДополнительныеПараметры.Вставить("ВыводитьРазвернутоеСальдо", Ложь);
		ДополнительныеПараметры.Вставить("ВключитьВИтог"			, НЕ (Отчет.ВключатьРазвернутоеСальдоВИтоги И Выборка.РазвернутоеСальдо));
		ДополнительныеПараметры.Вставить("ОбластьРазвернутогоСальдо", Неопределено);
		ВывестиПоказателиОборотноСальдовойВедомости(ДокументРезультат, Выборка, Выборка.Счет, 
			СтруктураОбщийИтог, СтруктураПараметров, СтруктураПараметровОСВ, ДополнительныеПараметры);
		
		Если Выборка.РазвернутоеСальдо Тогда
			
			ОбластьСтрокаСчетРазвернутый.Параметры.Заполнить(Выборка);
			// Выводим текущую строку отчета.
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Уровень"					, Уровень);
			ДополнительныеПараметры.Вставить("СтруктураКолонок"			, СтруктураКолонок);
			ДополнительныеПараметры.Вставить("ВыводитьРазвернутоеСальдо", Истина);
			ДополнительныеПараметры.Вставить("ВключитьВИтог"			, Отчет.ВключатьРазвернутоеСальдоВИтоги);
			ДополнительныеПараметры.Вставить("ОбластьРазвернутогоСальдо", ОбластьСтрокаСчетРазвернутый);
			ВывестиПоказателиОборотноСальдовойВедомости(ДокументРезультат, Выборка, Выборка.Счет, 
				СтруктураОбщийИтог, СтруктураПараметров, СтруктураПараметровОСВ, ДополнительныеПараметры);
			
		КонецЕсли;
		
		Если ТипЗнч(Выборка.Расшифровка) = Тип("ТаблицаЗначений") Тогда
			ВывестиПодчиненнуюРасшифровку(ДокументРезультат, Выборка, ВыборкаСтруктура, Макет, СтруктураПараметров.СписокПоказателей, Уровень + 1);
		КонецЕсли;
		
	КонецЦикла;

	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();

	// Выведем итоговую строку.
	ОбластьИтогиСчет = Макет.ПолучитьОбласть("ИТОГИ|Счет");
	
	Если СтруктураПараметров.СписокПоказателей.Количество() > 0 Тогда
		ОбластьИтогиСчет.Параметры.ИмяПоказателя = СтруктураПараметров.СписокПоказателей[0].Представление;
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбластьИтогиСчет, 0);
	
	ОбластьИтогиСтрокаЧисла = Макет.ПолучитьОбласть("ИтогиСтрока|Числа");
	ОбластьИтогиЧисла       = Макет.ПолучитьОбласть("ИТОГИ|Числа");
	ОбластьИтогиСтрокаСчет  = Макет.ПолучитьОбласть("ИтогиСтрока|Счет");
	
	НомерТекущейСтрокиИтога = 0;	
	Для Каждого ТекПоказатель Из СтруктураПараметров.СписокПоказателей Цикл

		Если НомерТекущейСтрокиИтога > 0 Тогда
			Область 	= ОбластьИтогиСтрокаЧисла;
			ОбластьСчет = ОбластьИтогиСтрокаСчет;
		Иначе
			Область 	= ОбластьИтогиЧисла;
			ОбластьСчет = ОбластьИтогиСчет;
		КонецЕсли;

		ОбластьСчет.Параметры.ИмяПоказателя = ТекПоказатель.Представление;
		
		ФорматПоказателя = "";
		СтруктураПараметровОСВ.ФорматПоказателей.Свойство(ТекПоказатель.Значение, ФорматПоказателя);

		ЗаполнитьДаннымиОбластьВыводаОбороткаОстатки(Область, ФорматПоказателя, 
			СтруктураОбщийИтог[ТекПоказатель.Значение + "НачальныйОстатокДт"], СтруктураОбщийИтог[ТекПоказатель.Значение + "НачальныйОстатокКт"], 
			СтруктураОбщийИтог[ТекПоказатель.Значение + "КонечныйОстатокДт"], СтруктураОбщийИтог[ТекПоказатель.Значение + "КонечныйОстатокКт"]);
		ЗаполнитьДаннымиОбластьВыводаОбороткаОбороты(Область, ФорматПоказателя, 
			СтруктураОбщийИтог[ТекПоказатель.Значение + "ОборотДт"], СтруктураОбщийИтог[ТекПоказатель.Значение + "ОборотКт"]);
		
		Если НомерТекущейСтрокиИтога > 0 Тогда
			ДокументРезультат.Вывести(ОбластьСчет);	
		КонецЕсли;

		ДокументРезультат.Присоединить(Область);
		
		НомерТекущейСтрокиИтога = НомерТекущейСтрокиИтога + 1;

	КонецЦикла;

	ИтогиПодвал = Макет.ПолучитьОбласть("ИтогиПодвал");
   	ДокументРезультат.Вывести(ИтогиПодвал, 0);
	
	// Зафиксируем заголовок отчета.
	ДокументРезультат.ФиксацияСверху = ВысотаЗаголовка + 3;

	// Первую колонку не печатаем.
	ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1, 2, ДокументРезультат.ВысотаТаблицы, ДокументРезультат.ШиринаТаблицы);
	
	// Выводится по ширине листа.
	ДокументРезультат.Автомасштаб = Истина;
    	
КонецПроцедуры

// При формировании отчета, повторяет развороты, присутствующие в предудущей версии отчета.
// 
&НаСервере
Процедура ПривестиГлобальноеПредставлениеКСтруктуреКопии(ГлобальноеПредставление, Знач КопияПредставления, Знач ТекущаяСтрокаГлавнойТаблицы = Неопределено)
	
	Для Каждого СтрокаКопии Из КопияПредставления Цикл
		
		Если КопияПредставления.Колонки.Найти("ПоСубсчетам") <> Неопределено И СтрокаКопии.ПоСубсчетам Тогда
			
			Счет 	= СтрокаКопии.Счет;
			Отбор 	= Новый Структура("Счет", Счет);
			Строки 	= ГлобальноеПредставление.НайтиСтроки(Отбор);
			
			Для Каждого Строка Из Строки Цикл
				Строка.РазвернутоеСальдо = Истина;
			КонецЦикла;
			
		КонецЕсли;
		
		Если КопияПредставления.Колонки.Найти("РазвернутоеСальдо") <> Неопределено 
			И ГлобальноеПредставление.Колонки.Найти("РазвернутоеСальдо") <> Неопределено И СтрокаКопии.РазвернутоеСальдо Тогда
			
			Счет 	= СтрокаКопии.Счет;
			Отбор 	= Новый Структура("Счет", Счет);
			Строки 	= ГлобальноеПредставление.НайтиСтроки(Отбор);
			
			Для Каждого Строка Из Строки Цикл
				Строка.РазвернутоеСальдо = Истина;
			КонецЦикла;
			
		КонецЕсли;
        		
		Если ТипЗнч(СтрокаКопии.Расшифровка) <> Тип("ТаблицаЗначений") Тогда
			Продолжить; // Не расшифрованные строки неинтересны.
		КонецЕсли;
		
		Если СтрокаКопии.Расшифровка.Количество() = 0 Тогда
			Продолжить; // Пустые расшифровки неинтересны.
		КонецЕсли;
				
		ПредставительРазворота = СтрокаКопии.Расшифровка[0];
		
		ИмяРазворота 	= ПредставительРазворота.ИмяМакета;
        Отбор			= СтрокаКопии.Отбор;
		
		Если ИмяРазворота = "Период" Тогда
			ИмяРазворота = ПолучитьИмяРазворотаИзОтбора(Отбор);
		КонецЕсли;
		
		НовТекущаяСтрокаГлавнойТаблицы 	= ПолучитьСтрокуГлавнойТаблицыПоОтборам(ТекущаяСтрокаГлавнойТаблицы, Отбор, ГлобальноеПредставление);
		Расшифровка 					= НовТекущаяСтрокаГлавнойТаблицы;
		
		Если Расшифровка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Иерархия = СтрокаКопии.Иерархия;
		Если Найти(ИмяРазворота, "ПоДопРеквизитам") <> 0 Тогда
			ОбработатьВыбраннуюРасшифровку(Расшифровка, ПредставительРазворота.Отбор[ИмяРазворота], Ложь, Неопределено, Ложь, ГлобальноеПредставление, Иерархия);
		Иначе	
			ОбработатьВыбраннуюРасшифровку(Расшифровка, ИмяРазворота, Ложь, Неопределено, Ложь, ГлобальноеПредставление, Иерархия);
		КонецЕсли;
		
		ПривестиГлобальноеПредставлениеКСтруктуреКопии(ГлобальноеПредставление, СтрокаКопии.Расшифровка, Расшифровка);
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает строку главной таблицы представления ОСВ по указанному отбору.
// 
&НаСервере
Функция ПолучитьСтрокуГлавнойТаблицыПоОтборам(ТекущаяСтрока, Отбор, ГлобальноеПредставление)
	
	Для Каждого ПоследнееОтбораКИ Из Отбор Цикл
	КонецЦикла;
    
    СтрокаГлавнойТаблицы = Неопределено;
    
	ПоследнееОтбора = ПоследнееОтбораКИ.Значение;
	
	КолонкаОтбора = ПоследнееОтбораКИ.Ключ;
	
	Если ЕстьПериодВИмени(КолонкаОтбора) Тогда
		КолонкаОтбора = "Период";
	КонецЕсли;
	
	Если КолонкаОтбора = "СубСчет" Тогда
		КолонкаОтбора = "Счет";
	КонецЕсли;
	
	Если ТипЗнч(ПоследнееОтбораКИ.Значение) = Тип("Структура") Тогда
		
        Если ТекущаяСтрока <> Неопределено Тогда
            СтрокаГлавнойТаблицы = ТекущаяСтрока.Расшифровка.Найти(ПоследнееОтбораКИ.Значение.Значение, СтрЗаменить(КолонкаОтбора, "_0_", ""));
        ИначеЕсли ГлобальноеПредставление.Количество() > 0 Тогда       
			СтрокаГлавнойТаблицы = ГлобальноеПредставление.Найти(ПоследнееОтбораКИ.Значение.Значение, СтрЗаменить(КолонкаОтбора, "_0_", ""));
		КонецЕсли;
		
	Иначе
		
        Если ТекущаяСтрока <> Неопределено Тогда
            СтрокаГлавнойТаблицы = ТекущаяСтрока.Расшифровка.Найти(ПоследнееОтбораКИ.Значение, СтрЗаменить(КолонкаОтбора, "_0_", ""));
        ИначеЕсли ГлобальноеПредставление.Количество() > 0 Тогда
			СтрокаГлавнойТаблицы = ГлобальноеПредставление.Найти(ПоследнееОтбораКИ.Значение, СтрЗаменить(КолонкаОтбора, "_0_", ""));
		КонецЕсли;
		
	КонецЕсли;

	Возврат СтрокаГлавнойТаблицы;
	
КонецФункции

// Добавляет строку ОСВ в существующее глобальное представление.
// 
&НаСервере
Функция ДобавитьВГлобальноеПредставление(мГлобальнаяТаблицаОСВ, СтрокаВыборка, СписокПоказателей, ИмяМакета = "Счет", Расшифровка = "Счет")
	
	гл_ТЗ = мГлобальнаяТаблицаОСВ;
	
	Если гл_ТЗ = Неопределено ИЛИ гл_ТЗ.Колонки.Количество() = 0 Тогда
		ИнициализацияГлобальногоПредставления(мГлобальнаяТаблицаОСВ, СписокПоказателей);
		гл_ТЗ = мГлобальнаяТаблицаОСВ;
	КонецЕсли;
	
	НовСтрока = гл_ТЗ.Добавить();
	
	Для Каждого Колонка Из гл_ТЗ.Колонки Цикл
		Если Колонка.Имя <> "Уровень" И Колонка.Имя <> "ИмяМакета" И Колонка.Имя <> "Расшифровка" И Колонка.Имя <> "Отбор" Тогда
			Попытка
				НовСтрока[Колонка.Имя] = СтрокаВыборка[Колонка.Имя];
			Исключение
				НовСтрока[Колонка.Имя] = Неопределено;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	НовСтрока.ИмяМакета   = ИмяМакета;
	НовСтрока.Уровень	  = СтрокаВыборка.Уровень();
	НовСтрока.Расшифровка = Расшифровка;
	НовСтрока.Иерархия 	  = СтрокаВыборка.Иерархия;
	
	Отбор = Новый Структура("Счет");
	Отбор.Счет = СтрокаВыборка.Счет;
	
	НовСтрока.Отбор 		= Отбор;
	
	Возврат НовСтрока;
	
КонецФункции

// Помещает во временное хранилище таблицу для последующей сортировки.
// 
&НаСервере
Функция ПодготовитьТаблицуДляСортировки(Расшифровка)
	
	ТаблицаОСВ 				= ПолучитьИзВременногоХранилища(АдресГлобальногоПредставления);
	СтрокаОСВ 				= ПолучитьСтрокуПоИндексу(ТаблицаОСВ, Расшифровка.ИндексСтроки);
	ТаблицаОстаткиИОбороты 	= СтрокаОСВ.Расшифровка;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОстаткиИОбороты, УникальныйИдентификатор);
	
	
КонецФункции

// Основной обработчик выбранных расшифровок. Определяет, что необходимо сделать в случае выбора
// того или иного разворота.
// 
&НаСервере
Процедура ОбработатьВыбраннуюРасшифровку(Расшифровка, Знач ИмяРазворота, МножественныйРазворот, АдресХранилища, 
	ФормироватьОтчет = Истина, ТаблицаОСВ_ = Неопределено, Иерархия = Ложь)
	
	РасшифровкаВОСВ = Ложь;
	ИнтерактивнаяРабота = Истина;
	
	Если ТаблицаОСВ_ = Неопределено Тогда		
		ТаблицаОСВ = ПолучитьИзВременногоХранилища(АдресГлобальногоПредставления);		
	Иначе		
		ТаблицаОСВ 		= ТаблицаОСВ_;
		РасшифровкаВОСВ = Истина;		
	КонецЕсли;	
	
	ДопИмяРазворота = ИмяРазворота;
	
	Если НЕ МножественныйРазворот Тогда
		
		Если ИмяРазворота = "СвернутьГруппировку" Тогда // Удаление группировки.
			
			СтрокаОСВ = ПолучитьСтрокуПоИндексу(ТаблицаОСВ, Расшифровка.ИндексСтроки);
			СтрокаОСВ.Расшифровка = Неопределено;
						
		ИначеЕсли ИмяРазворота = "Сортировка" Тогда // Сортировка таблицы разворота.
			
			СтрокаОСВ = ПолучитьСтрокуПоИндексу(ТаблицаОСВ, Расшифровка.ИндексСтроки);
			
			Если АдресХранилища <> Неопределено Тогда
				ТаблицаОстаткиИОбороты = ПолучитьИзВременногоХранилища(АдресХранилища);
				УдалитьИзВременногоХранилища(АдресХранилища)
			КонецЕсли;
			
			Если ТипЗнч(ТаблицаОстаткиИОбороты) = Тип("ТаблицаЗначений") Тогда
				СтрокаОСВ.Расшифровка = ТаблицаОстаткиИОбороты;
			КонецЕсли;
						
		ИначеЕсли ИмяРазворота = "ПоПроводкам" Тогда
			ТаблицаОстаткиИОбороты = ДанныеПоПроводкам(Расшифровка, ИмяРазворота);	
		ИначеЕсли ИмяРазворота = "ИерархияЭлементов" Тогда
			
			СтрокаОСВ 		     = ПолучитьСтрокуПоИндексу(ТаблицаОСВ, Расшифровка.ИндексСтроки);
			ИмяРазворота 	     = СтрокаОСВ.Расшифровка[0].ИмяМакета;
			Иерархия 		     = Истина;
			СтрокаОСВ.Иерархия   = Истина;
			
			Если Найти(ИмяРазворота, "ПоДопРеквизитам") <> 0 Тогда				
				ИмяРазворота = СтрокаОСВ.Расшифровка[0].Отбор[СтрокаОСВ.Расшифровка[0].ИмяМакета];				
			КонецЕсли;
			
		ИначеЕсли ИмяРазворота = "ПоСубсчетам" Тогда
			
			// Получим список субсчетов.
			Счет 			= Расшифровка.Счет;
			// НУНВ...
			МассивСубсчетов = ПолучитьСубсчетаСчета(Счет, Отчет.РегистрБухгалтерии.ИмяОбъекта);
			// ...НУНВ
			МассивСубсчетов.Добавить("Счет");
			
			Для Каждого Субсчет Из МассивСубсчетов Цикл
				
				Отбор  = Новый Структура("Счет", Субсчет);
				Строки = ТаблицаОСВ.НайтиСтроки(Отбор);
				
				Для Каждого СтрокаСуб Из Строки Цикл
					СтрокаСуб.ПоСубсчетам = НЕ СтрокаСуб.ПоСубсчетам;
					Если НЕ СтрокаСуб.ПоСубсчетам И СтрокаСуб.Счет <> Счет Тогда
						СтрокаСуб.Расшифровка = Неопределено;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			
		ИначеЕсли Найти(ИмяРазворота, "отч_") > 0 Тогда
			// Открыть типовой отчет.
		ИначеЕсли ИмяРазворота = "РазвернутоеСальдо" Тогда
			
			Разворот = ПолучитьСтрокуПоИндексу(ТаблицаОСВ, Расшифровка.ИндексСтроки);
			
			Если ИнтерактивнаяРабота Тогда
				Разворот.РазвернутоеСальдо = НЕ Разворот.РазвернутоеСальдо;
			КонецЕсли;
		
			ФормироватьОтчет = Истина;
			
		ИначеЕсли ТипЗнч(ИмяРазворота) = Тип("Структура") Тогда
			
			// Это разворот по дополнительному реквизиту.
			
		КонецЕсли;
				
		Если НЕ ЗначениеЗаполнено(ИмяРазворота) Тогда
			Возврат;
		КонецЕсли;	
		
		Если ИмяРазворота <> "СвернутьГруппировку" 
			И ИмяРазворота <> "РазвернутоеСальдо" 
			И ИмяРазворота <> "Диаграмма" 
			И ИмяРазворота <> "Сортировка" 
			И Найти(ИмяРазворота, "отч_") = 0 
			И ИмяРазворота <> "ПоСубсчетам" Тогда
			
			Если ТипЗнч(ИмяРазворота) = Тип("Структура") Тогда				
				// Это разворот по дополнительному реквизиту.
				ТаблицаОстаткиИОбороты = ПолучитьОстаткиИОборотыДляПоляПоОтборуДопРеквизиты(ИмяРазворота, Расшифровка, ДопИмяРазворота, Иерархия, Ложь);				
			ИначеЕсли ИмяРазворота <> "ПоПроводкам" Тогда				
				ТаблицаОстаткиИОбороты = ПолучитьОстаткиИОборотыДляПоляПоОтбору(ИмяРазворота, Расшифровка, Иерархия);				
			КонецЕсли;
			
			// НУНВ...
			ДополнитьТаблицуСлужебнойИнформацией(Отчет.РегистрБухгалтерии.ИмяОбъекта, ТаблицаОстаткиИОбороты, ИмяРазворота, Расшифровка, ДопИмяРазворота, Ложь);
			// ...НУНВ
						
			Если НЕ РасшифровкаВОСВ Тогда				
				СтрокаОСВ = ПолучитьСтрокуПоИндексу(ТаблицаОСВ, Расшифровка.ИндексСтроки);
				СтрокаОСВ.Расшифровка = ТаблицаОстаткиИОбороты;				
			Иначе				
				СтрокаОСВ = Расшифровка;
				СтрокаОСВ.Расшифровка = ТаблицаОстаткиИОбороты;				
			КонецЕсли;
						
		КонецЕсли;
		
		Если СтрокаОСВ <> Неопределено Тогда
			СтрокаОСВ.Иерархия = Иерархия;
		КонецЕсли;
	
	Иначе
		
		Если НЕ ЗначениеЗаполнено(ИмяРазворота) Тогда
			Возврат;
		КонецЕсли;

		СтрокаОСВ = ПолучитьСтрокуПоИндексу(ТаблицаОСВ, Расшифровка.ИндексСтроки);
		
		Для Каждого СтрокаРасшифровкиОСВ Из СтрокаОСВ.Расшифровка Цикл
		
			Если ИмяРазворота = "ПоПроводкам" Тогда
				
				ТаблицаОстаткиИОбороты = ДанныеПоПроводкам(СтрокаРасшифровкиОСВ, ИмяРазворота);
				
			ИначеЕсли ТипЗнч(ИмяРазворота) = Тип("Структура") Тогда				
				// Это разворот по дополнительному реквизиту.
				ТаблицаОстаткиИОбороты = ПолучитьОстаткиИОборотыДляПоляПоОтборуДопРеквизиты(ИмяРазворота, СтрокаРасшифровкиОСВ, ДопИмяРазворота, Ложь, Ложь);				
			Иначе				
				ТаблицаОстаткиИОбороты = ПолучитьОстаткиИОборотыДляПоляПоОтбору(ИмяРазворота, СтрокаРасшифровкиОСВ);				
			КонецЕсли;
			
			// НУНВ...
			ДополнитьТаблицуСлужебнойИнформацией(Отчет.РегистрБухгалтерии.ИмяОбъекта, ТаблицаОстаткиИОбороты, ИмяРазворота, СтрокаРасшифровкиОСВ, ДопИмяРазворота, Ложь);
			// ...НУНВ
			
			СтрокаОСВ 				= СтрокаРасшифровкиОСВ;
			СтрокаОСВ.Расшифровка 	= ТаблицаОстаткиИОбороты;
			
		КонецЦикла;
		
		Если СтрокаОСВ <> Неопределено Тогда
			СтрокаОСВ.Иерархия = Иерархия;
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураПараметров    = ПолучитьИзВременногоХранилища(АдресСтруктурыПараметров);
	СтруктураПараметровОСВ = ПараметрыВыводаОСВ(СтруктураПараметров, 
								СтруктураПараметров.ОтчетОбъектМакет, СтруктураПараметров.ПоЗабалансовымСчетам);

   	Если ФормироватьОтчет Тогда
		
		УдалитьИзВременногоХранилища(АдресГлобальногоПредставления);		
		АдресГлобальногоПредставления = ПоместитьВоВременноеХранилище(ТаблицаОСВ, УникальныйИдентификатор);		
		СформироватьОСВПоГлобальномуПредставлениюНаСервере(ДокументРезультат, СтруктураПараметров, СтруктураПараметровОСВ);
	   
   	КонецЕсли;
													  
КонецПроцедуры

// Дополняет любую таблицу-подчиненную расшифровку служебной информацией, необходимой
// для формирования отчета.
// 
&НаСервере
Процедура ДополнитьТаблицуСлужебнойИнформацией(ИмяРегистраБухгалтерии, ТаблицаОстаткиИОбороты, Знач ИмяРазворота2, Расшифровка, ДопИмяРазворота, РазвернутоеСальдо = Ложь) 
	
	// Необходимо к таблице добавить служебные колонки:
	// "ИмяМакета", "Уровень", "Расшифровка", "Отбор".
	
	Отбор = Расшифровка.Отбор;
	ИспользованиеОтбора = Ложь;
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда // Отбор заполнен
		ИспользованиеОтбора = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ИмяРазворота2) = Тип("Структура") Тогда
		
		ИмяРазворота = ДопИмяРазворота;
		
		Если НЕ ИмяРазворота2.Свойство("Значение") Тогда
			ИмяРазворота2.Вставить("Значение");
		КонецЕсли;
		
	Иначе
		
		ИмяРазворота = ИмяРазворота2;
		
	КонецЕсли;
	
	ИмяРазворота_ 		= ИмяРазворота;
	ИмяРазворотаОтбор   = ПолучитьИмяРазворотаДляОтбора(ИмяРазворота);
	
	Если ЕстьПериодВИмени(ИмяРазворота) Тогда
		ИмяРазворота_ 	= "Период";
	КонецЕсли;
	
	Если ИмяРазворота = "СубСчет" Тогда
		ИмяРазворота_	= "Счет";
	КонецЕсли;
	
	ТаблицаОстаткиИОбороты.Колонки.Добавить("ИмяМакета");
	ТаблицаОстаткиИОбороты.Колонки.Добавить("Уровень");
	ТаблицаОстаткиИОбороты.Колонки.Добавить("Расшифровка");
	ТаблицаОстаткиИОбороты.Колонки.Добавить("Отбор");
	ТаблицаОстаткиИОбороты.Колонки.Добавить("РазвернутоеСальдо");
	ТаблицаОстаткиИОбороты.Колонки.Добавить("Иерархия");
	
	НовыйОтбор = Новый Структура;
	
	Для Каждого СтрокаТаблицы Из ТаблицаОстаткиИОбороты Цикл
		
		Если ИспользованиеОтбора Тогда
			
			НовыйОтбор = Новый Структура;
			НовыйОтбор.Очистить();
			
			СчетчикДопОтборов = 0;
			
			Для Каждого СтрокаСтарогоОтбора Из Отбор Цикл
				Если Найти(СтрокаСтарогоОтбора.Ключ, "ПоДопРеквизитам") <> 0 Тогда
					СчетчикДопОтборов = СчетчикДопОтборов + 1;
				КонецЕсли;	
				НовыйОтбор.Вставить(СтрокаСтарогоОтбора.Ключ, СтрокаСтарогоОтбора.Значение);
			КонецЦикла;
			
			Если ТипЗнч(ИмяРазворота2) = Тип("Структура") Тогда
				
				НовыйИмяРазворота = Новый Структура;
				НовыйИмяРазворота.Вставить("Значение",                  ИмяРазворота2.Значение);
				НовыйИмяРазворота.Вставить("Измерение",                 ИмяРазворота2.Измерение);
				НовыйИмяРазворота.Вставить("Свойство",                  ИмяРазворота2.Свойство);
				НовыйИмяРазворота.Вставить("СсылкаПВХ",                 ИмяРазворота2.СсылкаПВХ);
				НовыйИмяРазворота.Вставить("ИмяПредопределенныхДанных", ИмяРазворота2.ИмяПредопределенныхДанных);
						
				НовыйИмяРазворота.Значение = СтрокаТаблицы[СтрЗаменить(ИмяРазворота_, ".", "")];
				// Дополним отбор очередным измерением.
				НовыйОтбор.Вставить(СтрЗаменить(ИмяРазворота, ".", "_0_"), НовыйИмяРазворота);
				
				ИмяРазворота_ = СтрЗаменить(ИмяРазворота, ".", "_0_");
				
			Иначе
				
				// Дополним отбор очередным измерением.
				НовыйОтбор.Вставить(СтрЗаменить(ИмяРазворота, ".", "_0_"), СтрокаТаблицы[СтрЗаменить(ИмяРазворота_, ".", "")]);
			
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаТаблицы.Отбор = НовыйОтбор;
		
	КонецЦикла;
	
	ТаблицаОстаткиИОбороты.ЗаполнитьЗначения(?(ИмяРазворота = "СубСчет", ИмяРазворота, ИмяРазворота_), "ИмяМакета");
	ТаблицаОстаткиИОбороты.ЗаполнитьЗначения(Расшифровка.Уровень + 1	, "Уровень");
	ТаблицаОстаткиИОбороты.ЗаполнитьЗначения(РазвернутоеСальдо			, "РазвернутоеСальдо");
	
КонецПроцедуры

// Удаляет все текущие расшифровки и дает команду заново сформировать оборотно-сальдовую ведомость.
// 
&НаКлиенте
Процедура ОчиститьРасшифровки(Команда)
	
	АдресГлобальногоПредставления 	= Неопределено;
	АдресСтруктурыПараметров		= Неопределено;
	
	СформироватьОтчет(Неопределено);
	
КонецПроцедуры

// Обработчик "Начала выбора" списка значений "Отбор по измерениям".
// 
// &НаКлиенте
// Процедура ОтборПоИзмерениямЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
// 		
// КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииРаботыОтчетаКакРасшифровки

// Обработчик "Начала выбора" регистра бухгалтерии (НУВН).
// 
&НаКлиенте
Процедура РегистрБухгалтерииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
				
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы"   , Отчет.РегистрБухгалтерии);
	ПараметрыФормы.Вставить("ВидыОбъектов"           , СписокДоступныхРегистров);
	
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СтандартныйПериодПриИзменении(Элемент)
	
	ИзмененыНастройкиОтчета();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПоРаботеСНастройками

// Процедура обрабатывает изменение вида сравнения.
// 
// Параметры:
//  ИдСтроки - Строка.
// 
&НаСервере
Процедура ИзменениеВидаСравненияСервер(ИдСтроки)
	
	ТекущиеДанные = ОтборПоИзмерениям.НайтиПоИдентификатору(ИдСтроки); 	
	бит_МеханизмПолученияДанных.ИзменениеВидаСравнения(ТекущиеДанные);
	
	бит_МеханизмПолученияДанныхКлиентСервер.УстановитьСвойствоВыборГруппИЭлементов(Элементы.ОтборПоИзмерениямЗначение, 
		ТекущиеДанные.ВидСравнения);

КонецПроцедуры

// Процедура формирует список доступных видов сравнения в зависимости от типа значения в строке.
// 
// Параметры:
//  ИдСтроки - Число
// 
&НаСервере
Функция СформироватьСписокВыбораВидаСравнения(ИдСтроки)
	
	ТекущиеДанные = ОтборПоИзмерениям.НайтиПоИдентификатору(ИдСтроки);
	СписокВидов = бит_МеханизмПолученияДанных.СписокВыбораВидаСравнения(ТекущиеДанные);

	Возврат СписокВидов;
	
КонецФункции // СформироватьСписокВыбораВидаСравнения()

// Функция создает структуру, хранящую настройки.
// 
// Возвращаемое значение:
//  СтруктураНастроек - Структура.
// 
&НаСервере
Функция УпаковатьНастройкиВСтруктуру()

	СтруктураНастроек = Новый Структура;
	Для каждого Реквизит Из Метаданные.Отчеты.бит_осв_ИнтерактивнаяОборотноСальдоваяВедомость.Реквизиты Цикл
		ИмяРеквизита = Реквизит.Имя;
		СтруктураНастроек.Вставить(ИмяРеквизита, Отчет[ИмяРеквизита]);	
	КонецЦикла; 
	
	СтруктураНастроек.Вставить("Организация", Организация);
	СтруктураНастроек.Вставить("Показатели" , Показатели);
	
	ТаблицаОтборовПоИзмерениям = РеквизитФормыВЗначение("ОтборПоИзмерениям"); 	
	СтруктураНастроек.Вставить("ОтборПоИзмерениям", бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(ТаблицаОтборовПоИзмерениям));
	
	ТаблицаОСВ = ПолучитьИзВременногоХранилища(АдресГлобальногоПредставления);
	СтруктураНастроек.Вставить("ТаблицаОСВ", бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(ТаблицаОСВ));
	
	Возврат СтруктураНастроек;
	
КонецФункции // УпаковатьНастройкиВСтруктуру()

// Процедура применяет сохраненну настройки.
// 
// Параметры:
//  ВыбНастройка - СправочникСсылка.бит_СохраненныеНастройки.
// 
&НаСервере
Процедура ПрименитьНастройки(ВыбНастройка)
	
	// Очистка отчета.
	ДокументРезультат.Очистить();
	
    СтруктураНастроек = ВыбНастройка.ХранилищеНастроек.Получить();
	
	ЗаполнитьЗначенияСвойств(Отчет, СтруктураНастроек);  
	
	МассивОрганизаций = СтруктураНастроек.Организация.ВыгрузитьЗначения();
	Организация.ЗагрузитьЗначения(МассивОрганизаций);
	
	Показатели.Очистить();
	Показатели = СтруктураНастроек.Показатели.Скопировать();
	
	Организация.Очистить();
	Организация = СтруктураНастроек.Организация.Скопировать();

	ТаблицаОтборовПоИзмерениям = ?(ТипЗнч(СтруктураНастроек.ОтборПоИзмерениям) = Тип("ТаблицаЗначений")
									, СтруктураНастроек.ОтборПоИзмерениям
									, бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(СтруктураНастроек.ОтборПоИзмерениям));
									
									
	СконвертируемТаблицуОтборов(ТаблицаОтборовПоИзмерениям);
	
	ЗначениеВДанныеФормы(ТаблицаОтборовПоИзмерениям, ОтборПоИзмерениям);
	
	// Расшифровки.
	АдресГлобальногоПредставления = Неопределено;
	Если СтруктураНастроек.Свойство("ТаблицаОСВ") Тогда
		ТаблицаОСВ = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(СтруктураНастроек.ТаблицаОСВ);
		Если ТаблицаОСВ <> Неопределено Тогда
			АдресГлобальногоПредставления = ПоместитьВоВременноеХранилище(ТаблицаОСВ, УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	// Структура параметров.
	АдресСтруктурыПараметров = Неопределено;
	ПодготовитьСтруктуруПараметровФормированияОтчетаНаСервере();
		
КонецПроцедуры // ПрименитьНастройки()

// Конвертирует таблицу отбора если это необходимо.
// 
// Параметры:
//  Таблица - ТаблицаЗначений.
// 
&НаСервере
Процедура СконвертируемТаблицуОтборов(Таблица)

	Если Таблица.Колонки.Количество() < 6 Тогда
		
		Если Таблица.Колонки.Найти("Использование") = Неопределено Тогда
			Таблица.Колонки.Добавить("Использование");
		КонецЕсли;
		
		Если Таблица.Колонки.Найти("ВидСравнения") = Неопределено Тогда			
			Таблица.Колонки.Добавить("ВидСравнения");
		КонецЕсли;
		
		Если Таблица.Колонки.Найти("ТипЗначения") = Неопределено Тогда
			Таблица.Колонки.Добавить("ТипЗначения");
		КонецЕсли;
		
		Для Каждого Стр Из Таблица Цикл
			
			Стр.Использование = Истина;
			Стр.ВидСравнения = ВидСравнения.Равно;
			
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипЗнч(Стр.Значение));
			
			Стр.ТипЗначения = Новый ОписаниеТипов(МассивТипов);
						
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // СконвертируемТаблицуОтборов()

// Процедура открывает форму восстановления настроек.
// 
// 
&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()

	// Получим настройку по умолчанию.
	НастройкаПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(КэшЗначений.НастраиваемыйОбъект);
	
	// Установим настройку.
	Если ЗначениеЗаполнено(НастройкаПоУмолчанию) Тогда	
		ПрименитьНастройки(НастройкаПоУмолчанию);
	КонецЕсли;
		
	// Если настройки нет - заполним значения по умолчанию.
	      
КонецПроцедуры // УстановитьЗначенияПоУмолчанию()

// Процедура - обработчик события "Нажатие" кнопки "НастройкиСохранить" 
// коммандной панели "ДействияФормы".
// 
&НаКлиенте
Процедура ДействияФормыНастройкиСохранить(Кнопка)
	
	ПараметрыФормы     = Новый Структура;
	СтруктураНастройки = УпаковатьНастройкиВСтруктуру();
	ПараметрыФормы.Вставить("СтруктураНастройки" , СтруктураНастройки);
	ПараметрыФормы.Вставить("ТипНастройки"		 , КэшЗначений.ТипНастройки);
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", КэшЗначений.НастраиваемыйОбъект);
	
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения",
											ПараметрыФормы,
											ЭтотОбъект);	
													
КонецПроцедуры // ДействияФормыНастройкиСохранить()

// Процедура - обработчик события "Нажатие" кнопки "НастройкиВосстановить" 
// коммандной панели "ДействияФормы".
// 
&НаКлиенте
Процедура ДействияФормыНастройкиВосстановить(Кнопка)
	
	ПараметрыФормы     = Новый Структура;
	ПараметрыФормы.Вставить("ТипНастройки"		 , КэшЗначений.ТипНастройки);
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", КэшЗначений.НастраиваемыйОбъект);
	
	Обработчик = Новый ОписаниеОповещения("НастройкиВосстановитьЗавершение", ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки"
					, ПараметрыФормы, ЭтотОбъект, , , , Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры // ДействияФормыНастройкиВосстановить()

// Процедура - завершение обработчика события "Нажатие" кнопки "НастройкиВосстановить" 
// коммандной панели "ДействияФормы".
// 
&НаКлиенте
Процедура НастройкиВосстановитьЗавершение(Настройка, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Настройка) Тогда		
		ПрименитьНастройки(Настройка);		
	КонецЕсли;
	
КонецПроцедуры // НастройкиВосстановитьЗавершение()
#КонецОбласти     
	
#Область ПодсчетСуммыВТабличномДокументеПриАктивизации

&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	СуммаОтчета = БухгалтерскиеОтчетыВызовСервера.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ДокументРезультат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	БухгалтерскиеОтчетыКлиент.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		СуммаОтчета, ДокументРезультат, Элементы.ДокументРезультат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры

#КонецОбласти

// Функция управляет видимостью информационной надписи, о необходимости измерения Валюта,
// для вывода данных по валютным суммам.
// 
&НаКлиенте
Процедура ВидимостьИнформацииВалютнаяСумма()
	
	флУстановленаВалютаяСумма = Ложь;
	
	НайденныйЭлемент = Показатели.НайтиПоЗначению("ВалютнаяСумма");
	
	Если НайденныйЭлемент <> Неопределено Тогда		
		флУстановленаВалютаяСумма = НайденныйЭлемент.Пометка;		
	КонецЕсли; 
	
	Если Элементы.ГруппаПоказателиИнфо.Видимость <> флУстановленаВалютаяСумма Тогда		
		Элементы.ГруппаПоказателиИнфо.Видимость = флУстановленаВалютаяСумма;		
	КонецЕсли; 
	
КонецПроцедуры // ВидимостьИнформацииВалютнаяСумма()

// Проверяет корректность периода.
// 
&НаКлиенте
Функция ПроверитьКорректностьОграниченийПоДатам(Знач ДатаНач, Знач ДатаКон, Знач ВыдаватьПредупреждение = Истина)

	// Проверка на пустые значения.
	Если ДатаНач > ДатаКон И ДатаКон <> '00010101000000' Тогда

		Если ВыдаватьПредупреждение Тогда
			ТекстСообщения = НСтр("ru='Дата начала периода не может быть больше даты конца периода'; 
								  |en='The period start date cannot be greater than the period end date'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	
		Возврат Ложь;

	КонецЕсли;
	
	Возврат Истина;

КонецФункции
 
// Заполняет параметры регистра бухгалтерии.
// 
&НаСервере
Процедура ЗаполнитьПараметрыРегистраБухгалтерииНаСервере(РегистрБухгалтерии)
	
	Если ПустаяСтрока(РегистрБухгалтерии) Тогда
		ОчиститьПараметрыРегистраБухгалтерииНаСервере();
		Возврат;
	КонецЕсли;
	
	// 1. Измерения.
	ЗаполнитьИзмеренияРегистраБухгалтерииНаСервере(РегистрБухгалтерии);
	// 2. Показатели.
	ЗаполнитьПоказателиРегистраБухгалтерииНаСервере(РегистрБухгалтерии);

КонецПроцедуры

// Заполняет параметры регистра бухгалтерии.
// 
&НаСервере
Процедура ЗаполнитьИзмеренияРегистраБухгалтерииНаСервере(РегистрБухгалтерии)
	
	ИмяРегистра 		= РегистрБухгалтерии.ИмяОбъекта;
	
	МетаданныеРегистра	= Метаданные.РегистрыБухгалтерии[ИмяРегистра];
	ИзмеренияРегистра 	= ОтборПоИзмерениям;
	
	// Очистим предыдущие измерения.
	ИзмеренияРегистра.Очистить();
	
	ЕстьОрганизации = НЕ (Метаданные.Справочники.Найти("Организации") = Неопределено);
	ЕстьОрганизация = Ложь;
	
	// Показателями являются измерения регистра.
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		// Если показатель - "организация", не выводим его.		
		Если Измерение.Имя = "Организация" И ЕстьОрганизации Тогда			
			ЕстьОрганизация = Истина;
			Продолжить;			
		КонецЕсли;
		
		НовИзмерение = ИзмеренияРегистра.Добавить();
		
		НовИзмерение.Измерение 				= Измерение.Имя;
		НовИзмерение.ПредставлениеИзмерения = Измерение.Синоним;
		НовИзмерение.Значение               = Измерение.Тип.ПривестиЗначение();
		НовИзмерение.ТипЗначения            = Измерение.Тип;
				
	КонецЦикла;
	
	Элементы.Организация.Доступность = ЕстьОрганизация;
		
КонецПроцедуры

// Управляет видимостью поля "Организация".
// 
&НаСервере
Процедура ВидимостьОрганизацииНаСервере(ИмяРегистра)
	
	МетаданныеРегистра	= Метаданные.РегистрыБухгалтерии[ИмяРегистра];
	ИзмеренияРегистра 	= ОтборПоИзмерениям;
	
	ЕстьОрганизации = НЕ (Метаданные.Справочники.Найти("Организации") = Неопределено);
	ЕстьОрганизация = Ложь;
	
	// Показателями являются измерения регистра.
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		// Если показатель - "организация", не выводим его.		
		Если Измерение.Имя = "Организация" И ЕстьОрганизации Тогда			
			ЕстьОрганизация = Истина;
			Продолжить;			
		КонецЕсли;
			
	КонецЦикла;
	
	Элементы.Организация.Доступность = ЕстьОрганизация;
	
КонецПроцедуры

// Заполняет параметры регистра бухгалтерии.
// 
&НаСервере
Процедура ЗаполнитьПоказателиРегистраБухгалтерииНаСервере(РегистрБухгалтерии)
	
	ИмяРегистра 		= РегистрБухгалтерии.ИмяОбъекта;
	МетаданныеРегистра	= Метаданные.РегистрыБухгалтерии[ИмяРегистра];
	
	ПоказателиРегистра  = Показатели;
	
	// Очистим предыдущие показатели.
	ПоказателиРегистра.Очистить();
	
	// Показателями являются ресурсы регистра.
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		ПоказателиРегистра.Добавить(Ресурс.Имя, Ресурс.Представление(), ПоказателиРегистра.Количество() = 0);
	КонецЦикла;
    	
КонецПроцедуры

// Очищает заполненные параметры регистра бухгалтерии.
// 
&НаСервере
Процедура ОчиститьПараметрыРегистраБухгалтерииНаСервере()
	
	Показатели.Очистить();
	ОтборПоИзмерениям.Очистить();
	    	
КонецПроцедуры

// Заполняет структуру параметров формирования ОСВ.
// 
&НаСервере
Функция ПодготовитьСтруктуруПараметровФормированияОтчетаНаСервере()
	
	СтруктураПараметров =  Новый Структура;
	
	Если НЕ ЕстьОрганизация(Отчет.РегистрБухгалтерии.ИмяОбъекта) Тогда
		Организация.Очистить();
	КонецЕсли;
	
	// Организация.
	СтруктураПараметров.Вставить("МассивОрганизаций", Организация.ВыгрузитьЗначения());

	// Отбор по измерениям.
	ТаблицаОтбораИзмерения = РеквизитФормыВЗначение("ОтборПоИзмерениям");
	ТаблицаОтбораИзмерения.Очистить();
		
	Для Каждого ОтборИзмерение Из ОтборПоИзмерениям Цикл
					
		НоваяСтрокаТаблицыОтбора = ТаблицаОтбораИзмерения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыОтбора, ОтборИзмерение);
				
	КонецЦикла;
	
	СтруктураПараметров.Вставить("ТаблицаОтбора", ТаблицаОтбораИзмерения);
	
	// Ресурсы (показатели) отчета.
	МассивПоказателей 				= Новый Массив;
	МассивПредставленийПоказателей 	= Новый Массив;
	СписокПоказателей				= Новый СписокЗначений;
	
	Для Каждого Показатель Из Показатели Цикл
		Если Показатель.Пометка Тогда
			МассивПоказателей.Добавить(Показатель.Значение);
			МассивПредставленийПоказателей.Добавить(Показатель.Представление);
			СписокПоказателей.Добавить(Показатель.Значение, Показатель.Представление);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураПараметров.Вставить("МассивПоказателей"		, МассивПоказателей);
	СтруктураПараметров.Вставить("ПредставлениеПоказателей"	, МассивПредставленийПоказателей);
	СтруктураПараметров.Вставить("СписокПоказателей"		, СписокПоказателей);
	СтруктураПараметров.Вставить("НачалоПериода"			, Отчет.СтандартныйПериод.ДатаНачала);
	СтруктураПараметров.Вставить("ОкончаниеПериода"			, Отчет.СтандартныйПериод.ДатаОкончания);
	СтруктураПараметров.Вставить("ПоВалютам"				, Отчет.ПоВалютам);
	СтруктураПараметров.Вставить("ПоЗабалансовымСчетам"		, Отчет.ПоЗабалансовымСчетам);
	СтруктураПараметров.Вставить("ПоСубсчетамИСубконто"		, Отчет.ПоСубсчетамИСубконто);
	СтруктураПараметров.Вставить("ОтчетОбъектМакет"			, РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ОборотноСальдоваяВедомость"));
	// НУНВ...
	СтруктураПараметров.Вставить("ИмяРегистраБухгалтерии"	, Отчет.РегистрБухгалтерии.ИмяОбъекта);
	// ...НУНВ
	
	Если АдресСтруктурыПараметров <> Неопределено Тогда
		УдалитьИзВременногоХранилища(АдресСтруктурыПараметров);
	КонецЕсли;
	
	АдресСтруктурыПараметров = ПоместитьВоВременноеХранилище(СтруктураПараметров, УникальныйИдентификатор);
	
КонецФункции

// Функция возвращает текст предупреждения.
//
// Параметры:
//  ВывестиПредупреждение - Булево.
//
// Возвращаемое значение:
//  ЦветаСтиля - цвет.
//
&НаСервереБезКонтекста
Функция ЦветТекстаПредупреждения(ВывестиПредупреждение)

	Если ВывестиПредупреждение Тогда
		ЦветПредупреждения = ЦветаСтиля.бит_ЦветТекстаКрасный;
	Иначе
		ЦветПредупреждения = ЦветаСтиля.бит_ЦветТекстаЧерный;
	КонецЕсли;
	
	Возврат ЦветПредупреждения;

КонецФункции

// Включает/отключает предупреждение о необходимости переформировать отчет.
// 
&НаКлиенте
Процедура ИзмененыНастройкиОтчета(ВывестиПредупреждение = Истина)
	
	Если НЕ ОтчетСформирован Тогда
		Возврат;
	КонецЕсли;
	
	РекомендацияПользователю = ВывестиПредупреждение;
	ОбластьПредупреждения 	 = ДокументРезультат.Область("R4C2:R4C20");
	
	Если ВывестиПредупреждение Тогда
		Текст = НСтр("ru='Внимание. Изменены ключевые настройки отчета. Рекомендуется нажать на кнопку ""Сформировать""'; 
					 |en='Attention. Key report settings have been changed. It is recommended to click on the ""Generate"" button'");
	Иначе
		Текст = "";
	КонецЕсли;
	
	ОбластьПредупреждения.Текст 	 = Текст;
	ОбластьПредупреждения.ЦветТекста = ЦветТекстаПредупреждения(ВывестиПредупреждение);
	
КонецПроцедуры

// Обработчик команды "Сформировать отчет".
// 
&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	ПодготовитьСтруктуруПараметровФормированияОтчетаНаСервере();
	СформироватьОборотноСальдовуюВедомостьНаСервере(ДокументРезультат);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшЗначений()

	КэшЗначений = Новый Структура;
	
	КэшЗначений.Вставить("ТипНастройки", Перечисления.бит_ТипыСохраненныхНастроек.Обработки);
	КэшЗначений.Вставить("НастраиваемыйОбъект", "Отчет.бит_осв_ИнтерактивнаяОборотноСальдоваяВедомость");

	КэшЗначений.Вставить("ВидСравненияРавно", ВидСравнения.Равно);

КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Процедура ОбработкаКомандыПанелиНастроекСервер(СкрытьПанельПриФормировании = Ложь)
	
	// Видимость панели настроек.
	бит_ОтчетыСервер.ОбработкаКомандыПанелиНастроек(Элементы.ФормаКомандаПанельНастроек
													 , Элементы.ГруппаПанельНастроек
													 , СкрытьПанельНастроек
													 , ТаксиОткрытьПанельНастроек
													 , СкрытьПанельПриФормировании);
	
КонецПроцедуры // ОбработкаКомандыПанелиНастроекСервер()

// Возвращает имя текущего разворота по указанному отбору.
// 
&НаСервере
Функция ПолучитьИмяРазворотаИзОтбора(Отбор)
	
	Для Каждого СтрокаОтбора Из Отбор Цикл
		
		Если ЕстьПериодВИмени(СтрокаОтбора.Ключ) Тогда
			Возврат СтрокаОтбора.Ключ;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "ПериодДень";
	
КонецФункции

// Функция Объединяет ограничения.
// 
&НаСервереБезКонтекста
Функция ОбъединитьОграничения(Знач Ограничение1, Знач Ограничение2, Знач СтрокаОбъединенияОграничений = "И")
	
	Если ПустаяСтрока(Ограничение1) Тогда
		Возврат Ограничение2;
	КонецЕсли;
	
	Если ПустаяСтрока(Ограничение2) Тогда
		Возврат Ограничение1;
	КонецЕсли;
	
	СтрокаОграничения = Ограничение1 + " " + СтрокаОбъединенияОграничений + " " + Ограничение2;
	
	Возврат СтрокаОграничения;
	
КонецФункции

// Проверяет, есть ли у регистра бухгалтерии измерение "Организация".
// 
&НаСервереБезКонтекста
Функция ЕстьОрганизация(РегистрБухгалтерии)
	
	Возврат Метаданные.РегистрыБухгалтерии[РегистрБухгалтерии].Измерения.Найти("Организация") <> Неопределено;
	
КонецФункции

// Возвращает массив субсчетов переданного, в качестве параметра счета.
// 
&НаСервере
Функция ПолучитьСубсчетаСчета(Счет, РегистрБухгалтерии)
	
	ПланСчетовИмя = Метаданные.РегистрыБухгалтерии[РегистрБухгалтерии].ПланСчетов.Имя;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&СчетРодитель)");
	
	Запрос.УстановитьПараметр("СчетРодитель", Счет);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Хозрасчетный", ПланСчетовИмя);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Проверяет разворот на разворот по периодам.
// 
&НаСервереБезКонтекста
Функция ЕстьПериодВИмени(ИмяРазворота)
	
	Возврат Лев(ИмяРазворота, 6) = "Период" И Найти(ИмяРазворота, "ПериодРегистрации") = 0 И Найти(ИмяРазворота, ".") = 0;
	
КонецФункции

// Проверяет присутствие в отборе разворота по периодам.
// 
&НаСервереБезКонтекста
Функция ЕстьПериод(Отбор)
	
	Для Каждого ЭлементОтбора Из Отбор Цикл
		Если ЭлементОтбора.Ключ = "Регистратор" ИЛИ ЕстьПериодВИмени(ЭлементОтбора.Ключ) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Ложь;
	
КонецФункции

// Проверяет, возможен ли для данного контекста (расшифровки) разворот по иерархии элементов.
// 
&НаСервере
Функция ВозможнаИерархия(Расшифровка)
	
	ТаблицаРасшифровки = Расшифровка.Расшифровка;
	
	Если ТаблицаРасшифровки.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбразецРасшифровки 	= ТаблицаРасшифровки.Получить(0);
	ОбразецЗначения		= ОбразецРасшифровки[СтрЗаменить(ПолучитьИмяРазворотаДляОтбора(ОбразецРасшифровки.ИмяМакета), ".", "")];
	
	Если ЭтоСсылочноеЗначение(ОбразецЗначения) Тогда
		
		Мета = ОбразецЗначения.Метаданные();
		
		Если Метаданные.Справочники.Содержит(Мета) Тогда			
			Возврат Мета.Иерархический;			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Служит для возврата пустых картинок, в случае, если нужной картинки нет в библиотеке картинок.
// 
&НаСервереБезКонтекста
Функция ПолучитьКартинку(Картинка)
	
	Если Картинка = Неопределено Тогда
		Возврат Новый Картинка;
	Иначе
		Возврат Картинка;
	КонецЕсли;
	
КонецФункции

// Возвращает признак того, что значение имеет ссылочный тип.
// 
&НаСервереБезКонтекста
Функция ЭтоСсылочноеЗначение(Значение)
	
	Попытка
		МетаданныеЗначения = Значение.Метаданные();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Если Метаданные.Справочники.Содержит(МетаданныеЗначения) ИЛИ Метаданные.Документы.Содержит(МетаданныеЗначения) 
		ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеЗначения) ИЛИ Метаданные.ПланыОбмена.Содержит(МетаданныеЗначения) 
		ИЛИ Метаданные.ПланыВидовРасчета.Содержит(МетаданныеЗначения) ИЛИ Метаданные.Перечисления.Содержит(МетаданныеЗначения) 
		ИЛИ Метаданные.ПланыСчетов.Содержит(МетаданныеЗначения) Тогда
		Возврат Истина;		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Переводит строку табличной части в соотвествующую структуру, для передачи на Клиент.
// 
&НаСервере
Функция СтокаТЧВСтруктуруНаСервере(СтрокаТЧ, Колонки, ИндексСтроки, СтруктураРодителя = Неопределено)
	
	СтруктураСтроки = Новый Структура;
              
	Для Каждого Колонка Из Колонки Цикл
		
		Если Колонка.Имя = "Расшифровка" Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураСтроки.Вставить(Колонка.Имя, СтрокаТЧ[Колонка.Имя]);
		
	КонецЦикла;
	
	МассивИндексСтроки = Новый Массив;
	
	Если СтруктураРодителя <> Неопределено Тогда
		Для Каждого ИндексРодителя Из СтруктураРодителя.ИндексСтроки Цикл
			МассивИндексСтроки.Добавить(ИндексРодителя);
		КонецЦикла;
	КонецЕсли;
	
	МассивИндексСтроки.Добавить(ИндексСтроки);
	
	СтруктураСтроки.Вставить("ИндексСтроки", МассивИндексСтроки);
		
	Возврат СтруктураСтроки;
	
КонецФункции

// Возвращает строку подчиненной/главной ТЗ по массиву индексов строки.
// 
&НаСервере
Функция ПолучитьСтрокуПоИндексу(Табличка, ИндексСтроки, НомерИндекса = 0)
	
	Если НомерИндекса = ИндексСтроки.Количество() - 1 Тогда
		Возврат Табличка[ИндексСтроки[НомерИндекса]];
	Иначе	
		Возврат ПолучитьСтрокуПоИндексу(Табличка[ИндексСтроки[НомерИндекса]].Расшифровка, ИндексСтроки, НомерИндекса + 1);
	КонецЕсли;
	
КонецФункции

// Получает имя разворота с учетом особенностей именования разворотов по периодам.
// 
&НаСервереБезКонтекста
Функция ПолучитьИмяРазворотаДляОтбора(ИмяРазворота)
	
	ИмяРазворота_ = ИмяРазворота;
	
	Если ЕстьПериодВИмени(ИмяРазворота) Тогда
		ИмяРазворота_ = "Период";
	КонецЕсли;
	
	Если ИмяРазворота = "СубСчет" Тогда
		ИмяРазворота_ = "Счет";
	КонецЕсли;
	
	ИмяРазворота_ = СтрЗаменить(ИмяРазворота_, "_0_", ".");
	
	Возврат ИмяРазворота_;
	
КонецФункции

// Проверяет, возможно ли присутствие у разворота свойства "Наименование".
// 
&НаСервереБезКонтекста
Функция ВозможноНаименование(ИмяРазворота)
	
	Если (Найти(ИмяРазворота, "Субконто") > 0 ИЛИ Найти(ИмяРазворота, "Счет") > 0 
		ИЛИ Найти(ИмяРазворота, "Организация") > 0 
		ИЛИ Найти(ИмяРазворота, "Валюта") > 0) И НЕ Найти(ИмяРазворота, ".") > 0 Тогда
		
		Возврат Истина;
		
	КонецЕсли;	
		
	Возврат Ложь;
	
КонецФункции

// Проверяет отбор на предмет присутствия разворотов, противоречащих получению таблицы остатков.
// 
&НаСервереБезКонтекста
Функция ОтборИсключаетОстатки(Отбор, ИмяРегистраБухгалтерии)
	
	МассивИсключающихОстатки = Новый Массив;
	МассивИсключающихОстатки.Добавить("КорСчет");
	МассивИсключающихОстатки.Добавить("КорСубконто1");
	МассивИсключающихОстатки.Добавить("КорСубконто2");
	МассивИсключающихОстатки.Добавить("КорСубконто3");
	МассивИсключающихОстатки.Добавить("КорСубконто4");
	МассивИсключающихОстатки.Добавить("КорСубконто5");
	МассивИсключающихОстатки.Добавить("Регистратор");
	
	Для Каждого ТекИзмерение Из Метаданные.РегистрыБухгалтерии[ИмяРегистраБухгалтерии].Измерения Цикл
		Если ТекИзмерение.Балансовый Тогда
			Продолжить;
		КонецЕсли;
		МассивИсключающихОстатки.Добавить(ТекИзмерение.Имя + "Кор");
	КонецЦикла;
		
	Для Каждого Исключающий Из МассивИсключающихОстатки Цикл
		Если Отбор.Свойство(Исключающий) Тогда
			Возврат Истина;
		КонецЕсли;	
	КонецЦикла;          
	
	Возврат Ложь;
	
КонецФункции

// Проверяет, является ли разворот разворотом по измерению регистра бухгалтерии.
// 
&НаСервереБезКонтекста
Функция ЭтоИзмерениеРегистра(ИмяРегистраБухгалтерии, ИмяРазворота, ЭтоИзмерениеКор = Ложь)
	
	МетаданныеРегистра = Метаданные.РегистрыБухгалтерии[ИмяРегистраБухгалтерии];
	
	// Если ИмяРазворота содержит точку - нужно проверить первое до точки слово.
	Точка = Найти(ИмяРазворота, ".");
	
	ИмяРазворотаПроверка = ИмяРазворота;
	
	Если Точка <> 0 Тогда
		ИмяРазворотаПроверка = Лев(ИмяРазворота, Точка - 1);
	КонецЕсли;
	
	ЭтоИзмерениеКор = Ложь;
	Если Прав(ИмяРазворотаПроверка, 3) = "Кор" И МетаданныеРегистра.Измерения.Найти(ИмяРазворотаПроверка) = Неопределено Тогда
		ИмяРазворотаПроверка = Сред(ИмяРазворотаПроверка, 1, СтрДлина(ИмяРазворотаПроверка) - 3);
		ЭтоИзмерениеКор = Истина;
	КонецЕсли;
	
	Возврат МетаданныеРегистра.Измерения.Найти(ИмяРазворотаПроверка) <> Неопределено;
	
КонецФункции

// По имени периода в отборе получает периодичность общего разворота расшифровки
// для указания его в параметрах виртуальной таблицы при выборке оборотов.
// 
&НаСервереБезКонтекста
Функция ПолучитьПериодичностьОтбора(Отбор)
	
	Периодичность = "";
	
	Для Каждого СтрокаОтбора Из Отбор Цикл
		
		Если ЕстьПериодВИмени(СтрокаОтбора.Ключ) Тогда
			Периодичность = СтрЗаменить(СтрокаОтбора.Ключ, "Период", "");
		КонецЕсли;
		
		Если СтрокаОтбора.Ключ = "Регистратор" Тогда
			Периодичность = "Регистратор";
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Периодичность;
	
КонецФункции

// В соотвествии с указанным периодом формирует его начало и окончание в соотвествии с настройками отчета.
// 
&НаСервереБезКонтекста
Процедура ЗаполнитьПсевдоПериод(Отбор, ДатаНачПсевдо, ДатаКонПсевдо)
	
	Для Каждого СтрокаОтбора Из Отбор Цикл
		Если ЕстьПериодВИмени(СтрокаОтбора.Ключ) Тогда
			
			// Установим новый псевдопериод
			СтрокаПериодичность = СтрЗаменить(СтрокаОтбора.Ключ, "Период", "");
			
			Если СтрокаПериодичность = "Год" Тогда
				
				ДатаНачПсевдо = НачалоГода(СтрокаОтбора.Значение);
				ДатаКонПсевдо = КонецГода(СтрокаОтбора.Значение);
				
        	ИначеЕсли СтрокаПериодичность = "Квартал" Тогда

				ДатаНачПсевдо = НачалоКвартала(СтрокаОтбора.Значение);
				ДатаКонПсевдо = КонецКвартала(СтрокаОтбора.Значение);
				
			ИначеЕсли СтрокаПериодичность = "Месяц" Тогда
				
				ДатаНачПсевдо = НачалоМесяца(СтрокаОтбора.Значение);
				ДатаКонПсевдо = КонецМесяца(СтрокаОтбора.Значение);
				
			ИначеЕсли СтрокаПериодичность = "Неделя" Тогда
				
				ДатаНачПсевдо = НачалоНедели(СтрокаОтбора.Значение);
				ДатаКонПсевдо = КонецНедели(СтрокаОтбора.Значение);
				
			ИначеЕсли СтрокаПериодичность = "День" Тогда
				
				ДатаНачПсевдо = НачалоДня(СтрокаОтбора.Значение);
				ДатаКонПсевдо = КонецДня(СтрокаОтбора.Значение);
				
			КонецЕсли;	
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Проверяет, является ли выбранный показатель балансовым для указанного регистра бухгалтерии.
// 
&НаСервере
Функция БалансовыйПоказатель(Показатель, ИмяРегистра)
	
	Возврат Метаданные.РегистрыБухгалтерии[ИмяРегистра].Ресурсы[Показатель.Значение].Балансовый;
	
КонецФункции

// Открывает значение выбранной расшифровки.
// 
&НаКлиенте
Процедура ОткрытьРасшифровку(Расшифровка)
	
	ИмяМакета = Расшифровка.ИмяМакета;
	
	Если ИмяМакета = "СубСчет" Тогда
		ИмяМакета = "Счет";
	КонецЕсли;
	
	ПутьКЗначению = СтрЗаменить(ИмяМакета, ".", "");
	Значение 	  = Расшифровка[ПутьКЗначению];
	ПоказатьЗначение( , Значение);
		
КонецПроцедуры // ОткрытьРасшифровку()
 
#КонецОбласти
