#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Перем КлючВарианта;
	
	СтандартнаяОбработка = Ложь;
	УстановитьЗаголовкиПолейДопИзмерений();
	
	Если НЕ КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("КлючВарианта", КлючВарианта) Тогда
		КлючВарианта = "";
	КонецЕсли;
	
	// Добавление данных по расчетам.
	ИзменитьСКДДляРасчетов(СхемаКомпоновкиДанных, КомпоновщикНастроек);
	
	// Таблица периодов.
	ТаблицаПериодов = ТаблицаПериодов();	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаПериодов", ТаблицаПериодов);			
	бит_ОтчетыБФСервер.НастроитьДинамическийПериод(СхемаКомпоновкиДанных, КомпоновщикНастроек);

	// Вывод результата.
	ДокументРезультат.Очистить();
	
	КомпоновщикМакета		  = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	МакетКомпоновки   		  = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);

	бит_ОтчетыБФСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, 
		ДокументРезультат, ВспомогательныеПараметрыОтчета());

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПоБюджету = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПоБюджету").Значение;
	Если ПоБюджету Тогда
		Бюджет = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Бюджет").Значение;
		Если НЕ ЗначениеЗаполнено(Бюджет) Тогда
			ТекстСообщения = НСтр("ru = 'Не установлен ""Бюджет"".'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , ,Отказ); 
		КонецЕсли;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'В настройках отчета не заполнены сценарии для сравнения.'");
	СценарииДляСравнения = Новый ТаблицаЗначений; 
	НастройкиОтчета 	 = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "СценарииДляСравнения").Значение;
	Если НастройкиОтчета = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
	Иначе	
		СценарииДляСравнения = НастройкиОтчета.Получить();
		Если НЕ ЗначениеЗаполнено(СценарииДляСравнения) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
		КонецЕсли;
	КонецЕсли;
	
	ПроверитьСписок(СценарииДляСравнения, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	Настройки.События.ПередЗагрузкойВариантаНаСервере = Истина;
	
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = Отчеты.бит_ПрогнозИсполненияБюджетаСРасчетами.ЗагрузитьНастройкиПриИзмененииПараметров();
	Настройки.События.ПриОпределенииСвойствЭлементовФормыНастроек = Истина;
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//   Например, если схема отчета зависит от ключа варианта или параметров отчета.
//   Чтобы изменения схемы вступили в силу следует вызывать метод ОтчетыСервер.ПодключитьСхему().
//
// Параметры:
//   Контекст - Произвольный - 
//       Параметры контекста, в котором используется отчет.
//       Используется для передачи в параметрах метода ОтчетыСервер.ПодключитьСхему().
//   КлючСхемы - Строка -
//       Идентификатор текущей схемы компоновщика настроек.
//       По умолчанию не заполнен (это означает что компоновщик инициализирован на основании основной схемы).
//       Используется для оптимизации, чтобы переинициализировать компоновщик как можно реже).
//       Может не использоваться если переинициализация выполняется безусловно.
//   КлючВарианта - Строка, Неопределено -
//       Имя предопределенного или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов для варианта расшифровки или без контекста.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных, Неопределено -
//       Настройки варианта отчета, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено когда настройки варианта не надо загружать (уже загружены ранее).
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных, Неопределено -
//       Пользовательские настройки, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено когда пользовательские настройки не надо загружать (уже загружены ранее).
//
// Примеры:
// 1. Компоновщик отчета инициализируется на основании схемы из общих макетов:
//	Если КлючСхемы <> "1" Тогда
//		КлючСхемы = "1";
//		СхемаКД = ПолучитьОбщийМакет("МояОбщаяСхемаКомпоновки");
//		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКД, КлючСхемы);
//	КонецЕсли;
//
// 2. Схема зависит от значения параметра, выведенного в пользовательские настройки отчета:
//	Если ТипЗнч(НовыеПользовательскиеНастройкиКД) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
//		ПолноеИмяОбъектаМетаданных = "";
//		Для Каждого ЭлементКД Из НовыеПользовательскиеНастройкиКД.Элементы Цикл
//			Если ТипЗнч(ЭлементКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
//				ИмяПараметра = Строка(ЭлементКД.Параметр);
//				Если ИмяПараметра = "ОбъектМетаданных" Тогда
//					ПолноеИмяОбъектаМетаданных = ЭлементКД.Значение;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЦикла;
//		Если КлючСхемы <> ПолноеИмяОбъектаМетаданных Тогда
//			КлючСхемы = ПолноеИмяОбъектаМетаданных;
//			СхемаКД = Новый СхемаКомпоновкиДанных;
//			// Наполнение схемы...
//			ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКД, КлючСхемы);
//		КонецЕсли;
//	КонецЕсли;
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, Настройки, ПользовательскиеНастройки) Экспорт
	
	ТекущийКлючСхемы = Неопределено;
	
	Если Настройки = Неопределено Тогда 
		Настройки = КомпоновщикНастроек.Настройки;
	КонецЕсли;
	
	ЭтоЗагруженнаяСхема = Ложь;
	ДвоичныеДанныеСхемы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Настройки.ДополнительныеСвойства, "СхемаКомпоновкиДанных");
	
	Если ТипЗнч(ДвоичныеДанныеСхемы) = Тип("ДвоичныеДанные") Тогда
		ТекущийКлючСхемы = ХешДвоичныхДанных(ДвоичныеДанныеСхемы);
		Если ТекущийКлючСхемы <> КлючСхемы Тогда
			Схема = Отчеты.бит_ПрогнозИсполненияБюджетаСРасчетами.ИзвлечьСхемуИзДвоичныхДанных(ДвоичныеДанныеСхемы);
			ЭтоЗагруженнаяСхема = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ДоступныеЗначения = Неопределено;
	ФиксированныеПараметры = Отчеты.бит_ПрогнозИсполненияБюджетаСРасчетами.ФиксированныеПараметры(
		Настройки, ПользовательскиеНастройки, ДоступныеЗначения);
	
	Если ТекущийКлючСхемы = Неопределено Тогда 
		ТекущийКлючСхемы = "" + ФиксированныеПараметры.ПоБюджету;
		ТекущийКлючСхемы = ОбщегоНазначения.СократитьСтрокуКонтрольнойСуммой(ТекущийКлючСхемы, 100);
		
		Если ТекущийКлючСхемы <> КлючСхемы Тогда
			КлючСхемы = "";
			Схема = Отчеты.бит_ПрогнозИсполненияБюджетаСРасчетами.СхемаКомпоновкиДанных(ФиксированныеПараметры);
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийКлючСхемы <> Неопределено И ТекущийКлючСхемы <> КлючСхемы Тогда
		КлючСхемы = ТекущийКлючСхемы;
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, Схема, КлючСхемы);
		
		Если ЭтоЗагруженнаяСхема Тогда
			Отчеты.бит_ПрогнозИсполненияБюджетаСРасчетами.УстановитьСтандартныеНастройкиЗагруженнойСхемы(
				ЭтотОбъект, ДвоичныеДанныеСхемы, Настройки, ПользовательскиеНастройки);
		Иначе
			Отчеты.бит_ПрогнозИсполненияБюджетаСРасчетами.УстановитьСтандартныеНастройки(
				ЭтотОбъект, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
		КонецЕсли;
		
		Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
			// Переопределение.
			// АПК:278-выкл Допустимое исключение.
			ИнтеграцияПодсистемБСП.ПередЗагрузкойВариантаНаСервере(Контекст, Настройки);
			// АПК:278-вкл
			ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере(Контекст, Настройки);
			ПередЗагрузкойВариантаНаСервере(Контекст, Настройки);
		КонецЕсли;
	Иначе
		Отчеты.бит_ПрогнозИсполненияБюджетаСРасчетами.УстановитьФиксированныеПараметры(
			ЭтотОбъект, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ДоступныеЗначения", ДоступныеЗначения);

КонецПроцедуры

Процедура ПередЗагрузкойВариантаНаСервере(Форма, Настройки) Экспорт
	
	ТекущийКлючСхемы = Неопределено;
	Схема = Неопределено;
	КлючСхемы = "";
	ЭтоЗагруженнаяСхема = Ложь;
	
	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Или Настройки = Неопределено Тогда
		Если Настройки = Неопределено Тогда
			ДополнительныеСвойстваНастроек = КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
		Иначе
			ДополнительныеСвойстваНастроек = Настройки.ДополнительныеСвойства;
		КонецЕсли;
		
		Если Форма.ТипФормыОтчета = ТипФормыОтчета.Основная
			И (Форма.РежимРасшифровки
			Или Форма.КлючТекущегоВарианта <> "ПрогнозИсполненияБюджетаСРасчетами") Тогда 
			
			ДополнительныеСвойстваНастроек.Вставить("ОтчетИнициализирован", Истина);
		КонецЕсли;
		
		ДвоичныеДанныеСхемы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДополнительныеСвойстваНастроек, "СхемаКомпоновкиДанных");
		
		Если ТипЗнч(ДвоичныеДанныеСхемы) = Тип("ДвоичныеДанные") Тогда
			ЭтоЗагруженнаяСхема = Истина;
			ТекущийКлючСхемы = ХешДвоичныхДанных(ДвоичныеДанныеСхемы);
			Схема = Отчеты.бит_ПрогнозИсполненияБюджетаСРасчетами.ИзвлечьСхемуИзДвоичныхДанных(ДвоичныеДанныеСхемы);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоЗагруженнаяСхема Тогда
		КлючСхемы = ТекущийКлючСхемы;
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Форма, Схема, КлючСхемы);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииСвойствЭлементовФормыНастроек(ТипФормы, СвойстваЭлементов, ПользовательскиеНастройки) Экспорт 
	
	Если ТипФормы <> ТипФормыОтчета.Основная Тогда 
		Возврат;
	КонецЕсли;
	
	СвойстваГруппы = ОтчетыСервер.СвойстваГруппыЭлементовФормы();
	СвойстваГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СвойстваЭлементов.Группы.Вставить("ФиксированныеПараметры", СвойстваГруппы);
	
	ФиксированныеПараметры = Новый Структура("Период, ПоБюджету, Бюджет");
	ШиринаПоля = Новый Структура("ПоБюджету, Бюджет", 5, 35);
	
	Для Каждого ЭлементНастройки Из ПользовательскиеНастройки Цикл 
		Если ТипЗнч(ЭлементНастройки) <> Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			Или Не ФиксированныеПараметры.Свойство(ЭлементНастройки.Параметр) Тогда 
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля = СвойстваЭлементов.Поля.Найти(
			ЭлементНастройки.ИдентификаторПользовательскойНастройки, "ИдентификаторНастройки");
		
		Если СвойстваПоля = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля.ИдентификаторГруппы = "ФиксированныеПараметры";
		
		ИмяПараметра = Строка(ЭлементНастройки.Параметр);
		Если ИмяПараметра <> "Период" Тогда 
			СвойстваПоля.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			СвойстваПоля.Ширина = ШиринаПоля[ИмяПараметра];
			СвойстваПоля.РастягиватьПоГоризонтали = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИзменениеЗапросаПоРасчетам

// Процедура меняет текст запроса для СКД и подставляет фиксированные параметры.
//
// Параметры:
//  СКД - СхемаКомпоновкиДанных.
//
Процедура ИзменитьСКДДляРасчетов(СхемаКомпоновкиДанных, КомпоновщикНастроек)
	
	ПараметрыМодификации = бит_ОтчетыСРасчетамиСервер.НовыеПараметрыМодификацииСКДДляРасчетов();
	ПараметрыМодификации.МенеджерОтчета        = Отчеты.бит_ПрогнозИсполненияБюджетаСРасчетами;
	ПараметрыМодификации.СхемаКомпоновкиДанных = СхемаКомпоновкиДанных;
	ПараметрыМодификации.КомпоновщикНастроек   = КомпоновщикНастроек;
	ПараметрыМодификации.ПутьКНаборуДанных     = "Результат.Элементы.НаборДанных1";
	ПараметрыМодификации.ШаблонТекстаРасчета   = ШаблонТекстаРасчета();
	ПараметрыМодификации.СхемаКомпоновкиДанныхПоУмолчанию = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	ЗаполнитьОписаниеРесурсов(ПараметрыМодификации);
	бит_ОтчетыСРасчетамиСервер.ИзменитьСКДДляРасчетов(ПараметрыМодификации);

КонецПроцедуры

Функция ШаблонТекстаРасчета()
	
	Возврат
	"ВЫБРАТЬ
	|	ОборотыРезультат.Сценарий КАК Сценарий,
	|	ОборотыРезультат.ЦФО КАК ЦФО,
	|	ОборотыРезультат.Организация КАК Организация,
	|	&СтатьяРасчета КАК Статья,
	|	ОборотыРезультат.СтатьяБюджета КАК СтатьяБюджета,
	|	ОборотыРезультат.СтатьяОборотов КАК СтатьяОборотов,
	|	ОборотыРезультат.Валюта КАК Валюта,
	|	ОборотыРезультат.Аналитика_1 КАК Аналитика_1,
	|	ОборотыРезультат.Аналитика_2 КАК Аналитика_2,
	|	ОборотыРезультат.Аналитика_3 КАК Аналитика_3,
	|	ОборотыРезультат.Аналитика_4 КАК Аналитика_4,
	|	ОборотыРезультат.Аналитика_5 КАК Аналитика_5,
	|	ОборотыРезультат.Аналитика_6 КАК Аналитика_6,
	|	ОборотыРезультат.Аналитика_7 КАК Аналитика_7,
	|	ОборотыРезультат.Аналитика_8 КАК Аналитика_8,
	|	ОборотыРезультат.Аналитика_9 КАК Аналитика_9,
	|	ОборотыРезультат.Аналитика_10 КАК Аналитика_10,
	|	ОборотыРезультат.Аналитика_11 КАК Аналитика_11,
	|	ОборотыРезультат.Аналитика_12 КАК Аналитика_12,
	|	ОборотыРезультат.ТипДокумента КАК ТипДокумента,
	|	ОборотыРезультат.СтатусДокумента КАК СтатусДокумента,
	|	ОборотыРезультат.Регистратор КАК Регистратор,
	|	ОборотыРезультат.ПериодСекунда КАК ПериодСекунда,
	|	ОборотыРезультат.ПериодДень КАК ПериодДень,
	|	ОборотыРезультат.ПериодНеделя КАК ПериодНеделя,
	|	ОборотыРезультат.ПериодДекада КАК ПериодДекада,
	|	ОборотыРезультат.ПериодМесяц КАК ПериодМесяц,
	|	ОборотыРезультат.ПериодКвартал КАК ПериодКвартал,
	|	ОборотыРезультат.ПериодПолугодие КАК ПериодПолугодие,
	|	ОборотыРезультат.ПериодГод КАК ПериодГод,
	|	0 КАК Сумма,
	|	0 КАК Количество,
	|   &ДатаНачалаРасчета КАК ДатаНачалаРасчета,
	|   &ДатаОкончанияРасчета КАК ДатаОкончанияРасчета,
	|	ИСТИНА КАК ЭтоРасчет,
	|	&ОбластьРасчетныхПараметров КАК ОбластьРасчетныхПараметров
	|ИЗ
	|	ВТОборотыИсточник КАК ОборотыРезультат
	|ГДЕ
	|	ОборотыРезультат.СтатьяБюджета В ИЕРАРХИИ(&ЗначениеОтбораПараметра)";
	
КонецФункции

Процедура ЗаполнитьОписаниеРесурсов(ПараметрыМодификации)
	
	ОписаниеРесурсов = ПараметрыМодификации.ОписаниеРесурсов;
	
	НовоеОписание = ОписаниеРесурсов.Добавить();
	НовоеОписание.ИмяРесурса = "Сумма";
	НовоеОписание.ВидРесурса = "Сумма";
	
	НовоеОписание = ОписаниеРесурсов.Добавить();
	НовоеОписание.ИмяРесурса = "Количество";
	НовоеОписание.ВидРесурса = "Количество";
	
КонецПроцедуры

#КонецОбласти

#Область ТаблицаПериодов

Функция НоваяТаблицаПериодов()

	ТаблицаПериодов = Новый ТаблицаЗначений; 
	ТаблицаПериодов.Колонки.Добавить("ДатаНачалаРасчета", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаПериодов.Колонки.Добавить("ДатаОкончанияРасчета", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаПериодов.Колонки.Добавить("Сценарий", Новый ОписаниеТипов("СправочникСсылка.СценарииПланирования"));
	ТаблицаПериодов.Колонки.Добавить("Код", 				 ОбщегоНазначения.ОписаниеТипаСтрока(25));
	ТаблицаПериодов.Колонки.Добавить("Порядок", 			 ОбщегоНазначения.ОписаниеТипаЧисло(2));
	
	Возврат ТаблицаПериодов;

КонецФункции

Функция ТаблицаПериодов()

	НастройкиОтчета    	 = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "СценарииДляСравнения").Значение;
	СценарииДляСравнения = НастройкиОтчета.Получить();
	Если НЕ ЗначениеЗаполнено(СценарииДляСравнения) Тогда
		ВызватьИсключение НСтр("ru = 'Список сценариев пустой.'");
	КонецЕсли;
		
	Список = НовыйСписок(); // Приведение списка к формальному виду.
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СценарииДляСравнения, Список);
	
	ТаблицаПериодов = НоваяТаблицаПериодов();
	
	Для каждого СтрокаТаблицы Из Список Цикл
		НоваяСтрока   = ТаблицаПериодов.Добавить();
		НоваяСтрока.ДатаНачалаРасчета 	 = СтрокаТаблицы.Период.ДатаНачала;
		НоваяСтрока.ДатаОкончанияРасчета = СтрокаТаблицы.Период.ДатаОкончания;
		НоваяСтрока.Сценарий		     = СтрокаТаблицы.Сценарий;	
		НоваяСтрока.Порядок				 = ТаблицаПериодов.Количество();
		Если ПустаяСтрока(СтрокаТаблицы.Код) Тогда
			Заголовок = Строка(СтрокаТаблицы.Сценарий);
		Иначе	
			Заголовок = СтрокаТаблицы.Код;
		КонецЕсли;
		НоваяСтрока.Код = Заголовок;
	КонецЦикла;
	
	Возврат ТаблицаПериодов;
		
КонецФункции

#КонецОбласти

Процедура УстановитьЗаголовкиПолейДопИзмерений()
	
	Отчеты.бит_ПрогнозИсполненияБюджетаСРасчетами.УстановитьЗаголовкиПолейДопИзмерений(СхемаКомпоновкиДанных);
	
КонецПроцедуры

Процедура ПроверитьСписок(Список, Отказ)

	Если НЕ ЗначениеЗаполнено(Список) Тогда
		Возврат;
	КонецЕсли;
	
	СценарииДляСравнения = НовыйСписок();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Список, СценарииДляСравнения);
	
	ЭталонУстановлен = Ложь;
	Поле			 = "";
	
	НомерСтроки = 0;
	ИмяСписка = НСтр("ru='Сценарии';en='Scenarios'");
	Для каждого СтрокаТаблицы Из СценарииДляСравнения Цикл
		
		Префикс = СтрШаблон("СценарииДляСравнения[%1].", Формат(НомерСтроки , "ЧН=0; ЧГ="));
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сценарий) Тогда
			Поле = Префикс + "Сценарий";
			ИмяПоля = НСтр("ru='Сценарий';en='Scenario'");
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",, ИмяПоля, НомерСтроки + 1, ИмяСписка);			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Период) Тогда
			Поле = Префикс + "Период";
			ИмяПоля = НСтр("ru='Период';en='Period'");
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",, ИмяПоля, НомерСтроки + 1, ИмяСписка);			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Иначе
			Если ЗначениеЗаполнено(СтрокаТаблицы.Период.ДатаОкончания) И СтрокаТаблицы.Период.ДатаНачала > СтрокаТаблицы.Период.ДатаОкончания Тогда
				ТекстСообщения = НСтр("ru='Дата начала периода не может быть больше даты конца периода';
									  |en='The start date of the period cannot be greater than the end date of the period.'");					
				Поле = Префикс + "Период";
				ИмяПоля = НСтр("ru='Период';en='Period'");
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ", 
					ИмяПоля, НомерСтроки + 1, ИмяСписка);				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
			КонецЕсли;
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла; 
	
КонецПроцедуры

Функция НовыйСписок()
	
	Возврат Отчеты.бит_ПрогнозИсполненияБюджетаСРасчетами.НовыйСписок();
	
КонецФункции

// Возвращает хеш-сумму двоичных данных.
//
// Параметры:
//   ДвоичныеДанные - ДвоичныеДанные - Данные, от которых считается хеш-сумма.
//
Функция ХешДвоичныхДанных(ДвоичныеДанные)
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеДанных.Добавить(ДвоичныеДанные);
	Возврат СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "") + "_" + Формат(ДвоичныеДанные.Размер(), "ЧГ=");
КонецФункции

Функция ВспомогательныеПараметрыОтчета()
	
	ВспомогательныеПараметры = Новый Массив;
	ВспомогательныеПараметры.Добавить("СценарииДляСравнения");
	ВспомогательныеПараметры.Добавить("Периодичность");
	
	Возврат ВспомогательныеПараметры;
	
КонецФункции

#КонецОбласти

#Область Инициализация

УстановитьЗаголовкиПолейДопИзмерений();

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
 