//Добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
//конец добавила Сырбу Н.А Автоматизация бизнеса 07.08.2025
Процедура ЗарегистрироватьИзмененияРуководителяПодразделения(Источник, Отказ, РежимПроведения) Экспорт
			
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ТекСотрудники 		= Новый Массив;
	СтарыеДолжностиШР 	= Новый Массив;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.КадровыйПереводСписком") Тогда
	
		ТекСотрудникиТаб = Источник.Сотрудники.Выгрузить();	
		
		ТекСотрудники 		= ТекСотрудникиТаб.ВыгрузитьКолонку("Сотрудник");
		СтарыеДолжностиШР 	= ТекСотрудникиТаб.ВыгрузитьКолонку("ДолжностьПоШтатномуРасписанию");
		
	ИначеЕсли   ТипЗнч(Источник) <> Тип("ДокументОбъект.Увольнение") Тогда

		ТекСотрудники.Добавить(Источник.Сотрудник);
        СтарыеДолжностиШР.Добавить(Источник.ДолжностьПоШтатномуРасписанию);
		
	Иначе	
		
		ТекСотрудники.Добавить(Источник.Сотрудник);
		
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |	ДанныеДляПодбораСотрудников.МестоВСтруктуреПредприятия КАК СтруктураПредприятия
						  |ИЗ
	                      |	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудников
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПозицииРуководителейПодразделений КАК ПозицииРуководителейПодразделений
	                      |		ПО (ДанныеДляПодбораСотрудников.Сотрудник В (&Сотрудники))
	                      |			И ДанныеДляПодбораСотрудников.МестоВСтруктуреПредприятия = ПозицииРуководителейПодразделений.Подразделение
	                      |			И (ДанныеДляПодбораСотрудников.ДолжностьПоШтатномуРасписанию = ПозицииРуководителейПодразделений.ПозицияШтатногоРасписания ИЛИ ПозицииРуководителейПодразделений.ПозицияШтатногоРасписания В (&СтарыеДолжности) )	");    
	Запрос.УстановитьПараметр("Сотрудники", 	 ТекСотрудники); 
	Запрос.УстановитьПараметр("СтарыеДолжности", СтарыеДолжностиШР);
	
	//на текущий момент используем один конкретный узел
	УзелОбмена = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.ПолучитьСсылку(Новый УникальныйИдентификатор("a810b650-42cf-11f0-9124-005056aa9671"));
	
	Если УзелОбмена.ПолучитьОбъект() = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Выборка.СтруктураПредприятия);
		
	КонецЦикла;
	
	ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ТекСотрудники);	

КонецПроцедуры
