
#Область ПрограммныйИнтерфейс

// Возвращает хост сервиса обновлений для конфигурации БИТ.ФИНАНС.
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Строка.
//
Функция ХостСервисаОбновлений() Экспорт
	
	Возврат бит_ПолучениеОбновленийПрограммыПовтИсп.ХостСервисаОбновлений();
	
КонецФункции

// Устанавливает настройки параметров обновления для конфигурации БИТ.ФИНАНС.
//
// Параметры:
//	ДополнительныеПараметры - Структура.
//
Процедура УстановитьНастройкиОбновленияБИТ(ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.ТолькоИсправления = Истина;
	КопияНастроекСоединения = НостройкиСоединенияОбновленияБИТ(ДополнительныеПараметры.НастройкиСоединения);
	ДополнительныеПараметры.НастройкиСоединения = КопияНастроекСоединения;
	
КонецПроцедуры

// Заменяет значение параметра расположения домена для идентификации подключения к сервису БИТФинанс.
//
// Параметры:
//	НастройкиСоединения - Структура.
//
// Возвращаемое значение:
//	Структура.
//
Функция НостройкиСоединенияОбновленияБИТ(НастройкиСоединения) Экспорт
	
	// Настройки соединения - кэшируемеое значение структуры,
	//создадим структуру с новым адресом, чтобы не искажать данных в источнике.
	КопияНастроекСоединения = Новый Структура;
	Для каждого ЭлементНастройки Из НастройкиСоединения Цикл
		КлючНастройки     = ЭлементНастройки.Ключ;
		ЗначениеНастройки = ЭлементНастройки.Значение;
		Если КлючНастройки = "ДоменРасположенияСерверовИПП" Тогда
			ЗначениеНастройки = ИдентификаторДоменаБИТФинанс();
		КонецЕсли;
		КопияНастроекСоединения.Вставить(КлючНастройки, ЗначениеНастройки);
	КонецЦикла;
	Возврат КопияНастроекСоединения;
	
КонецФункции

// Производит проверку хоста для URL полученного из внешних источников.
//
// Параметры:
//  URL - Строка, Структура - URL из внешнего источника.
//
// Возвращаемое значение:
//	Булево.
//
Функция ПроверитьURL(Знач URL) Экспорт
	
	СтруктураURL = URL;
	Если ТипЗнч(URL) = Тип("Строка") Тогда
		СтруктураURL = ОбщегоНазначенияКлиентСервер.СтруктураURI(URL);
	КонецЕсли;
	
	СтруктураURLСервисаОбновлений = ОбщегоНазначенияКлиентСервер.СтруктураURI(ХостСервисаОбновлений());
	Возврат СтруктураURL.Хост = СтруктураURL.Хост;	
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИдентификаторДоменаБИТФинанс() Экспорт
	
	ИдентификаторДомена = 99;
	Возврат ИдентификаторДомена;
	
КонецФункции

Процедура УстановитьХостСервисаОбновлений() Экспорт
	
	ХостСервисаОбновлений = "vds853.1cbit.ru/patches/hs";
	Константы.бит_ХостСервисаОбновлений.Установить(ХостСервисаОбновлений);
	
КонецПроцедуры

#КонецОбласти
