
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимВыбораФайла = Параметры.РежимВыбораФайла;
	ЗаполнитьОписаниеЭлементов(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Ссылка = Параметры.Ссылка;
	ЗаполнитьВложения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УникальныйИдентификаторВладельцаФайла = ?(РежимВыбораФайла, ВладелецФормы.УникальныйИдентификатор,
											УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКФалуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.ПолноеИмяФайла = ПутьКФалу;
	ДиалогВыбораФайла.Фильтр =
		НСтр("ru = 'Файлы PDF(*.pdf,*.PDF)|*.pdf;*.PDF|Текстовые файлы (*.txt)|*.txt|Все файлы (*.*)|*.*'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьВыборПутиКФайлу", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(ОписаниеОповещения, ДиалогВыбораФайла);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВложения

&НаКлиенте
Процедура ВложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВариантВыбораФайла = 1;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭлементыИсточника

&НаКлиенте
Процедура ЭлементыИсточникаФлагВыбораПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭлементыИсточника.ТекущиеДанные;
	Если ТекущиеДанные.ФлагВыбора = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.НайденоеЗначение) Тогда
		ТекущиеДанные.Значение = ТекущиеДанные.ТипЗначения.ПривестиЗначение(ТекущиеДанные.НайденоеЗначение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНазад(Команда)
	
	ИндексТекущегоДействия = ИндексТекущегоДействия - 1;
	УстановитьВидимостьДоступностьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДалее(Команда)
	
	ИндексТекущегоДействия = ИндексТекущегоДействия + 1;
	ВыполнитьТекущееДействие();
	УстановитьВидимостьДоступностьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОписаниеЭлементов(Отказ)
	
	ОписаниеЭлементов = Параметры.ОписаниеЭлементов;
	Если ОписаниеЭлементов = Неопределено Тогда
		Если НЕ РежимВыбораФайла Тогда
			Отказ = Истина;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Для каждого ОписаниеЭлемента Из ОписаниеЭлементов Цикл
		НоваяСтрокаЭлемента = ЭлементыИсточника.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаЭлемента, ОписаниеЭлемента);
		
		ПредставлениеЭлемента = ОписаниеЭлемента.Синоним;
		ИмяЭлемента           = ОписаниеЭлемента.ИмяЭлемента;
		Если СтрНачинаетсяС(ИмяЭлемента, "ДополнительныйРеквизитЗначение_") Тогда
			ПредставлениеЭлемента = СтрШаблон("%1 (%2)", ПредставлениеЭлемента, НСтр("ru='Дополнительный реквизит'"));
		ИначеЕсли НЕ ПустаяСтрока(ИмяЭлемента)
			И (ВРег(ПредставлениеЭлемента) <> ВРег(бит_ОбщегоНазначенияКлиентСервер.РазбитьНаОтдельныеСлова(ИмяЭлемента))) Тогда
			ПредставлениеЭлемента = СтрШаблон("%1 (%2)", ПредставлениеЭлемента, ИмяЭлемента);
		КонецЕсли;
		НоваяСтрокаЭлемента.ПредставлениеЭлемента = ПредставлениеЭлемента;
		НоваяСтрокаЭлемента.Значение              = ОписаниеЭлемента.ТекущееЗначение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьТекущееДействие()
	
	Если ИндексТекущегоДействия = 1 Тогда
		ВыполнитьИИАнализФайла();
	ИначеЕсли ИндексТекущегоДействия = 2 Тогда
		ЗаполнитьРеквизитыОбъекта();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтменитьДействие(Форма)
	
	Форма.ИндексТекущегоДействия = Форма.ИндексТекущегоДействия - 1;
	УстановитьВидимостьДоступностьЭлементов(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИИАнализФайла()
	
	Если ВариантВыбораФайла = 0 Тогда
		ЗагрузитьДанныеФайла();
	ИначеЕсли ВариантВыбораФайла = 1 Тогда
		ЗагрузитьДанныеВложения();										
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеФайла()
	
	Если ПустаяСтрока(ПутьКФалу) Тогда
		ТекстСообщения = НСтр("ru='Не выбран файл'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ПутьКФалу");
		ОтменитьДействие(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.Интерактивно       = Ложь;
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификаторВладельцаФайла;
	
	ОбработкаЗавершенияЗагрузкиФайла = Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ЗагрузитьФайл(ОбработкаЗавершенияЗагрузкиФайла, ПараметрыЗагрузки, ПутьКФалу,
										АдресХраненияДанныхФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиДанныхФайла()
	
	Если РежимВыбораФайла Тогда
		ПараметрыФайла = Новый Структура;
		ПараметрыФайла.Вставить("ОписаниеВложения", ОписаниеФайлаДанных);
		ПараметрыФайла.Вставить("ДанныеВложения", АдресХраненияДанныхФайла);
		Закрыть(ПараметрыФайла);
	Иначе
		ПослеЗагрузкиДанныхФайлаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиДанныхФайлаНаСервере()
	
	ЗапросИИ = Новый Массив;
	ЗапросИИ.Добавить(Новый Структура("ДанныеВложения, ОписаниеВложения", АдресХраненияДанныхФайла, ОписаниеФайлаДанных));
	ЗапросИИ.Добавить(Справочники.бит_ШаблоныПромптовИИ.ПолучениеДанныхИзФайла);
	ЗапросИИ.Добавить(ОписаниеЭлементовJSON());
	Описание = бит_ИскусственныйИнтеллект.ОтветИИ(ЗапросИИ);
	
	НайденыеЗначения = бит_ИскусственныйИнтеллектКлиентСервер.ИзвлечьДанныеJSONИзГенеративнойСтроки(Описание,, Ложь);
	Если НайденыеЗначения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого НайденоеЗначение Из НайденыеЗначения Цикл
		Если НайденоеЗначение.ВозможныеЗначения.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиИсточника = ЭлементыИсточника.НайтиСтроки(Новый Структура("ИмяЭлемента", НайденоеЗначение.ИмяЭлемента));
		Если СтрокиИсточника.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиИсточника[0].НайденоеЗначение = НайденоеЗначение.ВозможныеЗначения[0];
		ОбработатьНайденноеЗначение(СтрокиИсточника[0]);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОписаниеЭлементовJSON()
	
	ТаблицаЭлементов  = ЭлементыИсточника.Выгрузить(, "ИмяЭлемента, ПредставлениеЭлемента, ТипЗначения");
	ТаблицаЭлементов.Колонки.Добавить("ДоступныеЗначения");
	Для каждого СтрокаЭлемента Из ТаблицаЭлементов Цикл
		СтрокаЭлемента.ДоступныеЗначения = ДоступныеЗначенияТипа(СтрокаЭлемента.ТипЗначения);
	КонецЦикла;
	
	МассивЭлементов        = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЭлементов);
	СериализуемоеЗначение  = бит_ИскусственныйИнтеллектКлиентСервер.СериализуемоеЗначениеДляВыгрузкиJSON(МассивЭлементов);
	ОписаниеЭлементов      = бит_ИскусственныйИнтеллектКлиентСервер.ЗначениеВJSON(СериализуемоеЗначение);
	
	Возврат ОписаниеЭлементов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДоступныеЗначенияТипа(ОписаниеТипаЭлемента)
	
	ДоступныеЗначения = Новый Массив;
	
	МетаданныеЭлемента = МетаданныеЭлементаПоОписаниюТипов(ОписаниеТипаЭлемента);
	Если МетаданныеЭлемента = Неопределено Тогда
		Возврат ДоступныеЗначения;
	КонецЕсли;
	
	Если Метаданные.Перечисления.Содержит(МетаданныеЭлемента) Тогда
		// Реализовать поиск по перечислениям.
	ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеЭлемента) Тогда
		Возврат ДоступныеЗначенияСправочника(МетаданныеЭлемента);
	КонецЕсли;
	
	Возврат ДоступныеЗначения;
	
КонецФункции

&НаСервереБезКонтекста
Функция МетаданныеЭлементаПоОписаниюТипов(ОписаниеТипаЭлемента)
	
	ТипыЭлемента = ОписаниеТипаЭлемента.Типы();
	Если ТипыЭлемента.Количество() <> 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Метаданные.НайтиПоТипу(ТипыЭлемента[0]);
	
КонецФункции

&НаСервереБезКонтекста
Функция ДоступныеЗначенияСправочника(МетаданныеЭлемента)
	
	ДоступныеЗначения = Новый Массив;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Источник.Ссылка КАК Ссылка,
	|	&ПоляПоиска КАК ПоляПоиска
	|ИЗ
	|	&ТаблицаИсточник КАК Источник
	|ГДЕ
	|	НЕ Источник.ПометкаУдаления";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточник", СтрШаблон("Справочник.%1", МетаданныеЭлемента.Имя));
	
	ПоляПоиска = Новый Массив;
	ПоляПоиска.Добавить("Наименование");
	
	ПоляПоискаКандидаты = Новый Массив;
	ПоляПоискаКандидаты.Добавить("НаименованиеПолное");
	ПоляПоискаКандидаты.Добавить("ИНН");
	Для каждого ПолеПоиска Из ПоляПоискаКандидаты Цикл
		Если МетаданныеЭлемента.Реквизиты.Найти(ПолеПоиска) <> Неопределено Тогда
			ПоляПоиска.Добавить(ПолеПоиска);
		КонецЕсли;
	КонецЦикла;
	
	ВыборкиПолейПоиска = Новый Массив;
	Для каждого ПолеПоиска Из ПоляПоиска Цикл
		ВыборкиПолейПоиска.Добавить(СтрШаблон("Источник.%1 КАК %1", ПолеПоиска));
	КонецЦикла;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляПоиска КАК ПоляПоиска", СтрСоединить(ВыборкиПолейПоиска,
																						"," + Символы.Таб));
	
	Запрос.Текст = ТекстЗапроса;
	Выборка      = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 50 Тогда
		Возврат ДоступныеЗначения;
	КонецЕсли;
	
	ПоляЭлемента = "ID," + СтрСоединить(ПоляПоиска, ",");
	Пока Выборка.Следующий() Цикл
		ЗначенияПолейЭлемента = Новый Структура(ПоляЭлемента);
		ЗаполнитьЗначенияСвойств(ЗначенияПолейЭлемента, Выборка);
		ЗначенияПолейЭлемента.ID = Выборка.Ссылка.УникальныйИдентификатор();
		ДоступныеЗначения.Добавить(ЗначенияПолейЭлемента);
	КонецЦикла;
	
	Возврат ДоступныеЗначения;
	
КонецФункции

&НаСервере
Процедура ОбработатьНайденноеЗначение(СтрокаЭлемента)
	
	НайденоеЗначение = СтрокаЭлемента.НайденоеЗначение;
	Если НЕ ЗначениеЗаполнено(НайденоеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ТипЭлемента = СтрокаЭлемента.ТипЗначения;
	
	Если СтрокаЭлемента.ТипЗначения = Новый ОписаниеТипов("Дата") Тогда
		Попытка
			ЗначениеДата = Дата(НайденоеЗначение);
			СтрокаЭлемента.НайденоеЗначение = ЗначениеДата;
		Исключение
			ПродолжитьВыполнение = Истина;
		КонецПопытки;
	ИначеЕсли ТипЗнч(НайденоеЗначение) = Тип("Строка") И СтрДлина(НайденоеЗначение) = 36 Тогда
		МетаданныеЭлемента = МетаданныеЭлементаПоОписаниюТипов(ТипЭлемента);
		Если МетаданныеЭлемента <> Неопределено Тогда
			Если Метаданные.Справочники.Содержит(МетаданныеЭлемента) Тогда
				Попытка
					УникальныйИдентификаторСсылки = Новый УникальныйИдентификатор(НайденоеЗначение);
					ЗначениеСсылка = Справочники[МетаданныеЭлемента.Имя].ПолучитьСсылку(УникальныйИдентификаторСсылки);
					Если ЗначениеЗаполнено(ЗначениеСсылка) Тогда
						СтрокаЭлемента.НайденоеЗначение = ЗначениеСсылка;
					КонецЕсли;
				Исключение
					ПродолжитьВыполнение = Истина;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаЭлемента.Значение) Тогда
		СтрокаЭлемента.Значение = ТипЭлемента.ПривестиЗначение(СтрокаЭлемента.НайденоеЗначение);
		Если ЗначениеЗаполнено(СтрокаЭлемента.Значение) Тогда
			СтрокаЭлемента.ФлагВыбора = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлЗавершение(ПомещенныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресХраненияДанныхФайла = ПомещенныйФайл.Хранение;
	ОписаниеФайла            = бит_ИскусственныйИнтеллектКлиентСервер.НовоеОписаниеФайлаВыгрузки(ПомещенныйФайл.Имя);
	ОписаниеФайлаДанных      = бит_ИскусственныйИнтеллектКлиентСервер.ЗначениеВJSON(ОписаниеФайла);
	
	ПослеЗагрузкиДанныхФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеВложения()
	
	ТекущиеДанные = Элементы.Вложения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.Файл) Тогда
		ТекстСообщения = НСтр("ru='Не выбрано вложение'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Вложения");
		ОтменитьДействие(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(ТекущиеДанные.Файл, УникальныйИдентификаторВладельцаФайла);
	АдресХраненияДанныхФайла = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
	ОписаниеФайла            = бит_ИскусственныйИнтеллектКлиентСервер.НовоеОписаниеФайлаВыгрузки(ДанныеФайла.ИмяФайла);
	ОписаниеФайлаДанных      = бит_ИскусственныйИнтеллектКлиентСервер.ЗначениеВJSON(ОписаниеФайла);
	
	ПослеЗагрузкиДанныхФайла();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВложения()
	
	Элементы.ВариантВыбораФайлаВложение.Доступность = Ложь;
	Элементы.Вложения.Видимость                     = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// АПК:277-выкл вызов модуля типовой конфигурации
	ИмяСправочникаХранения = РаботаСФайламиСлужебный.ИмяСправочникаХраненияФайлов(Ссылка);
	// АПК:277-вкл
	Если НЕ ЗначениеЗаполнено(ИмяСправочникаХранения) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникХраненияФайлов.Ссылка КАК Файл,
	|	СправочникХраненияФайлов.Описание КАК Описание,
	|	СправочникХраненияФайлов.Расширение КАК Расширение
	|ИЗ
	|	&ИмяСправочника КАК СправочникХраненияФайлов
	|ГДЕ
	|	СправочникХраненияФайлов.ВладелецФайла = &ВладелецФайла
	|	И НЕ СправочникХраненияФайлов.ПометкаУдаления
	|	И &ЭтоГруппа = ЛОЖЬ
	|	И &Служебный = ЛОЖЬ";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяСправочника", "Справочник." + ИмяСправочникаХранения);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Служебный",
		// АПК:277-выкл вызов модуля типовой конфигурации
		?(РаботаСФайламиСлужебный.ЕстьРеквизитСлужебный(ИмяСправочникаХранения),
		// АПК:277-вкл
		"СправочникХраненияФайлов.Служебный", "ЛОЖЬ"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоГруппа", 
		?(Метаданные.Справочники[ИмяСправочникаХранения].Иерархический,
		"СправочникХраненияФайлов.ЭтоГруппа", "ЛОЖЬ"));
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ВладелецФайла", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ВариантВыбораФайлаВложение.Доступность = Истина;
	Элементы.Вложения.Видимость                     = Истина;
	ВариантВыбораФайла                              = 1;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаВложения = Вложения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаВложения, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыборПутиКФайлу(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВариантВыбораФайла = 0;
	ПутьКФалу          = Результат[0];
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыОбъекта()
	
	ЭлементыЗаполнения = ЭлементыИсточника.НайтиСтроки(Новый Структура("ФлагВыбора", Истина));
	Если ЭлементыЗаполнения.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Выберите реквизиты для заполнения'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ЭлементыИсточника");
		ОтменитьДействие(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Массив;
	Для каждого СтрокаЭлемента Из ЭлементыЗаполнения Цикл
		ОписаниеЭлемента = Новый Структура("ИмяЭлемента, ПутьКДанным, Значение");
		ЗаполнитьЗначенияСвойств(ОписаниеЭлемента, СтрокаЭлемента);
		ЗначенияЗаполнения.Добавить(ОписаниеЭлемента);
	КонецЦикла;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступностьЭлементов(Форма)
	
	Элементы               = Форма.Элементы;
	ИндексТекущегоДействия = Форма.ИндексТекущегоДействия;
	
	Элементы.ФормаКомандаНазад.Доступность = (ИндексТекущегоДействия > 0);
	
	Если ИндексТекущегоДействия = 0 Тогда
		Элементы.ГруппаРазделы.ТекущаяСтраница = Элементы.ГруппаВыборФайла;
	ИначеЕсли ИндексТекущегоДействия = 1 И НЕ Форма.РежимВыбораФайла Тогда
		Элементы.ГруппаРазделы.ТекущаяСтраница = Элементы.ГруппаЭлеменыИсточника;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти