
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);

	Элементы.Владелец.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Владелец);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатьяОборотовПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтатьяОборотов) Тогда
		ЗаполнитьРеквизитыПоДаннымСтатьиОборотов();
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура УстановитьКоэффициенты(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПредупреждениеАсинх(НСтр("ru = 'Операция возможна после записи группы'; 
							|en = 'The operation is possible after recording the group'"));
		Возврат;	
	КонецЕсли;
	
	Коэффициент    = 1;
	ТекстПояснения = НСтр("ru = 'Введите число, отличное от нуля, которое будет установлено как значение коэффициента у всех статей, входящих в группу '; 
							|en = 'Enter the number that will be set as the coefficient value for all articles in the group.'");
	
	Результат = Ждать ПредупреждениеАсинх(ТекстПояснения);
	Результат = Ждать ВвестиЧислоАсинх(Коэффициент, Нстр("ru = 'Коэффициент'; en = 'Ratio'"), 9, 4);
	
	Если Результат <> Неопределено И Результат <> 0 Тогда
		УстановитьКоэффициентУПодчиненных(Результат);
					
		ПредупреждениеАсинх(НСтр("ru = 'Обработка завершена'; en = 'Processing is completed'"));
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.бит_СтатьиБюджета"));	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьКоэффициентУПодчиненных(Знач Коэффициент)

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
	Запрос.УстановитьПараметр("Родитель", Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатьиБюджета.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(СтатьиБюджета.СтатьяОборотов.РасходДоход, ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)) КАК РасходДоход
	|ИЗ
	|	Справочник.бит_СтатьиБюджета КАК СтатьиБюджета
	|ГДЕ
	|	СтатьиБюджета.Владелец = &Владелец
	|	И СтатьиБюджета.Родитель В ИЕРАРХИИ(&Родитель)
	|	И НЕ СтатьиБюджета.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		Пока Выборка.Следующий() Цикл
			
			ТекущийОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если Коэффициент = 0 Тогда
				ТекущийОбъект.Коэффициент = ?(Выборка.РасходДоход = Перечисления.бит_РасходДоход.Расходование, -1, 1);
			Иначе	
				ТекущийОбъект.Коэффициент = Коэффициент;
			КонецЕсли;
			
			ТекущийОбъект.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоДаннымСтатьиОборотов()

	РеквизитыСтатьи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СтатьяОборотов, "Наименование, Кодификатор");
	
	Объект.Наименование = РеквизитыСтатьи.Наименование;
	Объект.Кодификатор 	= РеквизитыСтатьи.Кодификатор;
	
	Если Объект.Коэффициент = 0 Тогда
		Объект.Коэффициент = 1;
	КонецЕсли; 
     
КонецПроцедуры

#КонецОбласти

