
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура УВМ_ОбработкаПроведения(Отказ, РежимПроведения)

	Документы.КадровыйПеревод.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

	#Вставка
	//++dar 20221128 (11805)
	Если НЕ Отказ Тогда
		Узел = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоКоду("851027ec-d2af-4799-bb1e-6aeedfaab22f");
		Для Каждого СтрокаТЧ Из Сотрудники Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрокаТЧ.Сотрудник);	
		КонецЦикла;
	КонецЕсли;
	//--dar 20221128 (11805)
	
	//++dar 25.06.25 (255715)
	Если Дата >= УВМ_ОбщиеДоработки.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		ТаблицаДвижений = Новый ТаблицаЗначений;
		ТаблицаДвижений.Колонки.Добавить("Период");
		ТаблицаДвижений.Колонки.Добавить("Физлицо");
		ТаблицаДвижений.Колонки.Добавить("Руководитель");
		ТаблицаДвижений.Колонки.Добавить("КадровыйДокумент");
		ТаблицаДвижений.Колонки.Добавить("ДействуетДо");
		
		Для Каждого СтрокаТЧ Из Сотрудники Цикл
			НовДвижение = ТаблицаДвижений.Добавить();
			НовДвижение.Период = СтрокаТЧ.ДатаНачала;
			НовДвижение.Физлицо = СтрокаТЧ.ФизическоеЛицо;
			НовДвижение.Руководитель = СтрокаТЧ.УВМ_Руководитель;
			НовДвижение.ДействуетДо = СтрокаТЧ.ДатаОкончания;
			НовДвижение.КадровыйДокумент = Ссылка;
		КонецЦикла;
		
		УВМ_ОбщиеДоработки.СформироватьДвиженияПоРуководителям(ТаблицаДвижений);
	КонецЕсли;
	//--dar 25.06.25 (255715)
	#КонецВставки

КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура УВМ_ОбработкаУдаленияПроведения(Отказ)
	//++dar 25.06.25 (255715)
	Если Дата >= УВМ_ОбщиеДоработки.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		УВМ_ОбщиеДоработки.УдалитьДвиженияПоРуководителям(Ссылка);
	КонецЕсли;	
	//--dar 25.06.25 (255715)
КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура УВМ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//++dar 25.06.25 (255715)
	Если Дата >= УВМ_ОбщиеДоработки.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		ПроверяемыеРеквизиты.Добавить("Сотрудники.УВМ_Руководитель");
	КонецЕсли;
	//--dar 25.06.25 (255715)
КонецПроцедуры
