
&НаСервере
Процедура УВМ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//+ dar 20220914 (11805)
	Если РольДоступна("АдминистраторСистемы") Тогда
		УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_Подразделение", Элементы.ОсновныеДанные, "Сотрудник.УВМ_Подразделение", , Элементы.РабочиеМеста);
	КонецЕсли;
	//- dar 20220914 (11805)
	//++dar 13.02.2024 (166614)
	УВМ_РаботаСФормами.СоздатьРеквизит(ЭтотОбъект, "РазрядУВМ", Новый ОписаниеТипов("СправочникСсылка.УВМ_Разряды"));
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "РазрядУВМ", "РабочееМесто", "РазрядУВМ",,,"Разряд (УВМ)", Новый Структура("ТолькоПросмотр", Истина));
	ЗаполнитьРазрядУВМ(Параметры.Ключ.Пустая());
	//--dar 13.02.2024 (166614)
	
	//++dar 25.06.25 (255715)
	Если ТекущаяДатаСеанса() >= УВМ_КэшированиеЗначений.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		УВМ_РаботаСФормами.НоваяКоманда(ЭтотОбъект, "УВМ_ОткрытьСписокРуководителей", "Открыть список руководителей (УВМ)", "УВМ_ОткрытьСписокРуководителей");
		УВМ_РаботаСФормами.НоваяКнопка(ЭтотОбъект, "УВМ_Руководитель", Элементы.ГруппаДополнительныеДанные1, "Руководитель (УВМ)", "УВМ_ОткрытьСписокРуководителей", 2);
		
		УВМ_РаботаСФормами.НоваяКоманда(ЭтотОбъект, "УВМ_ОткрытьСписокПодчиненных", "Открыть список подчиненных (УВМ)", "УВМ_ОткрытьСписокПодчиненных");
		УВМ_РаботаСФормами.НоваяКнопка(ЭтотОбъект, "УВМ_Подчиненные", Элементы.ГруппаДополнительныеДанные1, "Подчиненные (УВМ)", "УВМ_ОткрытьСписокПодчиненных", 2);
	КонецЕсли;
	//--dar 25.06.25 (255715)
	
КонецПроцедуры

//++dar 13.02.2024 (166614)
&НаСервере
Процедура ЗаполнитьРазрядУВМ(ЭтоНовыйОбъект)
	
	Если ЭтоНовыйОбъект Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "РазрядУВМ") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(КадроваяИсторияСотрудников.Регистратор КАК Документ.ПриемНаРаботу).УВМ_Разряд КАК Разряд
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
	|ГДЕ
	|	КадроваяИсторияСотрудников.Сотрудник = &Сотрудник
	|	И КадроваяИсторияСотрудников.Регистратор ССЫЛКА Документ.ПриемНаРаботу
	|	И КадроваяИсторияСотрудников.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Прием)";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЭтотОбъект.РазрядУВМ = Выборка.Разряд;
	КонецЕсли;	
	
КонецПроцедуры
//--dar 13.02.2024 (166614)

//++dar 25.06.25 (255715)
&НаКлиенте
Процедура УВМ_ОткрытьСписокРуководителей(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИзФормыСотрудника", Истина);
	ПараметрыФормы.Вставить("Физлицо", ЭтотОбъект.ФизическоеЛицоСсылка);
	ОткрытьФорму("РегистрСведений.УВМ_Руководители.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УВМ_ОткрытьСписокПодчиненных(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИзФормыСотрудника", Истина);
	ПараметрыФормы.Вставить("Руководитель", ЭтотОбъект.ФизическоеЛицоСсылка);
	ОткрытьФорму("РегистрСведений.УВМ_Руководители.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры
//--dar 25.06.25 (255715)
