////////////////////////////////////////////////////////////////////////////////
// Подсистема "Учет мигрантов".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при заполнения макета отчетной формы после основного заполнения.
// При необходимости можно переопределить заполнения макета другими данными.
//
// Параметры:
//   ПараметрыЗаполнения - Структура - Структура с параметрами для заполнения макета.
//   Действие - СправочникСсылка.бит_ум_ДействияПоСобытиям - текущее действие.
//   Организация - СправочникСсылка.Организации - организация из документа.
//   Сотрудник - СправочникСсылка.Сотрудники - ссылка на обрабатываемого сотрудника.
//   Документ - ДокументСсылка.бит_ум_ОтчетностьПоИР - документ из которого вызвано формирование формы.
//
Процедура СформироватьСтруктуруПараметровЗаполнения(ПараметрыЗаполнения, Действие, Организация, Сотрудник, Документ) Экспорт
	
КонецПроцедуры

// Добавляет в структуру по которой заполняются отчетные формы дополнительные параметры.
// Переданные параметры разбиваются на буквы, для возможности заполнения формы по ячейкам.
// Параметры добавляются в соответствии с правилами:
//   - с типом Дата - добавляется параметр [имя]_краткая в формате dd.MM.yyyy, 
//     [имя]_полная в формате DD и [имя][номер буквы];
//   - с типом Число - добавляется параметр [имя][номер буквы], [имя]_цел для целой части
//     [имя]_дроб для дробной части;
//   - с типом ПеречислениеСсылка - [имя][номер буквы] - строковое представление
//     значения перечисления по буквам в верхнем регистре,
//     [имя][предопределенное имя значения перечисления] со значением Истина;
//   - с типом Строка - [имя] - значение и [имя][номер буквы].
//
// Параметры:
//   СтруктураПараметров - Структура - Структура с параметрами для добавления в структуру заполнения.
//   Действие - СправочникСсылка.бит_ум_ДействияПоСобытиям
//   Организация - СправочникСсылка.Организации
//   Сотрудник - СправочникСсылка.Сотрудники
//   ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//   ПараметрыПечати - ТаблицаЗначений - Таблица с параметрами печати для текущей формы.
//   Документ - ДокументСсылка.бит_ум_ОтчетностьПоИР - Текущий обрабатываемый документ.
//
// Пример:
// // Убираем запятые из местонахождения организации
// Период = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Дата");
// ЮридическийАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Организация, 
// 	ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации"), Период);
// ЮридическийАдрес = СтрЗаменить(СтрЗаменить(ЮридическийАдрес, ", ", " "), ",", " ");
// СтруктураПараметров.Вставить("ОрганизацияМестоНахождения_бс", ЮридическийАдрес);
//
Процедура СформироватьСписокПараметровЗаполнения(СтруктураПараметров, Действие, Организация, Сотрудник, ФизическоеЛицо,
	ПараметрыПечати, Документ) Экспорт

КонецПроцедуры

#КонецОбласти