#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ бит_ум_УчетМигрантовСервер.ПолучитьЛицензию(Истина) Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;	
	
	Если НЕ Объект.ВнешнийМакетИспользовать Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	ВнешнийМакетЗарегистрирован = ВнешнийМакетЗарегистрирован(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УправлениеЭУ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если Объект.ВнешнийМакетИспользовать И НЕ ВнешнийМакетЗарегистрирован Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Макет отсутствует! Загрузите макет для продолжения.'"));
		Модифицированность = Истина;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ЗначениеЗаполнено(АдресФайлаВоВременномХранилище) Тогда
		ТекущийОбъект.ВнешнийМакетХранилище = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище),
			Новый СжатиеДанных(9));
		УдалитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
		АдресФайлаВоВременномХранилище = Неопределено;
	ИначеЕсли ОчиститьХранилищеВнешнегоМакета Тогда 
		ТекущийОбъект.ВнешнийМакетХранилище = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсточникМакетаФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ВыбратьВнешнийМакет();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникМакетаФайлОчистка(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Если НЕ ВнешнийМакетЗарегистрирован Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолеИсточникМакетаФайлОчисткаЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Удалить хранящийся в информационной базе макет?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВыгрузитьНажатие(Элемент)
	
	АдресДанныхВыгружаемогоФайла = "";
	ПолноеИмяФайлаВыбор = "";
	
	АдресДанныхВыгружаемогоФайла = ПолучитьВременныйФайл();
	
	Если НЕ ЗначениеЗаполнено(АдресДанныхВыгружаемогоФайла) Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяВыгружаемогоФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(?(ПустаяСтрока(Объект.Наименование),
		"", Объект.Наименование + ".mxl"));
	
	#Если ВебКлиент Тогда
		
		ПолучитьФайл(АдресДанныхВыгружаемогоФайла, ПолноеИмяВыгружаемогоФайла, Истина);
		
	#Иначе
		
		// инициализируем диалог выбора файлов
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		Диалог.Заголовок = НСтр("ru = 'Укажите файл для сохранения'");
		Диалог.ПроверятьСуществованиеФайла = Истина;
		Диалог.Расширение = "mxl";
		Диалог.Фильтр = НСтр("ru = 'Табличный документ (*.mxl)|*.mxl'");
		
		
		Диалог.ПолноеИмяФайла = ПолноеИмяВыгружаемогоФайла;
		
		Состояние();
		
		// показываем диалог
		Если НЕ Диалог.Выбрать() Тогда
			Возврат;
		Иначе
			ПолноеИмяФайлаВыбор = Диалог.ПолноеИмяФайла;
		КонецЕсли;
		
		ПолучитьИзВременногоХранилища(АдресДанныхВыгружаемогоФайла).Записать(ПолноеИмяФайлаВыбор);
		
	#КонецЕсли	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеЭУ()
	
	Если Модифицированность И ЗначениеЗаполнено(ПолноеИмяЗагруженногоВнешнегоМакета) Тогда
		ИсточникМакетаФайл = ПолноеИмяЗагруженногоВнешнегоМакета;
	Иначе
		ИсточникМакетаФайл = ?(ВнешнийМакетЗарегистрирован, НСтр("ru = 'Макет загружен в ИБ'"), "");
	КонецЕсли;
	
	Элементы.ДекорацияВыгрузить.Видимость = ВнешнийМакетЗарегистрирован И НЕ ОчиститьХранилищеВнешнегоМакета;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВнешнийМакетЗарегистрирован(СсылкаНаОбъект)
	
	Возврат НЕ СсылкаНаОбъект.ВнешнийМакетХранилище.Получить() = Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьВнешнийМакет()
	
	#Если ВебКлиент Тогда
		
		АдресФайлаВоВременномХранилище = "";
		ВыбранноеИмяФайла              = "";
		
		ДополнительныеПараметры = Новый Структура("ВыбранноеИмяФайла", ВыбранноеИмяФайла);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьВнешнийМакетЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		НачатьПомещениеФайла(ОписаниеОповещения, АдресФайлаВоВременномХранилище,,, УникальныйИдентификатор);

	#Иначе
		
		// инициализируем свойства диалога
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок = НСтр("ru = 'Выберите файл табличного документа'");
		Диалог.МножественныйВыбор = Ложь;
		Диалог.ПроверятьСуществованиеФайла = Истина;
		Диалог.Фильтр = НСтр("ru = 'Табличный документ (*.mxl)|*.mxl'");
		
		// показываем диалог
		Если НЕ Диалог.Выбрать() Тогда
			Возврат;
		КонецЕсли;
		
		АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Диалог.ПолноеИмяФайла), Новый УникальныйИдентификатор);
		ПолноеИмяЗагруженногоВнешнегоМакета = Диалог.ПолноеИмяФайла;
		
		ПроверитьВнешнийМакет();
		
	#КонецЕсли
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВнешнийМакетЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;
	
	АдресФайлаВоВременномХранилище = Адрес;
	ПолноеИмяЗагруженногоВнешнегоМакета = ВыбранноеИмяФайла;
	
	ПроверитьВнешнийМакет();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВнешнийМакет()
	
	Состояние("ru = 'Проверка макета...'");
	
	ПрочитатьВнешнийМакет();
	УправлениеЭУ();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьВнешнийМакет()
	
	ИмяФайлаМакета = ПолучитьИмяВременногоФайла("mxl");
	ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище).Записать(ИмяФайлаМакета);
	УдалитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Попытка
		ТабличныйДокумент.Прочитать(ИмяФайлаМакета);
		АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ТабличныйДокумент, Новый УникальныйИдентификатор);
		ВнешнийМакетЗарегистрирован = Истина;
		Модифицированность = Истина;
		ОчиститьХранилищеВнешнегоМакета = Ложь;
	Исключение
		ТекстСообщения = НСтр("ru = 'Неверный формат файла.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		АдресФайлаВоВременномХранилище = Неопределено;
		ПолноеИмяЗагруженногоВнешнегоМакета = Неопределено;
	КонецПопытки;
	
	УдалитьФайлы(ИмяФайлаМакета);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВременныйФайл()
	
	Если ЗначениеЗаполнено(АдресФайлаВоВременномХранилище) Тогда
		ТабличныйДокумент = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	Иначе
		ТабличныйДокумент = Объект.Ссылка.ВнешнийМакетХранилище.Получить();
	КонецЕсли;
	
	Если ТипЗнч(ТабличныйДокумент) <> Тип("ТабличныйДокумент") Тогда
		Возврат "";
	КонецЕсли;
	
	ВремФайл = ПолучитьИмяВременногоФайла();
	
	ТабличныйДокумент.Записать(ВремФайл);
	
	АдресДанныхВыгружаемогоФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВремФайл), Новый УникальныйИдентификатор);
								
	УдалитьФайлы(ВремФайл);							
								
	Возврат АдресДанныхВыгружаемогоФайла;
	
КонецФункции

&НаКлиенте
Процедура ПолеИсточникМакетаФайлОчисткаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьХранилищеВнешнегоМакета = Истина;
	ВнешнийМакетЗарегистрирован = Ложь;
	Модифицированность = Истина;
	УправлениеЭУ();
	
КонецПроцедуры

#КонецОбласти