
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработчикРаспознаванияДокументов = Параметры.ОбработчикРаспознаванияДокументов;
	Если НЕ ПустаяСтрока(ОбработчикРаспознаванияДокументов) Тогда
		РаскраситьКод();
	КонецЕсли;
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьОбработчикРаспознавания(Команда)
	
	РежимРедактирования = НЕ РежимРедактирования;
	Если НЕ РежимРедактирования Тогда
		РаскраситьКод();
	КонецЕсли;
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакончитьРедактирование(Команда)
	
	Закрыть(ОбработчикРаспознаванияДокументов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	Если РежимРедактирования Тогда
		Элементы.СтраницыОбработчикРаспознаванияДокументов.ТекущаяСтраница =
			Элементы.СтраницаОбработчикРаспознаванияДокументов;
	Иначе
		Элементы.СтраницыОбработчикРаспознаванияДокументов.ТекущаяСтраница =
			Элементы.СтраницаОбработчикРаспознаванияДокументовHTML;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РаскраситьКод()
	
	Модуль                                = Обработки.бит_РаскрашиваниеКода.Создать();
	ОбработчикРаспознаванияДокументовHTML = Модуль.РаскраситьТекст(ОбработчикРаспознаванияДокументов);
	
КонецПроцедуры

#КонецОбласти