
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета.
//
// Параметры:
//   Настройки - Коллекция - настройки отчетов и вариантов отчетов конфигурации.
//	 ОписаниеОтчета - СтрокаДерева
//                  - ОбъектМетаданных - описание настроек, метаданные или ссылка отчета.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПроверкаСоответствийВидовЗатрат");
	ОписаниеВарианта.Описание = НСтр("ru = 'Отображает установленное соответствие между видами затрат и статьями регламентированного учета.'");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.бит_КомИнт_МСФО.Подсистемы.Отчеты, "");
	ОписаниеВарианта.Включен = Истина;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли