
#Область ОписаниеПеременных

&НаКлиенте 
Перем мТекФункции; // Хранит текущие значения функций. Клиент.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	ЗаполнитьКэшЗначений();
	
	// Подготовка параметров, необходимых для отображения доп. измерений.
	СоответствиеИмен = Новый Соответствие;
	Для каждого ТекЭлемент Из КэшЗначений.ИзмеренияДоп Цикл
		СтруктураИмен = Новый Структура("ИмяПоля, Префикс, Постфикс", "ЗависимыеОбороты" + ТекЭлемент.Ключ + "_Зависимый", "", " зависимый");
		СоответствиеИмен.Вставить(ТекЭлемент.Ключ, СтруктураИмен);
	КонецЦикла;
	
	// Элементы управления для измерений несуществующих в смежном решении	
	// создаются программно для унификации кода.
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправленияУстановкаЗависимыхОборотов(Элементы);
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправленияУстановкаЗависимыхОборотовДеревоЗависимостей(Элементы,
		ЭтотОбъект);
	
	// Отображение дополнительных измерений в табличных полях.
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект,
		"ДеревоЗависимостей", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
	ПоказатьПрофилиРаспределенияДополнительныхИзмерений("ДеревоЗависимостей");
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект,
		"ЗависимыеОбороты", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект,
		"ЗависимыеОбороты", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений, СоответствиеИмен);
	ПоказатьПрофилиРаспределенияДополнительныхИзмерений("ЗависимыеОбороты");
	
	// Установить активный реквизит.
	СтруктураРеквизитов = Новый Структура("Сценарий");
	бит_РаботаСДиалогамиСервер.АктивизироватьРеквизитВФорме(Объект, ЭтотОбъект, СтруктураРеквизитов);
	
	// Структуры соответствия реквизитов дерева и табличной части.
	ЗаполнитьСтруктурыРеквизитов();
	
	ОбновитьДеревоЗависимостей();
	
	УстановитьФорматКоэффициентаСуммы();
	
	УстановитьУсловноеОформление();
	НастроитьОтображениеЭлементовПодбора(ЭтотОбъект);
	
	СпозиционироватьсяНаСтрокеЗависимостей();
	
	СформироватьКомандыЗаполненияПоСоответствиям();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	                     
	мТекФункции = Новый Структура;
	мТекФункции.Вставить("ФункцияСумма"		, КэшЗначений.ПустаяФункция);
	мТекФункции.Вставить("ФункцияКоличество", КэшЗначений.ПустаяФункция);
	
	бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ДеревоЗависимостей, ДеревоЗависимостей.ПолучитьЭлементы(), Истина);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыбратьПериодЗавершение" И Источник = УникальныйИдентификатор Тогда	
		РедактированиеПериодаЗавершение(Параметр.Результат, Неопределено);
	ИначеЕсли ИмяСобытия = "Запись_СтатьиОборотов" Тогда
		ОбработатьоповещениеОбИзмененииСтатьиОборотов(Источник);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Сценарии.Очистить();
	ТекущийОбъект.СценарииСтрокой = "";
	
	Сценарии = СписокСценариев.ВыгрузитьЗначения();
	бит_РаботаСКоллекциямиКлиентСервер.УдалитьПовторяющиесяЭлементыМассива(Сценарии);
	Если Сценарии.Количество() = 0 Тогда
		ТекущийОбъект.Сценарий = Справочники.СценарииПланирования.ПустаяСсылка();
	Иначе
		ТекущийОбъект.Сценарий = Сценарии[0];
		Если Сценарии.Количество() > 1 Тогда
			Для каждого Сценарий Из Сценарии Цикл
				СтрокаСценария = ТекущийОбъект.Сценарии.Добавить();
				СтрокаСценария.Сценарий = Сценарий;
			КонецЦикла;
			ТекущийОбъект.СценарииСтрокой = СтрСоединить(Сценарии, ";");
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_УстановкаЗависимыхОборотов";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьСостояниеДокумента();
	ЗаполнитьДобавленныеКолонкиТаблиц();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьКоэффициентыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиКРедактированиюКоэффицентов();	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочностьКоэффициентаСуммыПриИзменении(Элемент)
	
	УстановитьФорматКоэффициентаСуммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоЗначений

&НаКлиенте
Процедура ДеревоЗависимостейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ДеревоЗависимостейКодификатор ИЛИ Поле = Элементы.ДеревоЗависимостейТипСтатьиОборотов Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ТекущиеДанные = Элементы.ДеревоЗависимостей.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Отказ = Истина;
		Если Копирование Тогда
			СкопироватьСтрокуДерева(ТекущиеДанные.ПолучитьИдентификатор());
		Иначе
			ДобавитьЗависимуюСтатью(ТекущиеДанные);
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
	
	Если Копирование Тогда
		бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ДеревоЗависимостей ,ДеревоЗависимостей.ПолучитьЭлементы() ,Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет копирование строки дерева с подчиненными строками. 
// 
// Параметры:
//  ИдСтроки - Число
// 
&НаСервере
Процедура СкопироватьСтрокуДерева(Знач ИдСтроки)
	
	ТекущаяСтрока = ДеревоЗависимостей.НайтиПоИдентификатору(ИдСтроки);
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРодитель = ТекущаяСтрока.ПолучитьРодителя();
	Если СтрокаРодитель = Неопределено Тогда
		ТекущаяКоллекция = ДеревоЗависимостей.ПолучитьЭлементы();
	Иначе
		ТекущаяКоллекция = СтрокаРодитель.ПолучитьЭлементы();
	КонецЕсли;
			
	НоваяСтрока = ТекущаяКоллекция.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	
	НовИд = НоваяСтрока.ПолучитьИдентификатор();
	УстановитьНовыйИд(НовИд);
	ЗаполнитьСтрокуЗависимыхОборотов(НовИд);
	
	Элементы.ДеревоЗависимостей.ТекущаяСтрока = НовИд;			
	
	СкопироватьПодчиненныеСтроки(ТекущаяСтрока, НоваяСтрока);
	
КонецПроцедуры

// Процедура выполняет копирование подчиненных строк дерева. 
// 
// Параметры:
//  СтрокаИсточник - ДанныеФормыЭлементДерева.
//  СтрокаПриемник - ДанныеФормыЭлементДерева.
// 
&НаСервере
Процедура СкопироватьПодчиненныеСтроки(СтрокаИсточник, СтрокаПриемник)

	КоллекцияИсточник = СтрокаИсточник.ПолучитьЭлементы();
	КоллекцияПриемник = СтрокаПриемник.ПолучитьЭлементы();
	Для каждого ТекСтрока Из КоллекцияИсточник Цикл
		НоваяСтрока = КоллекцияПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		УстановитьНовыйИд(НоваяСтрока.ПолучитьИдентификатор());
		ЗаполнитьСтрокуЗависимыхОборотов(НоваяСтрока.ПолучитьИдентификатор());
		СкопироватьПодчиненныеСтроки(ТекСтрока, НоваяСтрока);
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоЗависимостей.ТекущиеДанные;
	
	Если НЕ Отказ Тогда   		
		НайтиУдалитьСтрокиТаблицы(ТекущиеДанные.ПолучитьИдентификатор()); 		
		Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ДеревоЗависимостей.ТекущиеДанные;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		бит_МеханизмДопИзмеренийКлиент.ИнициализироватьЗначенияДопИзмерений(ТекущиеДанные, 
																КэшЗначений.ИзмеренияДоп, 
																КэшЗначений.НастройкиИзмерений);
	КонецЕсли;
	
	мТекФункции.ФункцияСумма      = ТекущиеДанные.ФункцияСумма;
	мТекФункции.ФункцияКоличество = ТекущиеДанные.ФункцияКоличество;
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		ТекущиеДанные = Элементы.ДеревоЗависимостей.ТекущиеДанные;
		ЗаполнитьСтрокуЗависимыхОборотов(ТекущиеДанные.ПолучитьИдентификатор());	
		Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейСтатьяОборотовПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоЗависимостей.ТекущиеДанные;
	ПриИзмененииСтатьиОбортов(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейФункцияСуммаПриИзменении(Элемент)
	
	ПроверитьКонтекстФункции("ФункцияСумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейФункцияКоличествоПриИзменении(Элемент)
	
	ПроверитьКонтекстФункции("ФункцияКоличество");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейПриАктивизацииСтроки(Элемент)
	
	ДанныеТекущейСтроки = Элементы.ДеревоЗависимостей.ТекущиеДанные;
	Если ДанныеТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторТекущейСтроки = ДанныеТекущейСтроки.ИД;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	СтрокиПостОбработки.Очистить();
	Для каждого ПеретаскиваемаяСтрока Из ПараметрыПеретаскивания.Значение Цикл
		СтрокиПостОбработки.Добавить(ПеретаскиваемаяСтрока.ИД);
	КонецЦикла;
	
	ОтключитьОбработчикОжидания("ОкончаниеПеретаскиванияСтрокДерева");
	ПодключитьОбработчикОжидания("ОкончаниеПеретаскиванияСтрокДерева",0.1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)

	Копирование = Ложь;
	Если ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование Тогда
		Копирование = Истина;
	ИначеЕсли НЕ ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение Тогда
		Возврат;
	КонецЕсли;
	
	ПеренестиЗависимыеСтроки(ПараметрыПеретаскивания.Значение, Копирование, Строка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодборСтатей

&НаКлиенте
Процедура ПодборСтатейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПодборСтатей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ОбработкаПодбораСтатьиОборотов(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборСтатейОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтатьиОборотовИерархия = СтатьиОборотовВИерархии(ПараметрыПеретаскивания.Значение);
	Для каждого СтатьяОборотов Из СтатьиОборотовИерархия Цикл
		ОбработкаПодбораСтатьиОборотов(СтатьяОборотов);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ПодключаемыеКомандыЭлементовТаблицФормы

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыЭлемента = ПараметрыЭлементаСтроки(Элемент);
	
	Если бит_МеханизмДопИзмеренийКлиент.ЭтоАналитикаБанковскийСчет(ПараметрыЭлемента.ИмяПоля,
		КэшЗначений.НастройкиИзмерений) Тогда
	  	бит_РаботаСДиалогамиКлиент.ВыбратьБанковскийСчетБезВладельца(ПараметрыЭлемента.ТекущиеДанные, СтандартнаяОбработка,
																	ПараметрыЭлемента.ИмяПоля);
	Иначе
		бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ПараметрыЭлемента.ТекущиеДанные,
			ПараметрыЭлемента.ИмяПоля, СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиПриИзменении(Элемент)
	
	ОчиститьДанныеСвязанногоПоляПрофиля(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ПараметрыЭлемента = ПараметрыЭлементаСтроки(Элемент);
	
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ПараметрыЭлемента.ТекущиеДанные,
		ПараметрыЭлемента.ИмяПоля, СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиОчистка(Элемент, СтандартнаяОбработка)
	
	ПараметрыЭлемента = ПараметрыЭлементаСтроки(Элемент);
	
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент, ПараметрыЭлемента.ТекущиеДанные,
		ПараметрыЭлемента.ИмяПоля, СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПрофильРаспределенияСтрокиПриИзменении(Элемент)
	
	ОчиститьДанныеСвязанногоПоляПрофиля(Элемент);
	
КонецПроцедуры
	
#КонецОбласти 

&НаКлиенте
Процедура КомандаНастройкиПериода(Команда)
	
	ПараметрыПередачи = Новый Структура(); 
	ПараметрыПередачи.Вставить("ДатаНачала", 	Объект.ДатаНачала);
	ПараметрыПередачи.Вставить("ДатаОкончания", Объект.ДатаОкончания);
	ПараметрыПередачи.Вставить("Контекст", 		УникальныйИдентификатор);
	
	бит_ОбщегоНазначенияКлиент.ВыбратьПериод(ПараметрыПередачи);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУровеньВниз(Команда)
	
	ТекущаяСтрока   = Элементы.ДеревоЗависимостей.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено 
		  Тогда
		  
	    РодительСтроки = ТекущаяСтрока.ПолучитьРодителя();
		Если РодительСтроки = Неопределено Тогда
			РодительСтроки = ДеревоЗависимостей;
		КонецЕсли;	
		
		КоллекцияРодитель = РодительСтроки.ПолучитьЭлементы();
		Если КоллекцияРодитель.Количество()>=2  Тогда
		
			ТекущийИндекс = КоллекцияРодитель.Индекс(ТекущаяСтрока);
			ТекущийИндекс = ТекущийИндекс-1;
			
			Если ТекущийИндекс >= 0 Тогда
			  	
			  СкопироватьИерархию(КоллекцияРодитель[ТекущийИндекс],ТекущаяСтрока);
		      КоллекцияРодитель.Удалить(КоллекцияРодитель.Индекс(ТекущаяСтрока));
			  
			  Модифицированность = Истина;

			КонецЕсли; 
			
		КонецЕсли; 
		 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУровеньВверх(Команда)
	
	ТекущаяСтрока  = Элементы.ДеревоЗависимостей.ТекущиеДанные;
	РодительСтроки = ТекущаяСтрока.ПолучитьРодителя();
	Если ТекущаяСтрока <> Неопределено 
		И РодительСтроки <> Неопределено Тогда
		
		РодительРодителя = РодительСтроки.ПолучитьРодителя();
		
		Если РодительРодителя <> Неопределено  Тогда
			
			ИндексВставки = РодительРодителя.ПолучитьЭлементы().Индекс(РодительСтроки)+1;
			СкопироватьИерархию(РодительРодителя, ТекущаяСтрока, ИндексВставки, Истина);
			
		Иначе	
			
			ИндексВставки = ДеревоЗависимостей.ПолучитьЭлементы().Индекс(РодительСтроки)+1;			
			СкопироватьИерархию( ДеревоЗависимостей, ТекущаяСтрока, ИндексВставки, Истина);
			
		КонецЕсли; 
		
		КоллекцияРодитель = РодительСтроки.ПолучитьЭлементы();
		КоллекцияРодитель.Удалить(КоллекцияРодитель.Индекс(ТекущаяСтрока));
		
		Модифицированность = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьТабЧасть(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьИзменениеТабличнойЧасти", ЭтотОбъект);
	
	ПараметрыФормы = ПараметрыИзмененияТаблицыДокумента();
	ОткрытьФорму("Обработка.бит_ИзменениеТабличнойЧастиДокументаБюджетирования.Форма", 
		ПараметрыФормы, ЭтотОбъект,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьГруппу(Команда)
	
	РазвернутьДеревоЗависимостейИерархически();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьГруппу(Команда)
	
	СвернутьДеревоЗависимостейИерархически();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьОсновную(Команда)
	
	ДобавитьОсновнуюСтатью();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодбор(Команда)
	
	РежимПодбораСтатей = НЕ РежимПодбораСтатей;
	НастроитьОтображениеЭлементовПодбора(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаЗаполнитьИзСоответствия(Команда)
	
	Если ДеревоЗависимостей.ПолучитьЭлементы().Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИДВидаСоответствия = Команда.Имя;
	ИДВидаСоответствия = СтрЗаменить(ИДВидаСоответствия, "КомандаЗаполнитьИзСоответствия_", "");
	ИДВидаСоответствия = СтрЗаменить(ИДВидаСоответствия, "_", "-");
	Зависимости = ЗависимостиИзСоответствия(ИДВидаСоответствия);
	
	Для каждого СтрокаОсновнойСтатьи Из ДеревоЗависимостей.ПолучитьЭлементы() Цикл
		ОсновнаяСтатья  = СтрокаОсновнойСтатьи.СтатьяОборотов;
		ЗависимыеСтатьи = Зависимости.Получить(ОсновнаяСтатья);
		Если ЗависимыеСтатьи = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого ЗависимаяСтатья Из ЗависимыеСтатьи Цикл
			ДобавитьЗависимуюСтатью(СтрокаОсновнойСтатьи, ЗависимаяСтатья);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеСлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура РедактированиеПериодаЗавершение(ПериодРезультат, ДополнительныеДанные)

	Если ПериодРезультат <> Неопределено Тогда
	
		Объект.ДатаНачала    = ПериодРезультат.ДатаНачала;
		Объект.ДатаОкончания = ПериодРезультат.ДатаОкончания;
		
		ЭтотОбъект.Модифицированность = Истина; 		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшЗначений()

	КэшЗначений = Новый Структура;
		
	// Пустая пользовательская функция.
	КэшЗначений.Вставить("ПустаяФункция", Справочники.бит_ПользовательскиеФункции.ПустаяСсылка());	
	
	// Настройки из модуля объекта.
	КэшЗначений.Вставить("Измерения",
		бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Произвольные", "Синоним"));
	КэшЗначений.Вставить("ИзмеренияДоп",
		бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним"));
	КэшЗначений.Вставить("НастройкиИзмерений",
		бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений());
	КэшЗначений.Вставить("НастройкаАналитик", НастройкаАналитик());
	                 	      
КонецПроцедуры

&НаСервере
Функция НастройкаАналитик()
	
	НастройкаАналитик = Новый Соответствие;
	
	ФиксированныеАналитики = Новый СписокЗначений;
	ФиксированныеАналитики.Добавить("ЦФО");
	ФиксированныеАналитики.Добавить("Организация");
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		ФиксированныеАналитики.Добавить("Проект");
		ФиксированныеАналитики.Добавить("Контрагент");
		ФиксированныеАналитики.Добавить("ДоговорКонтрагента");
		ФиксированныеАналитики.Добавить("НоменклатурнаяГруппа");
		ФиксированныеАналитики.Добавить("БанковскийСчет");
	КонецЕсли;
	
	Измерения = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("все", "имя");
	Для каждого КлючИЗначение Из Измерения Цикл
		ИмяАналитики = КлючИЗначение.Ключ;
		Если ИмяАналитики = "Сценарий"
			ИЛИ ИмяАналитики = "СтатьяОборотов" Тогда
			Продолжить;
		КонецЕсли;
		
		НастройкаАналитики = Новый Структура;
		НастройкаАналитики.Вставить("ВидАналитики", Неопределено);
		
		ВидАналитики = Неопределено;
		Если ФиксированныеАналитики.НайтиПоЗначению(ИмяАналитики) <> Неопределено Тогда
			НастройкаАналитики.ВидАналитики = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик[ИмяАналитики];
		Иначе
			НастройкаИзмерения = КэшЗначений.НастройкиИзмерений.Получить(ИмяАналитики);
			Если НастройкаИзмерения <> Неопределено Тогда
				НастройкаАналитики.ВидАналитики = НастройкаИзмерения.Аналитика;
			КонецЕсли;
		КонецЕсли;
		
		НастройкаАналитик.Вставить(ИмяАналитики, НастройкаАналитики);
	КонецЦикла;
	
	Возврат НастройкаАналитик;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтруктурыРеквизитов()
 
 	Измерения = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("все", "имя");
	РеквизитыСтроки   = Новый Структура;
	РеквизитыРодителя = Новый Структура;
	
	// Измерения бюджетирования.
	РеквизитыРодителя.Вставить("СтатьяОборотов", "СтатьяОборотов");
	РеквизитыСтроки.Вставить("СтатьяОборотов",   "СтатьяОборотов_Зависимый");
	Для каждого НастройкаАналитики Из КэшЗначений.НастройкаАналитик Цикл
		ИмяАналитики = НастройкаАналитики.Ключ;
		
		РеквизитыРодителя.Вставить(ИмяАналитики, ИмяАналитики);
		РеквизитыСтроки.Вставить(ИмяАналитики,   ИмяАналитики + "_Зависимый");
		
		ИмяПрофиляРаспределения = ИмяАналитики + "_ПрофильРаспределения";
		РеквизитыСтроки.Вставить(ИмяПрофиляРаспределения, ИмяПрофиляРаспределения);
	КонецЦикла;
	
	// Специфические реквизиты зависимых оборотов.
	РеквизитыСтроки.Вставить("ПрофильРаспределения",	"ПрофильРаспределения");
	РеквизитыСтроки.Вставить("КоэффициентКоличество",	"КоэффициентКоличество");
	РеквизитыСтроки.Вставить("КоэффициентСумма",		"КоэффициентСумма");
	РеквизитыСтроки.Вставить("РеквизитКоличество",		"РеквизитКоличество");
	РеквизитыСтроки.Вставить("РеквизитСумма",			"РеквизитСумма");
	РеквизитыСтроки.Вставить("ФункцияСумма",			"ФункцияСумма");
	РеквизитыСтроки.Вставить("ФункцияКоличество",		"ФункцияКоличество");
	РеквизитыСтроки.Вставить("УчетСумма",				"УчетСумма");
	РеквизитыСтроки.Вставить("УчетКоличество",			"УчетКоличество");
	РеквизитыСтроки.Вставить("ИгнорироватьПриоритеты",	"ИгнорироватьПриоритеты");
	
КонецПроцедуры

&НаСервере
Процедура ОформитьТаблицу(СтатьяОборотов = Неопределено) 
	
	Если СтатьяОборотов = Неопределено Тогда
	    // Формирование массива статей, по которым нужно добавить элементы УО.
		ТаблицаЗо = Объект.ЗависимыеОбороты.Выгрузить();
		МассивСтатей = ТаблицаЗо.ВыгрузитьКолонку("СтатьяОборотов");
		Для каждого ЭлементМассиваЗависимых Из ТаблицаЗо.ВыгрузитьКолонку("СтатьяОборотов_Зависимый") Цикл
			МассивСтатей.Добавить(ЭлементМассиваЗависимых);  		
		КонецЦикла;
		бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСтатей);
		
		СписокСтатей.ЗагрузитьЗначения(МассивСтатей);
	Иначе // Работаем только с одной статьей оборотов.
		МассивСтатей = Новый Массив;
		НайденноеЗначение = СписокСтатей.НайтиПоЗначению(СтатьяОборотов);
		Если НайденноеЗначение = Неопределено Тогда			
			МассивСтатей.Добавить(СтатьяОборотов);
			СписокСтатей.Добавить(СтатьяОборотов);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыОформления = бит_РаботаСДиалогамиСервер.НовыеПараметрыОформленияСтатей();
	ПараметрыОформления.ПрефиксТаблицы = "ДеревоЗависимостей";
	
	Отбор = Новый Структура;
	Отбор.Вставить("ЛевоеЗначение", Новый ПолеКомпоновкиДанных(Элементы.ДеревоЗависимостейИД.ПутьКДанным));
	Отбор.Вставить("ВидСравнения",  ВидСравненияКомпоновкиДанных.Равно);
	Отбор.Вставить("ПравоеЗначение", Новый ПолеКомпоновкиДанных("ИдентификаторТекущейСтроки"));
	ПараметрыОформления.ДополнительныйОтборВыводаНадписи.Добавить(Отбор);
	
	ПоляОформления = Новый Структура;
	Для каждого ЭлементСтруктуры Из КэшЗначений.Измерения Цикл
		ИмяИзмерения = ЭлементСтруктуры.Ключ;
		ПоляОформления.Вставить("Учет_" + ИмяИзмерения, ИмяИзмерения + "_ПрофильРаспределения");
	КонецЦикла;
	ПараметрыОформления.ПоляОформления = ПоляОформления;
	
	бит_РаботаСДиалогамиСервер.ОформитьТаблицуПоСтатьямОборотов(УсловноеОформление, МассивСтатей, ПараметрыОформления);
		
КонецПроцедуры

// Процедура выполняет проверку пригодности использования пользовательской функции 
// для расчета зависимых оборотов. 
// 
// Параметры:
//  ИмяРеквизита - Строка.
// 
&НаКлиенте
Процедура ПроверитьКонтекстФункции(ИмяРеквизита)
	
	ТекущиеДанные = Элементы.ДеревоЗависимостей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные[ИмяРеквизита]) Тогда 
		
		Если НЕ КонтекстФункцииКорректен(ТекущиеДанные.ПолучитьИдентификатор(), ИмяРеквизита) Тогда
			
			ТекущиеДанные[ИмяРеквизита] = мТекФункции[ИмяРеквизита];
			
			ТекстСообщения = НСтр("ru='Для подбора доступны только пользовательские функции контекста ""Зависимые обороты"".';
								  |en='Only user functions of the context ""Dependent turnover"" are available for selection'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			
		Иначе
			
			// Профили распределения по аналитикам не используются для функций.
			Для каждого НастройкаАналитики Из КэшЗначений.НастройкаАналитик Цикл
				ИмяАналитики = НастройкаАналитики.Ключ;
				ТекущиеДанные[ИмяАналитики + "_ПрофильРаспределения"] = Неопределено;
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЕсли; 
	
	мТекФункции[ИмяРеквизита] = ТекущиеДанные[ИмяРеквизита];
	
КонецПроцедуры

// Процедура копирует строку дерева значений вместе с подчиненными строками. Рекурсия.
// 
// Параметры:
//  СтрокаРодитель    - СтрокаДереваЗначений - Строка дерева, которой подчиняется строка копирования.
//  СтрокаКопирования - СтрокаДереваЗначений - копируемая строка дерева.
// 
&НаКлиенте
Процедура СкопироватьИерархию(СтрокаРодитель,СтрокаКопирования, ИндексВставки = Неопределено, УровеньВверх = Ложь)
	
	Если ТипЗнч(ИндексВставки) = Тип("Число") Тогда
		НоваяСтрока = СтрокаРодитель.ПолучитьЭлементы().Вставить(ИндексВставки);
	Иначе	
		НоваяСтрока = СтрокаРодитель.ПолучитьЭлементы().Добавить();
	КонецЕсли;
	
	Если СтрокаКопирования.УровеньСтроки = 1 И УровеньВверх Тогда 
		
		СвойстваИсключения = "РеквизитСумма, РеквизитКоличество, КоэффициентСумма, КоэффициентКоличество, ФункцияСумма, ФункцияКоличество";
		
	Иначе
		
		СвойстваИсключения = "";
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКопирования,,СвойстваИсключения);
	
	Если УровеньВверх Тогда
		НоваяСтрока.УровеньСтроки = СтрокаКопирования.УровеньСтроки - 1;
	Иначе
		НоваяСтрока.УровеньСтроки = СтрокаКопирования.УровеньСтроки + 1;
	КонецЕсли;

	Для каждого СтрокаПодчиненная Из СтрокаКопирования.ПолучитьЭлементы() Цикл
		
		СкопироватьИерархию(НоваяСтрока, СтрокаПодчиненная,,УровеньВверх);
		
	КонецЦикла; 
	
	НайтиУдалитьСтрокиТаблицы(СтрокаКопирования.ПолучитьИдентификатор());
	
	ЗаполнитьСтрокуЗависимыхОборотов(НоваяСтрока.ПолучитьИдентификатор());

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФормы

&НаСервере
Процедура СинхронизироватьРеквизитыТаблицыИДерева(ИдТекущейСтрокиТч, ИдТекущейСтрокиДерева, Реквизиты, Приемник)
	
	ТекущиеДанныеТч 	= Объект.ЗависимыеОбороты.НайтиПоИдентификатору(ИдТекущейСтрокиТч);	
	ТекущиеДанныеДерева = ДеревоЗависимостей.НайтиПоИдентификатору(ИдТекущейСтрокиДерева);	
	Если ТекущиеДанныеТч = Неопределено ИЛИ ТекущиеДанныеДерева = Неопределено Тогда 		
		Возврат;    		
	КонецЕсли;
	
 	Для каждого КлючИЗначение Из Реквизиты Цикл
	 
		ИмяРеквДерево  = КлючИЗначение.Ключ;
	 	ИмяРеквТаблица = КлючИЗначение.Значение;
	 
	 	ЗначениеТаблица = ТекущиеДанныеТч[ИмяРеквТаблица];
	 	ЗначениеДерево  = ТекущиеДанныеДерева[ИмяРеквДерево];
		
		Если ЗначениеТаблица <> ЗначениеДерево Тогда
		 
		 	Если Приемник = "Таблица" Тогда
			 	ТекущиеДанныеТч[ИмяРеквТаблица] 	= ЗначениеДерево;
		 	ИначеЕсли Приемник = "Дерево" Тогда	
			 	ТекущиеДанныеДерева[ИмяРеквДерево]  = ЗначениеТаблица;
		 	КонецЕсли; 
		 
	 	КонецЕсли; 
	 
 	КонецЦикла; 	
 
КонецПроцедуры

&НаСервере
Процедура ИзменениеСтатьиОборотов(Знач ИдТекущейСтроки, Знач ЗаполнятьПоУмолчанию, НастройкиСтатейОборотов = Неопределено, ПрименятьОформление = Истина)

	ТекущиеДанныеДерева = ДеревоЗависимостей.НайтиПоИдентификатору(ИдТекущейСтроки);	
	Если ТекущиеДанныеДерева = Неопределено Тогда 		
		Возврат;    		
	КонецЕсли;
	
	СтатьяОборотов  = ТекущиеДанныеДерева.СтатьяОборотов;
	НастройкиСтатьи = НастройкиСтатьиОборотов(СтатьяОборотов, НастройкиСтатейОборотов);
	
	ТекущиеДанныеДерева.УчетСумма      = НастройкиСтатьи.Учет_Сумма;
	ТекущиеДанныеДерева.УчетКоличество = НастройкиСтатьи.Учет_Количество;
	
	Если ЗначениеЗаполнено(СтатьяОборотов) Тогда
		
		ТекущиеДанныеДерева.Кодификатор = ?(ЗначениеЗаполнено(НастройкиСтатьи.Кодификатор)
											,НастройкиСтатьи.Кодификатор
											,НастройкиСтатьи.Код);
		
		ТекущиеДанныеДерева.ТипСтатьиОборотов = НастройкиСтатьи.ТипСтатьи;
		
		Если ТекущиеДанныеДерева.ПолучитьРодителя() <> Неопределено Тогда
			Если ЗаполнятьПоУмолчанию Тогда

				Если ТекущиеДанныеДерева.УчетКоличество Тогда
					ТекущиеДанныеДерева.КоэффициентКоличество = Объект.КоэффициентКоличество;
					ТекущиеДанныеДерева.РеквизитКоличество = Перечисления.бит_РеквизитыДляРасчетаЗависимостей.Количество;
				Иначе
					ТекущиеДанныеДерева.КоэффициентКоличество = 0;
					ТекущиеДанныеДерева.РеквизитКоличество = Перечисления.бит_РеквизитыДляРасчетаЗависимостей.ПустаяСсылка();
				КонецЕсли;
				
				Если ТекущиеДанныеДерева.УчетСумма Тогда
					ТекущиеДанныеДерева.КоэффициентСумма = Объект.КоэффициентСумма;
					ТекущиеДанныеДерева.РеквизитСумма = Перечисления.бит_РеквизитыДляРасчетаЗависимостей.Сумма
				Иначе
					ТекущиеДанныеДерева.КоэффициентСумма = 0;
					ТекущиеДанныеДерева.РеквизитСумма = Перечисления.бит_РеквизитыДляРасчетаЗависимостей.ПустаяСсылка();
				КонецЕсли;
								
			КонецЕсли; 
		КонецЕсли; 
		
		бит_МеханизмДопИзмерений.ИнициализироватьЗначенияДопИзмерений(ТекущиеДанныеДерева, КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
		
		бит_Бюджетирование.УстановитьИспользованиеАналитики(ТекущиеДанныеДерева, НастройкиСтатьи, КэшЗначений.Измерения);
		
	КонецЕсли;
	
	Если ПрименятьОформление Тогда
		ОформитьТаблицу(СтатьяОборотов);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НастройкиСтатьиОборотов(СтатьяОборотов, НастройкиСтатейОборотов)
	
	Если ТипЗнч(НастройкиСтатейОборотов) = Тип("Соответствие") Тогда
		НастройкиСтатьи = НастройкиСтатейОборотов.Получить(СтатьяОборотов);
		Если НастройкиСтатьи <> Неопределено Тогда
			Возврат НастройкиСтатьи;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.бит_СтатьиОборотов.ПолучитьНастройки(СтатьяОборотов);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоПоРодителю(ИдТекСтрокиДерева, ТекИД_Родитель, НастройкиСтатейОборотов, ПрименятьОформление = Истина)

	// Текущая строка дерева.
	СтрокаВерх = ДеревоЗависимостей.НайтиПоИдентификатору(ИдТекСтрокиДерева);
	Если СтрокаВерх = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	ВеткаДереваВерх = СтрокаВерх.ПолучитьЭлементы();
		
	// Добавление подчиненных строк.
	НайденныеСтрокиЗвОб = Объект.ЗависимыеОбороты.НайтиСтроки(Новый Структура("ИД_Родитель", ТекИД_Родитель));
	Если НайденныеСтрокиЗвОб.Количество() > 0 Тогда
		
		НовыйУровень = СтрокаВерх.УровеньСтроки + 1;
					
		Для каждого СтрокаТаблицыЗвОб Из НайденныеСтрокиЗвОб Цикл
			
			СтрокаДерева 	 = ВеткаДереваВерх.Добавить();
			ТекИдентификатор = СтрокаДерева.ПолучитьИдентификатор();
			
			СтрокаДерева.УровеньСтроки = НовыйУровень;
			СтрокаДерева.ИД 		   = СтрокаТаблицыЗвОб.ИД;
			СинхронизироватьРеквизитыТаблицыИДерева(СтрокаТаблицыЗвОб.ПолучитьИдентификатор(), ТекИдентификатор, РеквизитыСтроки, "Дерево");
			
			// Если есть следующий уровень подчиненных.
			НайденныеСтрокиРодителиЗвОб = Объект.ЗависимыеОбороты.НайтиСтроки(Новый Структура("ИД_Родитель", СтрокаТаблицыЗвОб.ИД));
			Если НайденныеСтрокиРодителиЗвОб.Количество() > 0 Тогда     			
				
				СтрокаДерева.ЕстьПодчиненные = Истина;
				
				СтрокаРодительЗаОб = НайденныеСтрокиРодителиЗвОб[0];
				СинхронизироватьРеквизитыТаблицыИДерева(СтрокаРодительЗаОб.ПолучитьИдентификатор(), ТекИдентификатор, РеквизитыРодителя, "Дерево");
				ИзменениеСтатьиОборотов(ТекИдентификатор, Ложь,, ПрименятьОформление);
				
				ЗаполнитьДеревоПоРодителю(ТекИдентификатор, СтрокаРодительЗаОб.Ид_Родитель, НастройкиСтатейОборотов, ПрименятьОформление);
				
			Иначе
				
				ИзменениеСтатьиОборотов(ТекИдентификатор, Ложь, НастройкиСтатейОборотов, ПрименятьОформление);
				
			КонецЕсли; 			
	
		КонецЦикла; 
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоЗависимостей()
	
	ДеревоЗависимостей.ПолучитьЭлементы().Очистить();
	
	ВеткаДереваВерх = ДеревоЗависимостей.ПолучитьЭлементы();
	
	ТаблицаСтрокЗо          = Объект.ЗависимыеОбороты.Выгрузить();
	ИдСтрок 	            = ТаблицаСтрокЗо.ВыгрузитьКолонку("ИД");
	СтатьиОборотов          = ТаблицаСтрокЗо.ВыгрузитьКолонку("СтатьяОборотов");
	ЗависимыеСтатьиОборотов = ТаблицаСтрокЗо.ВыгрузитьКолонку("СтатьяОборотов_Зависимый");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтатьиОборотов, ЗависимыеСтатьиОборотов);
	
	ТаблицаСтрокЗо.Свернуть("ИД_Родитель");
	
	ИдРодителей             = ТаблицаСтрокЗо.ВыгрузитьКолонку("ИД_Родитель");
	НастройкиСтатейОборотов = Справочники.бит_СтатьиОборотов.НастройкиСтатейОборотов(СтатьиОборотов);
	
	// Для всех строк-родителей. 
	Для каждого ИдРодитель Из ИдРодителей Цикл
		
		// Если строка подчинена не "нулевой строке".
		Если ИдСтрок.Найти(ИдРодитель) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Запись строк дерева первого уровня.
		НайденныеСтрокиРодителиЗвОб = Объект.ЗависимыеОбороты.НайтиСтроки(Новый Структура("ИД_Родитель", ИдРодитель));
		Если НайденныеСтрокиРодителиЗвОб.Количество() > 0 Тогда
		    СтрокаРодительЗаОб = НайденныеСтрокиРодителиЗвОб[0];
			
			СтрокаДерева 	   = ВеткаДереваВерх.Добавить();
			ТекИдентификатор   = СтрокаДерева.ПолучитьИдентификатор();
			
			СтрокаДерева.ИД              = СтрокаРодительЗаОб.ИД_Родитель;
			СтрокаДерева.ЕстьПодчиненные = Истина;
			СинхронизироватьРеквизитыТаблицыИДерева(СтрокаРодительЗаОб.ПолучитьИдентификатор(), ТекИдентификатор, РеквизитыРодителя, "Дерево");
			ИзменениеСтатьиОборотов(ТекИдентификатор, Ложь, НастройкиСтатейОборотов, Ложь);
					
			ЗаполнитьДеревоПоРодителю(ТекИдентификатор, СтрокаРодительЗаОб.Ид_Родитель, НастройкиСтатейОборотов, Ложь);
		КонецЕсли;
			
	КонецЦикла;
	
	ОформитьТаблицу();

КонецПроцедуры

// Процедура создает строку табличной части ЗависимыеОбороты 
// по данным строки дерева и по данным родителя строки дерева.
// 
// Параметры:
//  ИдТекСтрокиДерева - Число.
// 
&НаСервере
Процедура ЗаполнитьСтрокуЗависимыхОборотов(Знач ИдТекСтрокиДерева)
	
	// Текущая строка дерева.
	ТекСтрокаДерева = ДеревоЗависимостей.НайтиПоИдентификатору(ИдТекСтрокиДерева);
	Если ТекСтрокаДерева = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	ТекВеткаДерева = ТекСтрокаДерева.ПолучитьЭлементы();
	
	СтрокаРодитель = ТекСтрокаДерева.ПолучитьРодителя();
	
	Если ТекСтрокаДерева.УровеньСтроки > 0
		И СтрокаРодитель <> Неопределено Тогда
		 
		// Поиск по ИД или создание новой строки в табличной части ЗависимыеОбороты.
		 
		НайденныеСтрокиТаблицыЗо = Объект.ЗависимыеОбороты.НайтиСтроки(Новый Структура("ИД", ТекСтрокаДерева.ИД));
		Если НайденныеСтрокиТаблицыЗо.Количество() = 0 Тогда
			
			СтрокаТаблицыЗо = Объект.ЗависимыеОбороты.Добавить();
			СтрокаТаблицыЗо.ИД 			= ТекСтрокаДерева.ИД;
			СтрокаТаблицыЗо.ИД_Родитель = СтрокаРодитель.ИД;	 	
		 
		Иначе
			
			СтрокаТаблицыЗо = НайденныеСтрокиТаблицыЗо[0];	
			
		КонецЕсли;
		 		 
		// Синхронизация значений текущей строки дерева и строки табличной части.
		СинхронизироватьРеквизитыТаблицыИДерева(СтрокаТаблицыЗо.ПолучитьИдентификатор()
		 										, ТекСтрокаДерева.ПолучитьИдентификатор()
												, РеквизитыСтроки
												, "Таблица");
		 
		// Синхронизация значений строки-родителя дерева и строки табличной части.
		СинхронизироватьРеквизитыТаблицыИДерева(СтрокаТаблицыЗо.ПолучитьИдентификатор()
		 										, СтрокаРодитель.ПолучитьИдентификатор()
												, РеквизитыРодителя
												, "Таблица");
		 
	КонецЕсли; 	 
	 
	Для каждого СтрокаДерева Из ТекВеткаДерева Цикл  	 
		ЗаполнитьСтрокуЗависимыхОборотов(СтрокаДерева.ПолучитьИдентификатор());  	 
	КонецЦикла; 
	 
КонецПроцедуры

// Процедура выполняет поиск строк табличной части ЗависимыеОбороты
// ,соответствующей строке дерева значений и удаляет найденные строки.
// 
// Параметры:
//  ИдТекСтрокиДерева - Число.
// 
&НаСервере
Процедура НайтиУдалитьСтрокиТаблицы(Знач ИдТекСтрокиДерева)

	Если ТипЗнч(ИдТекСтрокиДерева) <> Тип("Число") Тогда
		Возврат;
	КонецЕсли;
				
	СтрокаВерх = ДеревоЗависимостей.НайтиПоИдентификатору(ИдТекСтрокиДерева);
	Если СтрокаВерх = Неопределено Тогда
		Возврат;		
	КонецЕсли;
		
	НайденныеСтрокиТаблицыЗо = Объект.ЗависимыеОбороты.НайтиСтроки(Новый Структура("ИД", СтрокаВерх.ИД));
	Для каждого СтрокаТаблицаЗо Из НайденныеСтрокиТаблицыЗо Цикл
		ИндексУдаляемой = Объект.ЗависимыеОбороты.Индекс(СтрокаТаблицаЗо);
		Объект.ЗависимыеОбороты.Удалить(ИндексУдаляемой);	
	КонецЦикла;
	
	Для каждого СтрокаДерева Из СтрокаВерх.ПолучитьЭлементы() Цикл 		
		НайтиУдалитьСтрокиТаблицы(СтрокаДерева.ПолучитьИдентификатор()); 		
	КонецЦикла;	

КонецПроцедуры

// Устанавливает Ид в строке таб. части БДДС.
// 
// Параметры:
//  ИдТекСтрокиДерева - Число
// 
&НаСервере
Процедура УстановитьНовыйИд(Знач ИдТекСтрокиДерева)
	
	ТекущаяСтрока = ДеревоЗависимостей.НайтиПоИдентификатору(ИдТекСтрокиДерева);
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	ТекущаяСтрока.ИД = Строка(Новый УникальныйИдентификатор);
	Для каждого СтрокаДерева Из ТекущаяСтрока.ПолучитьЭлементы() Цикл
		УстановитьНовыйИД(СтрокаДерева.ПолучитьИдентификатор());
	КонецЦикла; 
	 
КонецПроцедуры

// Функция проверяет контекст функции.
// 
// Параметры:
//  ИдТекСтрокиДерева - Число
//  ИмяРеквизита	  - Строка
//  
// Возвращаемое значение:
//   Булево
// 
&НаСервере
Функция КонтекстФункцииКорректен(Знач ИдТекСтрокиДерева, Знач ИмяРеквизита)

	Результат = Ложь;
	
	ТекущаяСтрока = ДеревоЗависимостей.НайтиПоИдентификатору(ИдТекСтрокиДерева);
	Если ТекущаяСтрока <> Неопределено Тогда
		Результат = ТекущаяСтрока[ИмяРеквизита].Контекст = Перечисления.бит_КонтекстыВыполненияПользовательскихФункций.ЗависимыеОбороты;			
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ПриИзмененииСтатьиОбортов(СтрокаСтатьиОборотов)
	
	бит_МеханизмДопИзмеренийКлиент.ИнициализироватьЗначенияДопИзмерений(СтрокаСтатьиОборотов, 
																КэшЗначений.ИзмеренияДоп, 
																КэшЗначений.НастройкиИзмерений);
	ИзменениеСтатьиОборотов(СтрокаСтатьиОборотов.ПолучитьИдентификатор(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораСтатьиОборотов(СтатьяОборотов)
	
	Если СпособДобавленияСтатей = "Основная" Тогда
		ДобавитьОсновнуюСтатью(СтатьяОборотов);
	ИначеЕсли СпособДобавленияСтатей = "Зависимая" Тогда
		СтрокаОсновнойСтатьи = Элементы.ДеревоЗависимостей.ТекущиеДанные;
		Если СтрокаОсновнойСтатьи = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ДобавитьЗависимуюСтатью(СтрокаОсновнойСтатьи, СтатьяОборотов);
		Элементы.ДеревоЗависимостей.ТекущаяСтрока = СтрокаОсновнойСтатьи.ПолучитьИдентификатор();
	ИначеЕсли СпособДобавленияСтатей = "Обе" Тогда
		СтрокаОсновнойСтатьи = ДобавитьОсновнуюСтатью(СтатьяОборотов);
		ДобавитьЗависимуюСтатью(СтрокаОсновнойСтатьи, СтатьяОборотов);
		Элементы.ДеревоЗависимостей.ТекущаяСтрока = СтрокаОсновнойСтатьи.ПолучитьИдентификатор();
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьОсновнуюСтатью(СтатьяОборотов = Неопределено)
	
	НоваяСтрока         = ДеревоЗависимостей.ПолучитьЭлементы().Добавить();
	ИдентификаторСтроки = НоваяСтрока.ПолучитьИдентификатор();
	УстановитьНовыйИд(ИдентификаторСтроки);
	Элементы.ДеревоЗависимостей.ТекущаяСтрока = ИдентификаторСтроки;
	ЗаполнитьСтрокуЗависимыхОборотов(ИдентификаторСтроки);
	Модифицированность = Истина;
	
	Если СтатьяОборотов <> Неопределено Тогда
		НоваяСтрока.СтатьяОборотов = СтатьяОборотов;
		ПриИзмененииСтатьиОбортов(НоваяСтрока);
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьЗависимуюСтатью(СтрокаОсновнойСтатьи, СтатьяОборотов = Неопределено)
	
	ТекУровеньСтроки = СтрокаОсновнойСтатьи.УровеньСтроки;
	ВеткаДерева      = СтрокаОсновнойСтатьи.ПолучитьЭлементы();
	НоваяСтрока      = ВеткаДерева.Добавить(); 				
	НовИдентификатор = НоваяСтрока.ПолучитьИдентификатор();
	
	НоваяСтрока.УровеньСтроки = ТекУровеньСтроки + 1;
	УстановитьНовыйИд(НовИдентификатор);
	
	Если СтатьяОборотов <> Неопределено Тогда
		НоваяСтрока.СтатьяОборотов = СтатьяОборотов;
		ПриИзмененииСтатьиОбортов(НоваяСтрока);
	КонецЕсли;
	
	Элементы.ДеревоЗависимостей.ТекущаяСтрока = НовИдентификатор;
	ЗаполнитьСтрокуЗависимыхОборотов(НовИдентификатор);
	
	Элементы.ДеревоЗависимостей.Развернуть(СтрокаОсновнойСтатьи.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтатьиОборотовВИерархии(СтатиОборотовГруппыИЭлементы)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатьиОборотов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
	|ГДЕ
	|	СтатьиОборотов.Ссылка В ИЕРАРХИИ(&СтатиОборотовГруппыИЭлементы)
	|	И НЕ СтатьиОборотов.ПометкаУдаления
	|	И НЕ СтатьиОборотов.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатьиОборотов.РеквизитДопУпорядочивания";
	Запрос.УстановитьПараметр("СтатиОборотовГруппыИЭлементы", СтатиОборотовГруппыИЭлементы);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ПерейтиКРедактированиюКоэффицентов()

	Оповещение = Новый ОписаниеОповещения("ПерейтиКРедактированиюКоэффицентовЗавершение", ЭтотОбъект); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КоэффициентКоличество"	   , Объект.КоэффициентКоличество);
	ПараметрыФормы.Вставить("КоэффициентСумма"		   , Объект.КоэффициентСумма);
	ПараметрыФормы.Вставить("ТочностьКоэффициентаСуммы", Объект.ТочностьКоэффициентаСуммы);
	ОткрытьФорму("Документ.бит_УстановкаЗависимыхОборотов.Форма.Коэффициенты", ПараметрыФормы, ЭтотОбъект,,,, Оповещение);

КонецПроцедуры 

// Процедура окончание процедуры "ПерейтиКРедактированиюКоэффицентов". 
//
// Параметры:
//  Результат - Структура.
//  ДополнительныеПараметры - Структура.
//
&НаКлиенте 
Процедура ПерейтиКРедактированиюКоэффицентовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли; 
	
	ПерейтиКРедактированиюКоэффицентовЗавершениеНаСервере(Результат);
	Элементы.ДеревоЗависимостей.Развернуть(ДеревоЗависимостей.ПолучитьЭлементы()[0].ПолучитьИдентификатор(), Истина);
	
КонецПроцедуры


// Процедура окончание процедуры "ПерейтиКРедактированиюКоэффицентов". 
//
// Параметры:
//  Результат - Структура.
//  ДополнительныеПараметры - Структура.
//
&НаСервере 
Процедура ПерейтиКРедактированиюКоэффицентовЗавершениеНаСервере(Результат)
		
	ЗаполнитьЗначенияСвойств(Объект, Результат);
	Модифицированность = Истина;
	СформироватьНадписьКоэффициенты();
	
	ПерезаполнитьДеревоЗависимостей();    
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьДеревоЗависимостей()
	
	Для каждого СтрокаЗависимых Из Объект.ЗависимыеОбороты Цикл
		Если СтрокаЗависимых.УчетКоличество Тогда
			СтрокаЗависимых.КоэффициентКоличество = Объект.КоэффициентКоличество;
		Иначе
			СтрокаЗависимых.КоэффициентКоличество = 0;
		КонецЕсли;
		Если СтрокаЗависимых.УчетСумма Тогда
			СтрокаЗависимых.КоэффициентСумма = Объект.КоэффициентСумма;
		Иначе
			СтрокаЗависимых.КоэффициентСумма = 0;
		КонецЕсли;
	КонецЦикла; 
	ОбновитьДеревоЗависимостей();

КонецПроцедуры

&НаСервере
Процедура СформироватьНадписьКоэффициенты()

	ФорматКоэффициентаСуммы = Документы.бит_УстановкаЗависимыхОборотов.ФорматКоэффициентаСуммы(Объект.ТочностьКоэффициентаСуммы, Истина); 
	Шаблон = НСтр("ru='Коэффициенты: количество %1; сумма %2';en='Coefficients: number %1; the sum of %2'");	
	НадписьКоэффициенты = СтрШаблон(Шаблон, Формат(Объект.КоэффициентКоличество, "ЧЦ=10; ЧДЦ=4; ЧН=0,0000"),
								Формат(Объект.КоэффициентСумма, ФорматКоэффициентаСуммы));
	
КонецПроцедуры 

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	УстановитьСостояниеДокумента();
	ЗаполнитьДобавленныеКолонкиТаблиц();
	ЗагрузитьСписокСценариев();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект 	 = Форма.Объект;
	
	ЭтоПереносНаДругойСценарий = (Объект.ВидОперации =
		ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкиЗависимыхОборотов.ОтражениеНаДругомСценарии"));
	Элементы.Сценарий.АвтоОтметкаНезаполненного             = ЭтоПереносНаДругойСценарий;
	Если НЕ Элементы.Сценарий.АвтоОтметкаНезаполненного Тогда
		Элементы.Сценарий.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	Элементы.ЗависимыйСценарий.Видимость                 = ЭтоПереносНаДругойСценарий;
	Элементы.ЗависимыйСценарий.АвтоОтметкаНезаполненного = ЭтоПереносНаДругойСценарий;
	
	СпособыДобавленияСтатей = Элементы.СпособДобавленияСтатей.СписокВыбора;
	СпособыДобавленияСтатей.Очистить();
	СпособыДобавленияСтатей.Добавить("Основная",  НСтр("ru='Основную'"));
	СпособыДобавленияСтатей.Добавить("Зависимая", НСтр("ru='Зависимую'"));
	Если ЭтоПереносНаДругойСценарий Тогда
		СпособыДобавленияСтатей.Добавить("Обе", НСтр("ru='Обе'")); 
	ИначеЕсли Форма.СпособДобавленияСтатей = "Обе" Тогда
		Форма.СпособДобавленияСтатей = "";
	КонецЕсли;
	
	Если ПустаяСтрока(Форма.СпособДобавленияСтатей) Тогда
		Форма.СпособДобавленияСтатей = "Основная";
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СведеньяОСтатьяхОборотов = ПолучитьСведенияОСтатьяхОборотов(
					ОбщегоНазначения.ВыгрузитьКолонку(Объект.ЗависимыеОбороты, "СтатьяОборотов_Зависимый", Истина));
					
	Для каждого СтрокаТаблицы Из Объект.ЗависимыеОбороты Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СтатьяОборотов_Зависимый) Тогда
			СтрокаТаблицы.УчетКоличество= Ложь;
			СтрокаТаблицы.УчетСумма		= Ложь;
		Иначе
			СведенияОСтатье = СведеньяОСтатьяхОборотов.Получить(СтрокаТаблицы.СтатьяОборотов_Зависимый);
			Если СведенияОСтатье <> Неопределено Тогда
				СтрокаТаблицы.УчетКоличество= СведенияОСтатье.Учет_Количество;
				СтрокаТаблицы.УчетСумма		= СведенияОСтатье.Учет_Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСведенияОСтатьяхОборотов(Знач СписокСтатей)
	
	ИменаРеквизитов = "Учет_Количество, Учет_Сумма";
	
	СписокСтатейБезПустыхЗначений = ОбщегоНазначения.СкопироватьРекурсивно(СписокСтатей);
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(СписокСтатейБезПустыхЗначений,
		Справочники.бит_СтатьиОборотов.ПустаяСсылка());
	СведеньяОСтатьяхОборотов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СписокСтатейБезПустыхЗначений, ИменаРеквизитов);
	
	Возврат СведеньяОСтатьяхОборотов;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьоповещениеОбИзмененииСтатьиОборотов(СтатьяОборотов);
	
	ПараметрыОтбора = Новый Структура("СтатьяОборотов_Зависимый", СтатьяОборотов);
	СтрокиДляАктуализации = Объект.ЗависимыеОбороты.НайтиСтроки(ПараметрыОтбора);
	Если СтрокиДляАктуализации.Количество() > 0 Тогда
		СведенияОСтатье = ПолучитьСведенияОСтатьеОборотов(СтатьяОборотов);
		Для каждого СтрокаТаблицы Из СтрокиДляАктуализации Цикл
			Если СведенияОСтатье <> Неопределено Тогда
				СтрокаТаблицы.УчетКоличество= СведенияОСтатье.Учет_Количество;
				СтрокаТаблицы.УчетСумма		= СведенияОСтатье.Учет_Сумма;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСведенияОСтатьеОборотов(Знач СтатьяОборотов)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатьяОборотов, "Учет_Количество, Учет_Сумма");
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ШрифтЗаголовка = ШрифтыСтиля.бит_ШрифтТекстаОбычныйПолужирный;
	
	// Первый уровень дерева.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКодификатор");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейТипСтатьиОборотов");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейСтатьяОборотов");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейПрофильРаспределения");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейРеквизитСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКоэффициентСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейФункцияСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейРеквизитКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКоэффициентКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейФункцияКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейЦФО");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейОрганизация");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Равно, 0);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтЗаголовка);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейПрофильРаспределения");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейРеквизитСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКоэффициентСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейФункцияСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейРеквизитКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКоэффициентКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейФункцияКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейИгнорироватьПриоритеты");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Равно, 0);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	УстановитьПоясненияПолейДереваЗависимостей();
	УстановитьУсловноеОформлениеПрофилейРаспределения();
	УстановитьУсловноеОфомлениеПоКоличествуИСумме();
	
	// Шрифт подчиненных строк.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКодификатор");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейТипСтатьиОборотов");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейСтатьяОборотов");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейПрофильРаспределения");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейЦФО");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейОрганизация");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейИД");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Больше, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.ЕстьПодчиненные", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтЗаголовка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПоясненияПолейДереваЗависимостей()
	
	УстановитьНадписьПояснениеПоля(Элементы.ДеревоЗависимостейНадписьЗначениеАналитики.Имя, НСтр("ru='Аналитика'"));
	УстановитьНадписьПояснениеПоля(Элементы.ДеревоЗависимостейНадписьПрофильРаспределения.Имя,
		НСтр("ru='Профиль распределения'"));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНадписьПояснениеПоля(ИмяПоля, ТекстНадписи)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ИмяПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",
			бит_ОбщегоНазначенияПовтИсп.ЦветСтиля("ЦветНедоступногоТекста"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.бит_ЗаголовкиСтрокШрифт);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", ТекстНадписи + ":");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеПрофилейРаспределения()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля,
		Элементы.ДеревоЗависимостейНадписьПрофильРаспределения.Имя);
	ШаблонПоляПрофиля = "ДеревоЗависимостей%1_ПрофильРаспределения";
	Для каждого НастройкаАналитики Из КэшЗначений.НастройкаАналитик Цикл
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля,
			СтрШаблон(ШаблонПоляПрофиля, НастройкаАналитики.Ключ));
	КонецЦикла;
	ГруппаИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор, "ПустаяСтатьяИлиВедетсяУчет",
					ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
		"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
		"ДеревоЗависимостей.ФункцияКоличество", ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
		"ДеревоЗависимостей.ФункцияСумма", ВидСравненияКомпоновкиДанных.Заполнено);
    ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля,
		Элементы.ДеревоЗависимостейНадписьЗначениеАналитики.Имя);
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля,
		Элементы.ДеревоЗависимостейНадписьПрофильРаспределения.Имя);
	ШаблонПоляПрофиля = "ДеревоЗависимостей%1_ПрофильРаспределения";
	Для каждого НастройкаАналитики Из КэшЗначений.НастройкаАналитик Цикл
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля,
			СтрШаблон(ШаблонПоляПрофиля, НастройкаАналитики.Ключ));
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ИспользоватьПрофилиРаспределенияАналитик", ВидСравненияКомпоновкиДанных.Равно, Ложь);
    ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ШаблонПоляАналитики    = "ДеревоЗависимостей%1";
	ШаблонРеквизитаПрофиля = "ДеревоЗависимостей.%1_ПрофильРаспределения";
	Для каждого НастройкаАналитики Из КэшЗначений.НастройкаАналитик Цикл
		ИмяАналитики = НастройкаАналитики.Ключ;
		ЭлементУО    = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, СтрШаблон(ШаблонПоляАналитики, ИмяАналитики));
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"ИспользоватьПрофилиРаспределенияАналитик", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			СтрШаблон(ШаблонРеквизитаПрофиля, ИмяАналитики), ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<Задан профиль>'"));
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОфомлениеПоКоличествуИСумме()
	
	ИменаРесурсов = Новый Массив;
	ИменаРесурсов.Добавить("Количество");
	ИменаРесурсов.Добавить("Сумма");
	
	СвязанныеПоля = Новый Структура;
	СвязанныеПоля.Вставить("Реквизит",    НСтр("ru='Источник'"));
	СвязанныеПоля.Вставить("Коэффициент", НСтр("ru='Коэффициент'"));
	СвязанныеПоля.Вставить("Функция",     НСтр("ru='Функция'"));
	
	Для каждого ИмяРесурса Из ИменаРесурсов Цикл
		ЗаблокироватьПоляКоличестваИСуммы(ИмяРесурса, СвязанныеПоля);
		УстановитьПредставлениеПустыхПолей(ИмяРесурса, СвязанныеПоля);
		УстановитьОтметкуНезаполненногоКоличестваИСуммы(ИмяРесурса);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьПоляКоличестваИСуммы(ИмяРесурса, СвязанныеПоля)
	
	ЭлементУО              = УсловноеОформление.Элементы.Добавить();
	ШаблонБлокируемогоПоля = "ДеревоЗависимостей%1%2";
	Для каждого КлючИЗначение Из СвязанныеПоля Цикл
		ИмяПоля = СтрШаблон(ШаблонБлокируемогоПоля, КлючИЗначение.Ключ, ИмяРесурса);
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ИмяПоля);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Больше, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.Учет" + ИмяРесурса, ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.СтатьяОборотов", ВидСравненияКомпоновкиДанных.Заполнено);
	
	Элемент = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоЗависимостей.ИД");
	Элемент.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ИдентификаторТекущейСтроки");
	
	ПараметрыОформленияСкрытыхПолей =
		бит_РаботаСДиалогамиСервер.ПараметрыУсловногоОформленияНедоступныхПолейСтатейОборотов();
	ПараметрыОформленияСкрытыхПолей.Вставить("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Лево);
	Для каждого ПараметрОформления Из ПараметрыОформленияСкрытыхПолей Цикл
		ЭлементУО.Оформление.УстановитьЗначениеПараметра(ПараметрОформления.Ключ, ПараметрОформления.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеПустыхПолей(ИмяРесурса, СвязанныеПоля)
	
	ШаблонОформляемогоПоля = "ДеревоЗависимостей%1%2";
	
	Для каждого ПолеСвязи Из СвязанныеПоля Цикл
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		
		ИмяПоляСвязи = ПолеСвязи.Ключ; 
		
		ПолеОформления = СтрШаблон(ШаблонОформляемогоПоля, ИмяПоляСвязи, ИмяРесурса);
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ПолеОформления);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Больше, 0);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"ДеревоЗависимостей." + ИмяПоляСвязи + ИмяРесурса, ВидСравненияКомпоновкиДанных.НеЗаполнено);
		ПроверяемаяПара = "";
		Если ИмяПоляСвязи = "Коэффициент" Тогда
			ПроверяемаяПара = "Функция";
		ИначеЕсли ИмяПоляСвязи = "Функция" Тогда
			ПроверяемаяПара = "Коэффициент";
		КонецЕсли;
		Если НЕ ПустаяСтрока(ПроверяемаяПара) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
				"ДеревоЗависимостей." + ПроверяемаяПара + ИмяРесурса, ВидСравненияКомпоновкиДанных.НеЗаполнено);
		КонецЕсли;
		ГруппаИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор, "ПустаяСтатьяИлиВедетсяУчет",
						ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
			"ДеревоЗависимостей.Учет" + ИмяРесурса, ВидСравненияКомпоновкиДанных.Равно, Истина);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
			"ДеревоЗависимостей.СтатьяОборотов", ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",
			бит_ОбщегоНазначенияПовтИсп.ЦветСтиля("ЦветНедоступногоТекста"));
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.бит_ЗаголовкиСтрокШрифт);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", ПолеСвязи.Значение);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Лево);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтметкуНезаполненногоКоличестваИСуммы(ИмяРесурса)
	
	ЭлементУО = НовоеОформлениеНезаполненногоПоля(ИмяРесурса);
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейРеквизит" + ИмяРесурса);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.Реквизит" + ИмяРесурса, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	ЭлементУО = НовоеОформлениеНезаполненногоПоля(ИмяРесурса);
	СвязанныеПоля = Новый Массив;
	СвязанныеПоля.Добавить("Коэффициент");
	СвязанныеПоля.Добавить("Функция");
	ШаблонОформляемогоПоля = "ДеревоЗависимостей%1%2";
	Для каждого ИмяПоляСвязи Из СвязанныеПоля Цикл
		ПолеОформления = СтрШаблон(ШаблонОформляемогоПоля, ИмяПоляСвязи, ИмяРесурса);
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ПолеОформления);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"ДеревоЗависимостей." + ИмяПоляСвязи + ИмяРесурса, ВидСравненияКомпоновкиДанных.НеЗаполнено);
		ПроверяемаяПара = ?(ИмяРесурса = "Количество", "Сумма", "Количество");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"ДеревоЗависимостей." + ИмяПоляСвязи + ПроверяемаяПара, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НовоеОформлениеНезаполненногоПоля(ИмяРесурса)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Больше, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.Учет" + ИмяРесурса, ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	Возврат ЭлементУО;
	
КонецФункции

&НаСервере
Процедура УстановитьФорматКоэффициентаСуммы()

	ФорматКоэффициентаСуммы = Документы.бит_УстановкаЗависимыхОборотов.ФорматКоэффициентаСуммы(Объект.ТочностьКоэффициентаСуммы); 
	Элементы.ДеревоЗависимостейКоэффициентСумма.Формат = ФорматКоэффициентаСуммы;
	Элементы.ЗависимыеОборотыКоэффициентСумма.Формат   = ФорматКоэффициентаСуммы;
	
	СформироватьНадписьКоэффициенты();

КонецПроцедуры

&НаСервере
Функция ПараметрыИзмененияТаблицыДокумента()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Команда",			"бит_УстановкаЗависимыхОборотов");
	ПараметрыФормы.Вставить("Объект",			Объект.Ссылка);
	ПараметрыФормы.Вставить("ИмяТабличнойЧасти","ЗависимыеОбороты");
	ПараметрыФормы.Вставить("ТабличнаяЧасть",	 
		ПоместитьВоВременноеХранилище(ЗависимыеОборотыТаблицей(РеквизитФормыВЗначение("ДеревоЗависимостей")),
										УникальныйИдентификатор));
		
	Возврат ПараметрыФормы;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗависимыеОборотыТаблицей(Дерево, ЗависимыеОборотыТаблицей = Неопределено)
	
	Если ЗависимыеОборотыТаблицей = Неопределено Тогда
		ЗависимыеОборотыТаблицей = Новый ТаблицаЗначений;
		Для каждого Колонка Из Дерево.Колонки Цикл
			ЗависимыеОборотыТаблицей.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого СтрокаДерева Из Дерево.Строки Цикл
		Если ЗначениеЗаполнено(СтрокаДерева.СтатьяОборотов) Тогда
			ЗаполнитьЗначенияСвойств(ЗависимыеОборотыТаблицей.Добавить(), СтрокаДерева);
		КонецЕсли;
		ЗависимыеОборотыТаблицей(СтрокаДерева, ЗависимыеОборотыТаблицей);
	КонецЦикла;
	
	Возврат ЗависимыеОборотыТаблицей;
	
КонецФункции

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ОбработатьИзменениеТабличнойЧасти(Результат, Дополнительно) Экспорт

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	ИмяТабличнойЧасти		  = Результат.ИмяТабличнойЧасти;
	АдресВоВременномХранилище = Результат.АдресВоВременномХранилище;
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресВоВременномХранилище) Тогда
		Возврат;
	КонецЕсли; 
	
	ОбработатьИзменениеТабличнойЧастиНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеТабличнойЧастиНаСервере(Знач ПараметрыОповещения)

	ИмяТабличнойЧасти		  = ПараметрыОповещения.ИмяТабличнойЧасти;
	АдресВоВременномХранилище = ПараметрыОповещения.АдресВоВременномХранилище;
		
	Модифицированность = Истина;
	ДанныеЗаполнения   = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	ЗаполнитьДанныеДереваПоИзменениямТабличнойЧасти(ДеревоЗависимостей, ДанныеЗаполнения);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДереваПоИзменениямТабличнойЧасти(ДеревоЗависимостей, ДанныеЗаполнения)
	
	Для каждого ЭлементДерева Из ДеревоЗависимостей.ПолучитьЭлементы() Цикл
		ИдЭлемента = ЭлементДерева.ИД;
		Если НЕ ПустаяСтрока(ИдЭлемента) Тогда
			СтрокаЗаполнения = ДанныеЗаполнения.Найти(ИдЭлемента, "ИД");
			Если СтрокаЗаполнения <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ЭлементДерева, СтрокаЗаполнения);
				ЗаполнитьСтрокуЗависимыхОборотов(ЭлементДерева.ПолучитьИдентификатор());
			КонецЕсли;
		КонецЕсли;
		ЗаполнитьДанныеДереваПоИзменениямТабличнойЧасти(ЭлементДерева, ДанныеЗаполнения);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СпозиционироватьсяНаСтрокеЗависимостей()

	НомерТекущейСтроки = Параметры.НомерТекущейСтроки;
	Если НомерТекущейСтроки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ЗависимыеОбороты.Количество() < НомерТекущейСтроки Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицы = Объект.ЗависимыеОбороты[НомерТекущейСтроки - 1];
	Отбор = Новый Структура;
	Отбор.Вставить("ИД", СтрокаТаблицы.ИД);
	СтрокаДерева = бит_РаботаСКоллекциямиКлиентСервер.НайтиЭлементДерева(ДеревоЗависимостей.ПолучитьЭлементы(), Отбор,
																			Истина);
	Если СтрокаДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ДеревоЗависимостей.ТекущаяСтрока = СтрокаДерева.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоЗависимостейИерархически(Знач СтрокаДанных = Неопределено)
	
	Если СтрокаДанных <> Неопределено Тогда
		Элементы.ДеревоЗависимостей.Развернуть(СтрокаДанных, Истина);
		Возврат;
	КонецЕсли;
	
	// Все первого уровня
	ВсеСтроки = Элементы.ДеревоЗависимостей;
	Для каждого ДанныеСтроки Из ДеревоЗависимостей.ПолучитьЭлементы() Цикл 
		ВсеСтроки.Развернуть(ДанныеСтроки.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоЗависимостейИерархически(Знач СтрокаДанных = Неопределено)
	
	Если СтрокаДанных <> Неопределено Тогда
		Элементы.ДеревоЗависимостей.Свернуть(СтрокаДанных);
		Возврат;
	КонецЕсли;
	
	// Все первого уровня
	ВсеСтроки = Элементы.ДеревоЗависимостей;
	Для каждого ДанныеСтроки Из ДеревоЗависимостей.ПолучитьЭлементы() Цикл 
		ВсеСтроки.Свернуть(ДанныеСтроки.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыЭлементаСтроки(Элемент)
	
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("ИмяПоля");
	ПараметрыЭлемента.Вставить("ТекущиеДанные");
	
	Конейнер = КонейнерЭлемента(Элемент);
	ПараметрыЭлемента.ИмяПоля       = СтрЗаменить(Элемент.Имя, Конейнер.Имя, "");
	ПараметрыЭлемента.ТекущиеДанные = Конейнер.ТекущиеДанные;
	
	Возврат ПараметрыЭлемента;
	
КонецФункции

&НаКлиенте
Функция КонейнерЭлемента(Элемент)
	
	Конейнер = Элемент.Родитель;
	Если ТипЗнч(Конейнер) = Тип("ГруппаФормы") Тогда
		Возврат КонейнерЭлемента(Конейнер);
	КонецЕсли;
	
	Возврат Конейнер;
	
КонецФункции

&НаСервере
Процедура ПоказатьПрофилиРаспределенияДополнительныхИзмерений(ИмяТабличногоПоля)

	ШаблонЗаголовка = НСтр("ru='Профиль распределения %1'");
	Для каждого КлючИЗначение Из КэшЗначений.ИзмеренияДоп Цикл
		ИмяИзмерения   = КлючИЗначение.Ключ;
		ИмяКолонки     = ИмяТабличногоПоля + ИмяИзмерения + "_ПрофильРаспределения";
		ТекущаяКолонка = Элементы.Найти(ИмяКолонки);
		
		Если ТекущаяКолонка <> Неопределено Тогда
			ТекущаяНастройка = КэшЗначений.НастройкиИзмерений[ИмяИзмерения];
			Если ТекущаяНастройка <> Неопределено Тогда
				ТекущаяКолонка.Видимость = Истина;
				ТекущаяКолонка.Заголовок = СтрШаблон(ШаблонЗаголовка, ТекущаяНастройка.Синоним);
			Иначе
				ТекущаяКолонка.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеСвязанногоПоляПрофиля(Элемент)
	
	ОкончаниеПрофиль  = "_ПрофильРаспределения";
	ПараметрыЭлемента = ПараметрыЭлементаСтроки(Элемент);
	ИмяАналитики      = ПараметрыЭлемента.ИмяПоля;
	Если СтрЗаканчиваетсяНа(ИмяАналитики, ОкончаниеПрофиль) Тогда
		ИмяСвязанногоПоля = СтрЗаменить(ИмяАналитики, ОкончаниеПрофиль, "");
	Иначе
		ИмяСвязанногоПоля = ИмяАналитики + ОкончаниеПрофиль;
	КонецЕсли;
		
	Если НЕ ПараметрыЭлемента.ТекущиеДанные.Свойство(ИмяСвязанногоПоля) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЭлемента.ТекущиеДанные[ИмяСвязанногоПоля] = Неопределено;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьОтображениеЭлементовПодбора(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	ЭлементыФормы.ПодборСтатей.Видимость = Форма.РежимПодбораСтатей;
	ЭлементыФормы.СпособДобавленияСтатей.Видимость = Форма.РежимПодбораСтатей;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандыЗаполненияПоСоответствиям()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыСоответствийАналитик.Ссылка КАК ВидСоответствия,
	|	ВидыСоответствийАналитик.Наименование КАК Наименование
	|ИЗ
	|	Справочник.бит_ВидыСоответствийАналитик КАК ВидыСоответствийАналитик
	|ГДЕ
	|	НЕ ВидыСоответствийАналитик.ПометкаУдаления
	|	И (ВидыСоответствийАналитик.ЛеваяАналитика_1 = &ХарактеристикаСтатьяОборотов
	|			ИЛИ ВидыСоответствийАналитик.ЛеваяАналитика_2 = &ХарактеристикаСтатьяОборотов
	|			ИЛИ ВидыСоответствийАналитик.ЛеваяАналитика_3 = &ХарактеристикаСтатьяОборотов)
	|	И (ВидыСоответствийАналитик.ПраваяАналитика_1 = &ХарактеристикаСтатьяОборотов
	|			ИЛИ ВидыСоответствийАналитик.ПраваяАналитика_2 = &ХарактеристикаСтатьяОборотов
	|			ИЛИ ВидыСоответствийАналитик.ПраваяАналитика_3 = &ХарактеристикаСтатьяОборотов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыСоответствийАналитик.Приоритет";
	Запрос.УстановитьПараметр("ХарактеристикаСтатьяОборотов", ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов);
	ВидыСоответствий = Запрос.Выполнить().Выбрать();
	
	ШаблонИмениКоманды = "КомандаЗаполнитьИзСоответствия_%1";
	Пока ВидыСоответствий.Следующий() Цикл
		ИДСтрокой    = СтрЗаменить(ВидыСоответствий.ВидСоответствия.UUID(), "-", "_");
		ИмяКоманды   = СтрШаблон(ШаблонИмениКоманды, ИДСтрокой);
		КомандаФормы = Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = ВидыСоответствий.Наименование;
		КомандаФормы.Действие  = "Подключаемый_КомандаЗаполнитьИзСоответствия";
		КомандаФормы.Подсказка = НСтр("ru='Заполнить из соответствия'");
		КомандаФормы.ИзменяетСохраняемыеДанные = Истина;
		
		КнопкаФормы = ЭтотОбъект.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"),
						ЭтотОбъект.Элементы.ДеревоЗависимостейПодменюЗаполнить);
		КнопкаФормы.ИмяКоманды = ИмяКоманды;
		КнопкаФормы.Вид        = ВидКнопкиФормы.ОбычнаяКнопка;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗависимостиИзСоответствия(ИДВидаСоответствия)
	
	Зависимости = Новый Соответствие;
	
	ВидСоответствия = Справочники.бит_ВидыСоответствийАналитик.ПолучитьСсылку(
						Новый УникальныйИдентификатор(ИДВидаСоответствия));
						
	ТекущиеЗависимости = ТекущиеЗависимостиПервогоУровня();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗависимыеОбороты.ОсновнаяСтатья КАК ОсновнаяСтатья,
	|	ЗависимыеОбороты.ЗависимаяСтатья КАК ЗависимаяСтатья
	|ПОМЕСТИТЬ ЗависимыеОбороты
	|ИЗ
	|	&ЗависимыеОбороты КАК ЗависимыеОбороты";
	Запрос.УстановитьПараметр("ЗависимыеОбороты", ТекущиеЗависимости);
	Запрос.Выполнить();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СоответствияАналитик.ЛеваяАналитика_1 ССЫЛКА Справочник.бит_СтатьиОборотов
	|			ТОГДА СоответствияАналитик.ЛеваяАналитика_1
	|		КОГДА СоответствияАналитик.ЛеваяАналитика_2 ССЫЛКА Справочник.бит_СтатьиОборотов
	|			ТОГДА СоответствияАналитик.ЛеваяАналитика_2
	|		КОГДА СоответствияАналитик.ЛеваяАналитика_3 ССЫЛКА Справочник.бит_СтатьиОборотов
	|			ТОГДА СоответствияАналитик.ЛеваяАналитика_3
	|	КОНЕЦ КАК ОсновнаяСтатья,
	|	ВЫБОР
	|		КОГДА СоответствияАналитик.ПраваяАналитика_1 ССЫЛКА Справочник.бит_СтатьиОборотов
	|			ТОГДА СоответствияАналитик.ПраваяАналитика_1
	|		КОГДА СоответствияАналитик.ПраваяАналитика_2 ССЫЛКА Справочник.бит_СтатьиОборотов
	|			ТОГДА СоответствияАналитик.ПраваяАналитика_2
	|		КОГДА СоответствияАналитик.ПраваяАналитика_3 ССЫЛКА Справочник.бит_СтатьиОборотов
	|			ТОГДА СоответствияАналитик.ПраваяАналитика_3
	|	КОНЕЦ КАК ЗависимаяСтатья
	|ПОМЕСТИТЬ СоответствияАналитик
	|ИЗ
	|	РегистрСведений.бит_СоответствияАналитик.СрезПоследних(&Период, ВидСоответствия = &ВидСоответствия) КАК СоответствияАналитик
	|ГДЕ
	|	СоответствияАналитик.Используется
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоответствияАналитик.ОсновнаяСтатья КАК ОсновнаяСтатья,
	|	СоответствияАналитик.ЗависимаяСтатья КАК ЗависимаяСтатья
	|ИЗ
	|	СоответствияАналитик КАК СоответствияАналитик
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗависимыеОбороты КАК ЗависимыеОбороты
	|		ПО СоответствияАналитик.ОсновнаяСтатья = ЗависимыеОбороты.ОсновнаяСтатья
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗависимыеОбороты КАК УжеУчтенные
	|		ПО СоответствияАналитик.ОсновнаяСтатья = УжеУчтенные.ОсновнаяСтатья
	|			И СоответствияАналитик.ЗависимаяСтатья = УжеУчтенные.ЗависимаяСтатья
	|ГДЕ
	|	УжеУчтенные.ЗависимаяСтатья ЕСТЬ NULL
	|ИТОГИ ПО
	|	ОсновнаяСтатья";
	Запрос.УстановитьПараметр("ВидСоответствия", ВидСоответствия);
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Объект.ДатаНачала), Объект.ДатаНачала, '00010101'));
	ВыборкаОсновныхСтатей = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОсновныхСтатей.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаОсновныхСтатей.ОсновнаяСтатья) Тогда
			Продолжить;
		КонецЕсли;
		ЗависимыеСтатьи = Новый Массив;
		Выборка = ВыборкаОсновныхСтатей.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.ЗависимаяСтатья) Тогда
				Продолжить;
			КонецЕсли;	
			ЗависимыеСтатьи.Добавить(Выборка.ЗависимаяСтатья);
		КонецЦикла;
		Если ЗависимыеСтатьи.Количество() > 0 Тогда
			Зависимости.Вставить(ВыборкаОсновныхСтатей.ОсновнаяСтатья, ЗависимыеСтатьи);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Зависимости;
	
КонецФункции

&НаСервере
Функция ТекущиеЗависимостиПервогоУровня()
	
	ТекущиеЗависимости = Новый ТаблицаЗначений;
	ТекущиеЗависимости.Колонки.Добавить("ОсновнаяСтатья", Новый ОписаниеТипов("СправочникСсылка.бит_СтатьиОборотов"));
	ТекущиеЗависимости.Колонки.Добавить("ЗависимаяСтатья", Новый ОписаниеТипов("СправочникСсылка.бит_СтатьиОборотов"));
	
	Для каждого СтрокаОсновнойСтатьи Из ДеревоЗависимостей.ПолучитьЭлементы() Цикл
		ОсновнаяСтатья = СтрокаОсновнойСтатьи.СтатьяОборотов;
		ЗависимыеСтроки = СтрокаОсновнойСтатьи.ПолучитьЭлементы();
		Если ЗависимыеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ТекущиеЗависимости.Добавить();
			НоваяСтрока.ОсновнаяСтатья = ОсновнаяСтатья;
		Иначе
			Для каждого СтрокаЗависимойСтатьи Из ЗависимыеСтроки Цикл
				НоваяСтрока = ТекущиеЗависимости.Добавить();
				НоваяСтрока.ОсновнаяСтатья = ОсновнаяСтатья;
				НоваяСтрока.ЗависимаяСтатья = СтрокаЗависимойСтатьи.СтатьяОборотов;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекущиеЗависимости;
	
КонецФункции

&НаСервере
Процедура ПеренестиЗависимыеСтроки(КоллекцияПеретаскиваемыхСтрок, Копирование, НовыйРодитель)
	
	Если НЕ Копирование Тогда
		Для каждого ПеретаскиваемаяСтрока Из КоллекцияПеретаскиваемыхСтрок Цикл
			НайтиУдалитьСтрокиТаблицы(ПеретаскиваемаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОкончаниеПеретаскиванияСтрокДереваНаСервере()
	
	Для каждого ЭлементПостОбработки Из СтрокиПостОбработки Цикл
		Отбор           = Новый Структура("ИД", ЭлементПостОбработки.Значение);
		СтрокаОбработки = бит_РаботаСКоллекциямиКлиентСервер.НайтиЭлементДерева(ДеревоЗависимостей.ПолучитьЭлементы(),
							Отбор, Истина);
		Если СтрокаОбработки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ЗаполнитьСтрокуЗависимыхОборотов(СтрокаОбработки.ПолучитьИдентификатор());
	КонецЦикла;
	СтрокиПостОбработки.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПеретаскиванияСтрокДерева()
	
	ОкончаниеПеретаскиванияСтрокДереваНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокСценариев()
	
	СписокСценариев.Очистить();
	
	Сценарии = Объект.Сценарии.Выгрузить(, "Сценарий").ВыгрузитьКолонку("Сценарий");
	Если Сценарии.Количество() > 0 Тогда
		СписокСценариев.ЗагрузитьЗначения(Сценарии);
	ИначеЕсли ЗначениеЗаполнено(Объект.Сценарий) Тогда
		СписокСценариев.Добавить(Объект.Сценарий);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
