#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
	Для Каждого ВидСубконто Из СписокВидовСубконто Цикл
		Если НЕ ЗначениеЗаполнено(ВидСубконто.Значение) Тогда
			ТекстСообщения = НСтр("ru='Список видов субконто не заполнен';
								  |en='List of species subkonto is empty'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Отчет.СписокВидовСубконто",, Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ВидСубконто Из СписокВидовКорСубконто Цикл
		Если НЕ ЗначениеЗаполнено(ВидСубконто.Значение) Тогда
			ТекстСообщения = НСтр("ru='Список видов кор. субконто не заполнен';
								  |en='List of types of crusts. subkonto is empty'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Отчет.СписокВидовКорСубконто",, Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	МаксКоличествоСубконто = бит_БухгалтерскийУчет.МаксимальноеКоличествоСубконто();
	Если СписокВидовСубконто.Количество() > МаксКоличествоСубконто Тогда
		ТекстСообщения = НСтр("ru='Выбрано слишком много видов субконто, максимально допустимо %1';
							  |en='Too many types subkonto maximum permissible %1'");
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения, МаксКоличествоСубконто),, "Отчет.СписокВидовСубконто",, Отказ);
	КонецЕсли;
	
	Если СписокВидовКорСубконто.Количество() > МаксКоличествоСубконто Тогда
		ТекстСообщения = НСтр("ru='Выбрано слишком много видов кор. субконто, максимально допустимо %1';
							  |en='Too many types of crusts. subkonto maximum permissible %1'");
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения, МаксКоличествоСубконто),, "Отчет.СписокВидовКорСубконто",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли