
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УправлениеОбъектамиСистемыПриОткрытии();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ОбъектыСписоком Тогда
		СохранитьСписокОбъектов(ТекущийОбъект);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьСписокОбъектовСистемы(ТекущийОбъект.ОбъектыСистемы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектСистемыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;	
	ДанныеВыбора.ЗагрузитьЗначения(ДоступныеОбъектыСистемы());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСписокОбъектовСистемы(Команда)
	
	ЗаполнитьСписокОбъектовСистемы(Объект.ОбъектыСистемы);
	
	Элементы.ОбъектСистемы.Видимость                = Ложь;
	Элементы.КомандаСписокОбъектовСистемы.Видимость = Ложь;
	Элементы.СписокОбъектов.Видимость               = Истина;
	
	ОбъектыСписоком = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДоступныеВидыОбъектов = Новый СписокЗначений;
	ДоступныеВидыОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Документ"));
	ДоступныеВидыОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Справочник"));
	ДоступныеВидыОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Задача"));
	
	ОтборОбъектыСистемы = Новый СписокЗначений;	
	ОтборОбъектыСистемы.ЗагрузитьЗначения(ДоступныеОбъектыСистемы());
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокОбъектов",                СписокОбъектов);
	ПараметрыФормы.Вставить("ДоступныеВидыОбъектов",         ДоступныеВидыОбъектов);
	ПараметрыФормы.Вставить("ОтборОбъектыСистемы",           ОтборОбъектыСистемы);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",            Истина);
	ОткрытьФорму("Справочник.бит_ПользовательскиеУсловия.Форма.ВыборОбъектовСистемы", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура СписокОбъектовПриИзмененииНаСервере()
	
	СохранитьСписокОбъектов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовПриИзменении(Элемент)
	
	СписокОбъектовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеЗаполненияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектСистемы = Неопределено;
	Если Объект.ОбъектыСистемы.Количество() > 0 Тогда
		ОбъектСистемы = Объект.ОбъектыСистемы[0].ОбъектСистемы;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОбъектСистемы) Тогда
		Возврат;
	КонецЕсли;
	                             
	// Откроем форму выбора элемента управления.
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектСистемы",       ОбъектСистемы);
	ПараметрыФормы.Вставить("ИмяТекущегоЭлемента", Объект.ПолеЗаполнения);
	
	ОткрытьФорму("РегистрСведений.бит_НастройкиДоступностиЭлементов.Форма.ВыборЭлементаУправления",
					ПараметрыФормы, Элемент);
	
КонецПроцедуры
				
&НаКлиенте
Процедура ПолеЗаполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Если НЕ ПустаяСтрока(ВыбранноеЗначение.ИмяРеквизита) Тогда
			Объект.ПолеЗаполнения = СтрШаблон("Объект.%1", ВыбранноеЗначение.ИмяРеквизита);
		Иначе
			Объект.ПолеЗаполнения = ВыбранноеЗначение.ИмяЭлемента;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры				

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеОбъектамиСистемыПриОткрытии()
	
	КоличествоОбъектов = Объект.ОбъектыСистемы.Количество();
	Если КоличествоОбъектов = 0 Тогда
		Объект.ОбъектыСистемы.Добавить();
	КонецЕсли;
	
	ОбъектыСписоком = (КоличествоОбъектов > 1);
	
	Элементы.ОбъектСистемы.Видимость                = НЕ ОбъектыСписоком;
	Элементы.КомандаСписокОбъектовСистемы.Видимость = НЕ ОбъектыСписоком;
	Элементы.СписокОбъектов.Видимость               = ОбъектыСписоком;
	
	Элементы.ОбъектСистемы.СписокВыбора.ЗагрузитьЗначения(ДоступныеОбъектыСистемы());
	
	МассивОбъектов = Объект.ОбъектыСистемы.Выгрузить().ВыгрузитьКолонку("ОбъектСистемы");
	СписокОбъектов.ЗагрузитьЗначения(МассивОбъектов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОбъектовСистемы(Знач ОбъектыСистемы);
	
	СписокОбъектов.Очистить();
	
	Для каждого СтрокаОбъекта Из ОбъектыСистемы Цикл
		ТекущийОбъектСистемы = СтрокаОбъекта.ОбъектСистемы;
		Если ЗначениеЗаполнено(ТекущийОбъектСистемы) Тогда
			СписокОбъектов.Добавить(ТекущийОбъектСистемы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступныеОбъектыСистемы()
	
	ДоступныеОбъекты = Новый Массив;
	ДоступныеОбъекты.Добавить(
		Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(Метаданные.Справочники.бит_ВнутренниеДокументы));
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		ДоступныеОбъекты.Добавить(
			Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(Метаданные.Документы["бит_ПроектДоговора"]));
	КонецЕсли;
		
	Возврат ДоступныеОбъекты;
	
КонецФункции

&НаСервере
Процедура СохранитьСписокОбъектов(ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		ОбъектыСистемы = Объект.ОбъектыСистемы;
	Иначе
		ОбъектыСистемы = ТекущийОбъект.ОбъектыСистемы;
	КонецЕсли;
		
	ОбъектыСистемы.Очистить();
	Для каждого ЭлементСписка Из СписокОбъектов Цикл
		СтрокаОбъекта = ОбъектыСистемы.Добавить();
		СтрокаОбъекта.ОбъектСистемы = ЭлементСписка.Значение;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти