
&ИзменениеИКонтроль("ОбновитьВредныеФакторыРабочихМестОбработкаУдаленияПроведения")
Процедура УВМ_ОбновитьВредныеФакторыРабочихМестОбработкаУдаленияПроведения(Источник, Отказ)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;

	РабочиеМеста = Неопределено;
	Если Источник.ДополнительныеСвойства.Свойство("ПрежниеРабочиеМеста") Тогда
		РабочиеМеста = Источник.ДополнительныеСвойства["ПрежниеРабочиеМеста"];
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры") Тогда
		МодульМедицинскиеОсмотры = ОбщегоНазначения.ОбщийМодуль("МедицинскиеОсмотры");
		МодульМедицинскиеОсмотры.ОбновитьВредныеФакторыРабочихМест(Источник.Ссылка, РабочиеМеста);
	КонецЕсли;

#Вставка
	//++dar 07.05.25 (241010)
	УВМ_ОбщиеДоработки.ЗаполнитьВредныеФакторыИзРезультатовСпецоценки(РабочиеМеста);
	//--dar 07.05.25 (241010)
#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ОбновитьВредныеФакторыРабочихМестОбработкаПроведения")
Процедура УВМ_ОбновитьВредныеФакторыРабочихМестОбработкаПроведения(Источник, Отказ, РежимПроведения)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;

	РабочиеМеста = Источник.РабочиеМеста.ВыгрузитьКолонку("РабочееМесто");
	АналогичныеМеста = Источник.АналогичныеМеста.ВыгрузитьКолонку("АналогичноеМесто");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РабочиеМеста, АналогичныеМеста, Истина);

	Если Источник.ДополнительныеСвойства.Свойство("ПрежниеРабочиеМеста") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РабочиеМеста, Источник.ДополнительныеСвойства["ПрежниеРабочиеМеста"], Истина);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры") Тогда
		МодульМедицинскиеОсмотры = ОбщегоНазначения.ОбщийМодуль("МедицинскиеОсмотры");
		МодульМедицинскиеОсмотры.ОбновитьВредныеФакторыРабочихМест(, РабочиеМеста);
	КонецЕсли;

#Вставка
	//++dar 07.05.25 (241010)
	УВМ_ОбщиеДоработки.ЗаполнитьВредныеФакторыИзРезультатовСпецоценки(РабочиеМеста);
	//--dar 07.05.25 (241010)
#КонецВставки
КонецПроцедуры
