
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтчетТабличныйДокумент = Параметры.ОтчетТабличныйДокумент;
	
	Элементы.КомандаСгенерироватьОписание.Видимость = (ОтчетТабличныйДокумент.ВысотаТаблицы > 0);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура КомандаСгенерироватьОписаниеНаСервере()
	
	ПараметрыПреобразования = бит_ИскусственныйИнтеллектКлиентСервер.НовыеПараметрыПреобразованияДанных();
	ПараметрыПреобразования.Данные = ОтчетТабличныйДокумент;
	Если ЗначениеЗаполнено(Запись.ФорматВыгрузки) Тогда
		ПараметрыПреобразования.ФорматВыгрузки = Запись.ФорматВыгрузки;
	КонецЕсли;
	ТекстВыгрузки = бит_ИскусственныйИнтеллектКлиентСервер.ПреобразоватьДанныеДляПередачиАссистенту(
						ПараметрыПреобразования);
	Если ПустаяСтрока(ТекстВыгрузки) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросИИ = Новый Массив;
	ЗапросИИ.Добавить(ТекстВыгрузки);
	ЗапросИИ.Добавить(Справочники.бит_ШаблоныПромптовИИ.ЗапросСтруктурыОтчета);
		
	Запись.Описание = бит_ИскусственныйИнтеллект.ОтветИИ(ЗапросИИ);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСгенерироватьОписание(Команда)
	КомандаСгенерироватьОписаниеНаСервере();
КонецПроцедуры

#КонецОбласти