
&Перед("ОбработкаПроверкиЗаполнения")
Процедура УВМ_ОбработкаПроверкиЗаполнения(ДокументОбъект, Отказ, ПроверяемыеРеквизиты)
	
	//++dar 13.01.24 (163129)
	//Если НЕ ДокументОбъект.НачалоТрудовойДеятельности Тогда
	//	ПроверяемыеРеквизиты.Добавить("ВидЗаявленияОВыбореСпособаВеденияТрудовойКнижки");
	//КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОбъект.ДатаПриема) Тогда
		ДатаСобытия = ДокументОбъект.ДатаПриема;
	Иначе
		ДатаСобытия = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ИсключаемыеРегистраторы = Новый Массив;
	ИсключаемыеРегистраторы.Добавить(ДокументОбъект.Ссылка);
	Если ЗначениеЗаполнено(ДокументОбъект.ИсправленныйДокумент) Тогда
		ИсключаемыеРегистраторы.Добавить(ДокументОбъект.ИсправленныйДокумент);
	КонецЕсли;
	
	ДанныеЗаявления = ЭлектронныеТрудовыеКнижки.ПоследнееЗаявлениеОВеденииТрудовойКнижки(
		ДокументОбъект.ФизическоеЛицо, ДатаСобытия, ИсключаемыеРегистраторы);
		
	Если НЕ ДокументОбъект.НачалоТрудовойДеятельности И НЕ ЗначениеЗаполнено(ДанныеЗаявления.ВидЗаявления) Тогда
		ПроверяемыеРеквизиты.Добавить("ВидЗаявленияОВыбореСпособаВеденияТрудовойКнижки");
	КонецЕсли;
	//--dar 13.01.24 (163129)
	
КонецПроцедуры
