
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Отчет);
	Если фОтказ Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Документ", Отчет.Документ);
	
    ПоказыватьДокумент = ?(Параметры.Свойство("ПоказыватьДокумент"), Параметры.ПоказыватьДокумент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Если Не ОтчетСформирован Тогда
		СформироватьИВывестиОтчет();
		ОтчетСформирован = Истина;
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьВыполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Отчет.Документ) Тогда		
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите документ, протокол выполнения которого необходимо увидеть'; 
									  |en = 'Select the document whose execution Protocol you want to see'"));		
		Возврат;
	КонецЕсли;
	
	СформироватьИВывестиОтчет();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура осуществляет управление доступностью/видимостью элементов формы.
// 
&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Элементы.Документ.Видимость = ПоказыватьДокумент;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

// Процедура вызывает процедуру объекта отчета по формированию.
// 
&НаСервере
Процедура СформироватьИВывестиОтчет()
	
	РеквизитФормыВЗначение("Отчет").СформироватьОтчет(ТабличныйДокумент);
	
КонецПроцедуры

#КонецОбласти
