#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольныеЗначенияБюджета");
	ОписаниеВарианта.Описание = НСтр("ru = 'Позволяет выполнить анализ расходования лимитов по бюджетам.'");

	ОписаниеОтчета.ОпределитьНастройкиФормы = Ложь;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьЗаголовкиПолейДопИзмерений(СхемаКомпоновкиДанных) Экспорт
	
	бит_МеханизмДопИзмерений.НастроитьПоляДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, "НаборДанных1");
	
КонецПроцедуры

#КонецОбласти 
	
#КонецЕсли	