
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	фКэшЗначений = Новый Структура("ОснованиеРазворотов", Параметры.ОснованиеРазворотов);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фКэшЗначений.ОснованиеРазворотов = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ЗаполнитьДеревоРеквизитов();
    	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабличноеПоле

&НаКлиенте
Процедура ТабличноеПолеРеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаДанных = ТабличноеПолеРеквизиты.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если СтрокаДанных.Тип = "Реквизит" Тогда
		Закрыть(СтрокаДанных.Измерение + "." + СтрокаДанных.ИмяРеквизита);
	ИначеЕсли СтрокаДанных.Тип = "ДопРеквизит" Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Свойство",                  СтрокаДанных.Тип);
		СтруктураПараметров.Вставить("Измерение",                 СтрокаДанных.Измерение);
		СтруктураПараметров.Вставить("СсылкаПВХ",                 СтрокаДанных.СсылкаПВХ);
		СтруктураПараметров.Вставить("ИмяПредопределенныхДанных", СтрокаДанных.ИмяПредопределенныхДанных);
		
		Закрыть(СтруктураПараметров);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТабличноеПолеРеквизитыРеквизит");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТабличноеПолеРеквизитыИзмерение");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТабличноеПолеРеквизитыИмяРеквизита");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТабличноеПолеРеквизитыТип");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ТабличноеПолеРеквизиты.Тип", ВидСравненияКомпоновкиДанных.Равно, "ДопРеквизит");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветЗаголовкаСтатуса);
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоРеквизитов()
	
	ДеревоТабличноеПолеРеквизиты = РеквизитФормыВЗначение("ТабличноеПолеРеквизиты");
	
	ДеревоТабличноеПолеРеквизиты.Строки.Очистить();
	
	КэшДопРеквизитов = Неопределено;
	Для Каждого СсылкаОснование Из фКэшЗначений.ОснованиеРазворотов Цикл
		Попытка
			КэшДопРеквизитов = УправлениеСвойствами.СвойстваОбъекта(СсылкаОснование.Метаданные,,Ложь);
		Исключение
			Продолжить;
		КонецПопытки;
		ДополнитьТабличноеПолеПоОснованию(ДеревоТабличноеПолеРеквизиты, СсылкаОснование, КэшДопРеквизитов);
	КонецЦикла;
	
	ЗначениеВДанныеФормы(ДеревоТабличноеПолеРеквизиты, ТабличноеПолеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьТабличноеПолеПоОснованию(ДеревоТабличноеПолеРеквизиты, СсылкаОснование, КэшДопРеквизитов)
	
	МетаданныеОснования = СсылкаОснование.Метаданные.Метаданные();
	Измерение 			= СсылкаОснование.Измерение;
		
	Попытка
		Реквизиты = МетаданныеОснования.Реквизиты;
	Исключение
		Возврат;
	КонецПопытки;
	
	// Добавим строку верхнего уровня.
	СтрокаРодитель = ДеревоТабличноеПолеРеквизиты.Строки.Добавить();
	СтрокаРодитель.Измерение 	= Измерение;
	СтрокаРодитель.Реквизит		= Измерение + ": " + МетаданныеОснования.Синоним;
	СтрокаРодитель.Тип			= "Справочник";
	ОписаниеТиповСтрока			= Новый ОписаниеТипов("Строка");
	
	Для Каждого Реквизит Из Реквизиты Цикл
		
		Если Реквизит.Тип = ОписаниеТиповСтрока И Реквизит.Тип.КвалификаторыСтроки.Длина = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРеквизит = СтрокаРодитель.Строки.Добавить();
		СтрокаРеквизит.Измерение 	= Измерение;
		СтрокаРеквизит.ИмяРеквизита	= Реквизит.Имя;
		СтрокаРеквизит.Реквизит		= Реквизит.Синоним;
		СтрокаРеквизит.Тип			= "Реквизит";
		
	КонецЦикла;
	
	Если КэшДопРеквизитов <> Неопределено Тогда
		
		// Найдем в кэшэ доп.реквизитов допики для такого имени объекта метаданных.
				
		Для Каждого СтрокаКэша Из КэшДопРеквизитов Цикл
			
			СтрокаРеквизит = СтрокаРодитель.Строки.Добавить();
			СтрокаРеквизит.Измерение 	= Измерение;
			СтрокаРеквизит.ИмяРеквизита	= "";
			СтрокаРеквизит.Реквизит		= СтрШаблон(НСтр("ru='%1 (доп. реквизит)';en='%1 (доп. реквизит)'"), 
													СтрокаКэша.Наименование);
			СтрокаРеквизит.СсылкаПВХ	= СтрокаКэша;
			СтрокаРеквизит.Тип			= "ДопРеквизит";
			СтрокаРеквизит.ИмяПредопределенныхДанных = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				СтрокаКэша.НаборСвойств, "ИмяПредопределенныхДанных");
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
