#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

#Область НачальноеЗаполнениеДанных

// См. бит_ОбновлениеИнформационнойБазыБФ.ПередОбновлениемИнформационнойБазы().
//
Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт
	
	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);
	
КонецПроцедуры

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт

	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника РолиИсполнителей.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением.
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	
	Элемент = Элементы.Добавить();
	Элемент.Предопределенный          = Истина;
	Элемент.ИмяПредопределенныхДанных = "Служебные";
	Элемент.Наименование			  = НСтр("ru = 'Служебные'", КодОсновногоЯзыка);
	
	Элемент = Элементы.Добавить();
	Элемент.Предопределенный          = Истина;
	Элемент.ИмяПредопределенныхДанных = "ЗапросСтруктурыОтчета";
	Элемент.Наименование			  = НСтр("ru = 'Запрос структуры отчета'", КодОсновногоЯзыка);
	Элемент.Содержание =
	НСтр("ru='Тебе переданы данные отчета сформированного в программе 1С. Проанализируй его содержание и верни структуру по формату:
		|Назначение отчета.
		|Структура колонок: имя - назначение.'", КодОсновногоЯзыка);
	
	Элемент = Элементы.Добавить();
	Элемент.Предопределенный          = Истина;
	Элемент.ИмяПредопределенныхДанных = "ПолучениеДанныхИзФайла";
	Элемент.Наименование			  = НСтр("ru = 'Получение данных из файла'", КодОсновногоЯзыка);
	Элемент.Содержание =
	НСтр("ru='Проанализируй предоставленный документ (печатную форму или связанный документ) и структуру полей в формате JSON. Структура JSON — это массив объектов, где каждый объект содержит:
	    |
		|- 'ИмяЭлемента' (string) — уникальное имя поля,
		|- 'ПредставлениеЭлемента' (string) — отображаемое название поля,
		|- 'ТипЗначения' (string) — тип значения (например, ""Строка"", ""Дата"", ""Организация"" и др.),
		|- 'ДоступныеЗначения' (array) — массив возможных значений (может быть пустым).
	    |
		|Требования к поиску и формированию результата:
	    |
		|1. Если для поля указаны 'ДоступныеЗначения' (массив не пустой), ищи подходящее значение только среди элементов этого массива, используя все доступные поля каждого элемента (например, 'Наименование', 'НаименованиеПолное', 'ИНН' и др.). В качестве результата для такого поля возвращай массив из одного или нескольких 'ID' найденных элементов, отсортированных по степени совпадения.
		|2. Если 'ДоступныеЗначения' пустой, ищи подходящие значения в тексте документа и возвращай массив строковых совпадений, отсортированных по степени совпадения.
		|3. Если 'ТипЗначения' — ""Дата"", возвращай найденные значения в формате строки YYYYMMDD.
		|4. Итоговый результат — массив объектов, где каждый объект содержит:
		|   - 'ИмяЭлемента' (string)
		|   - 'ВозможныеЗначения' (array), содержащий либо массив 'ID' (если есть 'ДоступныеЗначения'), либо массив строк (если 'ДоступныеЗначения' пустой).
	    |
		|Пример результата:
		|```json
		|[
		|  {
		|    ""ИмяЭлемента"": ""Организация"",
		|    ""ВозможныеЗначения"": [""0f1eafec-0e11-11e2-8ac4-005056aa43d6""]
		|  },
		|  {
		|    ""ИмяЭлемента"": ""Дата"",
		|    ""ВозможныеЗначения"": [""20240530""]
		|  },
		|  {
		|    ""ИмяЭлемента"": ""Комментарий"",
		|    ""ВозможныеЗначения"": [""Согласовано с отделом закупок""]
		|  }
		|]
		|```'", КодОсновногоЯзыка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли