#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ОписаниеПеременных

Перем мНастройкиИзмерений Экспорт; // Хранит настройки дополнительных измерений.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СписокПараметровНаФорме = Новый СписокЗначений;
	
	СписокПараметровНаФорме.Добавить("Период");
	
	Для каждого ЭлементСписка Из СписокПараметровНаФорме Цикл
		
		ИмяПараметра = ЭлементСписка.Значение;
		бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек, 
																 ЭтотОбъект[ИмяПараметра], 
																 ИмяПараметра);
		
	КонецЦикла;  	 
	
КонецПроцедуры // ПриКомпоновкеРезультата()

#КонецОбласти

#Область Инициализация

мНастройкиИзмерений = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();

Для Каждого ТекущийВариантСхемы Из СхемаКомпоновкиДанных.ВариантыНастроек Цикл
	
	НайденныйРегистр = Метаданные.РегистрыБухгалтерии.Найти(ТекущийВариантСхемы.Имя);
	
	Если НайденныйРегистр = Неопределено Тогда
		Продолжить;
	КонецЕсли;
	
	ТекущийВариантСхемы.Представление = НайденныйРегистр.Представление();
	
КонецЦикла;

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли