
&После("ОбработкаПроверкиЗаполнения")
Процедура УВМ_ОбработкаПроверкиЗаполнения(ДокументОбъект, Отказ, ПроверяемыеРеквизиты)
	//++dar 08.02.2024 (163679)
	Если НЕ ДокументОбъект.Проведен Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.УВМ_ФактическаяПричинаУвольнения) Тогда
			ТекстСообщения = НСтр("ru='Не указана Фактическая причина увольнения (УВМ)'");
			ПутьКПолю = "УВМ_ФактическаяПричинаУвольнения";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка, ПутьКПолю, , Отказ);
		КонецЕсли;
	КонецЕсли;
	//--dar 08.02.2024 (163679)
КонецПроцедуры
