
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура УВМ_ОбработкаПроведения(Отказ, РежимПроведения)

	Документы.Увольнение.ПровестиПоУчетам(Ссылка, РежимПроведения, Отказ, Неопределено, Движения, ЭтотОбъект, ДополнительныеСвойства);
	
	#Вставка
	//++dar 20221128 (11805)
	Если НЕ Отказ Тогда
		Узел = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоКоду("ИТ");
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Сотрудник);	
	КонецЕсли;
	//--dar 20221128 (11805)
	
	//++dar 07.06.23 (117669)
	Если НЕ Отказ Тогда
		ВАрхиве = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ВАрхиве");
		Если НЕ ВАрхиве Тогда
			КадровыйУчет.ПоместитьСотрудникаВАрхив(Сотрудник);	
		КонецЕсли;
	КонецЕсли;
	//--dar 07.06.23 (117669)
	
	//++dar 25.06.25 (255715)
	Если Дата >= УВМ_КэшированиеЗначений.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		Если ЗначениеЗаполнено(УВМ_Руководитель) Тогда
			МассивПодчиненных = УВМ_ОбщиеДоработки.ПодчиненныеСотрудника(ФизическоеЛицо);
			
			ТаблицаДвижений = Новый ТаблицаЗначений;
			ТаблицаДвижений.Колонки.Добавить("Период");
			ТаблицаДвижений.Колонки.Добавить("Физлицо");
			ТаблицаДвижений.Колонки.Добавить("Руководитель");
			ТаблицаДвижений.Колонки.Добавить("КадровыйДокумент");
			
			Для Каждого ТекущийПодчиненный Из МассивПодчиненных Цикл
				НовДвижение = ТаблицаДвижений.Добавить();
				НовДвижение.Период = ДатаУвольнения;
				НовДвижение.Физлицо = ТекущийПодчиненный;
				НовДвижение.Руководитель = УВМ_Руководитель;
				НовДвижение.КадровыйДокумент = Ссылка;
			КонецЦикла;
			
			УВМ_ОбщиеДоработки.СформироватьДвиженияПоРуководителям(ТаблицаДвижений);
		КонецЕсли;
	КонецЕсли;
	//--dar 25.06.25 (255715)
	#КонецВставки
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура УВМ_ОбработкаУдаленияПроведения(Отказ)
	
	//++dar 07.06.23 (117669)
	Если НЕ Отказ Тогда
		ВАрхиве = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ВАрхиве");
		Если ВАрхиве Тогда
			КадровыйУчет.ИзвлечьСотрудникаИзАрхива(Сотрудник);	
		КонецЕсли;
	КонецЕсли;
	//--dar 07.06.23 (117669)
	
	//++dar 25.06.25 (255715)
	Если Дата >= УВМ_КэшированиеЗначений.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		УВМ_ОбщиеДоработки.УдалитьДвиженияПоРуководителям(Ссылка);
	КонецЕсли;	
	//--dar 25.06.25 (255715)

КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура УВМ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//++dar 25.06.25 (255715)
	Если Дата >= УВМ_КэшированиеЗначений.ПолучитьДатуНачалаУчетаРуководителей() 
		И УВМ_ОбщиеДоработки.ЕстьПодчиненные(ФизическоеЛицо)
		И НЕ ЗначениеЗаполнено(УВМ_Руководитель) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("У сотрудника %1 есть подчиненные. Нужно указать его ИО.", ФизическоеЛицо), , "УВМ_Руководитель", "Объект", Отказ); 
	КонецЕсли;
	//--dar 25.06.25 (255715)
КонецПроцедуры
