#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета.
//
// Параметры:
//   Настройки - Коллекция - настройки отчетов и вариантов отчетов конфигурации.
//	 ОписаниеОтчета - СтрокаДерева
//                  - ОбъектМетаданных - описание настроек, метаданные или ссылка отчета.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьПоУправленческимВыпискам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Показывает сколько денежных средств, по данным управленческой выписки, на расчетных счетах и в кассах.'");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.бит_КомИнт_Казначейство.Подсистемы.Отчеты, "");
	ОписаниеВарианта.Включен = Истина;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли	