#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// АПК:299-выкл. Функция используется в макете.

// Функция формирует строковое представление времени.
//
// Параметры:
//  ВходящееВремя	 - Структура, Число	 - Время в секундах.
//  ДоСекунд		 - Булево			 - Точность до секунд.
// 
// Возвращаемое значение:
//  Строка - Строковое представление времени.
//
Функция ПредставлениеВремени(ВходящееВремя, ДоСекунд = Ложь) Экспорт
	
	РезСтрока = "";
	Если ТипЗнч(ВходящееВремя) = Тип("Структура") ИЛИ ТипЗнч(ВходящееВремя) = Тип("Число")  Тогда
		
		Если ТипЗнч(ВходящееВремя) = Тип("Структура") Тогда
			СтрВремя = ВходящееВремя;
		Иначе
			Если ДоСекунд Тогда
				СтрВремя = бит_ОбщегоНазначения.СекундыВоВремя(ВходящееВремя);
			Иначе	
				СтрВремя = бит_ОбщегоНазначения.МинутыВоВремя(ВходящееВремя);
			КонецЕсли; 
		КонецЕсли; 
		
		СтрФормат = "ЧЦ=2; ЧН=; ЧВН=";
		СтрДень   = Символы.НПП + НСтр("ru='д.'; en = 'd.'") + Символы.НПП;
		
		Если СтрВремя.Дни > 0 Тогда
			РезСтрока = Строка(СтрВремя.Дни) + СтрДень + Формат(СтрВремя.Часы, СтрФормат) + ":" + Формат(СтрВремя.Минуты, СтрФормат);
		Иначе	
			РезСтрока = Формат(СтрВремя.Часы, СтрФормат) + ":" + Формат(СтрВремя.Минуты, СтрФормат);
		КонецЕсли; 
		
		Если  СтрВремя.Свойство("Секунды") Тогда		
			РезСтрока = РезСтрока+":"+Формат(СтрВремя.Секунды,СтрФормат);		
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат РезСтрока;
	
КонецФункции

// АПК:299-вкл.

#КонецОбласти

#КонецЕсли