
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	УстановитьМаскиЭлементам();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьМаскиЭлементам()

	ТекОбъектСистемы = бит_УправлениеОбъектамиСистемы.НайтиОбъектДоступаПоТипу(ТипЗнч(Объект.Ссылка), 
			Перечисления.бит_ВидыОбъектовСистемы.Справочник);
	
	Элементы.Кодификатор.Маска = РегистрыСведений.бит_МаскиКодов.ПолучитьМаскуРеквизита(ТекОбъектСистемы, "Кодификатор");	

КонецПроцедуры

#КонецОбласти
