
//++dar 07.05.25 (241010)
&НаСервере
Функция СтрокаВредныхФакторов()
	
	МсвФакторов = Новый Массив;
	
	ДополнитьВредныеФакторы(ЭтотОбъект, МсвФакторов, "ВредныеФакторыИВидыРабот");
	ДополнитьВредныеФакторы(ЭтотОбъект, МсвФакторов, "ВредныеФакторы");
	
	КраткийСостав = КраткийСоставВредныхФакторовИзРабочегоМеста(МсвФакторов);
	
	Возврат КраткийСостав;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДополнитьВредныеФакторы(Форма, МсвФакторов, ИмяТаблицы)
	НаборЗаписей = Форма.РеквизитФормыВЗначение(ИмяТаблицы + "МедицинскихОсмотров");
	Для каждого СтрокаНабора Из НаборЗаписей Цикл
		Если МсвФакторов.Найти(СтрокаНабора.ВредныйФактор) = Неопределено Тогда
			МсвФакторов.Добавить(СтрокаНабора.ВредныйФактор);
		КонецЕсли;
	КонецЦикла;
	
	Если Форма.ИспользоватьПсихиатрическиеОсвидетельствования Тогда
		НаборЗаписейОПО = Форма.РеквизитФормыВЗначение(ИмяТаблицы + "ПсихиатрическихОсвидетельствований");
		Для каждого СтрокаНабора Из НаборЗаписейОПО Цикл
			Если МсвФакторов.Найти(СтрокаНабора.ВредныйФактор) = Неопределено Тогда
				МсвФакторов.Добавить(СтрокаНабора.ВредныйФактор);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция КраткийСоставВредныхФакторовИзРабочегоМеста(МсвФакторов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МсвФакторов", МсвФакторов);
	Запрос.Текст =                                         
	"ВЫБРАТЬ
	|	ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.Код КАК ВредныйФактор
	|ИЗ
	|	Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы КАК ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы
	|ГДЕ
	|	ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.Ссылка В(&МсвФакторов)";
	
	ВыборкаВредныхФакторов = Запрос.Выполнить().Выбрать();
	
	КраткийСостав = "";
	Пока ВыборкаВредныхФакторов.Следующий() Цикл
		КраткийСостав = КраткийСостав + ВыборкаВредныхФакторов.ВредныйФактор + ", ";
	КонецЦикла;
	
	КраткийСостав = Сред(КраткийСостав, 1, СтрДлина(КраткийСостав) - 2);
	
	Возврат КраткийСостав;
	
КонецФункции


&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура УВМ_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	Если Параметры.Ключ.Пустая() Тогда
		ТекущийОбъект.УстановитьСсылкуНового(СсылкаНаОбъект);
	КонецЕсли;

	ТекущийОбъект.СоответствуетУсловиямТруда = СоответствуетУсловиямТруда;
	ТекущийОбъект.НормыСИЗСоответствуютДолжности = НормыСИЗСоответствуютДолжности;

	Если Не ИспользоватьСпециальнуюОценкуУсловийТруда Тогда
		РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтотОбъект, "КлассыУсловийТрудаПоДолжностям", СсылкаНаОбъект);
		РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтотОбъект, "АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда", СсылкаНаОбъект);
	КонецЕсли;

	ОбучениеПоОхранеТрудаФормы.ЗаписатьИнструктажиРабочегоМестаОхраныТруда(ЭтотОбъект, СсылкаНаОбъект);
	ОбучениеПоОхранеТрудаФормы.ЗаписатьОбучениеРабочегоМестаОхраныТруда(ЭтотОбъект, СсылкаНаОбъект);

	Если Не МедицинскиеОсмотры.МедицинскиеОсмотрыИспользуются(ТекущийОбъект.Владелец) Тогда
		Возврат;
	КонецЕсли;

	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест) Тогда
		Возврат;
	КонецЕсли;

	ОхранаТруда.ОбработатьДублиСтрокВТабличнойЧасти(ЭтотОбъект, "ВредныеФакторыМедицинскихОсмотров", "ВредныйФактор");
	ОхранаТруда.ОбработатьДублиСтрокВТабличнойЧасти(ЭтотОбъект, "ВидыРаботМедицинскихОсмотров", "ВидРабот");
	ОхранаТруда.ОбработатьДублиСтрокВТабличнойЧасти(ЭтотОбъект, "ВредныеФакторыПсихиатрическихОсвидетельствований", "ВредныйФактор");
	ОхранаТруда.ОбработатьДублиСтрокВТабличнойЧасти(ЭтотОбъект, "ВидыРаботПсихиатрическихОсвидетельствований", "ВидРабот");

#Вставка
	//++dar 07.05.25 (241010)
	КраткийСоставФакторов = СтрокаВредныхФакторов();
	Если ЗначениеЗаполнено(КраткийСоставФакторов) Тогда
		СвойствоВредныеФакторы = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ВредныеФакторыИзРезультатовСпецоценки");
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Свойство",СвойствоВредныеФакторы);
		
		МсвСтрокПоОтбору = ТекущийОбъект.ДополнительныеРеквизиты.НайтиСтроки(ПараметрыОтбора);
		Если МсвСтрокПоОтбору.Количество() > 0 Тогда
			ТекущийДопРеквизит = МсвСтрокПоОтбору[0];
		Иначе
			ТекущийДопРеквизит = ТекущийОбъект.ДополнительныеРеквизиты.Добавить();
			ТекущийДопРеквизит.Свойство = СвойствоВредныеФакторы;
		КонецЕсли;
		
		ТекущийДопРеквизит.Значение = КраткийСоставФакторов;
		
		УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	//--dar 07.05.25 (241010)
#КонецВставки
КонецПроцедуры
//--dar 07.05.25 (241010)
