
#Область СлужебныйПрограммныйИнтерфейс

Функция НастройкиДополнительныхИзмерений() Экспорт

	Возврат бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхИзмерений();	

КонецФункции

Функция КоличествоДополнительныхИзмерений() Экспорт

	Возврат бит_МеханизмДопИзмеренийКлиентСерверПереопределяемый.КоличествоДополнительныхИзмерений();
			
КонецФункции

Функция ВключенРежимЗаполнятьВсегда() Экспорт
	
	РежимЗаполнения = Константы.бит_РежимАвтоЗаполненияАналитик.Получить();	

	Возврат РежимЗаполнения = Перечисления.бит_РежимыАвтоЗаполненияАналитик.ЗаполнятьВсегда;
	
КонецФункции

Функция РежимАвтоЗаполненияАналитик() Экспорт

	Возврат Константы.бит_РежимАвтоЗаполненияАналитик.Получить();

КонецФункции

#КонецОбласти