////////////////////////////////////////////////////////////////////////////////
// Конфигурация "БИТ.Учет мигрантов".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы ДополнительныеОтчетыИОбработки.

// См. ДополнительныеОтчетыИОбработкиПереопределяемый.ОпределитьРазделыСДополнительнымиОбработками.
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.УчетМигрантов);
	
КонецПроцедуры

// См. ДополнительныеОтчетыИОбработкиПереопределяемый.ОпределитьРазделыСДополнительнымиОтчетами.
Процедура ОпределитьРазделыСДополнительнымиОтчетами(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.УчетМигрантов);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы БазоваяФункциональность.

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса.
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!	
	//Обработчики.Вставить("бит_сл_*", "бит_ум_УчетМигрантовВызовСервера.УстановитьПараметрыСеансаСистемыЛицензирования");
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиента.
Процедура ПриДобавленииПараметровРаботыКлиента(Параметры) Экспорт
	
	Если ПравоДоступа("Использование", Метаданные.Обработки.бит_ум_МастерНастройки)
		И Константы.бит_ум_ВыполнятьНачальнуюНастройкуПрограммы.Получить() = Истина
		И НЕ бит_ум_УчетМигрантовПовтИсп.ЭтоУМ() Тогда
		Параметры.Вставить("ПервыйЗапускУМ", Истина);
	КонецЕсли;
	
КонецПроцедуры

// См. ПодсистемыКонфигурацииПереопределяемый.ПриДобавленииПодсистем.
Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт
	
	МодулиПодсистем.Добавить("бит_ум_ОбновлениеИнформационнойБазы");
	Если бит_ум_УчетМигрантовВызовСервера.ЭтоУМ() Тогда
		МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыКадровыйУчет");
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы УправлениеПечатью.

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииОбъектовСКомандамиПечати.
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	Если бит_ум_УчетМигрантовВызовСервера.ЭтоУМ() Тогда
    	СписокОбъектов.Добавить(Справочники.Сотрудники);
    	СписокОбъектов.Добавить(Справочники.ФизическиеЛица);
    	СписокОбъектов.Добавить(Справочники.Организации);
    	СписокОбъектов.Добавить(Справочники.ПодразделенияОрганизаций);
    	СписокОбъектов.Добавить(Справочники.Организации);
    	СписокОбъектов.Добавить(Документы.КадровыйПеревод);	
		СписокОбъектов.Добавить(Документы.ПриемНаРаботу);	
		СписокОбъектов.Добавить(Документы.Увольнение);	
	КонецЕсли;
	СписокОбъектов.Добавить(Документы.бит_ум_ОтчетностьПоИР);
	СписокОбъектов.Добавить(Документы.бит_ум_ЗаявлениеНаУменьшениеСуммыНДФЛ);
	СписокОбъектов.Добавить(Документы.бит_ум_ПодтверждениеПраваНаУменьшениеСуммыНДФЛ);
	СписокОбъектов.Добавить(Документы.бит_ум_КвитанцияЗаПатент);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы ВариантыОтчетов.

// См. ВариантыОтчетовПереопределяемый.ОпределитьРазделыСВариантамиОтчетов.
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.УчетМигрантов.Подсистемы.ИностранныеРаботники);
	Если бит_ум_УчетМигрантовВызовСервера.ЭтоУМ() Тогда
		Разделы.Добавить(Метаданные.Подсистемы.УчетМигрантов.Подсистемы.КадровыйУчет);
	КонецЕсли;
	
КонецПроцедуры

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	Если бит_ум_УчетМигрантовВызовСервера.ЭтоУМ() Тогда
		ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ОтчетыПоСотрудникам);
	КонецЕсли;
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бит_ум_ДокументыИностранныхРаботников);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бит_ум_ИностранныеРаботники);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бит_ум_НесданныеФормыОтчетности);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бит_ум_ИнформацияОПатентах);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бит_ум_ВзаиморасчетыПоПатентам);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бит_ум_ИсторияДокументов);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы ГрупповоеИзменениеОбъектов.

// См. ГрупповоеИзменениеОбъектовПереопределяемый.ПриОпределенииОбъектовСРедактируемымиРеквизитами.
Процедура ПриОпределенииОбъектовСРедактируемымиРеквизитами(Объекты) Экспорт
	
	Объекты.Вставить(Метаданные.Справочники.бит_ум_ВидыОформляемыхДокументов.ПолноеИмя(), "РеквизитыНеРедактируемыеВГрупповойОбработке");
	Объекты.Вставить(Метаданные.Справочники.бит_ум_ЗначенияПараметровПечати.ПолноеИмя(), "РеквизитыРедактируемыеВГрупповойОбработке");
	Объекты.Вставить(Метаданные.ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.ПолноеИмя(), "РеквизитыНеРедактируемыеВГрупповойОбработке");
	Объекты.Вставить(Метаданные.Документы.бит_ум_ОтчетностьПоИР.ПолноеИмя(), "РеквизитыНеРедактируемыеВГрупповойОбработке");
	
КонецПроцедуры
	
////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы Пользователи.

// См. ПользователиПереопределяемый.ПриУстановкеНачальныхНастроек.
Процедура ПриУстановкеНачальныхНастроек(НачальныеНастройки) Экспорт
	
	НачальныеНастройки.НастройкиИнтерфейса.ОтображениеПанелиРазделов = ОтображениеПанелиРазделов.КартинкаИТекст;
	НачальныеНастройки.НастройкиКлиента.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
	
	Если НачальныеНастройки.НастройкиТакси <> Неопределено Тогда
		НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
		ГруппаЛево = Новый ГруппаНастройкиСоставаИнтерфейсаКлиентскогоПриложения;
		ГруппаЛево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельРазделов"));
		ГруппаЛево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
		НастройкиСостава.Лево.Добавить(ГруппаЛево);
		НачальныеНастройки.НастройкиТакси.УстановитьСостав(НастройкиСостава);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы ЗащитаПерсональныхДанных.

// См. ЗащитаПерсональныхДанныхПереопределяемый.ЗаполнитьСведенияОПерсональныхДанных.
Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.бит_ум_ДокументыИР";
	НовыеСведения.ПоляРегистрации	= "Физлицо";
	НовыеСведения.ПоляДоступа		= "ВидДокумента,Серия,Номер,ДопПоле,СрокДействия,ТерриторияДействия,ГосударственныйОрган,ДатаВыдачи,ДопПоле2";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.бит_ум_ДопДанныеФизЛиц";
	НовыеСведения.ПоляРегистрации	= "Физлицо";
	НовыеСведения.ПоляДоступа		= "РежимВъезда,Статус,ДатаПрибытия,ДатаУбытия,ПланируемаяДатаОкончанияТрудовойДеятельности";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы ТекущиеДела.

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриОпределенииОбработчиковТекущихДел(Обработчики) Экспорт
	
	Обработчики.Добавить(ОбщегоНазначения.ОбщийМодуль("бит_ум_УчетМигрантовСервер"));
	Обработчики.Добавить(РегистрыСведений.бит_ум_ДокументыИР);
	Обработчики.Добавить(Документы.бит_ум_КвитанцияЗаПатент);
	
КонецПроцедуры

// См. ТекущиеДелаПереопределяемый.ПриОпределенииПорядкаРазделовКомандногоИнтерфейса.
Процедура ПриОпределенииПорядкаРазделовКомандногоИнтерфейса(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.УчетМигрантов);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы ДатыЗапретаИзменения.

// См. ДатыЗапретаИзмененияПереопределяемый.ПриЗаполненииРазделовДатЗапретаИзменения.
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт

	Раздел = Разделы.Добавить();
	Раздел.Имя  = "УчетМигрантов";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("b9e3751d-97cb-4aee-a90b-17f866750ffe");
	Раздел.Представление = НСтр("ru = 'Учет мигрантов'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));
	
КонецПроцедуры

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	// Раздел КадровыйУчет
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бит_ум_КвитанцияЗаПатент",          		   	"Дата",			"УчетМигрантов", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бит_ум_ПодтверждениеПраваНаУменьшениеСуммыНДФЛ","Дата",			"УчетМигрантов", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бит_ум_ОтчетностьПоИР",                			"Дата",			"УчетМигрантов", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бит_ум_ЗаявлениеНаУменьшениеСуммыНДФЛ",         "Дата",			"УчетМигрантов", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.бит_ум_ОтветственныеЛицаЗаИР",			"Период",		"УчетМигрантов", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.бит_ум_ВыполненныеДействия",				"Период",		"УчетМигрантов", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.бит_ум_КонтролирующиеОрганыПоОрганизациям","Период",		"УчетМигрантов", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.бит_ум_ОплатаПатентов",				"Период",		"УчетМигрантов", "Организация");	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы Свойства.

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт

	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "69c5a4da-6f18-4e9d-93a9-6d90ce668ed6", Метаданные.Документы.бит_ум_ОтчетностьПоИР);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы УправлениеДоступом.

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.бит_ум_ЗаявлениеНаУменьшениеСуммыНДФЛ, Истина);
	Списки.Вставить(Метаданные.Документы.бит_ум_КвитанцияЗаПатент, Истина);
	Списки.Вставить(Метаданные.Документы.бит_ум_ОтчетностьПоИР, Истина);
	Списки.Вставить(Метаданные.Документы.бит_ум_ПодтверждениеПраваНаУменьшениеСуммыНДФЛ, Истина); 
	Списки.Вставить(Метаданные.ЖурналыДокументов.бит_ум_ЖурналДокументов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.бит_ум_ВыполненныеДействия, Истина); 
	Списки.Вставить(Метаданные.РегистрыСведений.бит_ум_КонтролирующиеОрганыПоОрганизациям, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.бит_ум_ОтветственныеЛицаЗаИР, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.бит_ум_ПодтверждениеПраваНаУменьшениеСуммыНДФЛ, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.бит_ум_ОплатаПатентов, Истина);	
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа.
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя = "бит_ум_Пользователь";
	ОписаниеПрофиля.Идентификатор = "453d4eee-3aa8-4c55-af89-0fe3f9f7f901";
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Пользователь (Учет мигрантов)'", ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Описание = НСтр("ru = 'Предназначен для пользователей, которые будут работать с подсистемой ""Учет мигрантов"".
                                     |Предоставляет права на все объекты подсистемы.'");	
	
	Если бит_ум_УчетМигрантовПовтИсп.ЭтоБСПВерсии("3.1.5") Тогда
		ОписаниеПрофиля.Роли.Добавить("бит_ум_Пользователь315");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("бит_ум_Пользователь");
	КонецЕсли;
	ОписаниеПрофиля.Роли.Добавить("сл2_Пользователь");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ТекущиеДела") Тогда
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");      
	КонецЕсли;
	
	Если бит_ум_УчетМигрантовВызовСервера.ЭтоУМ() Тогда
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
		ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
		ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
		ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
		ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
		ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРассылокОтчетов");  
		ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
		ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеУниверсальногоОтчета");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");		
		ОписаниеПрофиля.Роли.Добавить("бит_ум_КадровыйУчет");
	КонецЕсли;
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);   
	
	Если бит_ум_УчетМигрантовВызовСервера.ЭтоУМ() Тогда
		ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
		ОписаниеПрофиля.Имя = "бит_ум_ИспользованиеОбработкиОбменДаннымиСТиповымиРешениями";
		ОписаниеПрофиля.Идентификатор = "52860c43-9459-4bdc-9f06-fbc593c62d1c";
		ОписаниеПрофиля.Наименование = НСтр("ru = 'Использование обработки ""Обмен данными с типовыми решениями"" (Учет мигрантов)'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПрофиля.Описание = НСтр("ru = 'Даёт пользователю право на запуск обработки ""Обмен данными с типовыми решениями"".'");	
		ОписаниеПрофиля.Роли.Добавить("бит_ум_ИспользованиеОбработкиОбменДаннымиСТиповымиРешениями");
		ОписанияПрофилей.Добавить(ОписаниеПрофиля);   
	КонецЕсли;	
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт

	Описание = Описание + "
	|Документ.бит_ум_ЗаявлениеНаУменьшениеСуммыНДФЛ.Чтение.Организации
	|Документ.бит_ум_ЗаявлениеНаУменьшениеСуммыНДФЛ.Изменение.Организации
	|Документ.бит_ум_КвитанцияЗаПатент.Чтение.Организации
	|Документ.бит_ум_КвитанцияЗаПатент.Изменение.Организации
	|Документ.бит_ум_ОтчетностьПоИР.Чтение.Организации
	|Документ.бит_ум_ОтчетностьПоИР.Изменение.Организации
	|Документ.бит_ум_ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.Чтение.Организации
	|Документ.бит_ум_ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.Изменение.Организации  
	|ЖурналДокументов.бит_ум_ЖурналДокументов.Чтение.Организации
	|РегистрСведений.бит_ум_ВыполненныеДействия.Чтение.Организации
	|РегистрСведений.бит_ум_ВыполненныеДействия.Изменение.Организации  
	|РегистрСведений.бит_ум_КонтролирующиеОрганыПоОрганизациям.Чтение.Организации
	|РегистрСведений.бит_ум_КонтролирующиеОрганыПоОрганизациям.Изменение.Организации
	|РегистрСведений.бит_ум_ОтветственныеЛицаЗаИР.Чтение.Организации
	|РегистрСведений.бит_ум_ОтветственныеЛицаЗаИР.Изменение.Организации
	|РегистрСведений.бит_ум_ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.Чтение.Организации
	|РегистрСведений.бит_ум_ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.Изменение.Организации
	|РегистрНакопления.бит_ум_ОплатаПатентов.Чтение.Организации
	|РегистрНакопления.бит_ум_ОплатаПатентов.Изменение.Организации";
	
КонецПроцедуры

#КонецОбласти