#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
	   	Возврат;	
	КонецЕсли;
	
	СпособВыполнения = Перечисления.бит_СпособыВыполненияАлгоритма.Сразу;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
		
	Если НЕ Отказ Тогда
		СоздатьТочкуСтарта();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Наименование = СтрШаблон(НСтр("ru='%1 (копия)';en='%1 (copy)'"), ОбъектКопирования.Наименование); 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ПроверитьЗаполнениеВидаАлгоритма(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура создает точку старта.
// 
// Возвращаемое значение:
//  ТочкаСтарта - СправочникСсылка.бит_ТочкиАлгоритмов - Ссылка на точку старта.
//
Функция СоздатьТочкуСтарта()
	
	ТочкаСтарта = Справочники.бит_ТочкиАлгоритмов.ПустаяСсылка();
	СоздатьТочкуСтарта = Ложь;
	Если НЕ ЭтоГруппа И ДополнительныеСвойства.Свойство("СоздатьТочкуСтарта", СоздатьТочкуСтарта) И СоздатьТочкуСтарта Тогда
		
		СпрОбъект = Справочники.бит_ТочкиАлгоритмов.СоздатьЭлемент();
		СпрОбъект.Наименование = "Старт";
		СпрОбъект.ВидТочки     = Перечисления.бит_ВидыТочекАлгоритмов.Старт;
		СпрОбъект.Владелец     = Ссылка;
		
		Если ДополнительныеСвойства.Свойство("ПервоначальноеЗаполнение")
			И ДополнительныеСвойства.ПервоначальноеЗаполнение Тогда
			СпрОбъект.ДополнительныеСвойства.Вставить("ПроверитьЗаполнение", Ложь);
		КонецЕсли;
		
		ДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОбъект,,"Ошибки");
		Если ДействиеВыполнено Тогда
			ТочкаСтарта = СпрОбъект.Ссылка;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат ТочкаСтарта;
	
КонецФункции

Процедура ПроверитьЗаполнениеВидаАлгоритма(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ВидАлгоритма) Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеВидыАлгоритмов = Перечисления.бит_ВидыАлгоритмов.ДоступныеВидыАлгоритмов();
	Если ДоступныеВидыАлгоритмов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДоступныеВидыАлгоритмов.НайтиПоЗначению(ВидАлгоритма) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='Вид алгоритма ""%1"" не доступен для текущей версии программы.'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, ВидАлгоритма);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ВидАлгоритма",, Отказ);
	
КонецПроцедуры


#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли