// + БаринбергГМ 20220625 (9837)
// добавлен реквизит, форма и весь функционал по ученическим договорам
// - БаринбергГМ 20220625 (9837)

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура УВМ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Элементы.Найти("УВМ_ТипРасчетаВозмещения") = Неопределено Тогда
		эТипРасчетаВозмещения = УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_ТипРасчетаВозмещения", Элементы.ГруппаОписанияУсловий, Истина, 4, Элементы.ГруппаОбязательства);
		эТипРасчетаВозмещения.УстановитьДействие("ПриИзменении", "УВМ_ТипРасчетаВозмещенияПриИзменении");
		мТипыРасчетаВозмещения = Новый Массив;
		мТипыРасчетаВозмещения.Добавить(Перечисления.УВМ_ТипыРасчетаВозмещенияПоУченическимДоговорам.Стандартный);
		мТипыРасчетаВозмещения.Добавить(Перечисления.УВМ_ТипыРасчетаВозмещенияПоУченическимДоговорам.ПропорциональноФактическиОтработанномуВремени);
		эТипРасчетаВозмещения.СписокВыбора.ЗагрузитьЗначения(мТипыРасчетаВозмещения);
	КонецЕсли;
	
	УВМ_ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УВМ_ТипРасчетаВозмещенияПриИзменении(Элемент)
	
	УВМ_ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура УВМ_ОбновитьВидимостьЭлементовФормы()
	
	Если Объект.УВМ_ТипРасчетаВозмещения = Перечисления.УВМ_ТипыРасчетаВозмещенияПоУченическимДоговорам.ПропорциональноФактическиОтработанномуВремени Тогда
		Элементы.ГруппаОбязательства.Видимость = Ложь;
		Элементы.ДатаОкончанияОбязательств.ТолькоПросмотр = Ложь;
		
		Если Объект.Обязательства.Количество() = 0 Тогда
			Объект.ДатаОкончанияОбязательств = Объект.ДатаНачалаОбязательств;
		Иначе
			ПериодРаботы = 0;
			Для Каждого Обязательство Из Объект.Обязательства Цикл
				ПериодРаботы = Макс(ПериодРаботы, Обязательство.ПериодРаботы);
			КонецЦикла; 
			Объект.ДатаОкончанияОбязательств = ?(ПериодРаботы = 0, '00010101', НачалоДня(ДобавитьМесяц(Объект.ДатаОкончанияУчебы, ПериодРаботы)));
		КонецЕсли;
	Иначе
		Элементы.ГруппаОбязательства.Видимость = Истина;
		Элементы.ДатаОкончанияОбязательств.ТолькоПросмотр = Истина;
		
		ЗаполнитьПоОснованиюНаСервере(Объект.Мероприятие);
		Если Объект.Обязательства.Количество() = 0 Тогда
			Объект.ДатаОкончанияОбязательств = Объект.ДатаНачалаОбязательств;
		Иначе
			ПоследняяСтрока = Объект.Обязательства[Объект.Обязательства.Количество()-1];
			Объект.ДатаОкончанияОбязательств = ПоследняяСтрока.ДатаОкончания;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти