
&НаСервере
Процедура УВМ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//+dar 20221102 (24881)
	ДопСвойства = Новый Структура;
	ДопСвойства.Вставить("Высота", 2);
	ДопСвойства.Вставить("АвтоМаксимальнаяШирина", Ложь);
	ДопСвойства.Вставить("МаксимальнаяШирина", 48);
	ДопСвойства.Вставить("РастягиватьПоВертикали", Ложь);
	
	УВМ_График = УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_ГрафикРаботы", Элементы.ГруппаУсловияПриемаКраткоеОписание, "Объект.УВМ_ГрафикРаботы", , Элементы.КраткоеОписание, , ДопСвойства);
	УВМ_Продолжительность = УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_ПродолжительностьСмены", Элементы.ГруппаУсловияПриемаКраткоеОписание, "Объект.УВМ_ПродолжительностьСмены", , Элементы.КраткоеОписание, , ДопСвойства);
	//-dar 20221102 (24881) 
	
	// + СБит 2023-12-25 160495 
	УВМ_РаботаСФормами.СоздатьРеквизит(ЭтаФорма, "ЗарегистрироватьКВыгрузке", Новый ОписаниеТипов("Булево")); 
	УВМ_РаботаСФормами.СоздатьРеквизит(ЭтаФорма, "УВМ_ДолжностьУпр", Новый ОписаниеТипов("СправочникСсылка.УВМ_ДолжностиУпр")); 
	НовыйЭлемент = УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_ДолжностьУпр", Элементы.ЛеваяКолонка, "УВМ_ДолжностьУпр",,,"Должность управленческая");
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "УВМ_ДолжностьУпрПриИзменении");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Должности = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СоздатьНаборЗаписей();
		Должности.Отбор.Период.Установить(ТекущаяДатаСеанса()); // + СБит 2026-07-13 #УВМ
		Должности.Отбор.Позиция.Установить(Объект.Ссылка);
		Должности.Прочитать();
		Если Должности.Количество()>0 Тогда
			ЭтаФорма["УВМ_ДолжностьУпр"] = Должности[0].УВМ_ДолжностьУпр;
		КонецЕсли;
	КонецЕсли;
    // - СБит 2023-12-25
	
КонецПроцедуры

&НаСервере
Процедура УВМ_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//dar++ 20221212
	Если ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда 
		// + СБит 2026-07-13 #УВМ
		//Если НЕ ЗначениеЗаполнено(ЭтаФорма.МестоВСтруктуреПредприятия.Подразделение) Тогда
		//	ОбщегоНазначения.СообщитьПользователю("Не заполнено место в стр-ре предприятия!", , , , Отказ);
		//	Отказ = Истина;
		//КонецЕсли;
		// - СБит 2026-07-13 #УВМ
	КонецЕсли;
	//--dar 20221212
	
	// + СБит 2024-03-12
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		// 1
		ПредыдущиеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, "Должность,Подразделение");
		
		// 2 
		ПредыдущиеЗначения.Вставить("УВМ_ДолжностьУпр", Справочники.УВМ_ДолжностиУпр.ПустаяСсылка());
		НаборЗаписей = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДатаСеанса()); // + СБит 2026-07-13 #УВМ
		НаборЗаписей.Отбор.Позиция.Установить(Объект.Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество()>0 Тогда
			ПредыдущиеЗначения.УВМ_ДолжностьУпр = НаборЗаписей[0].УВМ_ДолжностьУпр;
		КонецЕсли;
		
		// 3
		Если ПредыдущиеЗначения.Должность <> Объект.Должность ИЛИ ПредыдущиеЗначения.Подразделение <> Объект.Подразделение ИЛИ ПредыдущиеЗначения.УВМ_ДолжностьУпр <> ЭтаФорма["УВМ_ДолжностьУпр"] Тогда  
			ЭтаФорма["ЗарегистрироватьКВыгрузке"] = Истина;
		КонецЕсли;
	КонецЕсли;
	// - СБит 2024-03-12
	
КонецПроцедуры

&НаСервере
Процедура УВМ_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//// + СБит 2023-12-25 160495 
	//Если Не Отказ Тогда 
	//	Привилегии = ПривилегированныйРежим();
	//	УстановитьПривилегированныйРежим(Истина);

	//	НаборЗаписей = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.Позиция.Установить(Объект.Ссылка);
	//	НаборЗаписей.Прочитать();
	//	Если НаборЗаписей.Количество() = 0 Тогда 
	//		Запись = НаборЗаписей.Добавить(); 
	//		Запись.Позиция = Объект.Ссылка;
	//		Запись.УВМ_ДолжностьУпр = ЭтаФорма["УВМ_ДолжностьУпр"];
	//	Иначе	
	//		НаборЗаписей[0].УВМ_ДолжностьУпр = ЭтаФорма["УВМ_ДолжностьУпр"];
	//	КонецЕсли;
	//	НаборЗаписей.Записать(); 
	//	
	//	// + СБит 2024-03-12
	//	Если ЭтаФорма["ЗарегистрироватьКВыгрузке"] = Истина Тогда
	//		ОбменДаннымиПереопределяемый.ОбновитьИсториюСотрудниковПоШтатке(Объект.Ссылка);
	//	КонецЕсли;	
	//    // - СБит 2024-03-12
	//	УстановитьПривилегированныйРежим(Привилегии);
	//	
	//КонецЕсли;
	//// - СБит 2023-12-25 
	
КонецПроцедуры

&НаСервере
Процедура УВМ_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	// + СБит 2023-12-25 160495 
	Привилегии = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДатаСеанса());
	НаборЗаписей.Отбор.Позиция.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда 
		Запись = НаборЗаписей.Добавить(); 
		Запись.Период = ТекущаяДатаСеанса(); // + СБит 2026-07-13 #УВМ
		Запись.Позиция = Объект.Ссылка;
		Запись.УВМ_ДолжностьУпр = ЭтаФорма["УВМ_ДолжностьУпр"];
	Иначе	
		НаборЗаписей[0].УВМ_ДолжностьУпр = ЭтаФорма["УВМ_ДолжностьУпр"];
	КонецЕсли;
	НаборЗаписей.Записать(); 
	
	// + СБит 2024-03-12
	Если ЭтаФорма["ЗарегистрироватьКВыгрузке"] = Истина Тогда
		ОбменДаннымиПереопределяемый.ОбновитьИсториюСотрудниковПоШтатке(Объект.Ссылка);
	КонецЕсли;	
	// - СБит 2024-03-12
	УстановитьПривилегированныйРежим(Привилегии);
		
    // - СБит 2023-12-25 
КонецПроцедуры

&НаКлиенте
Процедура УВМ_ДолжностьУпрПриИзменении(Элемент)
	
	// + СБит 2023-12-25 160495 
	Модифицированность = Истина;
    // - СБит 2023-12-25
	
КонецПроцедуры

