	
#Область СлужебныйПрограммныйИнтерфейс

Функция ПреобразоватьДанныеДляПередачиАссистенту(ПараметрыПреобразования) Экспорт
	
	Возврат бит_ИскусственныйИнтеллектКлиентСервер.ПреобразоватьДанныеДляПередачиАссистенту(ПараметрыПреобразования);
	
КонецФункции

Функция JSONВЗначение(Знач Строка, Знач ИменаСвойствСоЗначениямиДата = Неопределено, Знач ПрочитатьВСоответствие = Истина) Экспорт
	
	Возврат бит_ИскусственныйИнтеллектКлиентСервер.JSONВЗначение(Строка, ИменаСвойствСоЗначениямиДата, ПрочитатьВСоответствие);
	
КонецФункции

Функция ЗначениеВJSON(Знач Значение) Экспорт
	
	Возврат бит_ИскусственныйИнтеллектКлиентСервер.ЗначениеВJSON(Значение);
	
КонецФункции

Процедура РаспознатьДокумент(ДанныеДокумента, Результат = "", Знач ОписаниеВложения, Знач ПараметрыВзаимодействия) Экспорт
	
	бит_ИскусственныйИнтеллект.РаспознатьДокумент(ДанныеДокумента, Результат, ОписаниеВложения, ПараметрыВзаимодействия);
	
КонецПроцедуры

#КонецОбласти