#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ бит_ум_УчетМигрантовСервер.ПолучитьЛицензию(Истина) Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьНастройки();
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

 	// СтандартныеПодсистемы.ПодключаемыеКоманды
 	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
 	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	Элементы.ВАрхиве.Видимость = Истина;
	ЗаполнитьНастройки();
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
 	// СтандартныеПодсистемы.ПодключаемыеКоманды
 	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
 	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтролироватьИсполнениеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОформляемогоДокументаПриИзменении(Элемент)

	Объект.ДополнительныеНастройки.Очистить();
	ЗаполнитьНастройки();
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;	
	
	Элементы.ГруппаСрокИсполнения.Видимость = Объект.КонтролироватьИсполнение;
	Элементы.ГруппаДополнительныеНастройки.Видимость = Объект.ДополнительныеНастройки.Количество() > 0;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки()
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидОформляемогоДокумента) Тогда
		Объект.ДополнительныеНастройки.Очистить();
		Возврат;
	КонецЕсли;
	
	СтарыеНастройки = Объект.ДополнительныеНастройки.Выгрузить();
	Объект.ДополнительныеНастройки.Очистить();
	
	СписокНастроек = бит_ум_УчетМигрантовПовтИсп.СписокВозможныхНастроекВидаОформляемогоДокумента(Объект.ВидОформляемогоДокумента);
	СписокНастроек.Сортировать("Настройка");
	Для Каждого СтрокаНастроек Из СписокНастроек Цикл
		СтрокаТЗ = Объект.ДополнительныеНастройки.Добавить();
		СтрокаТЗ.Настройка = СтрокаНастроек.Настройка;
		НайденнаяСтрока = СтарыеНастройки.Найти(СтрокаТЗ.Настройка, "Настройка");
		Если НайденнаяСтрока <> Неопределено Тогда
			СтрокаТЗ.Значение = СтрокаТЗ.Настройка.ТипЗначения.ПривестиЗначение(НайденнаяСтрока.Значение);
		Иначе
			СтрокаТЗ.Значение = СтрокаНастроек.НачальноеЗначение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти