#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Перем КлючВарианта;
	
	СтандартнаяОбработка = Ложь;
	УстановитьЗаголовкиПолейДопИзмерений();
	
	ПользовательскиеПараметры = ЗначенияПараметровКомпоновщика();
	
	Список = НовыйСписок();

	// Добавление данных по расчетам.
	ИзменитьСКДДляРасчетов(СхемаКомпоновкиДанных, КомпоновщикНастроек);
	
	ЗаполнитьОбязательныеПараметры(Список, ПользовательскиеПараметры);
	
	НастроитьДинамическийПериод(ПользовательскиеПараметры.ВариантИсполнения, ПользовательскиеПараметры.ДополнятьПериоды);
	
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Вывод суммы.
	Если ПользовательскиеПараметры.ВыводитьСумму Тогда
		Если ПользовательскиеПараметры.ВыводитьКоличество И ПользовательскиеПараметры.ВыводитьСумму Тогда
			ГруппаПолей = НастройкиКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
			ГруппаПолей.Заголовок = НСтр("ru = 'Сумма';en='Sum'");
		Иначе
			ГруппаПолей = НастройкиКомпоновкиДанных.Выбор;
		КонецЕсли;

		НомерГруппы = 1;
		Для Каждого СтрокаТаблицы Из Список Цикл
			Путь 	  = СтрШаблон("Сумма%1", СтрокаТаблицы.НомерСтроки);
			Заголовок = СтрокаТаблицы.Код;
			ДобавитьЭлементВГруппу(НастройкиКомпоновкиДанных, ГруппаПолей, Путь, Заголовок,
				ПользовательскиеПараметры.ВыводитьСумму);
			
			Если ПользовательскиеПараметры.НарастающийИтог Тогда
				Путь 	  = СтрШаблон("СуммаИтоги%1", СтрокаТаблицы.НомерСтроки);
				Заголовок = СтрокаТаблицы.Код + " " + НСтр("ru = '(нарастающий итог)'; en = '(cumulative total)'");
				ДобавитьЭлементВГруппу(НастройкиКомпоновкиДанных, ГруппаПолей, Путь, Заголовок,
					ПользовательскиеПараметры.ВыводитьСумму);
			КонецЕсли;	

			Если СтрокаТаблицы.НомерСтроки = 1 Тогда
				Продолжить;	
			КонецЕсли;
			
			Путь	  = СтрШаблон("СуммаАбс%1", НомерГруппы);
			Заголовок = СтрШаблон(НСтр("ru = 'Отклонение абс. (%1)';en='Deviation abs. (%1)'"), СтрокаТаблицы.Код);
			ДобавитьЭлементВГруппу(НастройкиКомпоновкиДанных, ГруппаПолей, Путь, Заголовок,
				ПользовательскиеПараметры.ВыводитьАбсОтклонение);
			
			Путь	  = СтрШаблон("СуммаОтн%1", НомерГруппы);
			Заголовок = СтрШаблон(НСтр("ru = 'Отклонение отн. (%1)';en='Deviation rel. (%1)'"), СтрокаТаблицы.Код);
			ДобавитьЭлементВГруппу(НастройкиКомпоновкиДанных, ГруппаПолей, Путь, Заголовок,
				ПользовательскиеПараметры.ВыводитьОтнОтклонение);

			НомерГруппы = НомерГруппы + 1;
		КонецЦикла;
	КонецЕсли;
		
	// Вывод количества.	
	Если ПользовательскиеПараметры.ВыводитьКоличество Тогда		
		Если ПользовательскиеПараметры.ВыводитьКоличество И ПользовательскиеПараметры.ВыводитьСумму Тогда
			ГруппаПолей = НастройкиКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
			ГруппаПолей.Заголовок = НСтр("ru = 'Количество';en='Quantity'");
		Иначе
			ГруппаПолей = НастройкиКомпоновкиДанных.Выбор;
		КонецЕсли;
		
		НомерГруппы = 1;
		Для Каждого СтрокаТаблицы Из Список Цикл
			Путь 	  = СтрШаблон("Количество%1", СтрокаТаблицы.НомерСтроки);
			Заголовок = СтрокаТаблицы.Код;
			ДобавитьЭлементВГруппу(НастройкиКомпоновкиДанных, ГруппаПолей, Путь, Заголовок,
				ПользовательскиеПараметры.ВыводитьКоличество);
			
			Если ПользовательскиеПараметры.НарастающийИтог Тогда
				Путь 	  = СтрШаблон("КоличествоИтоги%1", СтрокаТаблицы.НомерСтроки);
				Заголовок = СтрокаТаблицы.Код + " " + НСтр("ru = '(нарастающий итог)'; en = '(cumulative total)'");
				ДобавитьЭлементВГруппу(НастройкиКомпоновкиДанных, ГруппаПолей, Путь, Заголовок,
					ПользовательскиеПараметры.ВыводитьСумму);
			КонецЕсли;	

			Если СтрокаТаблицы.НомерСтроки = 1 Тогда
				Продолжить;	
			КонецЕсли;
			
			Путь	  = СтрШаблон("КоличествоАбс%1", НомерГруппы);
			Заголовок = СтрШаблон(НСтр("ru = 'Отклонение абс. (%1)';en='Deviation abs. (%1)'"), СтрокаТаблицы.Код);
			ДобавитьЭлементВГруппу(НастройкиКомпоновкиДанных, ГруппаПолей, Путь, Заголовок,
				ПользовательскиеПараметры.ВыводитьАбсОтклонение);
			
			Путь	  = СтрШаблон("КоличествоОтн%1", НомерГруппы);
			Заголовок = СтрШаблон(НСтр("ru = 'Отклонение отн. (%1)';en='Deviation rel. (%1)'"), СтрокаТаблицы.Код);
			ДобавитьЭлементВГруппу(НастройкиКомпоновкиДанных, ГруппаПолей, Путь, Заголовок,
				ПользовательскиеПараметры.ВыводитьОтнОтклонение);

			НомерГруппы = НомерГруппы + 1;
		КонецЦикла;
	КонецЕсли;
	
	// Вывод результата.
	ДокументРезультат.Очистить();

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
	
	СкорректироватьСвязиНаборовДанныхМакетаКомпоновки(МакетКомпоновки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);

	бит_ОтчетыБФСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, 
		ДокументРезультат, ВспомогательныеПараметрыОтчета());
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПоБюджету = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПоБюджету").Значение;
	Если ПоБюджету Тогда
		Бюджет = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Бюджет").Значение;
		Если НЕ ЗначениеЗаполнено(Бюджет) Тогда
			ТекстСообщения = НСтр("ru = 'Не установлен ""Бюджет"".'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , ,Отказ); 
		КонецЕсли;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'В настройках отчета не заполнены сценарии для сравнения.'");
	СценарииДляСравнения = Новый ТаблицаЗначений; 
	НастройкиОтчета 	 = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "СценарииДляСравнения").Значение;
	Если НастройкиОтчета = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
	Иначе	
		СценарииДляСравнения = НастройкиОтчета.Получить();
		Если НЕ ЗначениеЗаполнено(СценарииДляСравнения) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
		КонецЕсли;
	КонецЕсли;
	
	ВариантИсполнения = Истина;
	Параметр = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек,"ВариантИсполнения");
	Если Параметр <> Неопределено Тогда
		ВариантИсполнения = Параметр.Значение;	
	КонецЕсли;
	
	Если ВариантИсполнения = 1 Тогда
		Параметр = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период");
		Если НЕ ЗначениеЗаполнено(Параметр.Значение) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен период отчета.'");	
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
		КонецЕсли;	
	КонецЕсли;
	
	ПроверитьСписок(СценарииДляСравнения, ВариантИсполнения, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПослеЗаполненияПанелиБыстрыхНастроек   = Истина;
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	Настройки.События.ПередЗагрузкойВариантаНаСервере = Истина;
	
	Настройки.События.ПриОпределенииСвойствЭлементовФормыНастроек = Истина;
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = Отчеты.бит_ПланФактныйАнализБюджетаСРасчетами.ЗагрузитьНастройкиПриИзмененииПараметров();
	
КонецПроцедуры

// Вызывается после перезаполнения панели настроек формы отчета.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   ПараметрыЗаполнения - Структура - Параметры, которые будут загружены в отчет.
//
Процедура ПослеЗаполненияПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт

	// См. так же: Форма.ФормаНастроекОтчета.ОтобразитьСписок().
	Отчеты.бит_ПланФактныйАнализБюджетаСРасчетами.УправлениеФормой(Форма);
		
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//   Например, если схема отчета зависит от ключа варианта или параметров отчета.
//   Чтобы изменения схемы вступили в силу следует вызывать метод ОтчетыСервер.ПодключитьСхему().
//
// Параметры:
//   Контекст - Произвольный - 
//       Параметры контекста, в котором используется отчет.
//       Используется для передачи в параметрах метода ОтчетыСервер.ПодключитьСхему().
//   КлючСхемы - Строка -
//       Идентификатор текущей схемы компоновщика настроек.
//       По умолчанию не заполнен (это означает что компоновщик инициализирован на основании основной схемы).
//       Используется для оптимизации, чтобы переинициализировать компоновщик как можно реже).
//       Может не использоваться если переинициализация выполняется безусловно.
//   КлючВарианта - Строка, Неопределено -
//       Имя предопределенного или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов для варианта расшифровки или без контекста.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных, Неопределено -
//       Настройки варианта отчета, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено когда настройки варианта не надо загружать (уже загружены ранее).
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных, Неопределено -
//       Пользовательские настройки, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено когда пользовательские настройки не надо загружать (уже загружены ранее).
//
// Примеры:
// 1. Компоновщик отчета инициализируется на основании схемы из общих макетов:
//	Если КлючСхемы <> "1" Тогда
//		КлючСхемы = "1";
//		СхемаКД = ПолучитьОбщийМакет("МояОбщаяСхемаКомпоновки");
//		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКД, КлючСхемы);
//	КонецЕсли;
//
// 2. Схема зависит от значения параметра, выведенного в пользовательские настройки отчета:
//	Если ТипЗнч(НовыеПользовательскиеНастройкиКД) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
//		ПолноеИмяОбъектаМетаданных = "";
//		Для Каждого ЭлементКД Из НовыеПользовательскиеНастройкиКД.Элементы Цикл
//			Если ТипЗнч(ЭлементКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
//				ИмяПараметра = Строка(ЭлементКД.Параметр);
//				Если ИмяПараметра = "ОбъектМетаданных" Тогда
//					ПолноеИмяОбъектаМетаданных = ЭлементКД.Значение;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЦикла;
//		Если КлючСхемы <> ПолноеИмяОбъектаМетаданных Тогда
//			КлючСхемы = ПолноеИмяОбъектаМетаданных;
//			СхемаКД = Новый СхемаКомпоновкиДанных;
//			// Наполнение схемы...
//			ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКД, КлючСхемы);
//		КонецЕсли;
//	КонецЕсли;
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, Настройки, ПользовательскиеНастройки) Экспорт
	
	ТекущийКлючСхемы = Неопределено;
	
	Если Настройки = Неопределено Тогда 
		Настройки = КомпоновщикНастроек.Настройки;
	КонецЕсли;
	
	ЭтоЗагруженнаяСхема = Ложь;
	ДвоичныеДанныеСхемы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Настройки.ДополнительныеСвойства, "СхемаКомпоновкиДанных");
	
	Если ТипЗнч(ДвоичныеДанныеСхемы) = Тип("ДвоичныеДанные") Тогда
		ТекущийКлючСхемы = ХешДвоичныхДанных(ДвоичныеДанныеСхемы);
		Если ТекущийКлючСхемы <> КлючСхемы Тогда
			Схема = Отчеты.бит_ПланФактныйАнализБюджетаСРасчетами.ИзвлечьСхемуИзДвоичныхДанных(ДвоичныеДанныеСхемы);
			ЭтоЗагруженнаяСхема = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ДоступныеЗначения = Неопределено;
	ФиксированныеПараметры = Отчеты.бит_ПланФактныйАнализБюджетаСРасчетами.ФиксированныеПараметры(
		Настройки, ПользовательскиеНастройки, ДоступныеЗначения);
	
	Если ТекущийКлючСхемы = Неопределено Тогда 
		ТекущийКлючСхемы = "" + ФиксированныеПараметры.ПоБюджету + "/" + ФиксированныеПараметры.ВариантИсполнения;
		ТекущийКлючСхемы = ОбщегоНазначения.СократитьСтрокуКонтрольнойСуммой(ТекущийКлючСхемы, 100);
		
		Если ТекущийКлючСхемы <> КлючСхемы Тогда
			КлючСхемы = "";
			Схема = Отчеты.бит_ПланФактныйАнализБюджетаСРасчетами.СхемаКомпоновкиДанных(ФиксированныеПараметры);
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийКлючСхемы <> Неопределено И ТекущийКлючСхемы <> КлючСхемы Тогда
		КлючСхемы = ТекущийКлючСхемы;
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, Схема, КлючСхемы);
		
		Если ЭтоЗагруженнаяСхема Тогда
			Отчеты.бит_ПланФактныйАнализБюджетаСРасчетами.УстановитьСтандартныеНастройкиЗагруженнойСхемы(
				ЭтотОбъект, ДвоичныеДанныеСхемы, Настройки, ПользовательскиеНастройки);
		Иначе
			Отчеты.бит_ПланФактныйАнализБюджетаСРасчетами.УстановитьСтандартныеНастройки(
				ЭтотОбъект, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
		КонецЕсли;
		
		Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
			// Переопределение.
			// АПК:278-выкл Допустимое исключение.
			ИнтеграцияПодсистемБСП.ПередЗагрузкойВариантаНаСервере(Контекст, Настройки);
			// АПК:278-вкл
			ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере(Контекст, Настройки);
			ПередЗагрузкойВариантаНаСервере(Контекст, Настройки);
		КонецЕсли;
	Иначе
		Отчеты.бит_ПланФактныйАнализБюджетаСРасчетами.УстановитьФиксированныеПараметры(
			ЭтотОбъект, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ДоступныеЗначения", ДоступныеЗначения);

КонецПроцедуры

Процедура ПередЗагрузкойВариантаНаСервере(Форма, Настройки) Экспорт
	
	ТекущийКлючСхемы = Неопределено;
	Схема = Неопределено;
	КлючСхемы = "";
	ЭтоЗагруженнаяСхема = Ложь;
	
	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") ИЛИ Настройки = Неопределено Тогда
		Если Настройки = Неопределено Тогда
			ДополнительныеСвойстваНастроек = КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
		Иначе
			ДополнительныеСвойстваНастроек = Настройки.ДополнительныеСвойства;
		КонецЕсли;
		
		Если Форма.ТипФормыОтчета = ТипФормыОтчета.Основная
			И (Форма.РежимРасшифровки
			ИЛИ Форма.КлючТекущегоВарианта <> "ПланФактныйАнализБюджетаСРасчетами") Тогда 
			ДополнительныеСвойстваНастроек.Вставить("ОтчетИнициализирован", Истина);
		КонецЕсли;
		
		ДвоичныеДанныеСхемы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДополнительныеСвойстваНастроек, "СхемаКомпоновкиДанных");
		
		Если ТипЗнч(ДвоичныеДанныеСхемы) = Тип("ДвоичныеДанные") Тогда
			ЭтоЗагруженнаяСхема = Истина;
			ТекущийКлючСхемы = ХешДвоичныхДанных(ДвоичныеДанныеСхемы);
			Схема = Отчеты.бит_ПланФактныйАнализБюджетаСРасчетами.ИзвлечьСхемуИзДвоичныхДанных(ДвоичныеДанныеСхемы);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоЗагруженнаяСхема Тогда
		КлючСхемы = ТекущийКлючСхемы;
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Форма, Схема, КлючСхемы);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииСвойствЭлементовФормыНастроек(ТипФормы, СвойстваЭлементов, ПользовательскиеНастройки) Экспорт 
	
	Если ТипФормы <> ТипФормыОтчета.Основная Тогда 
		Возврат;
	КонецЕсли;
	
	СвойстваГруппы = ОтчетыСервер.СвойстваГруппыЭлементовФормы();
	СвойстваГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СвойстваЭлементов.Группы.Вставить("ФиксированныеПараметры", СвойстваГруппы);
	
	ФиксированныеПараметры = Новый Структура("Период, ПоБюджету, Бюджет");
	ШиринаПоля = Новый Структура("ПоБюджету, Бюджет", 5, 35);
	
	Для Каждого ЭлементНастройки Из ПользовательскиеНастройки Цикл 
		Если ТипЗнч(ЭлементНастройки) <> Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			Или Не ФиксированныеПараметры.Свойство(ЭлементНастройки.Параметр) Тогда 
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля = СвойстваЭлементов.Поля.Найти(
			ЭлементНастройки.ИдентификаторПользовательскойНастройки, "ИдентификаторНастройки");
		
		Если СвойстваПоля = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля.ИдентификаторГруппы = "ФиксированныеПараметры";
		
		ИмяПараметра = Строка(ЭлементНастройки.Параметр);
		Если ИмяПараметра <> "Период" Тогда 
			СвойстваПоля.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			СвойстваПоля.Ширина = ШиринаПоля[ИмяПараметра];
			СвойстваПоля.РастягиватьПоГоризонтали = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИзменениеЗапросаПоРасчетам

// Процедура меняет текст запроса для СКД и подставляет фиксированные параметры.
//
// Параметры:
//  СКД - СхемаКомпоновкиДанных.
//
Процедура ИзменитьСКДДляРасчетов(СхемаКомпоновкиДанных, КомпоновщикНастроек)
	
	ПараметрыМодификации = бит_ОтчетыСРасчетамиСервер.НовыеПараметрыМодификацииСКДДляРасчетов();
	ПараметрыМодификации.МенеджерОтчета             = Отчеты.бит_ПланФактныйАнализБюджетаСРасчетами;
	ПараметрыМодификации.СхемаКомпоновкиДанных      = СхемаКомпоновкиДанных;
	ПараметрыМодификации.КомпоновщикНастроек        = КомпоновщикНастроек;
	ПараметрыМодификации.ПутьКНаборуДанных          = "Результат.Элементы.НаборДанных1";
	ПараметрыМодификации.КоличествоВариацийРесурсов = 5;
	ПараметрыМодификации.ШаблонТекстаРасчета        = ШаблонТекстаРасчета();
	ПараметрыМодификации.СхемаКомпоновкиДанныхПоУмолчанию = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	ЗаполнитьОписаниеРесурсов(ПараметрыМодификации);
	бит_ОтчетыСРасчетамиСервер.ИзменитьСКДДляРасчетов(ПараметрыМодификации);
	
КонецПроцедуры

Функция ШаблонТекстаРасчета()
	
	Возврат
	"ВЫБРАТЬ
	|	ОборотыРезультат.Сценарий КАК Сценарий,
	|	ОборотыРезультат.ЦФО КАК ЦФО,
	|	ОборотыРезультат.Организация КАК Организация,
	|	&СтатьяРасчета КАК Статья,
	|	ОборотыРезультат.СтатьяБюджета КАК СтатьяБюджета,
	|	ОборотыРезультат.СтатьяОборотов КАК СтатьяОборотов,
	|	ОборотыРезультат.Валюта КАК Валюта,
	|	ОборотыРезультат.Аналитика_1 КАК Аналитика_1,
	|	ОборотыРезультат.Аналитика_2 КАК Аналитика_2,
	|	ОборотыРезультат.Аналитика_3 КАК Аналитика_3,
	|	ОборотыРезультат.Аналитика_4 КАК Аналитика_4,
	|	ОборотыРезультат.Аналитика_5 КАК Аналитика_5,
	|	ОборотыРезультат.Аналитика_6 КАК Аналитика_6,
	|	ОборотыРезультат.Аналитика_7 КАК Аналитика_7,
	|	ОборотыРезультат.Аналитика_8 КАК Аналитика_8,
	|	ОборотыРезультат.Аналитика_9 КАК Аналитика_9,
	|	ОборотыРезультат.Аналитика_10 КАК Аналитика_10,
	|	ОборотыРезультат.Аналитика_11 КАК Аналитика_11,
	|	ОборотыРезультат.Аналитика_12 КАК Аналитика_12,
	|	ОборотыРезультат.ТипДокумента КАК ТипДокумента,
	|	ОборотыРезультат.СтатусДокумента КАК СтатусДокумента,
	|	ОборотыРезультат.Регистратор КАК Регистратор,
	|	ОборотыРезультат.ПериодСекунда КАК ПериодСекунда,
	|	ОборотыРезультат.ПериодДень КАК ПериодДень,
	|	ОборотыРезультат.ПериодНеделя КАК ПериодНеделя,
	|	ОборотыРезультат.ПериодДекада КАК ПериодДекада,
	|	ОборотыРезультат.ПериодМесяц КАК ПериодМесяц,
	|	ОборотыРезультат.ПериодКвартал КАК ПериодКвартал,
	|	ОборотыРезультат.ПериодПолугодие КАК ПериодПолугодие,
	|	ОборотыРезультат.ПериодГод КАК ПериодГод,
	|	0 КАК Сумма1,
	|	0 КАК Количество1,
	|	0 КАК Сумма2,
	|	0 КАК Количество2,
	|	0 КАК Сумма3,
	|	0 КАК Количество3,
	|	0 КАК Сумма4,
	|	0 КАК Количество4,
	|	0 КАК Сумма5,
	|	0 КАК Количество5,
	|	ЛОЖЬ КАК ЭтоРасчет,
	|	&ОбластьРасчетныхПараметров КАК ОбластьРасчетныхПараметров
	|ИЗ
	|	ВТОборотыИсточник КАК ОборотыРезультат
	|ГДЕ
	|	ОборотыРезультат.СтатьяБюджета В ИЕРАРХИИ(&ЗначениеОтбораПараметра)";
	
КонецФункции

Процедура ЗаполнитьОписаниеРесурсов(ПараметрыМодификации)
	
	ОписаниеРесурсов = ПараметрыМодификации.ОписаниеРесурсов;
	
	Для Вариация = 1 По ПараметрыМодификации.КоличествоВариацийРесурсов Цикл 
		НовоеОписание = ОписаниеРесурсов.Добавить();
		НовоеОписание.ИмяРесурса = "Сумма" + Вариация;
		НовоеОписание.ВидРесурса = "Сумма";
		НовоеОписание.Вариация   = Вариация;
		
		НовоеОписание = ОписаниеРесурсов.Добавить();
		НовоеОписание.ИмяРесурса = "Количество" + Вариация;
		НовоеОписание.ВидРесурса = "Количество";
		НовоеОписание.Вариация   = Вариация;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ЗначенияПараметровКомпоновщика()
	
	ПользовательскиеПараметры = Новый Структура;
	
	ЗначениеПоУмолчанию = 1;
	ДобавитьЗначениеПараметра(ПользовательскиеПараметры, "ВариантИсполнения", ЗначениеПоУмолчанию);
	ДобавитьЗначениеПараметра(ПользовательскиеПараметры, "ДополнятьПериоды");
	
	ЗначениеПоУмолчанию = Ложь;
	ВыводитьКоличество  = ЗначениеПараметраКомпоновщика("ВыводитьКоличество", ЗначениеПоУмолчанию);
	ВыводитьСумму       = ЗначениеПараметраКомпоновщика("ВыводитьСумму",      ЗначениеПоУмолчанию);
	Если НЕ ВыводитьСумму И НЕ ВыводитьКоличество Тогда
		ВыводитьСумму = Истина;
	КонецЕсли;
	ПользовательскиеПараметры.Вставить("ВыводитьКоличество", ВыводитьКоличество);
	ПользовательскиеПараметры.Вставить("ВыводитьСумму",      ВыводитьСумму);
	ДобавитьЗначениеПараметра(ПользовательскиеПараметры, "ОтображатьПустыеСтроки", ЗначениеПоУмолчанию);
	
	ЗначениеПоУмолчанию = Истина;
	ДобавитьЗначениеПараметра(ПользовательскиеПараметры, "ВыводитьАбсОтклонение", ЗначениеПоУмолчанию);
	ДобавитьЗначениеПараметра(ПользовательскиеПараметры, "ВыводитьОтнОтклонение", ЗначениеПоУмолчанию);
	ДобавитьЗначениеПараметра(ПользовательскиеПараметры, "НарастающийИтог", ЗначениеПоУмолчанию);
	
	ЗначениеПоУмолчанию = 4;
	ДобавитьЗначениеПараметра(ПользовательскиеПараметры, "Показатели", ЗначениеПоУмолчанию);
	
	Возврат ПользовательскиеПараметры;
	
КонецФункции

Процедура ДобавитьЗначениеПараметра(ПользовательскиеПараметры, ИмяПараметра, ЗначениеПоУмолчанию = Неопределено)
	
	ЗначениеПараметра    = ЗначениеПоУмолчанию;
	ПараметрКомпоновщика = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, ИмяПараметра);
	Если ПараметрКомпоновщика <> Неопределено Тогда
		ЗначениеПараметра = ПараметрКомпоновщика.Значение;
	КонецЕсли;
	
	ПользовательскиеПараметры.Вставить(ИмяПараметра, ЗначениеПараметра);
	
КонецПроцедуры

Функция ЗначениеПараметраКомпоновщика(ИмяПараметра, ЗначениеПоУмолчанию = Неопределено)
	
	ПараметрКомпоновщика = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, ИмяПараметра);
	Если ПараметрКомпоновщика = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат ПараметрКомпоновщика.Значение;
	
КонецФункции

Процедура ЗаполнитьОбязательныеПараметры(Список, ПользовательскиеПараметры)

	НастройкиОтчета    	 = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "СценарииДляСравнения").Значение;
	СценарииДляСравнения = НастройкиОтчета.Получить();
	Если НЕ ЗначениеЗаполнено(СценарииДляСравнения) Тогда
		ВызватьИсключение НСтр("ru = 'Список сценариев пустой.'");
	КонецЕсли;
	
	Список = НовыйСписок(); // Приведение списка к формальному виду.
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СценарииДляСравнения, Список);
	
	Если ПользовательскиеПараметры.ВариантИсполнения = 1 Тогда
		// В обычном варианте П/Ф анализа все запросы выполняются в одном периоде.
		// Поэтому перенесем параметр "Период" во все строки таблицы. 
		// Это необходимо для однотипного применения списка сценариев.
		Период = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек,"Период").Значение;
		Список.ЗаполнитьЗначения(Период, "Период");
	КонецЕсли;
	
	// Установка параметров Сценарий 1 ... 5.
	НомерСтроки = 2; // 1 - всегда занята эталоном.
	Для каждого СтрокаТаблицы Из Список Цикл
		Если СтрокаТаблицы.Эталон Тогда
			СтрокаТаблицы.НомерСтроки = 1;
		Иначе
			СтрокаТаблицы.НомерСтроки = НомерСтроки;
			НомерСтроки = НомерСтроки + 1;
		КонецЕсли; 
		ИмяПараметраСценарий = СтрШаблон("Сценарий%1", СтрокаТаблицы.НомерСтроки);
		ИмяПараметраПериод	 = СтрШаблон("Период%1", СтрокаТаблицы.НомерСтроки);
		
		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, ИмяПараметраСценарий,  СтрокаТаблицы.Сценарий);
		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, ИмяПараметраПериод,  СтрокаТаблицы.Период);
		Если ПустаяСтрока(СтрокаТаблицы.Код) Тогда
			СтрокаТаблицы.Код = Строка(СтрокаТаблицы.Сценарий);			
		КонецЕсли;
	КонецЦикла; 
	
	Список.Сортировать("НомерСтроки возр");
		
	ФиксированныеПараметры = Отчеты.бит_ПланФактныйАнализБюджетаСРасчетами.НовыеФиксированныеПараметры();
	ФиксированныеПараметры.Вставить("СценарииДляСравнения", Список);
	
	СхемаКомпоновкиДанных = Отчеты.бит_ПланФактныйАнализБюджетаСРасчетами.ПодготовитьСхемуПоСпискуСценариев(
								СхемаКомпоновкиДанных, Список, ПользовательскиеПараметры);
	
КонецПроцедуры

Процедура УстановитьЗаголовкиПолейДопИзмерений()
	
	Отчеты.бит_ПланФактныйАнализБюджетаСРасчетами.УстановитьЗаголовкиПолейДопИзмерений(СхемаКомпоновкиДанных);
	
КонецПроцедуры

Процедура ДобавитьЭлементВГруппу(НастройкиКомпоновкиДанных, Группа, Путь, Заголовок, Использование)
	
	ВыбранноеПоле = бит_ОтчетыБФКлиентСервер.ВыбранноеПоле(НастройкиКомпоновкиДанных, Путь, Истина);
	Если ВыбранноеПоле = Неопределено Тогда
		ВыбранноеПоле = бит_ОтчетыБФКлиентСервер.ДобавитьВыбранноеПоле(Группа, Путь, Заголовок);
		ВыбранноеПоле.Использование = Использование;
	КонецЕсли;
	ВыбранноеПоле.Заголовок = Заголовок;
	
КонецПроцедуры
 
Процедура ПроверитьСписок(Список, ВариантИсполнения, Отказ)

	Если НЕ ЗначениеЗаполнено(Список) Тогда
		Возврат;
	КонецЕсли;
	
	СценарииДляСравнения = НовыйСписок();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Список, СценарииДляСравнения);
	
	ЭталонУстановлен = Ложь;
	Поле			 = "";
	
	НомерСтроки = 0;
	ИмяСписка = НСтр("ru='Сценарии';en='Scenarios'");
	Для каждого СтрокаТаблицы Из СценарииДляСравнения Цикл
		
		Префикс = СтрШаблон("СценарииДляСравнения[%1].", Формат(НомерСтроки , "ЧН=0; ЧГ="));
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сценарий) Тогда
			Поле = Префикс + "Сценарий";
			ИмяПоля = НСтр("ru='Сценарий';en='Scenario'");
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",, ИмяПоля, НомерСтроки + 1, ИмяСписка);			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
		Если ВариантИсполнения <> 1 Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Период) Тогда
				Поле = Префикс + "Период";
				ИмяПоля = НСтр("ru='Период';en='Period'");
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",, ИмяПоля, НомерСтроки + 1, ИмяСписка);				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Иначе
				Если ЗначениеЗаполнено(СтрокаТаблицы.Период.ДатаОкончания) И СтрокаТаблицы.Период.ДатаНачала > СтрокаТаблицы.Период.ДатаОкончания Тогда
					ТекстСообщения = НСтр("ru='Дата начала периода не может быть больше даты конца периода';
										  |en='The start date of the period cannot be greater than the end date of the period.'");					
					Поле = Префикс + "Период";
					ИмяПоля = НСтр("ru='Период';en='Period'");
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ", ИмяПоля, НомерСтроки + 1, ИмяСписка);					
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаТаблицы.Эталон Тогда
			ЭталонУстановлен = Истина;		
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла; 

	Если НЕ ЭталонУстановлен Тогда
		ТекстПричины   = НСтр("ru = 'Не выделен эталонный сценарий.';en='Reference scenario not selected.'"); 
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("СПИСОК", "КОРРЕКТНОСТЬ",,, ИмяСписка, ТекстПричины);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйСписок()
	
	Возврат Отчеты.бит_ПланФактныйАнализБюджетаСРасчетами.НовыйСписок();
	
КонецФункции

Процедура ОформитьДинамическийПериод()

	ПараметрПериодичность = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Периодичность");
	
	ИскомоеПоле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ДинамическийПериод");
	
	ПараметрОформленияФормат = ИскомоеПоле.Оформление.Элементы.Найти("Формат");
	ПараметрОформленияФормат.Значение = ФорматнаяСтрокаАналогичныхПериодов(ПараметрПериодичность.Значение);
	ПараметрОформленияФормат.Использование = Истина;
	
КонецПроцедуры

Функция ФорматнаяСтрокаАналогичныхПериодов(Периодичность)
	
	ФорматнаяСтрока = "";
	
	Если Периодичность = Перечисления.бит_ПериодичностьПланирования.День Тогда
		ФорматнаяСтрока = "ДЛФ=D";
	ИначеЕсли Периодичность = Перечисления.бит_ПериодичностьПланирования.Неделя Тогда
		ФорматнаяСтрока = "ДЛФ=D";
	ИначеЕсли Периодичность = Перечисления.бит_ПериодичностьПланирования.Декада Тогда
		ФорматнаяСтрока = "ДЛФ=D";
	ИначеЕсли Периодичность = Перечисления.бит_ПериодичностьПланирования.Месяц Тогда
		ФорматнаяСтрока = "ДФ='ММММ'";
	ИначеЕсли Периодичность = Перечисления.бит_ПериодичностьПланирования.Квартал Тогда
		ФорматнаяСтрока = "ДФ='к ""кв.""'";
	ИначеЕсли Периодичность = Перечисления.бит_ПериодичностьПланирования.Полугодие Тогда
		ФорматнаяСтрока = "ДФ=ММ";
	ИначеЕсли Периодичность = Перечисления.бит_ПериодичностьПланирования.Год Тогда
		ФорматнаяСтрока = "ДФ=yyyy";
	КонецЕсли;
	
	Возврат ФорматнаяСтрока;
КонецФункции

Процедура СкорректироватьСвязиНаборовДанныхМакетаКомпоновки(МакетКомпоновки)
	
	Для каждого СвязьНаборовДанных Из МакетКомпоновки.СвязиНаборовДанных Цикл
		Если СвязьНаборовДанных.НаборДанныхИсточник = "СписокСтатей"
			И СвязьНаборовДанных.НаборДанныхПриемник = "Результат" Тогда
			СвязьНаборовДанных.ТипСвязи = ТипСвязиНаборовДанныхКомпоновкиДанных.Внутренняя;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает хеш-сумму двоичных данных.
//
// Параметры:
//   ДвоичныеДанные - ДвоичныеДанные - Данные, от которых считается хеш-сумма.
//
Функция ХешДвоичныхДанных(ДвоичныеДанные)
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеДанных.Добавить(ДвоичныеДанные);
	Возврат СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "") + "_" + Формат(ДвоичныеДанные.Размер(), "ЧГ=");
КонецФункции

Функция ВспомогательныеПараметрыОтчета()
	
	ВспомогательныеПараметры = Новый Массив;
	ВспомогательныеПараметры.Добавить("СценарииДляСравнения");
	ВспомогательныеПараметры.Добавить("ВариантИсполнения");
	
	ВспомогательныеПараметры.Добавить("Периодичность");
	ВспомогательныеПараметры.Добавить("ВыводитьСумму");
	ВспомогательныеПараметры.Добавить("ВыводитьКоличество");
	ВспомогательныеПараметры.Добавить("ВыводитьАбсОтклонение");
	ВспомогательныеПараметры.Добавить("ВыводитьОтнОтклонение");
			
	Возврат ВспомогательныеПараметры;
	
КонецФункции

Процедура НастроитьДинамическийПериод(ВариантИсполнения, ДополнятьПериод)
	
	бит_ОтчетыБФСервер.НастроитьДинамическийПериод(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДополнятьПериод);
	Если ВариантИсполнения <> 1 Тогда
		ОформитьДинамическийПериод();	
	КонецЕсли;

	ДинамическийПериодИспользуется = Ложь;
	Группировки = бит_ОтчетыБФКлиентСервер.ПолучитьГруппировки(КомпоновщикНастроек);
	
	Для каждого Элемент Из Группировки Цикл
		ПоляГруппировки = Элемент.Значение.ПоляГруппировки.Элементы;
		Для каждого ПолеГруппировки Из ПоляГруппировки Цикл
			Если Строка(ПолеГруппировки.Поле) = "ДинамическийПериод" Тогда
				Если Элемент.Значение.Использование И ПолеГруппировки.Использование Тогда
					ДинамическийПериодИспользуется = Истина;				
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если НЕ ДинамическийПериодИспользуется Тогда
		Для каждого Макет Из СхемаКомпоновкиДанных.Макеты Цикл
			ПараметрРасшифровки = Макет.Параметры.ПараметрРасшифровки;
			ДинамическийПериод = ПараметрРасшифровки.ВыраженияПолей.Найти("ГруппировкаПериод");
			Если ДинамическийПериод <> Неопределено Тогда
				ПараметрРасшифровки.ВыраженияПолей.Удалить(ДинамическийПериод);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Инициализация

УстановитьЗаголовкиПолейДопИзмерений();

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
