#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;

	Настройки = Настройки();
	ВнешниеНаборы = Новый Структура("Настройки", Настройки);
	
	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиОсновнойСхемы, "ТекстВсеПредприятие", 
		НСтр("ru = '<Для всего предприятия>'; en = 'For the whole enterprise'"));
		
	ДокументРезультат.Очистить();
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборы, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
Функция Настройки()

	Настройки = Новый ТаблицаЗначений;
	Настройки.Колонки.Добавить("СтруктурноеПодразделение");
	Настройки.Колонки.Добавить("СтруктурноеПодразделениеПредставление");
	Настройки.Колонки.Добавить("Параметр");
	Настройки.Колонки.Добавить("Значение");
	Настройки.Колонки.Добавить("ПорядокРазделов");
	Настройки.Колонки.Добавить("ПорядокПараметров");
	Настройки.Колонки.Добавить("Раздел");

	СтруктурныеПодразделения = СтруктурныеПодразделения();
	ЗаполнитьОбщиеНастройки(Настройки, СтруктурныеПодразделения);
	ЗаполнитьНастройкиБюджетирования(Настройки, СтруктурныеПодразделения);
	ЗаполнитьНастройкиКазначейства(Настройки, СтруктурныеПодразделения);
	ЗаполнитьНастройкиВизирования(Настройки, СтруктурныеПодразделения);
	ЗаполнитьНастройкиДоговоровИЗатрат(Настройки, СтруктурныеПодразделения);
	ЗаполнитьНастройкиЗакупок(Настройки, СтруктурныеПодразделения);
	
	Возврат Настройки;
	
КонецФункции

Функция СтруктурныеПодразделения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекстВсеПредприятие", НСтр("ru = '<Для всего предприятия>'"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_НастройкиБюджетирования.СтруктурноеПодразделение КАК СтруктурноеПодразделение
	|ПОМЕСТИТЬ ВсеСтруктурныеПодразделения
	|ИЗ
	|	РегистрСведений.бит_НастройкиБюджетирования КАК бит_НастройкиБюджетирования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_НастройкиВизирования.СтруктурноеПодразделение
	|ИЗ
	|	РегистрСведений.бит_НастройкиВизирования КАК бит_НастройкиВизирования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_НастройкиДоговоровИЗатрат.СтруктурноеПодразделение
	|ИЗ
	|	РегистрСведений.бит_НастройкиДоговоровИЗатрат КАК бит_НастройкиДоговоровИЗатрат
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_НастройкиЗакупок.СтруктурноеПодразделение
	|ИЗ
	|	РегистрСведений.бит_НастройкиЗакупок КАК бит_НастройкиЗакупок
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_НастройкиКазначейства.СтруктурноеПодразделение
	|ИЗ
	|	РегистрСведений.бит_НастройкиКазначейства КАК бит_НастройкиКазначейства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_НастройкиПрограммыОбщие.СтруктурноеПодразделение
	|ИЗ
	|	РегистрСведений.бит_НастройкиПрограммыОбщие КАК бит_НастройкиПрограммыОбщие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеСтруктурныеПодразделения.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ВЫБОР
	|		КОГДА ВсеСтруктурныеПодразделения.СтруктурноеПодразделение = НЕОПРЕДЕЛЕНО
	|			ТОГДА &ТекстВсеПредприятие
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ВсеСтруктурныеПодразделения.СтруктурноеПодразделение)
	|	КОНЕЦ КАК СтруктурноеПодразделениеПредставление,
	|	ВЫБОР
	|		КОГДА ВсеСтруктурныеПодразделения.СтруктурноеПодразделение = НЕОПРЕДЕЛЕНО
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТИПЗНАЧЕНИЯ(ВсеСтруктурныеПодразделения.СтруктурноеПодразделение)
	|	КОНЕЦ КАК ПредставлениеТипа
	|ИЗ
	|	ВсеСтруктурныеПодразделения КАК ВсеСтруктурныеПодразделения";
	
	РезультатЗапроса		 = Запрос.Выполнить();
	СтруктурныеПодразделения = РезультатЗапроса.Выгрузить(); 

	Для каждого СтрокаТаблицы Из СтруктурныеПодразделения Цикл
		Если СтрокаТаблицы.ПредставлениеТипа <> НЕОПРЕДЕЛЕНО Тогда
			СтрокаТаблицы.СтруктурноеПодразделениеПредставление = СтрокаТаблицы.СтруктурноеПодразделениеПредставление
				+ " (" + СтрокаТаблицы.ПредставлениеТипа + ")";		
		КонецЕсли;	
	КонецЦикла;
	
	Возврат СтруктурныеПодразделения;
	
КонецФункции
 
Процедура ЗаполнитьОбщиеНастройки(Настройки, СтруктурныеПодразделения)

	Период = ТекущаяДатаСеанса();
	Раздел 	= НСтр("ru = 'Общие настройки'");
	ПорядокРазделов = 1;
	Для каждого СтрокаТаблицы Из СтруктурныеПодразделения Цикл
		ПорядокПараметров = 0;
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Календарь'");
		НоваяСтрока.Значение = бит_НастройкиПрограммы.Календарь(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
	КонецЦикла; 

КонецПроцедуры

Процедура ЗаполнитьНастройкиБюджетирования(Настройки, СтруктурныеПодразделения)

	Период = ТекущаяДатаСеанса();
	Раздел 	= НСтр("ru = 'Бюджетирование'");
	ПорядокРазделов = 2;
	Для каждого СтрокаТаблицы Из СтруктурныеПодразделения Цикл
		ПорядокПараметров = 0;

		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Отключить автоматическое формирование движений по факту БДДС'");
		НоваяСтрока.Значение = бит_НастройкиПрограммы.НеФормироватьДвиженияПоФактуАвтоматически(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Сценарий отражения факта по бюджету'");
		НоваяСтрока.Значение = бит_НастройкиПрограммы.СценарийОтраженияФактаБДДС(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Не формировать проводки бюджетирования при автоматическом сборе факта'");
		НоваяСтрока.Значение = бит_НастройкиПрограммы.НеФормироватьПроводкиБюджетированияПриАвтоматическомСбореФакта(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Формировать зависимые обороты при автоматическом сборе факта'");
		НоваяСтрока.Значение = бит_НастройкиПрограммы.ФормироватьЗависимыеОборотыПриАвтоматическомСбореФакта(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Не учитывать сверхбюджетные операции при контроле по бюджету'");
		НоваяСтрока.Значение = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Отражать факт БДДС на основании опер учета'");
		НоваяСтрока.Значение = бит_НастройкиПрограммы.ОтражатьФактБДДСНаОснованииОперУчета(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
	КонецЦикла; 

КонецПроцедуры

Процедура ЗаполнитьНастройкиКазначейства(Настройки, СтруктурныеПодразделения)

	Период = ТекущаяДатаСеанса();
	Раздел 	= НСтр("ru = 'Казначейство'");
	ПорядокРазделов = 3;
	Для каждого СтрокаТаблицы Из СтруктурныеПодразделения Цикл
		ПорядокПараметров = 0;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Превышение суммы прогноза платежа в заявках на расходование ДС (%)'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.ДопустимыйПроцентПревышенияСуммыПрогнозаПлатежа(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Контролировать заявку по бюджету'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.КонтролироватьЗаявкуПоБюджету(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Сценарий контроля по бюджету'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.КазначействоСценарийКонтроляПоБюджету(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Не учитывать сверхбюджетные заявки при контроле по бюджету'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеЗаявкиПриКонтролеПоБюджету(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'При изменении крайней даты платежа'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.КонтролироватьКрайнююДатуПлатежа(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		//ПорядокПараметров = ПорядокПараметров + 1;
		//НоваяСтрока = Настройки.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		//НоваяСтрока.Параметр = НСтр("ru = 'Превышение суммы заявки в платежных позициях (%)'") ;
		//НоваяСтрока.Значение = бит_НастройкиПрограммы.ДопустимыйПроцентПревышенияСуммыЗаявки(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		//НоваяСтрока.Раздел 	= Раздел; 
		//НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		//НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		//ПорядокПараметров = ПорядокПараметров + 1;
		//НоваяСтрока = Настройки.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		//НоваяСтрока.Параметр = НСтр("ru = 'Автоматически заполнять назначение платежа в заявках на расходование ДС'") ;
		//НоваяСтрока.Значение = бит_НастройкиПрограммы.ЗаполнятьНазначениеПлатежаВЗаявкеНаРасходованиеДС(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		//НоваяСтрока.Раздел 	= Раздел; 
		//НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		//НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Запретить платежи без заявки'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.ЗапретитьПлатежиБезЗаявки(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
				
		//ПорядокПараметров = ПорядокПараметров + 1;
		//НоваяСтрока = Настройки.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		//НоваяСтрока.Параметр = НСтр("ru = 'Создавать планируемые поступления ДС при переводе между счетами'") ;
		//НоваяСтрока.Значение = бит_НастройкиПрограммы.СоздаватьПланируемыеПоступленияДСПриПереводе(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		//НоваяСтрока.Раздел 	= Раздел; 
		//НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		//НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		//ПорядокПараметров = ПорядокПараметров + 1;
		//НоваяСтрока = Настройки.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		//НоваяСтрока.Параметр = НСтр("ru = 'Контролировать наличие прикрепленного файла в заявке'") ;
		//НоваяСтрока.Значение = бит_НастройкиПрограммы.КонтролироватьНаличиеВложенияЗаявки(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		//НоваяСтрока.Раздел 	= Раздел; 
		//НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		//НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Контролировать остатки по прогнозу платежа'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.КонтролироватьОстаткиПоПрогнозуПлатежа(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Превышение суммы прогноза поступления ДС (%)'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.ДопустимыйПроцентПревышенияСуммыПрогнозаПоступления(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Контролировать остатки по прогнозу поступления'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.КонтролироватьОстаткиПоПрогнозуПоступления(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
	КонецЦикла; 

КонецПроцедуры

Процедура ЗаполнитьНастройкиВизирования(Настройки, СтруктурныеПодразделения)

	Период = ТекущаяДатаСеанса();
	Раздел 	= НСтр("ru = 'Визирование'");
	ПорядокРазделов = 3;
	Для каждого СтрокаТаблицы Из СтруктурныеПодразделения Цикл
		ПорядокПараметров = 0;
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Использовать производственный календарь для расчета даты ""Установить не позднее""'");
		НоваяСтрока.Значение = бит_НастройкиПрограммы.ИспользоватьКалендарьДляРасчетаКрайнейДаты(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Начало рабочего дня'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.ВизированиеНачалоРабочегоДня(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Окончание рабочего дня'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.ВизированиеОкончаниеРабочегоДня(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
	КонецЦикла; 

КонецПроцедуры
 
Процедура ЗаполнитьНастройкиДоговоровИЗатрат(Настройки, СтруктурныеПодразделения)

	Период = ТекущаяДатаСеанса();
	Раздел 	= НСтр("ru = 'Учет договоров и затрат'");
	ПорядокРазделов = 4;
	Для каждого СтрокаТаблицы Из СтруктурныеПодразделения Цикл
		ПорядокПараметров = 0;
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Устанавливать в договорах высокий приоритет заполнения аналитик'");
		НоваяСтрока.Значение = бит_НастройкиПрограммы.УстанавливатьВДоговорахВысокийПриоритетЗаполненияАналитик(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		//ПорядокПараметров = ПорядокПараметров + 1;
		//НоваяСтрока = Настройки.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		//НоваяСтрока.Параметр = НСтр("ru = 'Превышение суммы заявки на затраты в расходных позициях (%)'") ;
		//НоваяСтрока.Значение = бит_НастройкиПрограммы.ДопустимыйПроцентПревышенияСуммыЗаявкиНаЗатраты(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		//НоваяСтрока.Раздел 	= Раздел; 
		//НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		//НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Контролировать графики договоров по бюджету'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.КонтролироватьГрафикиДоговоровПоБюджету(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		//ПорядокПараметров = ПорядокПараметров + 1;
		//НоваяСтрока = Настройки.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		//НоваяСтрока.Параметр = НСтр("ru = 'Контролировать дату расхода заявки на затраты'") ;
		//НоваяСтрока.Значение = бит_НастройкиПрограммы.КонтролироватьДатуРасходаЗаявкиНаЗатраты(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		//НоваяСтрока.Раздел 	= Раздел; 
		//НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		//НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Контролировать превышения суммы по договору'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.КонтролироватьПревышенияСуммыПоДоговору(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		//ПорядокПараметров = ПорядокПараметров + 1;
		//НоваяСтрока = Настройки.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		//НоваяСтрока.Параметр = НСтр("ru = 'Контролировать превышения суммы по договору для заявок на затраты'") ;
		//НоваяСтрока.Значение = бит_НастройкиПрограммы.КонтролироватьПревышенияСуммыПоДоговоруДляЗаявокНаЗатраты(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		//НоваяСтрока.Раздел 	= Раздел; 
		//НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		//НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		//ПорядокПараметров = ПорядокПараметров + 1;
		//НоваяСтрока = Настройки.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		//НоваяСтрока.Параметр = НСтр("ru = 'Контролировать превышения суммы по договору для заявок'") ;
		//НоваяСтрока.Значение = бит_НастройкиПрограммы.КонтролироватьПревышенияСуммыПоДоговоруДляЗаявок(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		//НоваяСтрока.Раздел 	= Раздел; 
		//НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		//НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		//ПорядокПараметров = ПорядокПараметров + 1;
		//НоваяСтрока = Настройки.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		//НоваяСтрока.Параметр = НСтр("ru = 'Контролировать дату расхода заявки на расходование ДС'") ;
		//НоваяСтрока.Значение = бит_НастройкиПрограммы.КонтролироватьДатуРасходаЗаявкиНаРасходованиеДС(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		//НоваяСтрока.Раздел 	= Раздел; 
		//НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		//НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
	КонецЦикла; 

КонецПроцедуры
 
Процедура ЗаполнитьНастройкиЗакупок(Настройки, СтруктурныеПодразделения)

	Период = ТекущаяДатаСеанса();
	Раздел 	= НСтр("ru = 'Учет закупок'");
	ПорядокРазделов = 5;
	Для каждого СтрокаТаблицы Из СтруктурныеПодразделения Цикл
		ПорядокПараметров = 0;
		//ПорядокПараметров = ПорядокПараметров + 1;
		//НоваяСтрока = Настройки.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		//НоваяСтрока.Параметр = НСтр("ru = 'Контролировать заявку на закупку по бюджету'");
		//НоваяСтрока.Значение = бит_НастройкиПрограммы.КонтролироватьЗаявкуНаЗакупкуПоБюджету(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		//НоваяСтрока.Раздел 	= Раздел; 
		//НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		//НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		//ПорядокПараметров = ПорядокПараметров + 1;
		//НоваяСтрока = Настройки.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		//НоваяСтрока.Параметр = НСтр("ru = 'Не учитывать сверхбюджетные заявки на закупку при контроле по бюджету'") ;
		//НоваяСтрока.Значение = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеЗаявкиНаЗакупкуПриКонтролеПоБюджету(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		//НоваяСтрока.Раздел 	= Раздел; 
		//НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		//НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		//ПорядокПараметров = ПорядокПараметров + 1;
		//НоваяСтрока = Настройки.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		//НоваяСтрока.Параметр = НСтр("ru = 'Контролировать количество номенклатуры по заявкам на закупку'") ;
		//НоваяСтрока.Значение = бит_НастройкиПрограммы.КонтролироватьКоличествоНоменклатурыПоЗаявкамНаЗакупку(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		//НоваяСтрока.Раздел 	= Раздел; 
		//НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		//НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		//ПорядокПараметров = ПорядокПараметров + 1;
		//НоваяСтрока = Настройки.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		//НоваяСтрока.Параметр = НСтр("ru = 'Контролировать остатки на складе для передачи'") ;
		//НоваяСтрока.Значение = бит_НастройкиПрограммы.КонтролироватьОстаткиНаСкладеДляПередачи(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		//НоваяСтрока.Раздел 	= Раздел; 
		//НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		//НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Формировать движения по факту бюджета закупок'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.ФормироватьДвиженияПоФактуБюджетаЗакупок(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Формировать зависимые обороты по факту бюджета закупок'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.ФормироватьЗависимыеОборотыПоФактуБюджетаЗакупок(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Контролировать заявку на затраты по бюджету'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.КонтролироватьЗаявкуНаЗатратыПоБюджету(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		ПорядокПараметров = ПорядокПараметров + 1;
		НоваяСтрока = Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Параметр = НСтр("ru = 'Не учитывать сверхбюджетные заявки на затраты при контроле по бюджету'") ;
		НоваяСтрока.Значение = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеЗаявкиНаЗатратыПриКонтролеПоБюджету(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		НоваяСтрока.Раздел 	= Раздел; 
		НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
		
		//ПорядокПараметров = ПорядокПараметров + 1;
		//НоваяСтрока = Настройки.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		//НоваяСтрока.Параметр = НСтр("ru = 'Не формировать проводки бюджетирования по факту бюджета закупок'") ;
		//НоваяСтрока.Значение = бит_НастройкиПрограммы.НеФормироватьПроводкиБюджетированияПоФактуБюджетаЗакупок(СтрокаТаблицы.СтруктурноеПодразделение, Период);
		//НоваяСтрока.Раздел 	= Раздел; 
		//НоваяСтрока.ПорядокРазделов = ПорядокРазделов;
		//НоваяСтрока.ПорядокПараметров = ПорядокПараметров;
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'; en = 'Invalid call of the object on the client.'");
#КонецЕсли