#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НомерВерсии = ПолучитьВерсиюКонфигурации();
	
	Конфигурация = СтрШаблон(НСтр("ru = '%3, редакция %1 (%2)'"),
		РедакцияКонфигурации(НомерВерсии), НомерВерсии, НаименованиеКонфигурации());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьВерсиюКонфигурации()
	
	Если бит_ум_УчетМигрантовСервер.ВидКонфигурации() = "ЗУПУМ" ИЛИ
		бит_ум_УчетМигрантовСервер.ВидКонфигурации() = "ЗУПУМКОРП" Тогда
		Возврат ОбновлениеИнформационнойБазы.ВерсияИБ("УчетМигрантов") + "_" + Метаданные.Версия;
	Иначе
		Возврат ОбновлениеИнформационнойБазы.ВерсияИБ("УчетМигрантов");
	КонецЕсли;
	
КонецФункции

// Возвращает редакцию конфигурации.
//
&НаСервере
Функция РедакцияКонфигурации(Знач ВерсияКонфигурации)
	
	Результат = "";
	
	Позиция = СтрНайти(ВерсияКонфигурации, ".");
	Если Позиция > 0 Тогда
		Результат = Лев(ВерсияКонфигурации, Позиция);
		ВерсияКонфигурации = Сред(ВерсияКонфигурации, Позиция + 1);
		Позиция = СтрНайти(ВерсияКонфигурации, ".");
		Если Позиция > 0 Тогда
			Результат = Результат + Лев(ВерсияКонфигурации, Позиция - 1);
		Иначе
			Результат = "";
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(Результат) Тогда
		Результат = Метаданные.Версия;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НаименованиеКонфигурации()
	
	Если бит_ум_УчетМигрантовСервер.ВидКонфигурации() = "ЗУПУМ" Тогда
		Возврат "БИТ.Учет мигрантов (ЗУП)";
	ИначеЕсли бит_ум_УчетМигрантовСервер.ВидКонфигурации() = "ЗУПУМКОРП" Тогда	
		Возврат "БИТ.Учет мигрантов (ЗУП КОРП)";
	Иначе
		Возврат "БИТ.Учет мигрантов";
	КонецЕсли;
	
КонецФункции

#КонецОбласти