#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий	

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗарплатаКадры.ЗаполнитьЗначениеРеквизитаОрганизацияПриОднофирменномУчете(ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
		НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КоличествоМесяцев) Тогда
		КоличествоМесяцев = 1;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Сотрудник")
		И ЗначениеЗаполнено(ДанныеЗаполнения.Сотрудник) И (НЕ ДанныеЗаполнения.Свойство("Организация")
		ИЛИ НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Организация)) Тогда
		
		ИменаКадровыхДанных = "Организация";
	
		КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, ДанныеЗаполнения.Сотрудник, ИменаКадровыхДанных, Дата);
		Если КадровыеДанные.Количество() > 0 Тогда
			ДанныеЗаполнения.Вставить("Организация", КадровыеДанные[0].Организация);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПараметрыПроведения = ПолучитьДанныеДляПроведения(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПоРегистрам(ПараметрыПроведения, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоРегистрам(ПараметрыПроведения, Отказ)
	
	Движения.бит_ум_ОплатаПатентов.Записывать = Истина;
	
	Для Каждого Строка Из ПараметрыПроведения.ОплатаПатентов Цикл
		СуммаОсталось = Строка.Сумма;
		ТекущийНомерМесяца = 1;
		ТекущийПериод = Строка.ПериодВзаиморасчетов;
		Пока ТекущийНомерМесяца <= Строка.КоличествоМесяцев Цикл
			Движение = Движения.бит_ум_ОплатаПатентов.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Строка, , "ПериодВзаиморасчетов, Сумма");
			Движение.ПериодВзаиморасчетов = ТекущийПериод;
			Движение.Сумма = Строка.Сумма / Строка.КоличествоМесяцев;
			СуммаОсталось = СуммаОсталось - Движение.Сумма;
			ТекущийПериод = ДобавитьМесяц(Строка.ПериодВзаиморасчетов, ТекущийНомерМесяца);
			ТекущийНомерМесяца = ТекущийНомерМесяца + 1;
		КонецЦикла;
		Движение.Сумма = Движение.Сумма + СуммаОсталось;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеДляПроведения(Отказ)
		
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КвитанцияЗаПатент.Дата КАК Период,
	|	КвитанцияЗаПатент.Организация КАК Организация,
	|	КвитанцияЗаПатент.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КвитанцияЗаПатент.НачалоПериода КАК НачалоПериода,
	|	КвитанцияЗаПатент.КоличествоМесяцев КАК КоличествоМесяцев,
	|	КвитанцияЗаПатент.НачалоПериода КАК ПериодВзаиморасчетов,
	|	КвитанцияЗаПатент.СуммаДокумента КАК Сумма
	|ИЗ
	|	Документ.бит_ум_КвитанцияЗаПатент КАК КвитанцияЗаПатент
	|ГДЕ
	|	КвитанцияЗаПатент.Ссылка = &Регистратор";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеДляПроведения = Новый Структура; 
	
	ДанныеДляПроведения.Вставить("ОплатаПатентов", РезультатыЗапроса[0].Выгрузить());
	
	Возврат ДанныеДляПроведения;

КонецФункции	

#КонецОбласти
	
#КонецЕсли