
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Организация, Основание");
	ДатаДОПП = ТекущаяДатаСеанса();
	
	ЕстьПравоДобавленияДОПП = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.УведомлениеОСпецрежимахНалогообложения);
	ЕстьПравоЧтенияДОПП = ПравоДоступа("Чтение", Метаданные.Документы.УведомлениеОСпецрежимахНалогообложения);
	Элементы.СписокДОППСоздатьДОПП.Видимость = ЕстьПравоДобавленияДОПП;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НачатьОбновлениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_УведомлениеОСпецрежимахНалогообложения" Тогда
		НачатьОбновлениеФормы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	НачатьОбновлениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДОПП(Команда)
	
	ДлительнаяОперация = НачатьСозданиеРеглОтчетаСервер();

	ОповещениеОЗавершении = Новый ОписаниеОповещения("СозданиеРеглОтчетаЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СписокДОППВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЕстьПравоЧтенияДОПП Тогда
		ОбщегоНазначенияУТКлиент.ИзменитьЭлемент(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОбновлениеФормы()

	ДлительнаяОперация = НачатьОбновлениеФормыНаСервере();

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновлениеФормыЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция НачатьОбновлениеФормыНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	ПараметрыПолученияДанных = Новый Структура();
	ПараметрыПолученияДанных.Вставить("Основание", Основание);
	
	ИмяФункции = "РегистрыСведений.ДокументыОПредстоящейПоставке.ЗаполнитьСписокДОПППоОснованию";
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		ИмяФункции, ПараметрыПолученияДанных);
	
КонецФункции

&НаКлиенте
Процедура ОбновлениеФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	СписокДОПП.Очистить();
	
	ИтоговыеДанные = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	МассивДанныхДОПП = ИтоговыеДанные.СписокДОПП;
	Для Каждого ДокументДОПП Из МассивДанныхДОПП Цикл
		Строка = СписокДОПП.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, ДокументДОПП);
	КонецЦикла;
	
	Элементы.НомерДОПП.Видимость = Не ИтоговыеДанные.НетДанныхФНС;
	Элементы.ДатаДОПП.Видимость = Не ИтоговыеДанные.НетДанныхФНС;
	Элементы.СтатусДОПП.Видимость = Не ИтоговыеДанные.НетДанныхФНС;
	
КонецПроцедуры

&НаСервере
Функция НачатьСозданиеРеглОтчетаСервер()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	ПараметрыСозданияДОПП = Новый Структура();
	ПараметрыСозданияДОПП.Вставить("Организация", Организация);
	ПараметрыСозданияДОПП.Вставить("Основание",   Основание);
	ПараметрыСозданияДОПП.Вставить("Дата",        ДатаДОПП);
	
	ИмяФункции = "УчетНДСРФвызовСервера.СоздатьРеглОтчетДОПП";
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		ИмяФункции, ПараметрыСозданияДОПП);
	
КонецФункции

&НаКлиенте
Процедура СозданиеРеглОтчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	СсылкаНаДОПП = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если ЗначениеЗаполнено(СсылкаНаДОПП) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", СсылкаНаДОПП);
		ОткрытьФорму("Документ.УведомлениеОСпецрежимахНалогообложения.Форма.ФормаДокумента", 
					ПараметрыФормы,
					ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СтатусДОПП.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокДОПП.СтатусДОПП");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'В работе';
																|en = 'В работе'"));

	ОтборЭлемента.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти

