
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура УВМ_ОбработкаПроведения(Отказ, РежимПроведения)

	Документы.УвольнениеСписком.ПровестиПоУчетам(Ссылка, РежимПроведения, Отказ, Неопределено, Движения, ЭтотОбъект, ДополнительныеСвойства);

	#Вставка
	//+dar 20221129 (11805)
	Если НЕ Отказ Тогда
		Узел = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоКоду("ИТ");
		Для Каждого СтрокаТЧ Из Сотрудники Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрокаТЧ.Сотрудник);	
		КонецЦикла;
	КонецЕсли;
	//-dar 20221129 (11805)

	//++dar 07.06.23 (117669)
	Если НЕ Отказ Тогда
		МсвСотрудников = СотрудникиАрхива(Сотрудники.ВыгрузитьКолонку("Сотрудник"), Ложь);
		Для Каждого ТекущийСотрудник Из МсвСотрудников Цикл
			КадровыйУчет.ПоместитьСотрудникаВАрхив(ТекущийСотрудник);	
		КонецЦикла;
	КонецЕсли;
	//--dar 07.06.23 (117669)
	#КонецВставки
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура УВМ_ОбработкаУдаленияПроведения(Отказ)
	//++dar 07.06.23 (117669)
	Если НЕ Отказ Тогда
		МсвСотрудников = СотрудникиАрхива(Сотрудники.ВыгрузитьКолонку("Сотрудник"), Истина);
		Для Каждого ТекущийСотрудник Из МсвСотрудников Цикл
			КадровыйУчет.ИзвлечьСотрудникаИзАрхива(ТекущийСотрудник);	
		КонецЦикла;
	КонецЕсли;
	//--dar 07.06.23 (117669)
КонецПроцедуры

//++dar 07.06.23 (117669)
Функция СотрудникиАрхива(МассивОбъектов, ВАрхиве)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ВАрхиве = &ВАрхиве
	|	И Сотрудники.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("ВАрхиве", ВАрхиве);
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции
//--dar 07.06.23 (117669)
