
&НаКлиенте
&ИзменениеИКонтроль("ВыполнитьРасчетНачислений")
Процедура УВМ_ВыполнитьРасчетНачислений()

    #Вставка
	//++dar 10.04.23 (99225) выводим кадровикам инфу об ученических договорах
	Если НЕ РегистрацияНачисленийДоступна Тогда
		ОбучениеРазвитиеВызовСервера.УведомитьОбОбязательствахСотрудниковПоУченическимДоговорамСервер(Объект.ФизическоеЛицо, Объект.Организация, Объект.ДатаУвольнения);
	КонецЕсли;
	//--dar 10.04.23 (99225)
	#КонецВставки

	Если Не ИспользуетсяРасчетЗарплаты Тогда
		Возврат;
	КонецЕсли;

	ЗарплатаКадрыРасширенныйКлиент.ПодключитьОбработчикОжиданияАвтоматическогоРасчета(
	ЭтотОбъект, РегистрацияНачисленийДоступна, "РассчитатьНачисленияНаКлиенте", , "ОчиститьРассчитанныеДанныеНаКлиенте");

	ПодключитьОбработчикОжиданияФормы("РассчитатьНачисленияНаКлиенте", Ложь);

КонецПроцедуры
