
&После("ПередФормированиемСпискаПолучателейРассылки")
Процедура УВМ_ПередФормированиемСпискаПолучателейРассылки(ПараметрыПолучателей, Запрос, СтандартнаяОбработка, Результат)
	//+ dar 20220825 (14517)
	Ссылка = ПараметрыПолучателей.Ссылка;
	Если ЗначениеЗаполнено(Ссылка) 
		И ТипЗнч(Ссылка) = Тип("СправочникСсылка.РассылкиОтчетов")
		И ЗначениеЗаполнено(Ссылка.УВМ_Организация) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадроваяИсторияСотрудниковСрезПоследних.ГоловнаяОрганизация КАК Организация,
		|	КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ втРаботают
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, ГоловнаяОрганизация = &Организация) КАК КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	втРаботают.ФизическоеЛицо КАК Физлицо,
		// + СБит 2023-12-28 161905
		|	ЕСТЬNULL(КИ_Доп.АдресЭП, ЕСТЬNULL(КИ_Тип.АдресЭП, УВМ_ОтветственныйЗаГрафикОтпусков.Значение)) КАК Email
		|ИЗ
		|	втРаботают КАК втРаботают
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КонтактнаяИнформация.Ссылка КАК ФизическоеЛицо,
		|			КонтактнаяИнформация.АдресЭП КАК АдресЭП
		|		ИЗ
		|			Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ГДЕ
		|			КонтактнаяИнформация.Ссылка В
		|					(ВЫБРАТЬ
		|						втРаботают.ФизическоеЛицо КАК ФизическоеЛицо
		|					ИЗ
		|						втРаботают КАК втРаботают)
		|			И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица)) КАК КИ_Тип 
		|		ПО втРаботают.ФизическоеЛицо = КИ_Тип.ФизическоеЛицо
		// + СБит 2023-12-28 161905
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КонтактнаяИнформация.Ссылка КАК ФизическоеЛицо,
		|			КонтактнаяИнформация.АдресЭП КАК АдресЭП
		|		ИЗ
		|			Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ГДЕ
		|			КонтактнаяИнформация.Ссылка В
		|					(ВЫБРАТЬ
		|						втРаботают.ФизическоеЛицо КАК ФизическоеЛицо
		|					ИЗ
		|						втРаботают КАК втРаботают)
		|			И КонтактнаяИнформация.Вид = &ВидАдреса) КАК КИ_Доп
		|		ПО втРаботают.ФизическоеЛицо = КИ_Доп.ФизическоеЛицо
		|		, Константа.УВМ_ОтветственныйЗаГрафикОтпусков КАК УВМ_ОтветственныйЗаГрафикОтпусков
		// - СБит 2023-12-28
		//|ГДЕ
		//|	НЕ КИ.ФизическоеЛицо ЕСТЬ NULL";
		// + СБит 2023-12-28 161905
		//|	ЕСТЬNULL(КИ_Доп.АдресЭП, ЕСТЬNULL(КИ_Тип.АдресЭП, """")) <> """""
		|";
		
		Запрос.УстановитьПараметр("Организация", Ссылка.УВМ_Организация); 
		// + СБит 2023-12-28 161905 
		Если ЗначениеЗаполнено(Ссылка.УВМ_ВидАдреса) Тогда
			Запрос.УстановитьПараметр("ВидАдреса", Ссылка.УВМ_ВидАдреса); 
		Иначе
			Запрос.УстановитьПараметр("ВидАдреса", Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица); 
		КонецЕсли;
		// - СБит 2023-12-28
		Табл = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЧ Из Табл Цикл
			Результат.Вставить(СтрокаТЧ.Физлицо, СтрокаТЧ.Email);
		КонецЦикла;
		
		СтандартнаяОбработка = (Результат.Количество() = 0);
	КонецЕсли;
	//- dar 20220825 (14517)
КонецПроцедуры
