#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета.
//
// Параметры:
//   Настройки - Коллекция - настройки отчетов и вариантов отчетов конфигурации.
//	 ОписаниеОтчета - СтрокаДерева
//                  - ОбъектМетаданных - описание настроек, метаданные или ссылка отчета.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗначенияПроизвольныхПараметров");
	ОписаниеВарианта.Описание = НСтр("ru = 'Отчет показывает информацию о установленных знаяениях произвольных параметров.'");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.бит_КомИнт__Настройки, "");
	ОписаниеВарианта.Включен = Истина;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
	
#КонецЕсли	