#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ бит_ум_УчетМигрантовВызовСервера.ПолучитьЛицензию(Истина) Тогда
		Возврат;
	КонецЕсли;	
	
	СтруктураОтбора = Новый Структура;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Сотрудники") Тогда
		СтруктураОтбора.Вставить("Сотрудник", ПараметрКоманды);
	Иначе
		СтруктураОтбора.Вставить("ФизическоеЛицо", ПараметрКоманды);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	ОткрытьФорму("Документ.бит_ум_КвитанцияЗаПатент.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,
		ПараметрКоманды, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти