
&ИзменениеИКонтроль("ОбязательстваСотрудниковПоУченическимДоговорам")
Функция УВМ_ОбязательстваСотрудниковПоУченическимДоговорам(ФизическоеЛицо, Организация, ДатаСреза)

	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		ДатаСреза = ТекущаяДатаСеанса();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УсловияУченическогоДоговора.УченическийДоговор КАК УченическийДоговор,
	|	СУММА(УсловияУченическогоДоговора.Сумма) КАК Сумма
	|ИЗ
	|	РегистрСведений.УсловияУченическогоДоговора КАК УсловияУченическогоДоговора
	|ГДЕ
	|	&ДатаСреза МЕЖДУ УсловияУченическогоДоговора.ДатаНачалаОбязательств И УсловияУченическогоДоговора.ДатаОкончанияОбязательств
	|	И УсловияУченическогоДоговора.ФизическоеЛицо = &ФизическоеЛицо
	|	И УсловияУченическогоДоговора.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	УсловияУченическогоДоговора.УченическийДоговор
	|
	|ИМЕЮЩИЕ
	|	СУММА(УсловияУченическогоДоговора.Сумма) > 0";
	#Вставка
	// + БаринбергГМ 20220625 (9837)
	// пацаны из фирмы 1С не вкурсе как работает "МЕЖДУ"
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УсловияУченическогоДоговора.УченическийДоговор КАК УченическийДоговор,
	|	СУММА(УсловияУченическогоДоговора.Сумма) КАК Сумма
	|ИЗ
	|	РегистрСведений.УсловияУченическогоДоговора КАК УсловияУченическогоДоговора
	|ГДЕ
	|	УсловияУченическогоДоговора.ДатаНачалаОбязательств <= &ДатаСреза
	|	И УсловияУченическогоДоговора.ДатаОкончанияОбязательств > &ДатаСреза
	|	И УсловияУченическогоДоговора.ФизическоеЛицо = &ФизическоеЛицо
	|	И УсловияУченическогоДоговора.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	УсловияУченическогоДоговора.УченическийДоговор
	|
	|ИМЕЮЩИЕ
	|	СУММА(УсловияУченическогоДоговора.Сумма) > 0";
	// - БаринбергГМ 20220625 (9837)
	#КонецВставки

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

//++dar 10.04.23 (99225)
// выводит информацию об ученических договорах сотрудников
Процедура УведомитьОбОбязательствахСотрудниковПоУченическимДоговорам(ФизическоеЛицо, Организация, ДатаСреза) Экспорт

	УдержанияПоДоговорам = ОбязательстваСотрудниковПоУченическимДоговорам(
	ФизическоеЛицо, Организация, ДатаСреза);

	Если УдержанияПоДоговорам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаКоллекции Из УдержанияПоДоговорам Цикл
		ОбщегоНазначения.СообщитьПользователю("Обратите внимание! У " + ФизическоеЛицо + " есть обязательства по ученическому договору "
			+ СтрокаКоллекции.УченическийДоговор + " на сумму: " + СтрокаКоллекции.Сумма + " руб!");
	КонецЦикла;
		
КонецПроцедуры

&ИзменениеИКонтроль("ДополнитьТаблицуУдержанийДаннымиПоУченическимДоговорамСотрудника")
Процедура УВМ_ДополнитьТаблицуУдержанийДаннымиПоУченическимДоговорамСотрудника(Сотрудник, ДатаУвольнения, МенеджерРасчета)

	ДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(
	Истина, Сотрудник, "ГоловнаяОрганизация, ФизическоеЛицо, Организация, ОсновноеРабочееМестоВОрганизации");

	ОбщегоНазначенияКлиентСервер.Проверить(ДанныеСотрудников.Количество() > 0, 
	НСтр("ru = 'Не удалось получить кадровые данные сотрудника. Запрашивались: Головная организация и Физическое лицо.'"));

	ДанныеСотрудника = ДанныеСотрудников[0];

	Если Не ДанныеСотрудника.ОсновноеРабочееМестоВОрганизации Тогда
		Возврат;
	КонецЕсли;

	УдержанияПоДоговорам = ОбязательстваСотрудниковПоУченическимДоговорам(
	ДанныеСотрудника.ФизическоеЛицо, ДанныеСотрудника.Организация, ДатаУвольнения);

	Если УдержанияПоДоговорам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ВидыРасчета = РасчетЗарплаты.УдержанияПоКатегории(Перечисления.КатегорииУдержаний.ОбязательстваПоУченическомуДоговору);
	ОбщегоНазначенияКлиентСервер.Проверить(ВидыРасчета.Количество() > 0, 
	НСтр("ru = 'Не удалось найти ни одного вида удержания категории «Обязательства по ученическому договору»'"));

	Для Каждого СтрокаКоллекции Из УдержанияПоДоговорам Цикл
		НоваяСтрока = Обработки.МенеджерРасчетаЗарплаты.СтрокаТаблицыУдержаний(МенеджерРасчета.Зарплата.Удержания);
		НоваяСтрока.ДокументОснование = СтрокаКоллекции.УченическийДоговор;
		НоваяСтрока.ФизическоеЛицо = ДанныеСотрудника.ФизическоеЛицо;
		НоваяСтрока.ГоловнаяОрганизация = ДанныеСотрудника.ГоловнаяОрганизация;
		НоваяСтрока.Категория = Перечисления.КатегорииУдержаний.ОбязательстваПоУченическомуДоговору;
		НоваяСтрока.Удержание = ВидыРасчета[0];
		НоваяСтрока.Результат = СтрокаКоллекции.Сумма;
		НоваяСтрока.ДатаНачала = ДатаУвольнения;
		НоваяСтрока.ДатаОкончания = ДатаУвольнения;
		#Вставка
		// + БаринбергГМ 20220625 (9837)
		// оповестим сотрудника департамента персонала
		ОбщегоНазначения.СообщитьПользователю("Обратите внимание! У " + НоваяСтрока.ФизическоеЛицо + " есть обязательства по ученическому договору "
			+ НоваяСтрока.ДокументОснование + " на сумму: " + НоваяСтрока.Результат + " руб!");
		// - БаринбергГМ 20220625 (9837)
		#КонецВставки
	КонецЦикла;

КонецПроцедуры
//--dar 10.04.23 (99225)
