
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	Если НЕ Параметры.Свойство("Отбор") Тогда
		Параметры.Вставить("Отбор", Новый Структура);
	КонецЕсли;
	
	Если Параметры.Свойство("Версия_2") И ЗначениеЗаполнено(Параметры.Версия_2) Тогда
		Параметры.Отбор.Вставить("Версия_2", Параметры.Версия_2);
	КонецЕсли;
	
	ДанныеВыбора = ПолучитьДоступныеЗначения(
		Параметры.Отбор, Неопределено).ДоступныеЗначения;
	
	Параметры.Отбор.Очистить();
	Параметры.Отбор.Вставить("Ссылка", ДанныеВыбора);

КонецПроцедуры

#КонецЕсли

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДоступныеЗначения(
		Параметры.Отбор, Параметры.СтрокаПоиска).ДоступныеЗначения;
		
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Функция выполняет заполнение списка значений 
// данных выбора с учетом настроек параметров учета.
// Поддерживается параметр отбора.
// Обрабатывается также строка поиска.
//
Функция ПолучитьДоступныеЗначения(Отбор, СтрокаПоиска = "") Экспорт
	
	Версия_2 = Неопределено;
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Если Отбор.Свойство("Версия_2") И ЗначениеЗаполнено(Отбор.Версия_2) Тогда
			Версия_2 = Отбор.Версия_2;
		КонецЕсли;
	КонецЕсли;
			
	ДоступныеЗначения = Новый СписокЗначений;
	ЕстьНедоступные   = Ложь;
	Исключения		  = Новый Массив; 
	
	Если Версия_2 <> Неопределено Тогда
		Если НЕ Версия_2 Тогда
			Исключения.Добавить(Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.РазворачиватьСИерархией);
		КонецЕсли;
	КонецЕсли;

	ВидыОперацийМетаданные = Метаданные.Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода; 
	Для каждого ЗначениеПеречисления Из ВидыОперацийМетаданные.ЗначенияПеречисления Цикл
		
		Если ТипЗнч(СтрокаПоиска) = Тип("Строка")
			И НЕ ПустаяСтрока(СтрокаПоиска)
			И СтрНайти(НРег(ЗначениеПеречисления.Синоним), НРег(СтрокаПоиска)) <> 1 Тогда
			Продолжить;
		КонецЕсли;
		Ссылка = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода[ЗначениеПеречисления.Имя];
		Если ТипЗнч(Отбор) = Тип("ПеречислениеСсылка.бит_СпособыЗаполненияИзмеренийВФормахВвода")
			И Отбор <> Ссылка Тогда
			Продолжить;
		ИначеЕсли ТипЗнч(Отбор) = Тип("ФиксированныйМассив")
			И Отбор.Найти(Ссылка) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Исключения.Найти(Ссылка) <> Неопределено Тогда
			ЕстьНедоступные = Истина;
			Продолжить;
		КонецЕсли;
		ДоступныеЗначения.Добавить(Ссылка, ЗначениеПеречисления.Синоним);
		
	КонецЦикла;
	
	Возврат Новый Структура("ДоступныеЗначения, ЕстьНедоступные", ДоступныеЗначения, ЕстьНедоступные);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Код процедур и функций

#КонецОбласти

#КонецЕсли