#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Сотрудники") Тогда
		Физлицо = СотрудникиВызовСервера.ФизическиеЛицаСотрудников(ПараметрКоманды)[0];
	Иначе
		Физлицо = ПараметрКоманды;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Физлицо", Физлицо);
	ОткрытьФорму("РегистрСведений.бит_ум_ДокументыИР.Форма.ДокументыИностранногоРаботника", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,
		ПараметрКоманды, ПараметрыВыполненияКоманды.Окно)
	
КонецПроцедуры

#КонецОбласти