#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Сбор данных сотрудников
	СотрудникиКраткийСостав = Новый Массив;
	
	Для Каждого СтрокаТабличнойЧасти Из ПереченьСотрудников Цикл
		СотрудникиКраткийСостав.Добавить(СтрокаТабличнойЧасти.Сотрудник);
	КонецЦикла;
	
	КраткийСоставДокумента = ЗарплатаКадры.КраткийСоставСотрудников(СотрудникиКраткийСостав, Дата);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		Если ТипДанныхЗаполнения <> Тип("Структура")
			И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения;
		ИначеЕсли ТипДанныхЗаполнения = Тип("Структура")
			И ДанныеЗаполнения.Свойство("Основание")
			И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Основание.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения.Основание;
		КонецЕсли;

		Если ДокументОснование <> Неопределено Тогда
			ЗаполнитьПоДокументуОснованию(ДокументОснование);
		КонецЕсли;
		
	КонецЕсли;
	
	ЗарплатаКадры.ЗаполнитьЗначениеРеквизитаОрганизацияПриОднофирменномУчете(ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(НалоговыйПериод) Тогда
		НалоговыйПериод = Год(Макс(ТекущаяДатаСеанса(), '20150101'));
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Заявление) И бит_ум_УчетМигрантовПовтИсп.ЭтоУМ() Тогда
		Заявление = Документы.бит_ум_ЗаявлениеНаУменьшениеСуммыНДФЛ.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПараметрыПроведения = ПолучитьДанныеДляПроведения(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПоРегистрам(ПараметрыПроведения, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоРегистрам(ПараметрыПроведения, Отказ)
	
	Движения.бит_ум_ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.Записывать = Истина;
	
	Для Каждого Строка Из ПараметрыПроведения.ПодтверждениеПраваНаУменьшениеСуммыНДФЛ Цикл
		ЗаполнитьЗначенияСвойств(Движения.бит_ум_ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.Добавить(), Строка);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеДляПроведения(Отказ)
		
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.Ссылка.Дата КАК Период,
	|	ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.Ссылка.Организация,
	|	ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.Ссылка.НалоговыйПериод,
	|	ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.Ссылка.ДатаУведомления,
	|	ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.Ссылка.НомерУведомления,
	|	ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.Ссылка.КодНалоговогоОргана
	|ИЗ
	|	Документ.бит_ум_ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.ПереченьСотрудников КАК ПодтверждениеПраваНаУменьшениеСуммыНДФЛ
	|ГДЕ
	|	ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.Ссылка = &Регистратор";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеДляПроведения = Новый Структура; 
	
	ДанныеДляПроведения.Вставить("ПодтверждениеПраваНаУменьшениеСуммыНДФЛ", РезультатыЗапроса[0].Выгрузить());
	
	Возврат ДанныеДляПроведения;

КонецФункции

Процедура ЗаполнитьПоДокументуОснованию(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.бит_ум_ЗаявлениеНаУменьшениеСуммыНДФЛ") Тогда
		
		Заявление = Основание;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание, "Организация, НалоговыйПериод");
		
		Для Каждого СтрокаТаблицы Из Основание.ПереченьСотрудников Цикл
			ЗаполнитьЗначенияСвойств(ПереченьСотрудников.Добавить(), СтрокаТаблицы);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ") Тогда
		
		Заявление = Основание;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание, "Организация, НалоговыйПериод");
		
		Если ЗначениеЗаполнено(Организация) Тогда
		
			СписокСотрудников = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(Основание.Сотрудники.ВыгрузитьКолонку("Сотрудник"),
				Истина, Организация, Основание.Дата);
		
			Для Каждого СтрокаТаблицы Из СписокСотрудников Цикл
				ЗаполнитьЗначенияСвойств(ПереченьСотрудников.Добавить(), СтрокаТаблицы);
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти		
		
#КонецЕсли