////////////////////////////////////////////////////////////////////////////////
// Конфигурация "БИТ.Учет мигрантов".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы БазоваяФункциональность.

// См. ОбщегоНазначенияКлиентПереопределяемый.ПриНачалеРаботыСистемы.
Процедура ПриНачалеРаботыСистемы(Параметры) Экспорт
	
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	сл2_Клиент.Инициализация();
	#КонецЕсли
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента();
	Если ПараметрыРаботыКлиента.Свойство("ПервыйЗапускУМ") И ПараметрыРаботыКлиента.ПервыйЗапускУМ = Истина Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОткрытаВручную", Истина);
		ОткрытьФорму("Обработка.бит_ум_МастерНастройки.Форма.НачалоРаботы", ПараметрыФормы, , Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти