
	
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокОбъектов        = Параметры.СписокОбъектов;
	ДоступныеВидыОбъектов = Параметры.ДоступныеВидыОбъектов;
	ОтборОбъектыСистемы   = Параметры.ОтборОбъектыСистемы;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СписокОбъектов.Количество() = 0 Тогда
		Элементы.СписокОбъектов.ДобавитьСтроку();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокОбъектовЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокОбъектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачатьВыборОбъектаСистемы(Элемент, ТекущиеДанные.Значение);
	
КонецПроцедуры

&НаСервере
Функция КорректныйВидОбъектаСистемы(Знач ОбъектСистемы)
	
	Если НЕ ЗначениеЗаполнено(ОбъектСистемы) Тогда 
		Возврат Истина;
	КонецЕсли;
	
	ВидОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСистемы, "ВидОбъекта");
	Если ДоступныеВидыОбъектов.НайтиПоЗначению(ВидОбъекта) = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Объекты системы вида ""%1"" не доступны для выбора.';
							  |en='Objects of the system type ""%1"" is not available for selection.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ВидОбъекта); 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	Если ОтборОбъектыСистемы.Количество() > 0 И ОтборОбъектыСистемы.НайтиПоЗначению(ОбъектСистемы) = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Выбранный объект системы не соответствует отбору.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ВидОбъекта); 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура СписокОбъектовЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокОбъектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектСистемы = ТекущиеДанные.Значение;
	
	Если НЕ КорректныйВидОбъектаСистемы(ОбъектСистемы) Тогда
		ТекущиеДанные.Значение = Неопределено;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокОбъектов

&НаКлиенте
Процедура СписокОбъектовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование ИЛИ НЕ НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	НачатьВыборОбъектаСистемы(Элементы.СписокОбъектов.ТекущийЭлемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) И (СписокОбъектов.НайтиПоЗначению(ВыбранноеЗначение) <> Неопределено) Тогда
		// Данный объект уже присутствует в списке.
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ПустойОбъект = ПредопределенноеЗначение("Справочник.бит_ОбъектыСистемы.ПустаяСсылка");
	Если СписокОбъектов.НайтиПоЗначению(ПустойОбъект) <> Неопределено Тогда
		ТекстСообщения = НСтр("ru='Выбор пустого объекта недопустим.';
							  |en='Cant choose empty object.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	ОповеститьОВыборе(СписокОбъектов);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодбор(Команда)
	
	НачатьВыборОбъектаСистемы(Элементы.СписокОбъектов,, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьВыборОбъектаСистемы(ЭлементВладелец, ОбъектСистемы = Неопределено, РежимПодбора = Ложь)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыОбъектов",         ДоступныеВидыОбъектов);
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы", ОбъектСистемы);
	ПараметрыФормы.Вставить("ТолькоВключенные",     Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",   РежимПодбора);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",   НЕ РежимПодбора);
	Если ОтборОбъектыСистемы.Количество() > 0 Тогда
		ПараметрыФормы.Вставить("ДоступныеОбъектыСистемы", ОтборОбъектыСистемы);
	КонецЕсли;
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы, ЭлементВладелец);
	
КонецПроцедуры

#КонецОбласти
