#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Сбор данных сотрудников
	СотрудникиКраткийСостав = Новый Массив;
	
	// Проверим, все ли действия выполнены
	ФлагВсеВыполнено = Истина;
	
	Для Каждого СтрокаТабличнойЧасти Из ВыполняемыеДействия Цикл
		
		СотрудникиКраткийСостав.Добавить(СтрокаТабличнойЧасти.Сотрудник);
		
		Если НЕ СтрокаТабличнойЧасти.Выполнено Тогда
			ФлагВсеВыполнено = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	КраткийСоставДокумента = ЗарплатаКадры.КраткийСоставСотрудников(СотрудникиКраткийСостав, Дата);
	
	ВсеВыполнено = ФлагВсеВыполнено; 
	
	ДатаСобытия = Дата;
	
	Действия = СтрСоединить(ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВыполняемыеДействия.ВыгрузитьКолонку(
		"Действие")), ", ");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		Если ТипДанныхЗаполнения <> Тип("Структура")
			И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения;
		ИначеЕсли ТипДанныхЗаполнения = Тип("Структура")
			И ДанныеЗаполнения.Свойство("Основание")
			И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Основание.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения.Основание;
		КонецЕсли;

		Если ДокументОснование <> Неопределено Тогда
			ЗаполнитьПоДокументуОснованию(ДокументОснование);
		КонецЕсли;
		
	КонецЕсли;
	
	ЗарплатаКадры.ЗаполнитьЗначениеРеквизитаОрганизацияПриОднофирменномУчете(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПараметрыПроведения = ПолучитьДанныеДляПроведения(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПоРегистрам(ПараметрыПроведения, Отказ);

КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоРегистрам(ПараметрыПроведения, Отказ)
	
	Движения.бит_ум_ВыполненныеДействия.Записывать = Истина;
	
	Для Каждого Строка Из ПараметрыПроведения.ВыполненныеДействия Цикл
		ЗаполнитьЗначенияСвойств(Движения.бит_ум_ВыполненныеДействия.Добавить(), Строка);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеДляПроведения(Отказ)
		
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтчетностьПоИР.Ссылка.Дата КАК Период,
	|	ОтчетностьПоИР.Ссылка.Организация,
	|	ОтчетностьПоИР.Сотрудник,
	|	ОтчетностьПоИР.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОтчетностьПоИР.Действие,
	|	ОтчетностьПоИР.Выполнено,
	|	ОтчетностьПоИР.ДатаВыполнения
	|ИЗ
	|	Документ.бит_ум_ОтчетностьПоИР.ВыполняемыеДействия КАК ОтчетностьПоИР
	|ГДЕ
	|	ОтчетностьПоИР.Ссылка = &Регистратор";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеДляПроведения = Новый Структура; 
	
	ДанныеДляПроведения.Вставить("ВыполненныеДействия", РезультатыЗапроса[0].Выгрузить());
	
	Возврат ДанныеДляПроведения;

КонецФункции	

Процедура ЗаполнитьВыполняемыеДействия(Основание)
	
	ДополнительныеСвойства.Вставить("ЗаполнитьПараметрыПечати");
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;	
	
	ПараметрыОбъекта = Новый Структура("Организация, Событие, Дата, Проведен");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, ЭтотОбъект);  
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Сотрудники") Тогда
		ПараметрыОбъекта.Вставить("Сотрудник", Основание);
	Иначе
		ПараметрыОбъекта.Вставить("Основание", Основание);      
	КонецЕсли;
		
	ВыполняемыеДействия.Очистить();
	ДополнительныеПараметрыПечати.Очистить();
	
	ТаблицаВыполняемыеДействия = ВыполняемыеДействия.Выгрузить();
	ТаблицаВыполняемыеДействия.Очистить();
	
	ПараметрыОбъекта.Вставить("ТаблицаВыполняемыеДействия", ТаблицаВыполняемыеДействия);
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено);
	Документы.бит_ум_ОтчетностьПоИР.ПодготовитьДанныеДляЗаполнения(ПараметрыОбъекта, АдресХранилища);
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресХранилища);
	УдалитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;   	
	
	Если СтруктураДанных.Свойство("ТаблицаВыполняемыеДействия") Тогда
		
		ВыполняемыеДействия.Загрузить(СтруктураДанных.ТаблицаВыполняемыеДействия);
		
		КлючСвязи = 0;
		
		Для Каждого СтрокаТаблицы Из ВыполняемыеДействия Цикл
			КлючСвязи = КлючСвязи + 1;
			СтрокаТаблицы.КлючСвязи = КлючСвязи;
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуОснованию(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		
		Событие = ПредопределенноеЗначение("Перечисление.бит_ум_ВидыСобытийПоИР.ПриемНаРаботу");
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		бит_ум_ОбщегоНазначения.ЗаполнитьПоОснованию(ЭтотОбъект, Основание, Истина);
		
		// Заполним табличную часть
		ЗаполнитьВыполняемыеДействия(Основание);
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.Увольнение") Тогда
		
		Событие = ПредопределенноеЗначение("Перечисление.бит_ум_ВидыСобытийПоИР.Увольнение");
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		бит_ум_ОбщегоНазначения.ЗаполнитьПоОснованию(ЭтотОбъект, Основание, Истина);
		
		// Заполним табличную часть
		ЗаполнитьВыполняемыеДействия(Основание);     
		
	ИначеЕсли ТипЗнч(Основание) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		Событие = Документы.бит_ум_ОтчетностьПоИР.ОпределитьСобытиеПоСотруднику(Основание);   
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		бит_ум_ОбщегоНазначения.ЗаполнитьПоОснованию(ЭтотОбъект, Основание, Истина); 
		
		Если ЗначениеЗаполнено(Событие) Тогда   
			КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина,
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Основание), "Организация", ТекущаяДатаСеанса());
			Организация = КадровыеДанные[0].Организация;
			ЗаполнитьВыполняемыеДействия(Основание);    
		Иначе 
			СтрокаТабличнойЧасти = ВыполняемыеДействия.Добавить();
			СтрокаТабличнойЧасти.Сотрудник = Основание;     
			СтрокаТабличнойЧасти.КлючСвязи = 1;
		КонецЕсли;
		      
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли