
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура УВМ_ОбработкаПроведения(Отказ, РежимПроведения)

	Документы.ПриемНаРаботу.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

	#Вставка
	//++dar 20221128 (11805)
	Если НЕ Отказ Тогда
		Узел = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоКоду("851027ec-d2af-4799-bb1e-6aeedfaab22f");
		Для Каждого СтрокаТЧ Из Сотрудники Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрокаТЧ.Сотрудник);	
		КонецЦикла;
	КонецЕсли;
	//--dar 20221128 (11805)
	#КонецВставки

КонецПроцедуры
