////////////////////////////////////////////////////////////////////////////////
// Подсистема "Учет мигрантов".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Если физическое лицо является иностранцем и у него не заполнены паспортные данные
// в регистре сведений "Документы иностранных работников", то заполним их из регистра
// "Документы физических лиц".
//
// Параметры:
//   Источник - РегистрСведенийНаборЗаписей.ДокументыФизическихЛиц - источник события.
//   Отказ - Булево - Признак отказа от записи набора в базу данных.
//		Значение по умолчанию: Ложь. 
//   Замещение - Булево - Режим записи набора.
//		Истина - запись осуществляется с заменой существующих в базе данных записей набора.
//		Ложь - запись осуществляется с "дописыванием" текущего набора записей. 
//
Процедура ДокументыФизическихЛицПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;      
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.Константы.бит_ум_ПереноситьДанныеПаспортаИзДокументовФизЛиц) 
		ИЛИ НЕ бит_ум_УчетМигрантовПовтИсп.ПолучитьКонстантуИзНастроек("ПереноситьДанныеПаспортаИзДокументовФизЛиц") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПравоДоступа("Изменение", Метаданные.РегистрыСведений.бит_ум_ДокументыИР)
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.бит_ум_ДокументыИР) Тогда
		Возврат;
	КонецЕсли;
		
	Для Каждого Движение Из Источник Цикл
		
		Если НЕ ЗначениеЗаполнено(Движение.Физлицо) ИЛИ НЕ ЗначениеЗаполнено(Движение.Номер) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Движение.ВидДокумента, "КодМВД") <> "10" Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.бит_ум_ДокументыИР.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = Движение.Период;
		МенеджерЗаписи.Физлицо = Движение.Физлицо;
		МенеджерЗаписи.ВидДокумента =
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.бит_ум_ВидыДокументовИР.ПаспортИностранногоГражданина");
		МенеджерЗаписи.Серия = Движение.Серия; 
		МенеджерЗаписи.Номер = Движение.Номер;
		МенеджерЗаписи.ДатаВыдачи = Движение.ДатаВыдачи;
		МенеджерЗаписи.СрокДействия = Движение.СрокДействия;
		МенеджерЗаписи.ГосударственныйОрган =
			бит_ум_УчетМигрантовСервер.НайтиГосударственныйОрганПоНаименованию(Движение.КемВыдан);
		
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти