#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета.
//
// Параметры:
//   Настройки - Коллекция - настройки отчетов и вариантов отчетов конфигурации.
//	 ОписаниеОтчета - СтрокаДерева
//                  - ОбъектМетаданных - описание настроек, метаданные или ссылка отчета.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПланФактныйАнализ");
	ОписаниеВарианта.Описание = НСтр("ru = 'Позволяет выполнить сравнительный анализ данных по запланированным поступлениям денежных средств.'");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.бит_КомИнт_Казначейство.Подсистемы.Отчеты, "");
	ОписаниеВарианта.Включен = Истина;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьЗаголовкиПолейДопИзмерений(СхемаКомпоновкиДанных) Экспорт
	
	бит_МеханизмДопИзмерений.НастроитьПоляДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, "Движения");
	
КонецПроцедуры
 
#КонецОбласти 

#КонецЕсли	