#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	УстановитьЗаголовкиПолейДопИзмерений();
	
	ПараметрДополнятьПериод = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ДополнятьПериод");
	
	бит_ОтчетыБФСервер.НастроитьДинамическийПериод(СхемаКомпоновкиДанных, КомпоновщикНастроек, ПараметрДополнятьПериод.Значение);
	
	ДокументРезультат.Очистить();

	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Добавим служебные параметры заголовка. См. ЗначенияЗаголовковПолей().
	ПараметрЗаголовок 		   = НастройкиКомпоновкиДанных.ПараметрыВывода.НайтиЗначениеПараметра(
									Новый ПараметрКомпоновкиДанных("Заголовок"));
	ПараметрЗаголовок.Значение = ПараметрЗаголовок.Значение + " %ВалютаОтчета%";

	КомпоновщикМакета 		  = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 		  = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
	
	бит_ОтчетыБФСервер.УстановитьЗаголовкиМакетаКомпоновки(ЗначенияЗаголовковПолей(), МакетКомпоновки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
Процедура УстановитьЗаголовкиПолейДопИзмерений()
	
	Отчеты.бит_ПланФактныйАнализПоступленийДенежныхСредств.УстановитьЗаголовкиПолейДопИзмерений(СхемаКомпоновкиДанных);
	
КонецПроцедуры

Функция ЗначенияЗаголовковПолей()
	
	ДанныеОтчета = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Показатели").Значение;
	
	ЗначенияЗаголовковПолей = Новый Структура;
	Если ДанныеОтчета = 1 Тогда
		ПараметрВалюта = Константы.бит_ВалютаУправленческогоУчета.Получить();
		ЗначенияЗаголовковПолей.Вставить("ВалютаОтчета", "(" + ПараметрВалюта + ")");
	ИначеЕсли ДанныеОтчета = 2 Тогда
		ПараметрВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
		ЗначенияЗаголовковПолей.Вставить("ВалютаОтчета", "(" + ПараметрВалюта + ")");
	ИначеЕсли ДанныеОтчета = 3 Тогда
		ПараметрВалюта = НСтр("ru = 'в валюте взаиморасчетов'"); // Получить валюту сценария.
		ЗначенияЗаголовковПолей.Вставить("ВалютаОтчета", "(" + ПараметрВалюта + ")");
	Иначе
		ПараметрВалюта = НСтр("ru = 'в валюте операции'");
		ЗначенияЗаголовковПолей.Вставить("ВалютаОтчета", "(" + ПараметрВалюта + ")");	
	КонецЕсли;
		
	Возврат ЗначенияЗаголовковПолей;
	
КонецФункции

#КонецОбласти 

#Область Инициализация

УстановитьЗаголовкиПолейДопИзмерений();

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли