
&ИзменениеИКонтроль("ПроверитьПересечениеПериодовОтсутствия")
Функция УВМ_ПроверитьПересечениеПериодовОтсутствия(ИсходныеДанные, Регистратор, ИсправленныйДокумент)

	ДанныеСотрудников = Новый Соответствие;
	РезультатПроверки = Новый Структура("ДанныеСотрудников, Отказ", ДанныеСотрудников, Ложь);

	ИсключаемыеРегистраторы = Новый Массив;
	ИсключаемыеРегистраторы.Добавить(Регистратор);

	Если ИсправленныйДокумент <> Неопределено Тогда
		ИсключаемыеРегистраторы.Добавить(ИсправленныйДокумент);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИсключаемыеРегистраторы,
		ИсправлениеДокументовЗарплатаКадры.ПолучитьДокументыЦепочкиИсправлений(ИсправленныйДокумент));
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("ИсходныеДанные", ИсходныеДанные);
	Запрос.УстановитьПараметр("ИсключаемыеРегистраторы", ИсключаемыеРегистраторы);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсходныеДанные.Сотрудник КАК Сотрудник,
	|	ИсходныеДанные.Состояние КАК Состояние,
	|	ИсходныеДанные.Начало КАК ДатаНачала,
	|	ИсходныеДанные.Окончание КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТСостоянияСотрудниковДокумента
	|ИЗ
	|	&ИсходныеДанные КАК ИсходныеДанные
	|;
	|
#Вставка
	// + СБит 2025-10-10 279466  
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР 
	|		КОГДА ВытесняемоеПлановоеВремяСотрудников.Регистратор Ссылка Документ.СторнированиеНачислений
	|			ТОГДА СторнированиеНачислений.СторнируемыйДокумент
	|		КОГДА ВытесняемоеПлановоеВремяСотрудников.Регистратор Ссылка Документ.ОплатаПоСреднемуЗаработку 
	|			И ОплатаПоСреднемуЗаработку.ИсправленныйДокумент <> ЗНАЧЕНИЕ(Документ.ОплатаПоСреднемуЗаработку.ПустаяСсылка)
	|			ТОГДА ОплатаПоСреднемуЗаработку.ИсправленныйДокумент
	|		ИНАЧЕ ВытесняемоеПлановоеВремяСотрудников.Регистратор 
	|	КОНЕЦ КАК Регистратор,
	|	ВытесняемоеПлановоеВремяСотрудников.Сотрудник КАК Сотрудник,
	|	ВытесняемоеПлановоеВремяСотрудников.Период КАК Период,
	|	СУММА(ВытесняемоеПлановоеВремяСотрудников.Часы) КАК Часы
	|Поместить втОтсутствияНеполныйДень
	|ИЗ
	|	ВТСостоянияСотрудниковДокумента КАК СостоянияСотрудниковДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВытесняемоеПлановоеВремяСотрудников КАК ВытесняемоеПлановоеВремяСотрудников
	|		ПО СостоянияСотрудниковДокумента.Сотрудник = ВытесняемоеПлановоеВремяСотрудников.Сотрудник
	|			И НЕ ВытесняемоеПлановоеВремяСотрудников.Регистратор В (&ИсключаемыеРегистраторы)
	|			И СостоянияСотрудниковДокумента.ДатаОкончания >= ВытесняемоеПлановоеВремяСотрудников.Период
	|			И СостоянияСотрудниковДокумента.ДатаНачала <= ВытесняемоеПлановоеВремяСотрудников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаПоСреднемуЗаработку КАК ОплатаПоСреднемуЗаработку
    |		ПО ВытесняемоеПлановоеВремяСотрудников.Регистратор = ОплатаПоСреднемуЗаработку.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СторнированиеНачислений КАК СторнированиеНачислений
    |		ПО ВытесняемоеПлановоеВремяСотрудников.Регистратор = СторнированиеНачислений.Ссылка
    |
	|ГДЕ
	|	(ВЫБОР 
	|		КОГДА ВытесняемоеПлановоеВремяСотрудников.Регистратор Ссылка Документ.СторнированиеНачислений
	|			ТОГДА СторнированиеНачислений.СторнируемыйДокумент
	|		КОГДА ВытесняемоеПлановоеВремяСотрудников.Регистратор Ссылка Документ.ОплатаПоСреднемуЗаработку 
	|			И ОплатаПоСреднемуЗаработку.ИсправленныйДокумент <> ЗНАЧЕНИЕ(Документ.ОплатаПоСреднемуЗаработку.ПустаяСсылка)
	|			ТОГДА ОплатаПоСреднемуЗаработку.ИсправленныйДокумент
	|		ИНАЧЕ ВытесняемоеПлановоеВремяСотрудников.Регистратор 
	|	КОНЕЦ).ВнутрисменноеОтсутствие = Истина
	|
	|СГРУППИРОВАТЬ ПО			
	|	ВЫБОР 
	|		КОГДА ВытесняемоеПлановоеВремяСотрудников.Регистратор Ссылка Документ.СторнированиеНачислений
	|			ТОГДА СторнированиеНачислений.СторнируемыйДокумент
	|		КОГДА ВытесняемоеПлановоеВремяСотрудников.Регистратор Ссылка Документ.ОплатаПоСреднемуЗаработку 
	|			И ОплатаПоСреднемуЗаработку.ИсправленныйДокумент <> ЗНАЧЕНИЕ(Документ.ОплатаПоСреднемуЗаработку.ПустаяСсылка)
	|			ТОГДА ОплатаПоСреднемуЗаработку.ИсправленныйДокумент
	|		ИНАЧЕ ВытесняемоеПлановоеВремяСотрудников.Регистратор 
	|	КОНЕЦ,
	|	ВытесняемоеПлановоеВремяСотрудников.Сотрудник,
	|	ВытесняемоеПлановоеВремяСотрудников.Период
	|ИМЕЮЩИЕ
	|	СУММА(ВытесняемоеПлановоеВремяСотрудников.Часы) > 0
	|;
	|
#КонецВставки
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСостоянийСотрудников.Регистратор КАК Регистратор,
	|	ДанныеСостоянийСотрудников.Сотрудник КАК Сотрудник,
	|	ДанныеСостоянийСотрудников.Сторно КАК Сторно,
	|	ДанныеСостоянийСотрудников.Состояние КАК ТекущееСостояние,
	|	ДанныеСостоянийСотрудников.Начало КАК Начало,
	|	ДанныеСостоянийСотрудников.Окончание КАК Окончание,
	|	СостоянияСотрудниковДокумента.Состояние КАК Состояние,
	|	СостоянияСотрудниковДокумента.ДатаНачала КАК ДатаНачала,
	|	СостоянияСотрудниковДокумента.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТТекущиеСостоянияБезПриоритета
	|ИЗ
	|	ВТСостоянияСотрудниковДокумента КАК СостоянияСотрудниковДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСостоянийСотрудников КАК ДанныеСостоянийСотрудников
	|		ПО СостоянияСотрудниковДокумента.Сотрудник = ДанныеСостоянийСотрудников.Сотрудник
	|			И (НЕ ДанныеСостоянийСотрудников.Регистратор В (&ИсключаемыеРегистраторы))
	|			И (ДанныеСостоянийСотрудников.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.Работа))
	|			И (ДанныеСостоянийСотрудников.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.РаботаВОтпускеПоУходуЗаРебенком))
	|			И (СостоянияСотрудниковДокумента.ДатаОкончания >= ДанныеСостоянийСотрудников.Начало
	|				ИЛИ СостоянияСотрудниковДокумента.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.Увольнение))
	|			И (СостоянияСотрудниковДокумента.ДатаНачала <= ДанныеСостоянийСотрудников.Окончание
	|				ИЛИ ДанныеСостоянийСотрудников.Окончание = ДАТАВРЕМЯ(1, 1, 1))
#Вставка
	// + СБит 2025-10-10 279466  
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтсутствияНеполныйДень.Регистратор,
	|	ОтсутствияНеполныйДень.Сотрудник,
	|	Ложь КАК Сторно,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтсутствиеССохранениемОплаты),
	//|	""Отсутствие неполный день"",
	|	ОтсутствияНеполныйДень.Период,
	|	ОтсутствияНеполныйДень.Период,
	|	СостоянияСотрудниковДокумента.Состояние КАК Состояние,
	|	СостоянияСотрудниковДокумента.ДатаНачала КАК ДатаНачала,
	|	СостоянияСотрудниковДокумента.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	ВТСостоянияСотрудниковДокумента КАК СостоянияСотрудниковДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОтсутствияНеполныйДень КАК ОтсутствияНеполныйДень
	|		ПО СостоянияСотрудниковДокумента.Сотрудник = ОтсутствияНеполныйДень.Сотрудник
	|			И СостоянияСотрудниковДокумента.ДатаОкончания >= ОтсутствияНеполныйДень.Период
	|			И СостоянияСотрудниковДокумента.ДатаНачала <= ОтсутствияНеполныйДень.Период
#КонецВставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЗначениеИстина
	|ИЗ
	|	ВТТекущиеСостоянияБезПриоритета КАК ТекущиеСостоянияБезПриоритета";

	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	Если РезультатЗапроса.Пустой() Тогда 
		Возврат РезультатПроверки;
	КонецЕсли;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТекущиеСостоянияБезПриоритета.Регистратор КАК Регистратор,
	|	ТекущиеСостоянияБезПриоритета.Сотрудник КАК Сотрудник,
	|	ТекущиеСостоянияБезПриоритета.Сторно КАК Сторно,
	|	ТекущиеСостоянияБезПриоритета.ТекущееСостояние КАК ТекущееСостояние,
	|	ТекущиеСостоянияБезПриоритета.Начало КАК Начало,
	|	ТекущиеСостоянияБезПриоритета.Окончание КАК Окончание,
	|	ПриоритетыСостоянийСотрудников.Порядок КАК Приоритет,
	|	ТекущиеСостоянияБезПриоритета.Состояние КАК Состояние,
	|	ТекущиеСостоянияБезПриоритета.ДатаНачала КАК ДатаНачала,
	|	ТекущиеСостоянияБезПриоритета.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТТекущиеСостояния
	|ИЗ
	|	ВТТекущиеСостоянияБезПриоритета КАК ТекущиеСостоянияБезПриоритета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Перечисление.СостоянияСотрудника КАК ПриоритетыСостоянийСотрудников
	|		ПО ТекущиеСостоянияБезПриоритета.ТекущееСостояние = ПриоритетыСостоянийСотрудников.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеСостояния.Сотрудник КАК Сотрудник,
	|	ТекущиеСостояния.ТекущееСостояние КАК ТекущееСостояние,
	|	ТекущиеСостояния.Начало КАК Начало,
	|	ТекущиеСостояния.Окончание КАК Окончание,
	|	КОЛИЧЕСТВО(ТекущиеСостояния.Сотрудник) КАК КоличествоСторноЗаписей
	|ПОМЕСТИТЬ ВТТекущиеСостоянияСторно
	|ИЗ
	|	ВТТекущиеСостояния КАК ТекущиеСостояния
	|ГДЕ
	|	ТекущиеСостояния.Сторно
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущиеСостояния.Сотрудник,
	|	ТекущиеСостояния.ТекущееСостояние,
	|	ТекущиеСостояния.Начало,
	|	ТекущиеСостояния.Окончание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеСостояния.Сотрудник КАК Сотрудник,
	|	ТекущиеСостояния.ТекущееСостояние КАК ТекущееСостояние,
	|	ТекущиеСостояния.Начало КАК Начало,
	|	ТекущиеСостояния.Окончание КАК Окончание,
	|	КОЛИЧЕСТВО(ТекущиеСостояния.Сотрудник) КАК КоличествоСторнированныхЗаписей
	|ПОМЕСТИТЬ ВТСторнированныеЗаписи
	|ИЗ
	|	ВТТекущиеСостояния КАК ТекущиеСостояния
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТекущиеСостоянияСторно КАК ТекущиеСостоянияСторно
	|		ПО ТекущиеСостояния.Сотрудник = ТекущиеСостоянияСторно.Сотрудник
	|			И ТекущиеСостояния.ТекущееСостояние = ТекущиеСостоянияСторно.ТекущееСостояние
	|			И ТекущиеСостояния.Начало = ТекущиеСостоянияСторно.Начало
	|			И ТекущиеСостояния.Окончание = ТекущиеСостоянияСторно.Окончание
	|			И (НЕ ТекущиеСостояния.Сторно)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущиеСостояния.Сотрудник,
	|	ТекущиеСостояния.ТекущееСостояние,
	|	ТекущиеСостояния.Начало,
	|	ТекущиеСостояния.Окончание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СторнированныеЗаписи.Сотрудник КАК Сотрудник,
	|	СторнированныеЗаписи.ТекущееСостояние КАК ТекущееСостояние,
	|	СторнированныеЗаписи.Начало КАК Начало,
	|	СторнированныеЗаписи.Окончание КАК Окончание
	|ПОМЕСТИТЬ ВТИсключаемыеЗаписи
	|ИЗ
	|	ВТТекущиеСостоянияСторно КАК ТекущиеСостоянияСторно
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСторнированныеЗаписи КАК СторнированныеЗаписи
	|		ПО ТекущиеСостоянияСторно.Сотрудник = СторнированныеЗаписи.Сотрудник
	|			И ТекущиеСостоянияСторно.ТекущееСостояние = СторнированныеЗаписи.ТекущееСостояние
	|			И ТекущиеСостоянияСторно.Начало = СторнированныеЗаписи.Начало
	|			И ТекущиеСостоянияСторно.Окончание = СторнированныеЗаписи.Окончание
	|			И ТекущиеСостоянияСторно.КоличествоСторноЗаписей >= СторнированныеЗаписи.КоличествоСторнированныхЗаписей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТекущиеСостояния.Регистратор КАК Регистратор,
	|	ТекущиеСостояния.Сотрудник КАК Сотрудник,
	|	ТекущиеСостояния.ТекущееСостояние КАК ТекущееСостояние,
	|	ТекущиеСостояния.Начало КАК Начало,
	|	ТекущиеСостояния.Окончание КАК Окончание,
	|	ТекущиеСостояния.Приоритет КАК Приоритет,
	|	ТекущиеСостояния.Состояние КАК Состояние,
	|	ТекущиеСостояния.ДатаНачала КАК ДатаНачала,
	|	ТекущиеСостояния.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТНайденныеОшибкиПредварительно
	|ИЗ
	|	ВТТекущиеСостояния КАК ТекущиеСостояния
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсключаемыеЗаписи КАК ИсключаемыеЗаписи
	|		ПО ТекущиеСостояния.Сотрудник = ИсключаемыеЗаписи.Сотрудник
	|			И ТекущиеСостояния.ТекущееСостояние = ИсключаемыеЗаписи.ТекущееСостояние
	|			И ТекущиеСостояния.Начало = ИсключаемыеЗаписи.Начало
	|			И ТекущиеСостояния.Окончание = ИсключаемыеЗаписи.Окончание
	|ГДЕ
	|	ИсключаемыеЗаписи.Сотрудник ЕСТЬ NULL
	|	И НЕ ТекущиеСостояния.Сторно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайденныеОшибкиПредварительно.Сотрудник КАК Сотрудник,
	|	НайденныеОшибкиПредварительно.ТекущееСостояние КАК ТекущееСостояние,
	|	НайденныеОшибкиПредварительно.Начало КАК Начало,
	|	МИНИМУМ(ДанныеСостоянийСотрудников.Начало) КАК НачалоСледующегоСостояния
	|ПОМЕСТИТЬ ВТОткрытыеСостоянияДаты
	|ИЗ
	|	ВТНайденныеОшибкиПредварительно КАК НайденныеОшибкиПредварительно
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСостоянийСотрудников КАК ДанныеСостоянийСотрудников
	|		ПО НайденныеОшибкиПредварительно.Сотрудник = ДанныеСостоянийСотрудников.Сотрудник
	|			И (НайденныеОшибкиПредварительно.Окончание = ДАТАВРЕМЯ(1, 1, 1))
	|			И НайденныеОшибкиПредварительно.Начало < ДанныеСостоянийСотрудников.Начало
	|			И (ДанныеСостоянийСотрудников.Окончание = ДАТАВРЕМЯ(1, 1, 1))
	|			И (НЕ ДанныеСостоянийСотрудников.Регистратор В (&ИсключаемыеРегистраторы))
	|
	|СГРУППИРОВАТЬ ПО
	|	НайденныеОшибкиПредварительно.Сотрудник,
	|	НайденныеОшибкиПредварительно.ТекущееСостояние,
	|	НайденныеОшибкиПредварительно.Начало
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайденныеОшибкиПредварительно.Регистратор КАК Регистратор,
	|	НайденныеОшибкиПредварительно.Сотрудник КАК Сотрудник,
	|	НайденныеОшибкиПредварительно.ТекущееСостояние КАК ТекущееСостояние,
	|	НайденныеОшибкиПредварительно.Начало КАК Начало,
	|	ДОБАВИТЬКДАТЕ(ОткрытыеСостоянияДаты.НачалоСледующегоСостояния, ДЕНЬ, -1) КАК Окончание,
	|	НайденныеОшибкиПредварительно.Приоритет КАК Приоритет,
	|	НайденныеОшибкиПредварительно.Состояние КАК Состояние,
	|	НайденныеОшибкиПредварительно.ДатаНачала КАК ДатаНачала,
	|	НайденныеОшибкиПредварительно.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТНайденныеОшибки
	|ИЗ
	|	ВТНайденныеОшибкиПредварительно КАК НайденныеОшибкиПредварительно
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОткрытыеСостоянияДаты КАК ОткрытыеСостоянияДаты
	|		ПО НайденныеОшибкиПредварительно.Сотрудник = ОткрытыеСостоянияДаты.Сотрудник
	|			И НайденныеОшибкиПредварительно.ТекущееСостояние = ОткрытыеСостоянияДаты.ТекущееСостояние
	|			И НайденныеОшибкиПредварительно.Начало = ОткрытыеСостоянияДаты.Начало
	|			И (НайденныеОшибкиПредварительно.ДатаНачала <= ДОБАВИТЬКДАТЕ(ОткрытыеСостоянияДаты.НачалоСледующегоСостояния, ДЕНЬ, -1))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НайденныеОшибкиПредварительно.Регистратор,
	|	НайденныеОшибкиПредварительно.Сотрудник,
	|	НайденныеОшибкиПредварительно.ТекущееСостояние,
	|	НайденныеОшибкиПредварительно.Начало,
	|	НайденныеОшибкиПредварительно.Окончание,
	|	НайденныеОшибкиПредварительно.Приоритет,
	|	НайденныеОшибкиПредварительно.Состояние,
	|	НайденныеОшибкиПредварительно.ДатаНачала,
	|	НайденныеОшибкиПредварительно.ДатаОкончания
	|ИЗ
	|	ВТНайденныеОшибкиПредварительно КАК НайденныеОшибкиПредварительно
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОткрытыеСостоянияДаты КАК ОткрытыеСостоянияДаты
	|		ПО НайденныеОшибкиПредварительно.Сотрудник = ОткрытыеСостоянияДаты.Сотрудник
	|			И НайденныеОшибкиПредварительно.ТекущееСостояние = ОткрытыеСостоянияДаты.ТекущееСостояние
	|			И НайденныеОшибкиПредварительно.Начало = ОткрытыеСостоянияДаты.Начало
	|ГДЕ
	|	ОткрытыеСостоянияДаты.Сотрудник ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайденныеОшибки.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(НайденныеОшибки.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТПриоритетСостояний
	|ИЗ
	|	ВТНайденныеОшибки КАК НайденныеОшибки
	|
	|СГРУППИРОВАТЬ ПО
	|	НайденныеОшибки.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайденныеОшибки.Регистратор КАК Регистратор,
	|	НайденныеОшибки.Сотрудник КАК Сотрудник,
	|	НайденныеОшибки.ТекущееСостояние КАК ТекущееСостояние,
	|	НайденныеОшибки.Начало КАК Начало,
	|	НайденныеОшибки.Окончание КАК Окончание,
	|	НайденныеОшибки.Приоритет КАК Приоритет,
	|	НайденныеОшибки.Состояние КАК Состояние,
	|	НайденныеОшибки.ДатаНачала КАК ДатаНачала,
	|	НайденныеОшибки.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	ВТНайденныеОшибки КАК НайденныеОшибки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПриоритетСостояний КАК ПриоритетСостояний
	|		ПО НайденныеОшибки.Сотрудник = ПриоритетСостояний.Сотрудник
	|			И НайденныеОшибки.Приоритет = ПриоритетСостояний.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайденныеОшибки.Регистратор КАК Регистратор,
	|	НайденныеОшибки.Сотрудник КАК Сотрудник,
	|	НайденныеОшибки.ТекущееСостояние КАК ТекущееСостояние,
	|	НайденныеОшибки.Начало КАК Начало,
	|	НайденныеОшибки.Окончание КАК Окончание,
	|	НайденныеОшибки.Приоритет КАК Приоритет,
	|	НайденныеОшибки.Состояние КАК Состояние,
	|	НайденныеОшибки.ДатаНачала КАК ДатаНачала,
	|	НайденныеОшибки.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	ВТНайденныеОшибки КАК НайденныеОшибки
	|ГДЕ
	|	НайденныеОшибки.ТекущееСостояние = НайденныеОшибки.Состояние
	|	И НайденныеОшибки.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоУходуЗаРебенком)";

	УстановитьПривилегированныйРежим(Истина);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();			   
	УстановитьПривилегированныйРежим(Ложь);

	РезультатПроверки.Отказ = Не РезультатыЗапроса[9].Пустой();
	ОписаниеСотрудника = "Регистратор,Состояние,ПредставлениеПериода";

	Выборка = РезультатыЗапроса[9].Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеСотрудника = Новый Структура(ОписаниеСотрудника);
		ДанныеСотрудника.Регистратор = Выборка.Регистратор;
		ДанныеСотрудника.Состояние = Выборка.ТекущееСостояние;
		ДатаНачала = ?(Выборка.ТекущееСостояние = Перечисления.СостоянияСотрудника.Увольнение, Выборка.Начало - 86400, Выборка.Начало);
		ДатаОкончания = ?(Выборка.Окончание = Дата(1, 1, 1), Неопределено, Выборка.Окончание);
		ДанныеСотрудника.ПредставлениеПериода = ЗарплатаКадрыРасширенный.ПредставлениеПериодаРасчетногоДокумента(ДатаНачала, ДатаОкончания);
		РезультатПроверки.ДанныеСотрудников.Вставить(Выборка.Сотрудник, ДанныеСотрудника);
	КонецЦикла;

	Если РезультатПроверки.ДанныеСотрудников.Количество() > 0 Тогда 
		Возврат РезультатПроверки;
	КонецЕсли;

	Выборка = РезультатыЗапроса[8].Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДанныеСотрудника = Новый Структура(ОписаниеСотрудника);
		ДанныеСотрудника.Регистратор = Выборка.Регистратор;
		ДанныеСотрудника.Состояние = Выборка.ТекущееСостояние;
		ДатаНачала = ?(Выборка.ТекущееСостояние = Перечисления.СостоянияСотрудника.Увольнение, Выборка.Начало - 86400, Выборка.Начало);
		ДатаОкончания = ?(Выборка.Окончание = Дата(1, 1, 1), Неопределено, Выборка.Окончание);
		ДанныеСотрудника.ПредставлениеПериода = ЗарплатаКадрыРасширенный.ПредставлениеПериодаРасчетногоДокумента(ДатаНачала, ДатаОкончания);
		РезультатПроверки.ДанныеСотрудников.Вставить(Выборка.Сотрудник, ДанныеСотрудника);
	КонецЦикла;

	Возврат РезультатПроверки;

КонецФункции
