
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТехническаяРасшифровкаРасчета = Параметры.РасшифровкаРасчета;
	СформироватьДеревоЗависимостей(ТехническаяРасшифровкаРасчета);
	
	РасшифровкаРасчета            = СтрЗаменить(ТехническаяРасшифровкаРасчета, ":•", ":");
	
	Заголовок = СтрШаблон(НСтр("ru='Эффективная доля владения %1 в %2'"), Параметры.Акционер, Параметры.ОбъектВладения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьДеревоЗависимостей(Знач РасшифровкаСтрокой)
	
	ЗначениеДеревоЗависимостей = РеквизитФормыВЗначение("ДеревоЗависимостей");
	
	Пока Истина Цикл
		ДанныеСтроки = ДанныеСтрокиРасшифровки(РасшифровкаСтрокой);
		Если ДанныеСтроки = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		ДобавитьДанныеСтрокиВДерево(ЗначениеДеревоЗависимостей, ДанныеСтроки);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ЗначениеДеревоЗависимостей, "ДеревоЗависимостей");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеСтрокиРасшифровки(РасшифровкаСтрокой)
	
	СимволРазделения = "•";
	НачалоПоследовательности          = СтрНайти(РасшифровкаСтрокой, СимволРазделения);
	НачалоРасшифровки                 = СтрНайти(РасшифровкаСтрокой, СимволРазделения,,, 2);
	НачалоСледующейПоследовательности = СтрНайти(РасшифровкаСтрокой, СимволРазделения,,, 3);
	
	Если НачалоПоследовательности = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("Последовательность", "");
	ДанныеСтроки.Вставить("Множители",          "");
	ДанныеСтроки.Вставить("ЭффективнаяДоля",    "");
	
	ДанныеСтроки.Последовательность = Сред(РасшифровкаСтрокой, НачалоПоследовательности + 2,
										НачалоРасшифровки - НачалоПоследовательности - 3);
	
	Расшифровка = "";
	Если НачалоСледующейПоследовательности = 0 Тогда
		Расшифровка = Сред(РасшифровкаСтрокой, НачалоРасшифровки + 2);
	Иначе
		Расшифровка = Сред(РасшифровкаСтрокой, НачалоРасшифровки + 2,
									НачалоСледующейПоследовательности - НачалоРасшифровки - 3);
	КонецЕсли;
	НачалоЗнакаРавно = СтрНайти(Расшифровка, "=");
	ДанныеСтроки.Множители       = Лев(Расшифровка, НачалоЗнакаРавно - 6);
	
	ЭффективнаяДоляСтрокой = Сред(Расшифровка, НачалоЗнакаРавно + 1);
	ЭффективнаяДоляСтрокой = СтрЗаменить(ЭффективнаяДоляСтрокой, "%", "");
	ДанныеСтроки.ЭффективнаяДоля = Число(ЭффективнаяДоляСтрокой);
										
	Если НачалоСледующейПоследовательности = 0 Тогда
		РасшифровкаСтрокой = "";
	Иначе
		РасшифровкаСтрокой = Сред(РасшифровкаСтрокой, НачалоСледующейПоследовательности);
	КонецЕсли;
	
	Возврат ДанныеСтроки;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьДанныеСтрокиВДерево(ДеревоЗависимостей, ДанныеСтроки)
	
	Разделитель              = "|";
	СтрокаПоследовательности = СтрЗаменить(ДанныеСтроки.Последовательность, "->", Разделитель);
	Последовательность       = СтрРазделить(СтрокаПоследовательности, Разделитель, Ложь);
	Множители                = СтрРазделить(ДанныеСтроки.Множители, "*", Ложь);
	
	ТекущаяКоллекцияСтрокДерева = ДеревоЗависимостей.Строки;
	
	ИндексЭлемента = 0;
	Для каждого ЭлементПоследовательности Из Последовательность Цикл
		ОбъектСтрокой = СокрЛП(ЭлементПоследовательности);
		ВеткаОбъекта  = ТекущаяКоллекцияСтрокДерева.Найти(ОбъектСтрокой, "Объект");
		Если ВеткаОбъекта = Неопределено Тогда
			ВеткаОбъекта = ТекущаяКоллекцияСтрокДерева.Добавить();
			ВеткаОбъекта.Объект = ОбъектСтрокой;
			Если ИндексЭлемента > 0 Тогда
				ВеткаОбъекта.Доля = Множители[ИндексЭлемента - 1];
			КонецЕсли;
		КонецЕсли;
		ВеткаОбъекта.ЭффективнаяДоля = ВеткаОбъекта.ЭффективнаяДоля + ДанныеСтроки.ЭффективнаяДоля;
		ТекущаяКоллекцияСтрокДерева = ВеткаОбъекта.Строки;
		ИндексЭлемента              = ИндексЭлемента + 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти