#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета.
//
// Параметры:
//   Настройки - Коллекция - настройки отчетов и вариантов отчетов конфигурации.
//	 ОписаниеОтчета - СтрокаДерева
//                  - ОбъектМетаданных - описание настроек, метаданные или ссылка отчета.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт

	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;

	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "УстановленныеВизы");
	ОписаниеВарианта.Включен  = Истина;
	ОписаниеВарианта.Описание = НСтр("ru = 'Помогает получать информацию о просроченных и установленных визах.'; 
									 |en = 'Helps to get information about expired and established visas'");

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли