#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция определяет имя объекта ссылочного типа по описанию типов.
//
// Параметры:
//  Аналитика - ПланВидовХарактеристикСсылка.бит_ВидыДополнительныхАналитик - Дополнительная аналитика.
// 
// Возвращаемое значение:
//  Массив - массив выбора.
//
Функция ТипыДополнительнойАналитики(Аналитика) Экспорт
	
	МассивТипов = Аналитика.ТипЗначения.Типы();	 
	МассивВыбора = Новый Массив;
	
	Для Каждого ТекущийТип Из МассивТипов Цикл
		НовыеДанные = Метаданные.НайтиПоТипу(ТекущийТип);
		Если НовыеДанные = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		МассивВыбора.Добавить(НовыеДанные.ПолноеИмя());
	КонецЦикла;
	
	Возврат МассивВыбора;
	
КонецФункции

#КонецОбласти

#КонецЕсли
