#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Перем КлючВарианта;
	
	СтандартнаяОбработка = Ложь;
	УстановитьЗаголовкиПолейДопИзмерений();
	
	Если НЕ КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("КлючВарианта", КлючВарианта) Тогда
		КлючВарианта = "";
	КонецЕсли;
	
	ТаблицаПериодов = ТаблицаПериодов(); 
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаПериодов", ТаблицаПериодов);
			
	бит_ОтчетыБФСервер.НастроитьДинамическийПериод(СхемаКомпоновкиДанных, КомпоновщикНастроек);

	ДокументРезультат.Очистить();
	
	КомпоновщикМакета		  = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	МакетКомпоновки   		  = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	бит_ОтчетыБФСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, 
		ДокументРезультат, ВспомогательныеПараметрыОтчета());

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПоБюджету = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПоБюджету").Значение;
	Если ПоБюджету Тогда
		Бюджет = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Бюджет").Значение;
		Если НЕ ЗначениеЗаполнено(Бюджет) Тогда
			ТекстСообщения = НСтр("ru = 'Не установлен ""Бюджет"".'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , ,Отказ); 
		КонецЕсли;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'В настройках отчета не заполнены сценарии для сравнения.'");
	СценарииДляСравнения = Новый ТаблицаЗначений; 
	НастройкиОтчета 	 = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "СценарииДляСравнения").Значение;
	Если НастройкиОтчета = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
	Иначе	
		СценарииДляСравнения = НастройкиОтчета.Получить();
		Если НЕ ЗначениеЗаполнено(СценарииДляСравнения) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
		КонецЕсли;
	КонецЕсли;
	
	ПроверитьСписок(СценарииДляСравнения, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	Настройки.События.ПередЗагрузкойВариантаНаСервере = Истина;
	
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = Отчеты.бит_ПрогнозИсполненияБюджета.ЗагрузитьНастройкиПриИзмененииПараметров();
	Настройки.События.ПриОпределенииСвойствЭлементовФормыНастроек = Истина;
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//   Например, если схема отчета зависит от ключа варианта или параметров отчета.
//   Чтобы изменения схемы вступили в силу следует вызывать метод ОтчетыСервер.ПодключитьСхему().
//
// Параметры:
//   Контекст - Произвольный - 
//       Параметры контекста, в котором используется отчет.
//       Используется для передачи в параметрах метода ОтчетыСервер.ПодключитьСхему().
//   КлючСхемы - Строка -
//       Идентификатор текущей схемы компоновщика настроек.
//       По умолчанию не заполнен (это означает что компоновщик инициализирован на основании основной схемы).
//       Используется для оптимизации, чтобы переинициализировать компоновщик как можно реже).
//       Может не использоваться если переинициализация выполняется безусловно.
//   КлючВарианта - Строка, Неопределено -
//       Имя предопределенного или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов для варианта расшифровки или без контекста.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных, Неопределено -
//       Настройки варианта отчета, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено когда настройки варианта не надо загружать (уже загружены ранее).
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных, Неопределено -
//       Пользовательские настройки, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено когда пользовательские настройки не надо загружать (уже загружены ранее).
//
// Примеры:
// 1. Компоновщик отчета инициализируется на основании схемы из общих макетов:
//	Если КлючСхемы <> "1" Тогда
//		КлючСхемы = "1";
//		СхемаКД = ПолучитьОбщийМакет("МояОбщаяСхемаКомпоновки");
//		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКД, КлючСхемы);
//	КонецЕсли;
//
// 2. Схема зависит от значения параметра, выведенного в пользовательские настройки отчета:
//	Если ТипЗнч(НовыеПользовательскиеНастройкиКД) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
//		ПолноеИмяОбъектаМетаданных = "";
//		Для Каждого ЭлементКД Из НовыеПользовательскиеНастройкиКД.Элементы Цикл
//			Если ТипЗнч(ЭлементКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
//				ИмяПараметра = Строка(ЭлементКД.Параметр);
//				Если ИмяПараметра = "ОбъектМетаданных" Тогда
//					ПолноеИмяОбъектаМетаданных = ЭлементКД.Значение;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЦикла;
//		Если КлючСхемы <> ПолноеИмяОбъектаМетаданных Тогда
//			КлючСхемы = ПолноеИмяОбъектаМетаданных;
//			СхемаКД = Новый СхемаКомпоновкиДанных;
//			// Наполнение схемы...
//			ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКД, КлючСхемы);
//		КонецЕсли;
//	КонецЕсли;
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, Настройки, ПользовательскиеНастройки) Экспорт
	
	ТекущийКлючСхемы = Неопределено;
	
	Если Настройки = Неопределено Тогда 
		Настройки = КомпоновщикНастроек.Настройки;
	КонецЕсли;
	
	ЭтоЗагруженнаяСхема = Ложь;
	ДвоичныеДанныеСхемы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Настройки.ДополнительныеСвойства, "СхемаКомпоновкиДанных");
	
	Если ТипЗнч(ДвоичныеДанныеСхемы) = Тип("ДвоичныеДанные") Тогда
		ТекущийКлючСхемы = ХешДвоичныхДанных(ДвоичныеДанныеСхемы);
		Если ТекущийКлючСхемы <> КлючСхемы Тогда
			Схема = Отчеты.бит_ПрогнозИсполненияБюджета.ИзвлечьСхемуИзДвоичныхДанных(ДвоичныеДанныеСхемы);
			ЭтоЗагруженнаяСхема = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ДоступныеЗначения = Неопределено;
	ФиксированныеПараметры = Отчеты.бит_ПрогнозИсполненияБюджета.ФиксированныеПараметры(
		Настройки, ПользовательскиеНастройки, ДоступныеЗначения);
	
	Если ТекущийКлючСхемы = Неопределено Тогда 
		ТекущийКлючСхемы = "" + ФиксированныеПараметры.ПоБюджету;
		ТекущийКлючСхемы = ОбщегоНазначения.СократитьСтрокуКонтрольнойСуммой(ТекущийКлючСхемы, 100);
		
		Если ТекущийКлючСхемы <> КлючСхемы Тогда
			КлючСхемы = "";
			Схема = Отчеты.бит_ПрогнозИсполненияБюджета.СхемаКомпоновкиДанных(ФиксированныеПараметры);
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийКлючСхемы <> Неопределено И ТекущийКлючСхемы <> КлючСхемы Тогда
		КлючСхемы = ТекущийКлючСхемы;
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, Схема, КлючСхемы);
		
		Если ЭтоЗагруженнаяСхема Тогда
			Отчеты.бит_ПрогнозИсполненияБюджета.УстановитьСтандартныеНастройкиЗагруженнойСхемы(
				ЭтотОбъект, ДвоичныеДанныеСхемы, Настройки, ПользовательскиеНастройки);
		Иначе
			Отчеты.бит_ПрогнозИсполненияБюджета.УстановитьСтандартныеНастройки(
				ЭтотОбъект, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
		КонецЕсли;
		
		Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
			// Переопределение.
			ИнтеграцияПодсистемБСП.ПередЗагрузкойВариантаНаСервере(Контекст, Настройки);
			ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере(Контекст, Настройки);
			ПередЗагрузкойВариантаНаСервере(Контекст, Настройки);
		КонецЕсли;
	Иначе
		Отчеты.бит_ПрогнозИсполненияБюджета.УстановитьФиксированныеПараметры(
			ЭтотОбъект, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ДоступныеЗначения", ДоступныеЗначения);

КонецПроцедуры

Процедура ПередЗагрузкойВариантаНаСервере(Форма, Настройки) Экспорт
	
	ТекущийКлючСхемы = Неопределено;
	Схема = Неопределено;
	КлючСхемы = "";
	ЭтоЗагруженнаяСхема = Ложь;
	
	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Или Настройки = Неопределено Тогда
		Если Настройки = Неопределено Тогда
			ДополнительныеСвойстваНастроек = КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
		Иначе
			ДополнительныеСвойстваНастроек = Настройки.ДополнительныеСвойства;
		КонецЕсли;
		
		Если Форма.ТипФормыОтчета = ТипФормыОтчета.Основная
			И (Форма.РежимРасшифровки
			Или Форма.КлючТекущегоВарианта <> "ПрогнозИсполненияБюджета") Тогда 
			
			ДополнительныеСвойстваНастроек.Вставить("ОтчетИнициализирован", Истина);
		КонецЕсли;
		
		ДвоичныеДанныеСхемы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДополнительныеСвойстваНастроек, "СхемаКомпоновкиДанных");
		
		Если ТипЗнч(ДвоичныеДанныеСхемы) = Тип("ДвоичныеДанные") Тогда
			ЭтоЗагруженнаяСхема = Истина;
			ТекущийКлючСхемы = ХешДвоичныхДанных(ДвоичныеДанныеСхемы);
			Схема = Отчеты.бит_ПрогнозИсполненияБюджета.ИзвлечьСхемуИзДвоичныхДанных(ДвоичныеДанныеСхемы);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоЗагруженнаяСхема Тогда
		КлючСхемы = ТекущийКлючСхемы;
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Форма, Схема, КлючСхемы);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииСвойствЭлементовФормыНастроек(ТипФормы, СвойстваЭлементов, ПользовательскиеНастройки) Экспорт 
	
	Если ТипФормы <> ТипФормыОтчета.Основная Тогда 
		Возврат;
	КонецЕсли;
	
	СвойстваГруппы = ОтчетыСервер.СвойстваГруппыЭлементовФормы();
	СвойстваГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СвойстваЭлементов.Группы.Вставить("ФиксированныеПараметры", СвойстваГруппы);
	
	ФиксированныеПараметры = Новый Структура("Период, ПоБюджету, Бюджет");
	ШиринаПоля = Новый Структура("ПоБюджету, Бюджет", 5, 35);
	
	Для Каждого ЭлементНастройки Из ПользовательскиеНастройки Цикл 
		Если ТипЗнч(ЭлементНастройки) <> Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			Или Не ФиксированныеПараметры.Свойство(ЭлементНастройки.Параметр) Тогда 
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля = СвойстваЭлементов.Поля.Найти(
			ЭлементНастройки.ИдентификаторПользовательскойНастройки, "ИдентификаторНастройки");
		
		Если СвойстваПоля = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля.ИдентификаторГруппы = "ФиксированныеПараметры";
		
		ИмяПараметра = Строка(ЭлементНастройки.Параметр);
		Если ИмяПараметра <> "Период" Тогда 
			СвойстваПоля.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			СвойстваПоля.Ширина = ШиринаПоля[ИмяПараметра];
			СвойстваПоля.РастягиватьПоГоризонтали = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаПериодов()

	НастройкиОтчета    	 = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "СценарииДляСравнения").Значение;
	СценарииДляСравнения = НастройкиОтчета.Получить();
	Если НЕ ЗначениеЗаполнено(СценарииДляСравнения) Тогда
		ВызватьИсключение НСтр("ru = 'Список сценариев пустой.'");
	КонецЕсли;
	
	Периодичность = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Периодичность").Значение;
		
	Список = НовыйСписок(); // Приведение списка к формальному виду.
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СценарииДляСравнения, Список);
	
	ТаблицаПериодов = НоваяТаблицаПериодов();
	
	Для каждого СтрокаТаблицы Из Список Цикл
		ДатаНачалаРасчета 	 = бит_ОбщегоНазначенияКлиентСервер.ПолучитьНачалоПериода(СтрокаТаблицы.Период.ДатаНачала, Периодичность);
		ДатаОкончанияРасчета = бит_ОбщегоНазначенияКлиентСервер.ПолучитьКонецПериода(СтрокаТаблицы.Период.ДатаОкончания, Периодичность);
		ВычисленнаяДата		 = ДатаНачалаРасчета;
		Пока ВычисленнаяДата <= ДатаОкончанияРасчета Цикл
			
			НоваяСтрока   = ТаблицаПериодов.Добавить();
			НоваяСтрока.ДатаНачалаРасчета 	 = бит_ОбщегоНазначенияКлиентСервер.ПолучитьНачалоПериода(ВычисленнаяДата, Периодичность);
			НоваяСтрока.ДатаОкончанияРасчета = бит_ОбщегоНазначенияКлиентСервер.ПолучитьКонецПериода(ВычисленнаяДата, Периодичность);
			НоваяСтрока.Сценарий		     = СтрокаТаблицы.Сценарий;	
			НоваяСтрока.Порядок				 = ТаблицаПериодов.Количество();
			Если ПустаяСтрока(СтрокаТаблицы.Код) Тогда
				Заголовок = Строка(СтрокаТаблицы.Сценарий);
			Иначе	
				Заголовок = СтрокаТаблицы.Код;
			КонецЕсли;
			НоваяСтрока.Код = Заголовок;
			
			ВычисленнаяДата = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ВычисленнаяДата, 1, Периодичность, Истина);
		КонецЦикла; 
	КонецЦикла;
	
	Возврат ТаблицаПериодов;
		
КонецФункции

Процедура УстановитьЗаголовкиПолейДопИзмерений()
	
	Отчеты.бит_ПрогнозИсполненияБюджета.УстановитьЗаголовкиПолейДопИзмерений(СхемаКомпоновкиДанных);
	
КонецПроцедуры

Функция ЗначенияЗаголовковПолей()
	
	ДанныеОтчета = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Показатели").Значение;
	
	ЗначенияЗаголовковПолей = Новый Структура;
	Если ДанныеОтчета = 1 Тогда
		ПараметрВалюта = Константы.бит_ВалютаУправленческогоУчета.Получить();
		ЗначенияЗаголовковПолей.Вставить("ВалютаОтчета", "(" + ПараметрВалюта + ")");
	ИначеЕсли ДанныеОтчета = 2 Тогда
		ПараметрВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
		ЗначенияЗаголовковПолей.Вставить("ВалютаОтчета", "(" + ПараметрВалюта + ")");
	ИначеЕсли ДанныеОтчета = 3 Тогда
		ПараметрВалюта = "в валюте сценария"; // Получить валюту сценария.
		ЗначенияЗаголовковПолей.Вставить("ВалютаОтчета", "(" + ПараметрВалюта + ")");
	Иначе
		ЗначенияЗаголовковПолей.Вставить("ВалютаОтчета", "");	
	КонецЕсли;
	
	Бюджет 	  = "";
	ПоБюджету = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПоБюджету").Значение;
	Если ПоБюджету Тогда
		Бюджет = Строка(бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Бюджет").Значение);
	КонецЕсли;
	
	ЗначенияЗаголовковПолей.Вставить("Бюджет", Бюджет);
	
	Возврат ЗначенияЗаголовковПолей;
	
КонецФункции

Процедура ПроверитьСписок(Список, Отказ)

	Если НЕ ЗначениеЗаполнено(Список) Тогда
		Возврат;
	КонецЕсли;
	
	СценарииДляСравнения = НовыйСписок();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Список, СценарииДляСравнения);
	
	ЭталонУстановлен = Ложь;
	Поле			 = "";
	
	НомерСтроки = 0;
	ИмяСписка = НСтр("ru='Сценарии';en='Scenarios'");
	Для каждого СтрокаТаблицы Из СценарииДляСравнения Цикл
		
		Префикс = СтрШаблон("СценарииДляСравнения[%1].", Формат(НомерСтроки , "ЧН=0; ЧГ="));
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сценарий) Тогда
			Поле = Префикс + "Сценарий";
			ИмяПоля = НСтр("ru='Сценарий';en='Scenario'");
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",, ИмяПоля, НомерСтроки + 1, ИмяСписка);			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Период) Тогда
			Поле = Префикс + "Период";
			ИмяПоля = НСтр("ru='Период';en='Period'");
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",, ИмяПоля, НомерСтроки + 1, ИмяСписка);			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Иначе
			Если ЗначениеЗаполнено(СтрокаТаблицы.Период.ДатаОкончания) И СтрокаТаблицы.Период.ДатаНачала > СтрокаТаблицы.Период.ДатаОкончания Тогда
				ТекстСообщения = НСтр("ru='Дата начала периода не может быть больше даты конца периода';
									  |en='The start date of the period cannot be greater than the end date of the period.'");					
				Поле = Префикс + "Период";
				ИмяПоля = НСтр("ru='Период';en='Period'");
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ", 
					ИмяПоля, НомерСтроки + 1, ИмяСписка);				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
			КонецЕсли;
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла; 
	
КонецПроцедуры

Функция НовыйСписок()
	
	Возврат Отчеты.бит_ПрогнозИсполненияБюджета.НовыйСписок();
	
КонецФункции

Функция НоваяТаблицаПериодов()

	ТаблицаПериодов = Новый ТаблицаЗначений; 
	ТаблицаПериодов.Колонки.Добавить("ДатаНачалаРасчета", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаПериодов.Колонки.Добавить("ДатаОкончанияРасчета", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаПериодов.Колонки.Добавить("Сценарий", Новый ОписаниеТипов("СправочникСсылка.СценарииПланирования"));
	ТаблицаПериодов.Колонки.Добавить("Код", 				 ОбщегоНазначения.ОписаниеТипаСтрока(25));
	ТаблицаПериодов.Колонки.Добавить("Порядок", 			 ОбщегоНазначения.ОписаниеТипаЧисло(2));
	
	Возврат ТаблицаПериодов;

КонецФункции

// Возвращает хеш-сумму двоичных данных.
//
// Параметры:
//   ДвоичныеДанные - ДвоичныеДанные - Данные, от которых считается хеш-сумма.
//
Функция ХешДвоичныхДанных(ДвоичныеДанные)
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеДанных.Добавить(ДвоичныеДанные);
	Возврат СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "") + "_" + Формат(ДвоичныеДанные.Размер(), "ЧГ=");
КонецФункции

Функция ВспомогательныеПараметрыОтчета()
	
	ВспомогательныеПараметры = Новый Массив;
	ВспомогательныеПараметры.Добавить("СценарииДляСравнения");
	ВспомогательныеПараметры.Добавить("Периодичность");
	
	Возврат ВспомогательныеПараметры;
	
КонецФункции

#КонецОбласти

#Область Инициализация

УстановитьЗаголовкиПолейДопИзмерений();

#КонецОбласти

#КонецЕсли
