#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля



// Хранит настройки дополнительных измерений.
Перем мНастройкиИзмерений Экспорт;



#КонецОбласти

#Область ПроцедурыИФункцииОбработчикиСобытийОбъекта



// Процедура - обработчик события "ПриКомпоновкеРезультата" формы.
// 
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СписокПараметровНаФорме = Новый СписокЗначений;
	
	СписокПараметровНаФорме.Добавить("Период");
	СписокПараметровНаФорме.Добавить("Периодичность");
	СписокПараметровНаФорме.Добавить("Регистратор");
	
	Для каждого ЭлементСписка Из СписокПараметровНаФорме Цикл
		
		ИмяПараметра = ЭлементСписка.Значение;
		бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек, 
																 ЭтотОбъект[ИмяПараметра], 
																 ИмяПараметра);
		
	КонецЦикла;  	 
	
	
	
КонецПроцедуры // ПриКомпоновкеРезультата()



#КонецОбласти

#Область Инициализация



мНастройкиИзмерений = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();

бит_МеханизмДопИзмерений.НастроитьПоляДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, "НаборДанных1");

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли