
&НаСервере
Процедура УВМ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++dar 27.09.23 (147515)
	УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_Подразделение", Элементы.Шапка, Истина);
	//--dar 27.09.23 (147515)
	
	//++dar 25.06.25 (255715)
	Если Объект.Дата >= УВМ_ОбщиеДоработки.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		СвойстваПоля_Руководитель = Новый Структура;
		СвойстваПоля_Руководитель.Вставить("АвтоОтметкаНезаполненного", Истина);
		УВМ_РаботаСФормами.НоваяКолонкаТаблицыФормы(ЭтотОбъект, "УВМ_Руководитель", "Сотрудники", "Объект.Сотрудники.УВМ_Руководитель", , 
																"Руководитель", , , СвойстваПоля_Руководитель);
	КонецЕсли;
	//--dar 25.06.25 (255715)
	
КонецПроцедуры
