#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

Перем мНастройкиИзмерений Экспорт; // Хранит настройки дополнительных измерений.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СписокПараметровНаФорме = Новый СписокЗначений;
	Отчеты.бит_кзн_ПлатежныйКалендарь.ЗаполнитьДополнительныеСписки(СписокПараметровНаФорме);
	
	Для каждого ЭлементСписка Из СписокПараметровНаФорме Цикл
		ИмяПараметра = ЭлементСписка.Значение;
		бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек, 
			ЭтотОбъект[ИмяПараметра], ИмяПараметра);
	КонецЦикла;  	 
	
	РежимОстатков = ?(Константы.бит_кзн_РежимОтображенияОстатковДС.Получить() = Перечисления.бит_кзн_РежимОтображенияОстатковДС.УправленческаяВыписка, 1, 0);
	бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек, РежимОстатков, "РежимОстатков");
															 
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(
		"ВалютаУпр", Константы.бит_ВалютаУправленческогоУчета.Получить());

	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(
		"ВалютаРеглУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
КонецПроцедуры // ПриКомпоновкеРезультата()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Период.ДатаНачала < НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя()) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,"КОРРЕКТНОСТЬ", 
			НСтр("ru='Начало периода';en='Period Start'"),,,
			НСтр("ru='Отчет не предназначен для анализа прошедших периодов.';
				 |en='The report is not designed to analyze past periods.'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Отчет.Период.ДатаНачала",, Отказ); 
	КонецЕсли; 

	бит_ОтчетыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

мНастройкиИзмерений = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();
бит_МеханизмДопИзмерений.НастроитьПоляДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, "НаборДанных1");
					
бит_ОтчетыСервер.УстановитьСтандартноеВыражениеПредставленияПоляПериод(СхемаКомпоновкиДанных, "НаборДанных1", "Период");

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли