
//++dar 20221128 (11805)
// Выгрузка пользователей (с упр. подразделением) в базу ERP


#Область Служебные

&После("ЗаполнитьПравилаОбработкиДанных")
Процедура УВМ_ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных)
	Если НаправлениеОбмена = "Отправка" Тогда
		// + СБит 2023-11-23 138579
		ДобавитьПОД_Регистр_УВМ_ИсторияСотрудников_Отправка(ПравилаОбработкиДанных); 
		// + СБит 2025-07-30 255683 
		ДобавитьПОД_Регистр_УВМ_Руководители_Отправка(ПравилаОбработкиДанных); 
		// + СБит 2024-01-11 162485
		ДобавитьПОД_Справочник_УВМ_ДолжностиУпр_Отправка(ПравилаОбработкиДанных);
		// - СБит 2023-11-23 
		// + СБит 2025-02-07
		ДобавитьПОД_Регистр_МестоПозицииШтатногоРасписания_Отправка(ПравилаОбработкиДанных); 
	КонецЕсли;
КонецПроцедуры

&После("ЗаполнитьПравилаКонвертацииОбъектов")
Процедура УВМ_ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации)
	Если НаправлениеОбмена = "Отправка" Тогда
		// + СБит 2023-11-23 138579
		ДобавитьПКО_Регистр_УВМ_ИсторияСотрудников_Отправка(ПравилаКонвертации);
		// + СБит 2025-07-30 255683 
		ДобавитьПКО_Регистр_УВМ_Руководители_Отправка(ПравилаКонвертации);
		// + СБит 2024-01-11 162485
		ДобавитьПКО_Справочник_УВМ_ДолжностиУпр_Отправка(ПравилаКонвертации);
		// - СБит 2023-11-23 
		// + СБит 2025-02-07
		ДобавитьПКО_Регистр_МестоПозицииШтатногоРасписания_Отправка(ПравилаКонвертации);
	КонецЕсли;
КонецПроцедуры

&После("ЗаполнитьПравилаКонвертацииПредопределенныхДанных")
Процедура УВМ_ЗаполнитьПравилаКонвертацииПредопределенныхДанных(НаправлениеОбмена, ПравилаКонвертации)
	// + СБит 2024-03-05
	// Перечисление_ВидыКадровыхСобытий
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисление_ВидыКадровыхСобытий";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ВидыКадровыхСобытий;
	ПравилоКонвертации.ТипXDTO   = "ВидыКадровыхСобытий";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ВидыКадровыхСобытий.Прием, "Прием");
	ЗначенияДляОтправки.Вставить(Перечисления.ВидыКадровыхСобытий.Перемещение, "Перемещение");
	ЗначенияДляОтправки.Вставить(Перечисления.ВидыКадровыхСобытий.Увольнение, "Увольнение");
	ЗначенияДляОтправки.Вставить(Перечисления.ВидыКадровыхСобытий.НачальныеДанные, "НачальныеДанные");
	ЗначенияДляОтправки.Вставить(Перечисления.ВидыКадровыхСобытий.ВосстановлениеВДолжности, "ВосстановлениеВДолжности");
	ЗначенияДляОтправки.Вставить(Перечисления.ВидыКадровыхСобытий.НеподтвержденныеДанные, "НеподтвержденныеДанные");
	ЗначенияДляОтправки.Вставить(Перечисления.ВидыКадровыхСобытий.ИзменениеОплатыТруда, "ИзменениеОплатыТруда");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("Прием", Перечисления.ВидыКадровыхСобытий.Прием);
	ЗначенияДляПолучения.Вставить("Перемещение", Перечисления.ВидыКадровыхСобытий.Перемещение);
	ЗначенияДляПолучения.Вставить("Увольнение", Перечисления.ВидыКадровыхСобытий.Увольнение);
	ЗначенияДляПолучения.Вставить("НачальныеДанные", Перечисления.ВидыКадровыхСобытий.НачальныеДанные);
	ЗначенияДляПолучения.Вставить("ВосстановлениеВДолжности", Перечисления.ВидыКадровыхСобытий.ВосстановлениеВДолжности);
	ЗначенияДляПолучения.Вставить("НеподтвержденныеДанные", Перечисления.ВидыКадровыхСобытий.НеподтвержденныеДанные);
	ЗначенияДляПолучения.Вставить("ИзменениеОплатыТруда", Перечисления.ВидыКадровыхСобытий.ИзменениеОплатыТруда);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;
	
КонецПроцедуры

&После("ВыполнитьПроцедуруМодуляМенеджера")
Процедура УВМ_ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры)
	Если ИмяПроцедуры = "ПКО_Регистр_УВМ_ИсторияСотрудников_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Регистр_УВМ_ИсторияСотрудников_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
			// + СБит 2025-07-30 255683
	ИначеЕсли ИмяПроцедуры = "ПКО_Регистр_УВМ_Руководители_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Регистр_УВМ_Руководители_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_УВМ_ДолжностиУпр_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_УВМ_ДолжностиУпр_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки); 
			// - СБит 2024-04-15
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
//--dar 20221128 (11805)

#Область Справочник_Сотрудники_Пользователи

&ИзменениеИКонтроль("ДобавитьПКО_Справочник_Пользователи")
Процедура УВМ_ДобавитьПКО_Справочник_Пользователи(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Справочник_Пользователи";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Справочники.Пользователи;
	ПравилоКонвертации.ОбъектФормата                      = "Справочник.Пользователи";
	ПравилоКонвертации.ПриОтправкеДанных                  = "ПКО_Справочник_Пользователи_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации               = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование",   "Наименование");
	ДобавитьПКС(СвойстваШапки, "ФизическоеЛицо", "", 1, "Справочник_ФизическиеЛица_Получение");
	ДобавитьПКС(СвойстваШапки, "",               "ФизическоеЛицо", 1, "Справочник_ФизическиеЛица_Отправка");
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование,ФизическоеЛицо");
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");
	
#Вставка
	ПространствоИмен = ПространствоРасширенияЗУП();
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ПространствоИмен);

	ДобавитьПКС(СвойстваШапки, "", "Подразделение", 1, "Справочник_СтруктураПредприятия_Отправка", ПространствоИмен);
#КонецВставки
	
КонецПроцедуры


&ИзменениеИКонтроль("ПКО_Справочник_Пользователи_ПриОтправкеДанных")
Процедура УВМ_ПКО_Справочник_Пользователи_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		ДанныеXDTO.Вставить("ФизическоеЛицо", Новый Структура("Значение, ИмяПКО", ДанныеИБ.ФизическоеЛицо,"Справочник_ФизическиеЛица_Отправка"));
#Вставка
		ДопДанные = ПолучитьДополнительныеДанныеПользователя(ДанныеИБ.Ссылка);
		Если ЗначениеЗаполнено(ДанныеИБ.ФизическоеЛицо) Тогда
			ДанныеXDTO.Вставить("Подразделение", Новый Структура("Значение, ИмяПКО", ДопДанные.Подразделение,"Справочник_СтруктураПредприятия_Отправка"));
		КонецЕсли;
#КонецВставки
		Возврат;
	КонецЕсли;

	ДанныеXDTO.КлючевыеСвойства.Вставить("ФизическоеЛицо", Новый Структура("Значение, ИмяПКО", ДанныеИБ.ФизическоеЛицо,"Справочник_ФизическиеЛица_Отправка"));
#Вставка
	ДопДанные = ПолучитьДополнительныеДанныеПользователя(ДанныеИБ.Ссылка);
	ДанныеXDTO.КлючевыеСвойства.Вставить("Наименование", ДопДанные.Наименование);
	Если ЗначениеЗаполнено(ДанныеИБ.ФизическоеЛицо) Тогда
		ДанныеXDTO.Вставить("Подразделение", Новый Структура("Значение, ИмяПКО", ДопДанные.Подразделение,"Справочник_СтруктураПредприятия_Отправка"));
	КонецЕсли;
#КонецВставки
КонецПроцедуры

//++dar 02.04.25 (228237)
Функция ПолучитьДополнительныеДанныеПользователя(Пользователь)
	
	ДопДанные = Новый Структура("ФизическоеЛицо,Наименование,Подразделение");
	ДанныеПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Пользователь, "ФизическоеЛицо,Наименование");	
	
	Если НЕ ЗначениеЗаполнено(ДанныеПользователя.ФизическоеЛицо) Тогда
		ДопДанные.Наименование = ДанныеПользователя.Наименование;
		Возврат ДопДанные;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КадроваяИсторияСотрудников.ФизическоеЛицо.Наименование КАК Наименование,
	|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних( , ФизическоеЛицо = &ФизическоеЛицо) КАК КадроваяИсторияСотрудников
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних() КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
	|		ПО (КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция)";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ДанныеПользователя.ФизическоеЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДопДанные, Выборка);
	КонецЕсли;
	
	Возврат ДопДанные;
	
КонецФункции	
//--dar 02.04.25 (228237)
#КонецОбласти

#Область Справочник_УВМ_ДолжностиУпр

// + СБит 2024-01-11 162485
Процедура ДобавитьПОД_Справочник_УВМ_ДолжностиУпр_Отправка(ПравилаОбработкиДанных)
	
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_УВМ_ДолжностиУпр_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.УВМ_ДолжностиУпр;
	ПравилоОбработки.ОчисткаДанных           = Ложь;

	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_УВМ_ДолжностиУпр_Отправка");
	
КонецПроцедуры

// + СБит 2024-01-11 162485 
Процедура ДобавитьПКО_Справочник_УВМ_ДолжностиУпр_Отправка(ПравилаКонвертации)
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);

	ПравилоКонвертации.ИмяПКО            = "Справочник_УВМ_ДолжностиУпр_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Справочники.УВМ_ДолжностиУпр;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_УВМ_ДолжностиУпр_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ОбъектФормата     = "Справочник.УВМ_ДолжностиУпр";  

	ПространствоИмен = ПространствоРасширенияЗУП();
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ПространствоИмен);
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование");

КонецПроцедуры

Процедура ПКО_Справочник_УВМ_ДолжностиУпр_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки) 

	ДанныеXDTO.КлючевыеСвойства.Вставить("Наименование", ДанныеИБ.Наименование);
	
КонецПроцедуры

#КонецОбласти

#Область Регистр_УВМ_ИсторияСотрудников

// + СБит 2023-11-23 138579 
Процедура ДобавитьПОД_Регистр_УВМ_ИсторияСотрудников_Отправка(ПравилаОбработкиДанных)
	
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Регистр_УВМ_ИсторияСотрудников_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.РегистрыСведений.УВМ_ИсторияСотрудников;
	ПравилоОбработки.ОчисткаДанных           = Ложь;

	ПравилоОбработки.ИспользуемыеПКО.Добавить("Регистр_УВМ_ИсторияСотрудников_Отправка");
	
КонецПроцедуры


// + СБит 2023-11-23 138579 
Процедура ДобавитьПКО_Регистр_УВМ_ИсторияСотрудников_Отправка(ПравилаКонвертации)
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);

	ПравилоКонвертации.ИмяПКО            = "Регистр_УВМ_ИсторияСотрудников_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.РегистрыСведений.УВМ_ИсторияСотрудников;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Регистр_УВМ_ИсторияСотрудников_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ОбъектФормата     = "РегистрСведений.УВМ_ИсторияСотрудников";
	
	ПространствоИмен = ПространствоРасширенияЗУП();
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ПространствоИмен);

	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "", "ПериодОтбор", 1);
	ДобавитьПКС(СвойстваШапки, "", "ФизическоеЛицоОтбор", 1, "Справочник_ФизическиеЛица_Отправка"); 
	ДобавитьПКС(СвойстваШапки, "", "ПользовательОтбор", 1, "Справочник_Пользователи", ПространствоИмен);
	ДобавитьПКС(СвойстваШапки, "", "ОрганизацияОтбор", 1, "Справочник_Организации_Отправка");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Записи");
	ДобавитьПКС(СвойстваТЧ, "", "Период", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ФизическоеЛицо", 1, "Справочник_ФизическиеЛица_Отправка");  
	ДобавитьПКС(СвойстваТЧ, "", "Пользователь", 1, "Справочник_Пользователи", ПространствоИмен);
	ДобавитьПКС(СвойстваТЧ, "", "Организация", 	1, "Справочник_Организации_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "Подразделение",1, "Справочник_СтруктураПредприятия_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "Должность", 	1, "Справочник_Должности_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "ДолжностьУпр", 1, "Справочник_УВМ_ДолжностиУпр_Отправка", 	ПространствоИмен); 
	ДобавитьПКС(СвойстваТЧ, "", "ВидСобытия", 	1, "Перечисление_ВидыКадровыхСобытий", ПространствоИмен);
	ДобавитьПКС(СвойстваТЧ, "", "НавигационнаяСсылкаДокумента");
	
КонецПроцедуры

// + СБит 2023-11-23 138579 
Процедура ПКО_Регистр_УВМ_ИсторияСотрудников_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	
	ДанныеXDTO.Вставить("ПериодОтбор",         ДанныеИБ.Отбор.Период.Значение);
	ДанныеXDTO.Вставить("ФизическоеЛицоОтбор",   ДанныеИБ.Отбор.ФизическоеЛицо.Значение);
	ДанныеXDTO.Вставить("ПользовательОтбор", 	ДанныеИБ.Отбор.Пользователь.Значение);
	ДанныеXDTO.Вставить("ОрганизацияОтбор",   ДанныеИБ.Отбор.Организация.Значение); 
	
	ДанныеXDTO.КлючевыеСвойства.Вставить("ПериодОтбор",         ДанныеИБ.Отбор.Период.Значение);
	ДанныеXDTO.КлючевыеСвойства.Вставить("ФизическоеЛицоОтбор",   ДанныеИБ.Отбор.ФизическоеЛицо.Значение);
	ДанныеXDTO.КлючевыеСвойства.Вставить("ПользовательОтбор", 	ДанныеИБ.Отбор.Пользователь.Значение);
	ДанныеXDTO.КлючевыеСвойства.Вставить("ОрганизацияОтбор",   ДанныеИБ.Отбор.Организация.Значение); 
	
 	ТаблицаЗаписи = ДанныеИБ.Выгрузить();
	
	ДанныеXDTO.Вставить("Записи", ТаблицаЗаписи);
КонецПроцедуры

#КонецОбласти

#Область Регистр_УВМ_Руководители

// + СБит 2025-07-30 255683  
Процедура ДобавитьПОД_Регистр_УВМ_Руководители_Отправка(ПравилаОбработкиДанных)
	
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Регистр_УВМ_Руководители_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.РегистрыСведений.УВМ_Руководители;
	ПравилоОбработки.ОчисткаДанных           = Ложь;

	ПравилоОбработки.ИспользуемыеПКО.Добавить("Регистр_УВМ_Руководители_Отправка");
	
КонецПроцедуры


// + СБит 2025-07-30 255683  
Процедура ДобавитьПКО_Регистр_УВМ_Руководители_Отправка(ПравилаКонвертации)
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);

	ПравилоКонвертации.ИмяПКО            = "Регистр_УВМ_Руководители_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.РегистрыСведений.УВМ_Руководители;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Регистр_УВМ_Руководители_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ОбъектФормата     = "РегистрСведений.УВМ_Руководители";
	
	ПространствоИмен = ПространствоРасширенияЗУП();
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ПространствоИмен);

	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "", "ПериодОтбор", 1);
	ДобавитьПКС(СвойстваШапки, "", "ФизическоеЛицоОтбор", 1, "Справочник_ФизическиеЛица_Отправка"); 
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Записи");
	ДобавитьПКС(СвойстваТЧ, "", "Период", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ФизическоеЛицо", 1, "Справочник_ФизическиеЛица_Отправка");  
	ДобавитьПКС(СвойстваТЧ, "", "Руководитель", 1, "Справочник_ФизическиеЛица_Отправка");  
	ДобавитьПКС(СвойстваТЧ, "", "ДействуетДо");
	ДобавитьПКС(СвойстваТЧ, "", "НавигационнаяСсылкаДокумента");
	
КонецПроцедуры

// + СБит 2025-07-30 255683  
Процедура ПКО_Регистр_УВМ_Руководители_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	
	ДанныеXDTO.Вставить("ПериодОтбор",    ДанныеИБ.Отбор.Период.Значение);
	ДанныеXDTO.Вставить("ФизическоеЛицоОтбор",   ДанныеИБ.Отбор.Физлицо.Значение);
	
	ДанныеXDTO.КлючевыеСвойства.Вставить("ПериодОтбор",    ДанныеИБ.Отбор.Период.Значение);
	ДанныеXDTO.КлючевыеСвойства.Вставить("ФизическоеЛицоОтбор",   ДанныеИБ.Отбор.Физлицо.Значение);
	
 	ТаблицаЗаписи = ДанныеИБ.Выгрузить(); 
	Физлицо = ТаблицаЗаписи.Колонки.Найти("ФизЛицо");
	Физлицо.Имя = "ФизическоеЛицо";
	ТаблицаЗаписи.Колонки.Добавить("НавигационнаяСсылкаДокумента");
	Для Каждого Строка Из ТаблицаЗаписи Цикл
		Если ЗначениеЗаполнено(Строка.КадровыйДокумент) Тогда 
			Строка.НавигационнаяСсылкаДокумента = ПолучитьНавигационнуюСсылку(Строка.КадровыйДокумент);
		КонецЕсли;	
	КонецЦикла;	
	
	ДанныеXDTO.Вставить("Записи", ТаблицаЗаписи);
КонецПроцедуры

#КонецОбласти

#Область Регистр_МестоПозицииШтатногоРасписанияВСтруктуреПредприятия

// + СБит 2023-11-23 138579 
Процедура ДобавитьПОД_Регистр_МестоПозицииШтатногоРасписания_Отправка(ПравилаОбработкиДанных)
	
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Регистр_МестоПозицииШтатногоРасписания_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия;
	ПравилоОбработки.ПриОбработке            = "ПОД_Регистр_МестоПозицииШтатногоРасписания_Отправка_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Регистр_МестоПозицииШтатногоРасписания_Отправка");
	
КонецПроцедуры

Процедура ДобавитьПКО_Регистр_МестоПозицииШтатногоРасписания_Отправка(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Регистр_МестоПозицииШтатногоРасписания_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия;
	ПравилоКонвертации.ОбъектФормата     = "РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия";

	ПространствоИмен = ПространствоРасширенияЗУП();
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ПространствоИмен);

	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "", "ПозицияОтбор", 1, "Справочник_ШтатноеРасписание_Отправка");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Записи");
	ДобавитьПКС(СвойстваТЧ, "", "Подразделение",1, "Справочник_СтруктураПредприятия_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "ДолжностьУпр", 1, "Справочник_УВМ_ДолжностиУпр_Отправка", 	ПространствоИмен); 
	
КонецПроцедуры

Процедура ПОД_Регистр_МестоПозицииШтатногоРасписания_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Справочник_Сотрудники_Отправка = Ложь;
КонецПроцедуры

#КонецОбласти


//++dar 24.03.23 
//выгрузка сводных данных по з/п в ERP для отражения расходов по зарплате и налогам
#Область Документ_ОтражениеЗарплатыВБухучете   

&ИзменениеИКонтроль("ОтражениеЗарплатыВБухучете_ПриОтправкеДанных")
Процедура УВМ_ОтражениеЗарплатыВБухучете_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;

	ИспользоватьФормат1_11 = (СравнитьВерсии(КомпонентыОбмена.ВерсияФорматаОбмена, "1.11") >= 0);
	ИспользоватьФормат1_15 = (СравнитьВерсии(КомпонентыОбмена.ВерсияФорматаОбмена, "1.15") >= 0);
	ЭтоОбменБП3 = ЭтоОбменЗУПБП(КомпонентыОбмена);

	СоответствиеСтатьяРасходовСпособРасчетов = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатьиРасходовЗарплата.Ссылка КАК Ссылка,
	|	СтатьиРасходовЗарплата.СпособРасчетовСФизическимиЛицами КАК СпособРасчетовСФизическимиЛицами
	|ИЗ
	|	Справочник.СтатьиРасходовЗарплата КАК СтатьиРасходовЗарплата";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.СпособРасчетовСФизическимиЛицами) Тогда
			СпособРасчетов = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.СпособРасчетовСФизическимиЛицами)
		Иначе
			СпособРасчетов = "";
		КонецЕсли;
		СоответствиеСтатьяРасходовСпособРасчетов.Вставить(Выборка.Ссылка, СпособРасчетов);
	КонецЦикла;
	СоответствиеСтатьяРасходовСпособРасчетов.Вставить(Справочники.СтатьиРасходовЗарплата.ПустаяСсылка(), "");

	НачисленияВзносы = Новый ТаблицаЗначений;
	НачисленияВзносы.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	НачисленияВзносы.Колонки.Добавить("ВидОперации", Новый ОписаниеТипов("Строка"));
	НачисленияВзносы.Колонки.Добавить("ПодразделениеРегламентированногоУчета", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	НачисленияВзносы.Колонки.Добавить("Подразделение");
	НачисленияВзносы.Колонки.Добавить("СпособОтраженияЗарплатыВФинансовомУчете", Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияЗарплатыВБухУчете"));
	НачисленияВзносы.Колонки.Добавить("ОблагаетсяЕНВД", Новый ОписаниеТипов("Булево"));
	НачисленияВзносы.Колонки.Добавить("СпособРасчетов", Новый ОписаниеТипов("Строка"));
	НачисленияВзносы.Колонки.Добавить("ВидНачисленияОплатыТрудаДляНУ", Новый ОписаниеТипов("Строка"));
	НачисленияВзносы.Колонки.Добавить("ПериодПринятияРасходов", Новый ОписаниеТипов("Дата"));
	НачисленияВзносы.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ПФРДоПредельнойВеличины", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботах", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ПФРНаДоплатуЛетчикам", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ПФРНаДоплатуШахтерам", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ПФРНакопительная", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ПФРПоСуммарномуТарифу", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ПФРСПревышения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ПФРСтраховая", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ТФОМС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ФСС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ФССНесчастныеСлучаи", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленияВзносы.Колонки.Добавить("ФФОМС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));

	Если ЭтоОбменБП3 Тогда
		НачисленияВзносы.Колонки.Добавить("СтатьяФинансирования", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	КонецЕсли;
	Если ИспользоватьФормат1_15 Тогда
		НачисленияВзносы.Колонки.Добавить("ВзносыПоЕдиномуТарифу", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		НачисленияВзносы.Колонки.Добавить("Резерв", 	Новый ОписаниеТипов("СправочникСсылка.Резервы"));
		НачисленияВзносы.Колонки.Добавить("РезервБУ", 	Новый ОписаниеТипов("Булево"));
		НачисленияВзносы.Колонки.Добавить("РезервНУ", 	Новый ОписаниеТипов("Булево"));
	ИначеЕсли ИспользоватьФормат1_11 Тогда
		НачисленияВзносы.Колонки.Добавить("Резерв", Новый ОписаниеТипов("СправочникСсылка.Резервы"));
		НачисленияВзносы.Колонки.Добавить("РезервБУ", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1, 0)));
		НачисленияВзносы.Колонки.Добавить("РезервНУ", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1, 0)));
	КонецЕсли;

	ТаблицаНДФЛ = Новый ТаблицаЗначений;
	ТаблицаНДФЛ.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаНДФЛ.Колонки.Добавить("ВидОперации", Новый ОписаниеТипов("Строка"));
	ТаблицаНДФЛ.Колонки.Добавить("СпособРасчетов", Новый ОписаниеТипов("Строка"));
	ТаблицаНДФЛ.Колонки.Добавить("ОКТМО", Новый ОписаниеТипов("Строка"));
	ТаблицаНДФЛ.Колонки.Добавить("ОКАТО", Новый ОписаниеТипов("Строка"));
	ТаблицаНДФЛ.Колонки.Добавить("КПП", Новый ОписаниеТипов("Строка"));
	ТаблицаНДФЛ.Колонки.Добавить("НалоговыйОрган", Новый ОписаниеТипов("Строка"));
	ТаблицаНДФЛ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаНДФЛ.Колонки.Добавить("РегистрацияВНалоговомОргане", Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
	Если ЭтоОбменБП3 Тогда
		ТаблицаНДФЛ.Колонки.Добавить("СтатьяФинансирования", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	КонецЕсли;
#Вставка
	ТаблицаНДФЛ.Колонки.Добавить("Подразделение");
#КонецВставки

	Удержания = Новый ТаблицаЗначений;
	Удержания.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	Удержания.Колонки.Добавить("ВидОперации", Новый ОписаниеТипов("Строка"));
	Удержания.Колонки.Добавить("СпособРасчетов", Новый ОписаниеТипов("Строка"));
	Удержания.Колонки.Добавить("ПодразделениеРегламентированногоУчета", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	Удержания.Колонки.Добавить("Подразделение");
	Удержания.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Удержания.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Удержания.Колонки.Добавить("ОписаниеУдержанияДляЧека", Новый ОписаниеТипов("Строка"));
	Удержания.Колонки.Добавить("ЯвляетсяОснованиемОформленияКассовогоЧека", Новый ОписаниеТипов("Булево"));
	Если ЭтоОбменБП3 Тогда
		Удержания.Колонки.Добавить("СтатьяФинансирования", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	КонецЕсли;
	Если ИспользоватьФормат1_11 Тогда
		Удержания.Колонки.Добавить("ДокументОснование", Новый ОписаниеТипов("ДокументСсылка.ИсполнительныйЛист"));
	КонецЕсли;

	Если КомпонентыОбмена.ПараметрыКонвертации.ДанныеДляФормированияПроводокОтправлятьСводно Тогда

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);

		ВидыОперацийИсключения = Новый Массив;
		ВидыОперацийИсключения.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам);
		ВидыОперацийИсключения.Добавить(Перечисления.ВидыОперацийПоЗарплате.ДоходыКонтрагентов);
		ВидыОперацийИсключения.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПрочиеРасчетыСПерсоналом);
		Запрос.УстановитьПараметр("ВидыОперацийИсключения", ВидыОперацийИсключения);

		ВидыОперацийИсключенияНДФЛ = Новый Массив;
		ВидыОперацийИсключенияНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛРасчетыСБывшимиСотрудниками);
		ВидыОперацийИсключенияНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛДоходыКонтрагентов);
		ВидыОперацийИсключенияНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛПрочиеРасчетыСПерсоналом);
		Запрос.УстановитьПараметр("ВидыОперацийИсключенияНДФЛ", ВидыОперацийИсключенияНДФЛ);

		ВидыОперацийИсключенияУдержания = Новый Массив;
		ВидыОперацийИсключенияУдержания.Добавить(Перечисления.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты);
		ВидыОперацийИсключенияУдержания.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты);
		ВидыОперацийИсключенияУдержания.Добавить(Перечисления.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм);
		ВидыОперацийИсключенияУдержания.Добавить(Перечисления.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками);
		ВидыОперацийИсключенияУдержания.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВозмещениеУщерба);
		ВидыОперацийИсключенияУдержания.Добавить(Перечисления.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму);
		ВидыОперацийИсключенияУдержания.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПогашениеЗаймов);
		ВидыОперацийИсключенияУдержания.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПроцентыПоЗайму);
		Запрос.УстановитьПараметр("ВидыОперацийИсключенияУдержания", ВидыОперацийИсключенияУдержания);

		Запрос.УстановитьПараметр("СтатьяОплатаТруда", ОтражениеЗарплатыВБухучетеРасширенный.СтатьяОплатаТруда()); 

#Удаление
		Запрос.Текст = 
		"ВЫБРАТЬ
#КонецУдаления
#Вставка
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("Организация", ДанныеИБ.Организация);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОтражениеЗарплатыВБухучетеФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ втДанные
		|ИЗ
		|	Документ.ОтражениеЗарплатыВБухучете.ФизическиеЛица КАК ОтражениеЗарплатыВБухучетеФизическиеЛица
		|ГДЕ
		|	ОтражениеЗарплатыВБухучетеФизическиеЛица.Ссылка = &Ссылка
		|;
		|
		// + СБит 2023-12-27 160677 
		// один запрос вместо двух - поменять индексы при выгрузке из пакета в таблицы
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеДляПодбора.ФизическоеЛицо КАК ФизическоеЛицо, 
		|	МАКСИМУМ(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение) КАК МестоВСтруктуреПредприятия
		|ПОМЕСТИТЬ втАналитика
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(КонецПериода(&ДатаОкончания, День), 
		|			ГоловнаяОрганизация = &Организация И ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					втДанные.ФизическоеЛицо
		|				ИЗ
		|					втДанные)) КАК ДанныеДляПодбора
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних() КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
		|		ПО (ДанныеДляПодбора.ДолжностьПоШтатномуРасписанию = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция) 
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.ФизическоеЛицо
		|; 
		|
		|ВЫБРАТЬ
#КонецВставки
		|	ВЫБОР
		|		КОГДА НачисленнаяЗарплатаИВзносы.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НачисленнаяЗарплатаИВзносы.ВидОперации В (&ВидыОперацийИсключения)
		|						ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|				КОНЕЦ
		|		КОГДА НачисленнаяЗарплатаИВзносы.СтатьяРасходов = &СтатьяОплатаТруда
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|		ИНАЧЕ НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
		|	КОНЕЦ КАК ФизическоеЛицо,
		|	НачисленнаяЗарплатаИВзносы.Подразделение КАК Подразделение,
		|	НачисленнаяЗарплатаИВзносы.ВидОперации КАК ВидОперации,
		|	НачисленнаяЗарплатаИВзносы.СтатьяФинансирования КАК СтатьяФинансирования,
		|	НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
		|	НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов КАК СтатьяРасходов,
		|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
		|	НачисленнаяЗарплатаИВзносы.ПериодПринятияРасходов КАК ПериодПринятияРасходов,
		|	СУММА(НачисленнаяЗарплатаИВзносы.Сумма) КАК Сумма,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ВзносыПоЕдиномуТарифу) КАК ВзносыПоЕдиномуТарифу,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ПФРПоСуммарномуТарифу) КАК ПФРПоСуммарномуТарифу,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ПФРДоПредельнойВеличины) КАК ПФРДоПредельнойВеличины,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ПФРСПревышения) КАК ПФРСПревышения,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ПФРСтраховая) КАК ПФРСтраховая,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ПФРНакопительная) КАК ПФРНакопительная,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ФСС) КАК ФСС,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ФФОМС) КАК ФФОМС,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ТФОМС) КАК ТФОМС,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ПФРНаДоплатуЛетчикам) КАК ПФРНаДоплатуЛетчикам,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ПФРНаДоплатуШахтерам) КАК ПФРНаДоплатуШахтерам,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ФССНесчастныеСлучаи) КАК ФССНесчастныеСлучаи,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ОПСпоМеждународнымДоговорам) КАК ОПСпоМеждународнымДоговорам,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ОПСпоМеждународнымДоговорамСПревышения) КАК ОПСпоМеждународнымДоговорамСПревышения,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ОМСпоМеждународнымДоговорам) КАК ОМСпоМеждународнымДоговорам,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ОМСпоМеждународнымДоговорамСПревышения) КАК ОМСпоМеждународнымДоговорамСПревышения,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ОССпоМеждународнымДоговорам) КАК ОССпоМеждународнымДоговорам,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ОССпоМеждународнымДоговорамСПревышения) КАК ОССпоМеждународнымДоговорамСПревышения,
		|	ВЫБОР
		|		КОГДА НачисленнаяЗарплатаИВзносы.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НачисленнаяЗарплатаИВзносы.ВидОперации В (&ВидыОперацийИсключения)
		|						ТОГДА ФизическиеЛица.Наименование
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		КОГДА НачисленнаяЗарплатаИВзносы.СтатьяРасходов = &СтатьяОплатаТруда
		|			ТОГДА """"
		|		ИНАЧЕ ФизическиеЛица.Наименование
		|	КОНЕЦ КАК ФизическоеЛицоНаименование,
		|	ЕСТЬNULL(ПодразделенияОрганизаций.Наименование, """") КАК ПодразделениеНаименование,
#Удаление
		|	НачисленнаяЗарплатаИВзносы.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
#КонецУдаления
#Вставка
		// + СБит 2023-12-27 160677 
		|	ЕСТЬNULL(втАналитика.МестоВСтруктуреПредприятия, НачисленнаяЗарплатаИВзносы.МестоВСтруктуреПредприятия) КАК МестоВСтруктуреПредприятия,
		// - СБит 2023-12-27
#КонецВставки
		|	НачисленнаяЗарплатаИВзносы.Резерв КАК Резерв,
		|	НачисленнаяЗарплатаИВзносы.РезервБУ КАК РезервБУ,
		|	НачисленнаяЗарплатаИВзносы.РезервНУ КАК РезервНУ
		|ИЗ
		|	Документ.ОтражениеЗарплатыВБухучете.НачисленнаяЗарплатаИВзносы КАК НачисленнаяЗарплатаИВзносы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО НачисленнаяЗарплатаИВзносы.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|		ПО НачисленнаяЗарплатаИВзносы.Подразделение = ПодразделенияОрганизаций.Ссылка
#Вставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ втАналитика КАК втАналитика
		|		ПО (НачисленнаяЗарплатаИВзносы.ФизическоеЛицо = втАналитика.ФизическоеЛицо)
#КонецВставки
		|ГДЕ
		|	НачисленнаяЗарплатаИВзносы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленнаяЗарплатаИВзносы.Подразделение,
		|	НачисленнаяЗарплатаИВзносы.ВидОперации,
		|	НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете,
		|	НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД,
		|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов,
		|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
		|	НачисленнаяЗарплатаИВзносы.ПериодПринятияРасходов,
		|	ВЫБОР
		|		КОГДА НачисленнаяЗарплатаИВзносы.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НачисленнаяЗарплатаИВзносы.ВидОперации В (&ВидыОперацийИсключения)
		|						ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|				КОНЕЦ
		|		КОГДА НачисленнаяЗарплатаИВзносы.СтатьяРасходов = &СтатьяОплатаТруда
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|		ИНАЧЕ НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НачисленнаяЗарплатаИВзносы.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НачисленнаяЗарплатаИВзносы.ВидОперации В (&ВидыОперацийИсключения)
		|						ТОГДА ФизическиеЛица.Наименование
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		КОГДА НачисленнаяЗарплатаИВзносы.СтатьяРасходов = &СтатьяОплатаТруда
		|			ТОГДА """"
		|		ИНАЧЕ ФизическиеЛица.Наименование
		|	КОНЕЦ,
#Удаление
		|	НачисленнаяЗарплатаИВзносы.МестоВСтруктуреПредприятия,
#КонецУдаления
#Вставка
		|	ЕСТЬNULL(втАналитика.МестоВСтруктуреПредприятия, НачисленнаяЗарплатаИВзносы.МестоВСтруктуреПредприятия),
#КонецВставки
		|	ЕСТЬNULL(ПодразделенияОрганизаций.Наименование, """"),
		|	НачисленнаяЗарплатаИВзносы.Резерв,
		|	НачисленнаяЗарплатаИВзносы.РезервБУ,
		|	НачисленнаяЗарплатаИВзносы.РезервНУ,
		|	НачисленнаяЗарплатаИВзносы.СтатьяФинансирования
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицоНаименование,
		|	ПодразделениеНаименование,
		|	ВидОперации,
		|	СтатьяРасходов,
		|	СпособОтраженияЗарплатыВБухучете
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НДФЛ.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НДФЛ.ВидОперации В (&ВидыОперацийИсключенияНДФЛ)
		|						ТОГДА НДФЛ.ФизическоеЛицо
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|				КОНЕЦ
		|		КОГДА НДФЛ.СтатьяРасходов = &СтатьяОплатаТруда
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|		ИНАЧЕ НДФЛ.ФизическоеЛицо
		|	КОНЕЦ КАК ФизическоеЛицо,
		|	НДФЛ.ВидОперации КАК ВидОперации,
		|	НДФЛ.СтатьяФинансирования КАК СтатьяФинансирования,
		|	НДФЛ.СтатьяРасходов КАК СтатьяРасходов,
		|	НДФЛ.КодПоОКАТО КАК КодПоОКАТО,
		|	НДФЛ.КодПоОКТМО КАК КодПоОКТМО,
		|	НДФЛ.КПП КАК КПП,
		|	НДФЛ.КодНалоговогоОргана КАК КодНалоговогоОргана,
		|	СУММА(НДФЛ.Сумма) КАК Сумма,
		|	ВЫБОР
		|		КОГДА НДФЛ.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НДФЛ.ВидОперации В (&ВидыОперацийИсключенияНДФЛ)
		|						ТОГДА ФизическиеЛица.Наименование
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		КОГДА НДФЛ.СтатьяРасходов = &СтатьяОплатаТруда
		|			ТОГДА """"
		|		ИНАЧЕ ФизическиеЛица.Наименование
		|	КОНЕЦ КАК ФизическоеЛицоНаименование
#Вставка
		|	, ЕСТЬNULL(втАналитика.МестоВСтруктуреПредприятия,ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК МестоВСтруктуреПредприятия
#КонецВставки
		|ИЗ
		|	Документ.ОтражениеЗарплатыВБухучете.НачисленныйНДФЛ КАК НДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО НДФЛ.ФизическоеЛицо = ФизическиеЛица.Ссылка
#Вставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ втАналитика КАК втАналитика
		|		ПО (НДФЛ.ФизическоеЛицо = втАналитика.ФизическоеЛицо)
#КонецВставки
		|ГДЕ
		|	НДФЛ.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НДФЛ.СтатьяРасходов,
		|	НДФЛ.КПП,
		|	НДФЛ.ВидОперации,
		|	НДФЛ.КодПоОКАТО,
		|	НДФЛ.КодПоОКТМО,
		|	НДФЛ.КодНалоговогоОргана,
		|	ВЫБОР
		|		КОГДА НДФЛ.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НДФЛ.ВидОперации В (&ВидыОперацийИсключенияНДФЛ)
		|						ТОГДА НДФЛ.ФизическоеЛицо
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|				КОНЕЦ
		|		КОГДА НДФЛ.СтатьяРасходов = &СтатьяОплатаТруда
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|		ИНАЧЕ НДФЛ.ФизическоеЛицо
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НДФЛ.ВидОперации В (&ВидыОперацийИсключенияНДФЛ)
		|						ТОГДА ФизическиеЛица.Наименование
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		КОГДА НДФЛ.СтатьяРасходов = &СтатьяОплатаТруда
		|			ТОГДА """"
		|		ИНАЧЕ ФизическиеЛица.Наименование
		|	КОНЕЦ,
#Вставка
		|	ЕСТЬNULL(втАналитика.МестоВСтруктуреПредприятия,ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)),
#КонецВставки
		|	НДФЛ.СтатьяФинансирования
		|
		|ИМЕЮЩИЕ
		|	СУММА(НДФЛ.Сумма) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицоНаименование,
		|	ВидОперации,
		|	СтатьяРасходов,
		|	КодПоОКТМО,
		|	КПП,
		|	КодНалоговогоОргана
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
#Удаление
		|	ВЫБОР
		|		КОГДА УдержаннаяЗарплата.ВидОперации В (&ВидыОперацийИсключенияУдержания)
		|				ИЛИ УдержаннаяЗарплата.ЯвляетсяОснованиемОформленияКассовогоЧека
		|				ИЛИ УдержаннаяЗарплата.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ИсполнительныйЛист.ПустаяСсылка)
		|			ТОГДА УдержаннаяЗарплата.ФизическоеЛицо
		|		КОГДА УдержаннаяЗарплата.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)
		|				ИЛИ УдержаннаяЗарплата.СтатьяРасходов = &СтатьяОплатаТруда
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|		ИНАЧЕ УдержаннаяЗарплата.ФизическоеЛицо
		|	КОНЕЦ КАК ФизическоеЛицо,
#КонецУдаления
#Вставка
		|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
#КонецВставки
		|	УдержаннаяЗарплата.Подразделение КАК Подразделение,
#Удаление
		|	УдержаннаяЗарплата.ВидОперации КАК ВидОперации,
#КонецУдаления
#Вставка
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПрочиеУдержания) КАК ВидОперации,
#КонецВставки
		|	УдержаннаяЗарплата.СтатьяФинансирования КАК СтатьяФинансирования,
		|	УдержаннаяЗарплата.СтатьяРасходов КАК СтатьяРасходов,
#Удаление
		|	УдержаннаяЗарплата.Контрагент КАК Контрагент,
#КонецУдаления
#Вставка
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
#КонецВставки
		|	СУММА(УдержаннаяЗарплата.Сумма) КАК Сумма,
		|	УдержаннаяЗарплата.ЯвляетсяОснованиемОформленияКассовогоЧека КАК ЯвляетсяОснованиемОформленияКассовогоЧека,
		|	УдержаннаяЗарплата.ОписаниеУдержанияДляЧека КАК ОписаниеУдержанияДляЧека,
#Удаление
		|	ВЫБОР
		|		КОГДА УдержаннаяЗарплата.ВидОперации В (&ВидыОперацийИсключенияУдержания)
		|				ИЛИ УдержаннаяЗарплата.ЯвляетсяОснованиемОформленияКассовогоЧека
		|			ТОГДА ФизическиеЛица.Наименование
		|		КОГДА УдержаннаяЗарплата.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)
		|				ИЛИ УдержаннаяЗарплата.СтатьяРасходов = &СтатьяОплатаТруда
		|			ТОГДА """"
		|		ИНАЧЕ ФизическиеЛица.Наименование
		|	КОНЕЦ КАК ФизическоеЛицоНаименование,
#КонецУдаления
#Вставка
		|	"""" КАК ФизическоеЛицоНаименование,
#КонецВставки
		|	ЕСТЬNULL(ПодразделенияОрганизаций.Наименование, """") КАК ПодразделениеНаименование,
#Удаление
		|	УдержаннаяЗарплата.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
#КонецУдаления
#Вставка
		|	ЕСТЬNULL(втАналитика.МестоВСтруктуреПредприятия, УдержаннаяЗарплата.МестоВСтруктуреПредприятия) КАК МестоВСтруктуреПредприятия,
#КонецВставки
		|	УдержаннаяЗарплата.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.ОтражениеЗарплатыВБухучете.УдержаннаяЗарплата КАК УдержаннаяЗарплата
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО УдержаннаяЗарплата.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|		ПО УдержаннаяЗарплата.Подразделение = ПодразделенияОрганизаций.Ссылка
#Вставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ втАналитика КАК втАналитика
		|		ПО (УдержаннаяЗарплата.ФизическоеЛицо = втАналитика.ФизическоеЛицо)
#КонецВставки
		|ГДЕ
		|	УдержаннаяЗарплата.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	УдержаннаяЗарплата.Подразделение,
#Удаление
		|	УдержаннаяЗарплата.Контрагент,
		|	УдержаннаяЗарплата.ВидОперации,
#КонецУдаления
		|	УдержаннаяЗарплата.СтатьяРасходов,
		|	УдержаннаяЗарплата.ЯвляетсяОснованиемОформленияКассовогоЧека,
		|	УдержаннаяЗарплата.ОписаниеУдержанияДляЧека,
#Удаление
		|	ВЫБОР
		|		КОГДА УдержаннаяЗарплата.ВидОперации В (&ВидыОперацийИсключенияУдержания)
		|				ИЛИ УдержаннаяЗарплата.ЯвляетсяОснованиемОформленияКассовогоЧека
		|			ТОГДА ФизическиеЛица.Наименование
		|		КОГДА УдержаннаяЗарплата.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)
		|				ИЛИ УдержаннаяЗарплата.СтатьяРасходов = &СтатьяОплатаТруда
		|			ТОГДА """"
		|		ИНАЧЕ ФизическиеЛица.Наименование
		|	КОНЕЦ,
		|	УдержаннаяЗарплата.МестоВСтруктуреПредприятия,
#КонецУдаления
#Вставка
		|	ЕСТЬNULL(втАналитика.МестоВСтруктуреПредприятия, УдержаннаяЗарплата.МестоВСтруктуреПредприятия),
#КонецВставки
		|	ЕСТЬNULL(ПодразделенияОрганизаций.Наименование, """"),
		|	УдержаннаяЗарплата.ДокументОснование,
#Удаление
		|	ВЫБОР
		|		КОГДА УдержаннаяЗарплата.ВидОперации В (&ВидыОперацийИсключенияУдержания)
		|				ИЛИ УдержаннаяЗарплата.ЯвляетсяОснованиемОформленияКассовогоЧека
		|				ИЛИ УдержаннаяЗарплата.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ИсполнительныйЛист.ПустаяСсылка)
		|			ТОГДА УдержаннаяЗарплата.ФизическоеЛицо
		|		КОГДА УдержаннаяЗарплата.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)
		|				ИЛИ УдержаннаяЗарплата.СтатьяРасходов = &СтатьяОплатаТруда
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|		ИНАЧЕ УдержаннаяЗарплата.ФизическоеЛицо
		|	КОНЕЦ,
#КонецУдаления
		|	УдержаннаяЗарплата.СтатьяФинансирования
		|
		|ИМЕЮЩИЕ
		|	СУММА(УдержаннаяЗарплата.Сумма) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицоНаименование,
		|	ПодразделениеНаименование,
		|	ВидОперации,
		|	СтатьяРасходов,
		|	ЯвляетсяОснованиемОформленияКассовогоЧека,
		|	ОписаниеУдержанияДляЧека,
		|	Контрагент";

		Результаты = Запрос.ВыполнитьПакет();

#Удаление
		НачисленнаяЗарплатаИВзносы 	= Результаты[0].Выгрузить();
		НачисленныйНДФЛ 			= Результаты[1].Выгрузить();
		УдержаннаяЗарплата 			= Результаты[2].Выгрузить();
#КонецУдаления
#Вставка
		// + СБит 2023-12-27 160677 
		// убрали один запрос в пакете
		НачисленнаяЗарплатаИВзносы 	= Результаты[2].Выгрузить();
		НачисленныйНДФЛ 			= Результаты[3].Выгрузить();
		УдержаннаяЗарплата 			= Результаты[4].Выгрузить();
#КонецВставки

	Иначе

		НачисленнаяЗарплатаИВзносы 	= ДанныеИБ.НачисленнаяЗарплатаИВзносы.Выгрузить();
		НачисленныйНДФЛ 			= ДанныеИБ.НачисленныйНДФЛ.Выгрузить();
		УдержаннаяЗарплата 			= ДанныеИБ.УдержаннаяЗарплата.Выгрузить();

	КонецЕсли;

	ПередаватьВзносыПоЕдиномуТарифу = (Не ИспользоватьФормат1_15 И ДанныеИБ.ПериодРегистрации >= УчетСтраховыхВзносов.ДатаОбъединенияВзносов());
	ПередаватьВзносыПоМеждународнымДоговорам = ДанныеИБ.ПериодРегистрации >= УчетСтраховыхВзносов.ДатаОбъединенияВзносов();
	НачисленияВзносы.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(36)));
	Если ПередаватьВзносыПоЕдиномуТарифу Тогда
		ВзносыПоЕдиномуТарифу = Новый ТаблицаЗначений;
		ВзносыПоЕдиномуТарифу.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(36)));
		ВзносыПоЕдиномуТарифу.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	КонецЕсли;
	Если ПередаватьВзносыПоМеждународнымДоговорам Тогда
		ВзносыПоМеждународнымДоговорам = Новый ТаблицаЗначений;
		ВзносыПоМеждународнымДоговорам.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(36)));
		ВзносыПоМеждународнымДоговорам.Колонки.Добавить("ОПСпоМеждународнымДоговорам", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		ВзносыПоМеждународнымДоговорам.Колонки.Добавить("ОПСпоМеждународнымДоговорамСПревышения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		ВзносыПоМеждународнымДоговорам.Колонки.Добавить("ОМСпоМеждународнымДоговорам", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		ВзносыПоМеждународнымДоговорам.Колонки.Добавить("ОМСпоМеждународнымДоговорамСПревышения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		ВзносыПоМеждународнымДоговорам.Колонки.Добавить("ОССпоМеждународнымДоговорам", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		ВзносыПоМеждународнымДоговорам.Колонки.Добавить("ОССпоМеждународнымДоговорамСПревышения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	КонецЕсли;

	Для каждого СтрокаТЧ Из НачисленнаяЗарплатаИВзносы Цикл

		НоваяСтрока =  НачисленияВзносы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ, , "ВидОперации,Подразделение,ВидНачисленияОплатыТрудаДляНУ");

		НоваяСтрока.ВидОперации 					= XMLСтрока(СтрокаТЧ.ВидОперации);
		НоваяСтрока.СпособРасчетов 					= СоответствиеСтатьяРасходовСпособРасчетов[СтрокаТЧ.СтатьяРасходов];
		НоваяСтрока.ВидНачисленияОплатыТрудаДляНУ 	= XMLСтрока(СтрокаТЧ.ВидНачисленияОплатыТрудаДляНУ);

		НоваяСтрока.ПодразделениеРегламентированногоУчета   = СтрокаТЧ.Подразделение;
		НоваяСтрока.СпособОтраженияЗарплатыВФинансовомУчете = СтрокаТЧ.СпособОтраженияЗарплатыВБухучете;

		НоваяСтрока.Подразделение = МестоВСтруктуреПредприятия(СтрокаТЧ.МестоВСтруктуреПредприятия);

		ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		Если ПередаватьВзносыПоЕдиномуТарифу Или ПередаватьВзносыПоМеждународнымДоговорам Тогда
			НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
		КонецЕсли;
		Если ПередаватьВзносыПоЕдиномуТарифу Тогда
			НоваяСтрокаВзносов = ВзносыПоЕдиномуТарифу.Добавить();
			НоваяСтрокаВзносов.ИдентификаторСтроки = ИдентификаторСтроки;
			НоваяСтрокаВзносов.Сумма = СтрокаТЧ.ВзносыПоЕдиномуТарифу;
		КонецЕсли;
		Если ПередаватьВзносыПоМеждународнымДоговорам Тогда
			НоваяСтрокаВзносов = ВзносыПоМеждународнымДоговорам.Добавить();
			НоваяСтрокаВзносов.ИдентификаторСтроки = ИдентификаторСтроки;
			НоваяСтрокаВзносов.ОПСпоМеждународнымДоговорам = СтрокаТЧ.ОПСпоМеждународнымДоговорам;
			НоваяСтрокаВзносов.ОПСпоМеждународнымДоговорамСПревышения = СтрокаТЧ.ОПСпоМеждународнымДоговорамСПревышения;
			НоваяСтрокаВзносов.ОМСпоМеждународнымДоговорам = СтрокаТЧ.ОМСпоМеждународнымДоговорам;
			НоваяСтрокаВзносов.ОМСпоМеждународнымДоговорамСПревышения = СтрокаТЧ.ОМСпоМеждународнымДоговорамСПревышения;
			НоваяСтрокаВзносов.ОССпоМеждународнымДоговорам = СтрокаТЧ.ОССпоМеждународнымДоговорам;
			НоваяСтрокаВзносов.ОССпоМеждународнымДоговорамСПревышения = СтрокаТЧ.ОССпоМеждународнымДоговорамСПревышения;
		КонецЕсли;

		Если Не ИспользоватьФормат1_15 И ИспользоватьФормат1_11 Тогда
			НоваяСтрока.РезервБУ = ?(СтрокаТЧ.РезервБУ, 1, 0);
			НоваяСтрока.РезервНУ = ?(СтрокаТЧ.РезервНУ, 1, 0);
		КонецЕсли;

	КонецЦикла;

	Если Не ЭтоОбменБП3 Тогда
		ОтражениеЗарплатыВБухучете.ЗаполнитьРегистрациюВНалоговомОрганеВКоллекцииСтрок(ДанныеИБ.Организация, ДанныеИБ.ПериодРегистрации, НачисленныйНДФЛ);
	КонецЕсли;

	Для каждого СтрокаТЧ Из НачисленныйНДФЛ Цикл

		НоваяСтрока =  ТаблицаНДФЛ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ, , "ВидОперации");

		НоваяСтрока.ВидОперации 	= XMLСтрока(СтрокаТЧ.ВидОперации);
		НоваяСтрока.СпособРасчетов 	= СоответствиеСтатьяРасходовСпособРасчетов[СтрокаТЧ.СтатьяРасходов];
		НоваяСтрока.НалоговыйОрган  = СтрокаТЧ.КодНалоговогоОргана;
		НоваяСтрока.ОКАТО = СтрокаТЧ.КодПоОКАТО;
		НоваяСтрока.ОКТМО = СтрокаТЧ.КодПоОКТМО;

#Вставка 
		//++dar 24.03.23
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТЧ, "МестоВСтруктуреПредприятия") Тогда
			НоваяСтрока.Подразделение = МестоВСтруктуреПредприятия(СтрокаТЧ.МестоВСтруктуреПредприятия);
		КонецЕсли;
		//--dar 24.03.23
#КонецВставки
	КонецЦикла;

	Для каждого СтрокаТЧ Из УдержаннаяЗарплата Цикл

		НоваяСтрока =  Удержания.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ, , "ВидОперации,Подразделение");

		НоваяСтрока.ВидОперации 	= XMLСтрока(СтрокаТЧ.ВидОперации);
		НоваяСтрока.СпособРасчетов 	= СоответствиеСтатьяРасходовСпособРасчетов[СтрокаТЧ.СтатьяРасходов];
		НоваяСтрока.ПодразделениеРегламентированногоУчета   = СтрокаТЧ.Подразделение;

		НоваяСтрока.Подразделение = МестоВСтруктуреПредприятия(СтрокаТЧ.МестоВСтруктуреПредприятия);

	КонецЦикла;

	Если ПередаватьВзносыПоЕдиномуТарифу Или ПередаватьВзносыПоМеждународнымДоговорам Тогда
		Если ДанныеXDTO.Свойство("AdditionalInfo") И ТипЗнч(ДанныеXDTO.AdditionalInfo)=Тип("Структура") Тогда
			ДополнительныеДанные = ДанныеXDTO.AdditionalInfo;
		Иначе
			ДополнительныеДанные = Новый Структура;
		КонецЕсли;
		Если ПередаватьВзносыПоЕдиномуТарифу Тогда
			ДополнительныеДанные.Вставить("ВзносыПоЕдиномуТарифу", ВзносыПоЕдиномуТарифу); 
		КонецЕсли;
		Если ПередаватьВзносыПоМеждународнымДоговорам Тогда
			ДополнительныеДанные.Вставить("ВзносыПоМеждународнымДоговорам", ВзносыПоМеждународнымДоговорам); 
		КонецЕсли;
		ДанныеXDTO.Вставить("AdditionalInfo", ДополнительныеДанные);
	КонецЕсли;

	ДанныеXDTO.Вставить("НачисленнаяЗарплатаИВзносы", НачисленияВзносы);
	ДанныеXDTO.Вставить("НачисленныйНДФЛ", ТаблицаНДФЛ);
	ДанныеXDTO.Вставить("УдержаннаяЗарплата", Удержания);
КонецПроцедуры


&ИзменениеИКонтроль("ДобавитьПКО_Документ_ОтражениеЗарплатыВБухучете_Отправка")
Процедура УВМ_ДобавитьПКО_Документ_ОтражениеЗарплатыВБухучете_Отправка(ПравилаКонвертации)
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_ОтражениеЗарплатыВБухучете_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.ОтражениеЗарплатыВБухучете;
	ПравилоКонвертации.ОбъектФормата     = "Документ.ОтражениеЗарплатыВФинансовомУчете";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ОтражениеЗарплатыВБухучете_Отправка_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Дата",              "Дата");
	ДобавитьПКС(СвойстваШапки, "Комментарий",       "Комментарий");
	ДобавитьПКС(СвойстваШапки, "Номер",             "Номер");
	ДобавитьПКС(СвойстваШапки, "Организация",       "Организация", , "Справочник_Организации_Отправка");
	ДобавитьПКС(СвойстваШапки, "Ответственный",     "Ответственный", , "Справочник_Пользователи");
	ДобавитьПКС(СвойстваШапки, "ПериодРегистрации", "ПериодРегистрации");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "НачисленнаяЗарплатаИВзносы", "НачисленнаяЗарплатаИВзносы");
	ДобавитьПКС(СвойстваТЧ, "", "ВзносыПоЕдиномуТарифу", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ВидНачисленияОплатыТрудаДляНУ", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ВидОперации", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ОблагаетсяЕНВД", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПериодПринятияРасходов", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Подразделение", 1, "Справочник_СтруктураПредприятия_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "ПодразделениеРегламентированногоУчета", 1, "Справочник_ПодразделенияОрганизаций_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "ПФРДоПредельнойВеличины", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПФРЗаЗанятыхНаПодземныхИВредныхРаботах", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПФРНаДоплатуЛетчикам", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПФРНаДоплатуШахтерам", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПФРНакопительная", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПФРПоСуммарномуТарифу", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПФРСПревышения", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПФРСтраховая", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Резерв", 1, "Справочник_Резервы");
	ДобавитьПКС(СвойстваТЧ, "", "РезервБУ", 1);
	ДобавитьПКС(СвойстваТЧ, "", "РезервНУ", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СпособОтраженияЗарплатыВФинансовомУчете", 1, "Справочник_СпособыОтраженияЗарплатыВБухУчете");
	ДобавитьПКС(СвойстваТЧ, "", "СпособРасчетов", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СтатьяФинансирования", 1, "Справочник_СтатьиФинансированияЗарплата_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ТФОМС", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ФизическоеЛицо", 1, "Справочник_ФизическиеЛица_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "ФСС", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ФССНесчастныеСлучаи", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ФФОМС", 1);
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "НачисленныйНДФЛ",            "НачисленныйНДФЛ");
	ДобавитьПКС(СвойстваТЧ, "", "ВидОперации", 1);
	ДобавитьПКС(СвойстваТЧ, "", "КПП", 1);
	ДобавитьПКС(СвойстваТЧ, "", "НалоговыйОрган", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ОКАТО", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ОКТМО", 1);
	ДобавитьПКС(СвойстваТЧ, "", "РегистрацияВНалоговомОргане", 1, "Справочник_РегистрацииВНалоговомОргане");
	ДобавитьПКС(СвойстваТЧ, "", "СпособРасчетов", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СтатьяФинансирования", 1, "Справочник_СтатьиФинансированияЗарплата_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ФизическоеЛицо", 1, "Справочник_ФизическиеЛица_Отправка");
	#Вставка
	// для ТЧ НДФЛ выгружаем разбивку по упр. подразделениям для БДР
	ДобавитьПКС(СвойстваТЧ, "", "Подразделение", 1, "Справочник_СтруктураПредприятия_Отправка");
	#КонецВставки
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "УдержаннаяЗарплата",         "УдержаннаяЗарплата");
	ДобавитьПКС(СвойстваТЧ, "", "ВидОперации", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ДокументОснование", 1, "Документ_ИсполнительныйЛист_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "Контрагент", 1, "Справочник_Контрагенты_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "ОписаниеУдержанияДляЧека", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Подразделение", 1, "Справочник_СтруктураПредприятия_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "ПодразделениеРегламентированногоУчета", 1, "Справочник_ПодразделенияОрганизаций_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "СпособРасчетов", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СтатьяФинансирования", 1, "Справочник_СтатьиФинансированияЗарплата_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ФизическоеЛицо", 1, "Справочник_ФизическиеЛица_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "ЯвляетсяОснованиемОформленияКассовогоЧека", 1);

	
КонецПроцедуры

#КонецОбласти
//--dar 24.03.23

Функция ПространствоРасширенияЗУП()
	//++dar 15.01.26 (304514)
	//Возврат "http://v8.1c.ru/edi/edi_stnd/ED_Ext_UVM/1.17";
	Возврат "http://v8.1c.ru/edi/edi_stnd/ED_Ext_UVM/1.20";
	//--dar 15.01.26 (304514)
КонецФункции


