#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

#Область НачальноеЗаполнениеДанных

// См. бит_ОбновлениеИнформационнойБазыБФ.ПередОбновлениемИнформационнойБазы().
//
Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт
	
	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);
	
КонецПроцедуры

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт

	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника РолиИсполнителей.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением.
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	
	Элемент = Элементы.Добавить();
	Элемент.Предопределенный          = Истина;
	Элемент.ИмяПредопределенныхДанных = "Робот";
	Элемент.Наименование			  = НСтр("ru = 'Робот'", КодОсновногоЯзыка);
	Элемент.Аватарка                  = "бит_Робот";
	Элемент.Идентификация             = НСтр("ru='Помощник для обслуживания служебных обработчиков'", КодОсновногоЯзыка);
	Элемент.Инструкции                = НСтр("ru='Точное следование инструкциям'", КодОсновногоЯзыка);
	
КонецПроцедуры

#КонецОбласти

Функция Аватарка(Ассистент) Экспорт
	
	КартинкаАватара = Новый Картинка;
		
	ИсточникДанных = Неопределено;
	Если ТипЗнч(Ассистент) = Тип("СправочникСсылка.бит_АссистентыИИ") Тогда
		Если Ассистент.Пустая() Тогда
			Возврат КартинкаАватара;
		КонецЕсли;
		ИсточникДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ассистент, "Аватарка");
	Иначе
		ИсточникДанных = Ассистент;
	КонецЕсли;
	
	КартинкаАватара = Новый Картинка;
	Если ПустаяСтрока(ИсточникДанных.Аватарка) Тогда
		Возврат КартинкаАватара;
	КонецЕсли;
	
	Попытка
		КартинкаАватара = БиблиотекаКартинок[ИсточникДанных.Аватарка];
	Исключение
		КартинкаАватара = Новый Картинка;
	КонецПопытки;
	
	Возврат КартинкаАватара;
		
КонецФункции

#КонецОбласти

#КонецЕсли