#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	РежимВъездаПоУмолчанию = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("УчетМигрантов", "РежимВъездаИРВРФПоУмолчанию");
	СтатусПоУмолчанию = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("УчетМигрантов", "СтатусИРПоУмолчанию");
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Запись.РежимВъезда) Тогда
			Запись.РежимВъезда = РежимВъездаПоУмолчанию;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Запись.Статус) Тогда
			Запись.Статус = СтатусПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли