#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
// 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Отчет);
	 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИСформироватьОтчет(ПараметрыОтчета)
	
	Отчет.ДатаФормирования = ТекущаяДатаСеанса();
	Отчет.Процесс          = ПараметрыОтчета.Процесс;
	СформироватьОтчет(Отчет.Процесс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПередачаПараметровОтчетуСтатусаПроцесса"
		И Источник = ВладелецФормы Тогда
		ЗаполнитьИСформироватьОтчет(Параметр);
	КонецЕсли;

КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - действие команды "КомандаСформировать".
// 
&НаКлиенте
Процедура КомандаСформировать(Команда)

	СформироватьОтчет(Отчет.Процесс);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет формирование отчета.
// 
&НаСервере
Процедура СформироватьОтчет(Процесс)
	
	Отчет.Процесс = Процесс;
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ВывестиОтчет(Результат);
	
КонецПроцедуры

#КонецОбласти

