
&НаСервере
&ИзменениеИКонтроль("ЗаполнитьОтветственногоПоИностраннымРаботникам")
Процедура УВМ_ЗаполнитьОтветственногоПоИностраннымРаботникам()

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Оформил = бит_ум_УчетМигрантовСервер.ПолучитьОтветственноеЛицо(Объект.Организация, Объект.Дата);
		#Вставка
		// + 20240126 БаринбергГМ (165376)
		Объект.КонтролирующийОрган = УВМ_ОбщегоНазначенияКлиентСервер.ПолучитьКонтролирующийОрган(Объект.Организация, Объект.Дата, Объект.ВыполняемыеДействия.Выгрузить().ВыгрузитьКолонку("Действие"));
		// - 20240126 БаринбергГМ (165376)
		#КонецВставки
	КонецЕсли;

КонецПроцедуры
