
// + БаринбергГМ 20220625 (9837)
// - БаринбергГМ 20220625 (9837)
&ИзменениеИКонтроль("ПолучитьДанныеДляПроведения")
Функция УВМ_ПолучитьДанныеДляПроведения(Ссылка)

#Вставка
Если Ссылка.УВМ_ТипРасчетаВозмещения = Перечисления.УВМ_ТипыРасчетаВозмещенияПоУченическимДоговорам.ПропорциональноФактическиОтработанномуВремени Тогда
	ДвиженияУсловийУченическогоДоговора = Новый ТаблицаЗначений;
	ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("УченическийДоговор", Новый ОписаниеТипов("ДокументСсылка.УченическийДоговор"));
	//ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("ДатаНачалаДоговора", Новый ОписаниеТипов("Дата"));
	//ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("ПериодРаботы", Новый ОписаниеТипов("Дата"));
	ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("ДатаНачалаОбязательств", Новый ОписаниеТипов("Дата"));
	ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("ДатаОкончанияОбязательств", Новый ОписаниеТипов("Дата"));
	ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	
	пСтоимостьМероприятия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка.Мероприятие, "Стоимость");
	пКоличествоДней = (Ссылка.ДатаОкончанияОбязательств - Ссылка.ДатаНачалаОбязательств) / (60 * 60 * 24);
	пКоличествоДнейДоОкончанияОбучения = 0;
	Для индекс = 0 по пКоличествоДней - 1 Цикл
		Движение = ДвиженияУсловийУченическогоДоговора.Добавить();
		Движение.Организация = Ссылка.Организация;
		Движение.ФизическоеЛицо = Ссылка.ФизическоеЛицо;
		Движение.УченическийДоговор = Ссылка;
		Движение.ДатаНачалаОбязательств = Ссылка.ДатаНачалаОбязательств + индекс * 60 * 60 * 24;
		Движение.ДатаОкончанияОбязательств = Движение.ДатаНачалаОбязательств + 60 * 60 * 24;
		Если Движение.ДатаНачалаОбязательств < Ссылка.ДатаОкончанияУчебы Тогда
			Движение.Сумма = пСтоимостьМероприятия;
			пКоличествоДнейДоОкончанияОбучения = пКоличествоДнейДоОкончанияОбучения + 1;
		Иначе
			Движение.Сумма = (пКоличествоДней - индекс) / (пКоличествоДней - пКоличествоДнейДоОкончанияОбучения) * пСтоимостьМероприятия;
		КонецЕсли;
	КонецЦикла;
Иначе
#КонецВставки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УченическийДоговор.Организация,
	|	УченическийДоговор.ФизическоеЛицо,
	|	УченическийДоговор.Ссылка КАК УченическийДоговор,
	|	УченическийДоговор.ДатаНачалаОбязательств КАК ДатаНачалаДоговора,
	|	УченическийДоговорОбязательства.ПериодРаботы КАК ПериодРаботы,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачалаОбязательств,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончанияОбязательств,
	|	УченическийДоговорОбязательства.Сумма
	|ИЗ
	|	Документ.УченическийДоговор.Обязательства КАК УченическийДоговорОбязательства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УченическийДоговор КАК УченическийДоговор
	|		ПО УченическийДоговорОбязательства.Ссылка = УченическийДоговор.Ссылка
	|ГДЕ
	|	УченическийДоговор.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодРаботы";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ДвиженияУсловийУченическогоДоговора = РезультатЗапроса.Выгрузить();

	ПредыдущееДвижение = Неопределено;
	Для каждого Движение Из ДвиженияУсловийУченическогоДоговора Цикл
		Если ПредыдущееДвижение = Неопределено Тогда
			Движение.ДатаНачалаОбязательств = Движение.ДатаНачалаДоговора;
		Иначе
			Движение.ДатаНачалаОбязательств = КонецДня(ПредыдущееДвижение.ДатаОкончанияОбязательств)+1;
		КонецЕсли;
		Движение.ДатаОкончанияОбязательств = НачалоДня(ДобавитьМесяц(Движение.ДатаНачалаДоговора, Движение.ПериодРаботы))-1;
		ПредыдущееДвижение = Движение;
	КонецЦикла;
#Вставка
КонецЕсли;
#КонецВставки

	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("ДвиженияУсловийУченическогоДоговора", ДвиженияУсловийУченическогоДоговора);

	Возврат ДанныеДляПроведения;

КонецФункции
