
// + БаринбергГМ 20220625 (9837)
// - БаринбергГМ 20220625 (9837)
&ИзменениеИКонтроль("ПередЗаписью")
Процедура УВМ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	#Вставка
	Если УВМ_ТипРасчетаВозмещения = Перечисления.УВМ_ТипыРасчетаВозмещенияПоУченическимДоговорам.ПропорциональноФактическиОтработанномуВремени Тогда
		Возврат;
	КонецЕсли;
	#КонецВставки
	Если Обязательства.Количество() = 0 Тогда
		ДатаОкончанияОбязательств = ДатаНачалаОбязательств;
	Иначе
		ПериодРаботы = 0;
		Для Каждого Обязательство Из Обязательства Цикл
			ПериодРаботы = Макс(ПериодРаботы, Обязательство.ПериодРаботы);
		КонецЦикла; 
		ДатаОкончанияОбязательств = ?(ПериодРаботы = 0, '00010101', НачалоДня(ДобавитьМесяц(ДатаНачалаОбязательств, ПериодРаботы)) - 1);
	КонецЕсли;

КонецПроцедуры
