#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета.
//
// Параметры:
//   Настройки - Коллекция - настройки отчетов и вариантов отчетов конфигурации.
//   ОписаниеОтчета - СтрокаДерева
//                  - ОбъектМетаданных - описание настроек, метаданные или ссылка отчета.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.бит_ОСВПоЗаписямТрансляцииИсточник);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОСВПоЗаписямТрансляцииИсточник");
	ОписаниеВарианта.Описание = НСтр("ru = 'ОСВ по записям трансляции. Разворот по Источнику (с детализацией).'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОСВПоЗаписямТрансляцииИсточник");
	ОписаниеВарианта.Описание = НСтр("ru = 'ОСВ по записям трансляции. Разворот по Источнику (без детализации).'");

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли