
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаВыборАватара.Видимость = Ложь;
	ОтробразитьАватар();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АватарАссистентаНажатие(Элемент)
	
	Элементы.ГруппаВыборАватара.Видимость = Истина;
	
	ОтключитьОбработчикОжидания("АватарОжиданиеОтображенияВыбора");
	ПодключитьОбработчикОжидания("АватарОжиданиеОтображенияВыбора",0.1,Истина);
	
	
КонецПроцедуры

&НаКлиенте
Процедура АватарОжиданиеОтображенияВыбора()
	
	Элементы.ГруппаВыборАватара.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборАватара(Элемент)
	
	Модифицированность = Истина;
	
	Если Элемент = Элементы.АватарАссистента1 Тогда
		Объект.Аватарка = "бит_Ассистент1";
	ИначеЕсли Элемент = Элементы.АватарАссистента2 Тогда
		Объект.Аватарка = "бит_Ассистент2";
	ИначеЕсли Элемент = Элементы.АватарАссистента3 Тогда
		Объект.Аватарка = "бит_Ассистент3";
	ИначеЕсли Элемент = Элементы.АватарРобота Тогда
		Объект.Аватарка = "бит_Робот";
	КонецЕсли;
	
	Элементы.ГруппаВыборАватара.Скрыть();
	Элементы.ГруппаВыборАватара.Видимость = Ложь;
	ОтробразитьАватар();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтробразитьАватар()
	
	Элементы.АватарАссистента.Картинка = Справочники.бит_АссистентыИИ.Аватарка(Объект);
	
КонецПроцедуры

#КонецОбласти