
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыСистемы

&НаКлиенте
Процедура ОбъектыСистемыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		УжеВыбран = Ложь;
		Для каждого СтрокаТаблицы  Из Объект.ОбъектыСистемы Цикл
			Если СтрокаТаблицы.ОбъектСистемы = ВыбранноеЗначение Тогда
				УжеВыбран = Истина;
				Прервать;		
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ УжеВыбран Тогда
			НоваяСтрока = Объект.ОбъектыСистемы.Добавить();
			НоваяСтрока.ОбъектСистемы = ВыбранноеЗначение;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.бит_ОбъектыСистемы.ФормаВыбора", ПараметрыФормы, Элементы.ОбъектыСистемы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти