#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму(
		"Обработка.бит_ПанельАдминистрированияБФУП.Форма.ВариантыИНастройкиОтчетов",
		Новый Структура,
		ПараметрыВыполненияКоманды.Источник,
		"Обработка.бит_ПанельАдминистрированияБФУП.Форма.ВариантыИНастройкиОтчетов" + ?(ПараметрыВыполненияКоманды.Окно = Неопределено, ".ОтдельноеОкно", ""),
		ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

#КонецОбласти
