
&ИзменениеИКонтроль("ЗапросВТПредставленияОтработанноеВремя")
Функция УВМ_ЗапросВТПредставленияОтработанноеВремя(ИмяВТНачисленияИУдержания, НачалоПериода, ОкончаниеПериода, ИмяВТОтработанноеВремя)

	Запрос = ЗарплатаКадрыОбщиеНаборыДанныхБазовый.ЗапросВТПредставленияОтработанноеВремя(ИмяВТНачисленияИУдержания, НачалоПериода, ОкончаниеПериода, ИмяВТОтработанноеВремя);
	
	#Удаление
	ТекстЗапросаСКорректировками =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.Период, МЕСЯЦ) КАК МесяцНачисления,
	|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
	|	ОтработанноеВремя.Регистратор КАК Регистратор,
	|	ОтработанноеВремя.Сотрудник КАК Сотрудник,
	|	ОтработанноеВремя.Организация КАК Организация,
	|	ОтработанноеВремя.Подразделение КАК Подразделение,
	|	ОтработанноеВремя.Начисление КАК ВидРасчета,
	|	ОтработанноеВремя.ДокументОснование КАК ДокументОснование,
	|	ОтработанноеВремя.ДатаНачала КАК ДатаНачала,
	|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
	|	ОтработанноеВремя.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ОтработанноеВремя.ОтработаноДней КАК ОтработаноДней,
	|	ОтработанноеВремя.ОтработаноЧасов КАК ОтработаноЧасов,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
	|			ТОГДА ОтработанноеВремя.ОтработаноДней
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработаноДнейВПериоде,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
	|			ТОГДА ОтработанноеВремя.ОтработаноЧасов
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработаноЧасовВПериоде,
	|	ОтработанноеВремя.ОплаченоДней КАК ОплаченоДней,
	|	ОтработанноеВремя.ОплаченоЧасов КАК ОплаченоЧасов
	|ПОМЕСТИТЬ ВТПериодыОтработанноеВремяСКорректировками
	|ИЗ
	|	РегистрНакопления.ОтработанноеВремяПоСотрудникам КАК ОтработанноеВремя
	|ГДЕ
	|	ОтработанноеВремя.Период МЕЖДУ &ОтработанноеВремяПараметрНачалоПериода И &ОтработанноеВремяПараметрОкончаниеПериода
	|{ГДЕ
	|	ОтработанноеВремя.Сотрудник.*,
	|	ОтработанноеВремя.ФизическоеЛицо.*,
	|	ОтработанноеВремя.Организация.*,
	|	ОтработанноеВремя.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.Период, МЕСЯЦ),
	|	ОтработанноеВремя.ПериодДействия,
	|	ОтработанноеВремя.Регистратор,
	|	ОтработанноеВремя.Сотрудник,
	|	ОтработанноеВремя.Организация,
	|	ОтработанноеВремя.Подразделение,
	|	ОтработанноеВремя.Начисление,
	|	ОтработанноеВремя.ДокументОснование,
	|	ОтработанноеВремя.ДатаНачала,
	|	ОтработанноеВремя.ВремяВЧасах,
	|	ОтработанноеВремя.ИдентификаторСтроки,
	|	ОтработанноеВремя.ОтработаноДней,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
	|			ТОГДА ОтработанноеВремя.ОтработаноДней
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	NULL,
	|	ОтработанноеВремя.ОплаченоДней,
	|	NULL
	|ИЗ
	|	РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка КАК ОтработанноеВремя
	|ГДЕ
	|	ОтработанноеВремя.Период МЕЖДУ &ОтработанноеВремяПараметрНачалоПериода И &ОтработанноеВремяПараметрОкончаниеПериода
	|{ГДЕ
	|	ОтработанноеВремя.Сотрудник.*,
	|	ОтработанноеВремя.ФизическоеЛицо.*,
	|	ОтработанноеВремя.Организация.*,
	|	ОтработанноеВремя.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.ПериодДействия, МЕСЯЦ),
	|	ОтработанноеВремя.ПериодДействия,
	|	ОтработанноеВремя.Регистратор,
	|	ОтработанноеВремя.Сотрудник,
	|	ОтработанноеВремя.Организация,
	|	ОтработанноеВремя.Подразделение,
	|	ОтработанноеВремя.Начисление,
	|	ОтработанноеВремя.ДокументОснование,
	|	ОтработанноеВремя.ДатаНачала,
	|	ОтработанноеВремя.ВремяВЧасах,
	|	ОтработанноеВремя.ИдентификаторСтроки,
	|	0,
	|	0,
	|	ОтработанноеВремя.ОтработаноДней,
	|	ОтработанноеВремя.ОтработаноЧасов,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ОтработанноеВремяПоСотрудникам КАК ОтработанноеВремя
	|ГДЕ
	|	ОтработанноеВремя.ПериодДействия МЕЖДУ &ОтработанноеВремяПараметрНачалоПериода И &ОтработанноеВремяПараметрОкончаниеПериода
	|	И ОтработанноеВремя.Период <> ОтработанноеВремя.ПериодДействия
	|{ГДЕ
	|	ОтработанноеВремя.Сотрудник.*,
	|	ОтработанноеВремя.ФизическоеЛицо.*,
	|	ОтработанноеВремя.Организация.*,
	|	ОтработанноеВремя.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.ПериодДействия, МЕСЯЦ),
	|	ОтработанноеВремя.ПериодДействия,
	|	ОтработанноеВремя.Регистратор,
	|	ОтработанноеВремя.Сотрудник,
	|	ОтработанноеВремя.Организация,
	|	ОтработанноеВремя.Подразделение,
	|	ОтработанноеВремя.Начисление,
	|	ОтработанноеВремя.ДокументОснование,
	|	ОтработанноеВремя.ДатаНачала,
	|	ОтработанноеВремя.ВремяВЧасах,
	|	ОтработанноеВремя.ИдентификаторСтроки,
	|	0,
	|	0,
	|	ОтработанноеВремя.ОтработаноДней,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка КАК ОтработанноеВремя
	|ГДЕ
	|	ОтработанноеВремя.ПериодДействия МЕЖДУ &ОтработанноеВремяПараметрНачалоПериода И &ОтработанноеВремяПараметрОкончаниеПериода
	|	И ОтработанноеВремя.Период <> ОтработанноеВремя.ПериодДействия
	|{ГДЕ
	|	ОтработанноеВремя.Сотрудник.*,
	|	ОтработанноеВремя.ФизическоеЛицо.*,
	|	ОтработанноеВремя.Организация.*,
	|	ОтработанноеВремя.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтработанноеВремяВПериодахСКорректировками.МесяцНачисления КАК МесяцНачисления,
	|	ОтработанноеВремяВПериодахСКорректировками.ПериодДействия КАК ПериодДействия,
	|	ОтработанноеВремяВПериодахСКорректировками.Регистратор КАК Регистратор,
	|	ОтработанноеВремяВПериодахСКорректировками.Сотрудник КАК Сотрудник,
	|	ОтработанноеВремяВПериодахСКорректировками.Организация КАК Организация,
	|	ОтработанноеВремяВПериодахСКорректировками.Подразделение КАК Подразделение,
	|	ОтработанноеВремяВПериодахСКорректировками.ВидРасчета КАК ВидРасчета,
	|	ОтработанноеВремяВПериодахСКорректировками.ДокументОснование КАК ДокументОснование,
	|	ОтработанноеВремяВПериодахСКорректировками.ДатаНачала КАК ДатаНачала,
	|	ОтработанноеВремяВПериодахСКорректировками.ВремяВЧасах КАК ВремяВЧасах,
	|	ОтработанноеВремяВПериодахСКорректировками.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОтработаноДней) КАК ОтработаноДней,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОтработаноЧасов) КАК ОтработаноЧасов,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОтработаноДнейВПериоде) КАК ОтработаноДнейВПериоде,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОтработаноЧасовВПериоде) КАК ОтработаноЧасовВПериоде,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОплаченоДней) КАК ОплаченоДней,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОплаченоЧасов) КАК ОплаченоЧасов
	|ПОМЕСТИТЬ ВТПериодыОтработанноеВремя
	|ИЗ
	|	ВТПериодыОтработанноеВремяСКорректировками КАК ОтработанноеВремяВПериодахСКорректировками
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтработанноеВремяВПериодахСКорректировками.МесяцНачисления,
	|	ОтработанноеВремяВПериодахСКорректировками.ПериодДействия,
	|	ОтработанноеВремяВПериодахСКорректировками.Регистратор,
	|	ОтработанноеВремяВПериодахСКорректировками.Сотрудник,
	|	ОтработанноеВремяВПериодахСКорректировками.Подразделение,
	|	ОтработанноеВремяВПериодахСКорректировками.ВидРасчета,
	|	ОтработанноеВремяВПериодахСКорректировками.ДокументОснование,
	|	ОтработанноеВремяВПериодахСКорректировками.ДатаНачала,
	|	ОтработанноеВремяВПериодахСКорректировками.ВремяВЧасах,
	|	ОтработанноеВремяВПериодахСКорректировками.ИдентификаторСтроки,
	|	ОтработанноеВремяВПериодахСКорректировками.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПериодыОтработанноеВремяСКорректировками";
	#КонецУдаления
	#Вставка
	//++dar 25.01.24 (164660)
	ТекстЗапросаСКорректировками =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.Период, МЕСЯЦ) КАК МесяцНачисления,
	|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
	|	ОтработанноеВремя.Регистратор КАК Регистратор,
	|	ОтработанноеВремя.Сотрудник КАК Сотрудник,
	|	ОтработанноеВремя.Организация КАК Организация,
	|	ОтработанноеВремя.Подразделение КАК Подразделение,
	|	ОтработанноеВремя.Начисление КАК ВидРасчета,
	|	ОтработанноеВремя.ДокументОснование КАК ДокументОснование,
	|	ОтработанноеВремя.ДатаНачала КАК ДатаНачала,
	|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
	|	ОтработанноеВремя.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ОтработанноеВремя.ОтработаноДней КАК ОтработаноДней,
	|	ОтработанноеВремя.ОтработаноЧасов КАК ОтработаноЧасов,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
	|			ТОГДА ОтработанноеВремя.ОтработаноДней
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработаноДнейВПериоде,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
	|			ТОГДА ОтработанноеВремя.ОтработаноЧасов
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработаноЧасовВПериоде,
	|	ОтработанноеВремя.ОплаченоДней КАК ОплаченоДней,
	|	ОтработанноеВремя.ОплаченоЧасов КАК ОплаченоЧасов,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
	|				И ОтработанноеВремя.Регистратор ССЫЛКА Документ.БольничныйЛист
	|				И ОтработанноеВремя.Регистратор = ОтработанноеВремя.ДокументОснование
	|			ТОГДА ОтработанноеВремя.ОтработаноДней
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РабочиеДниБольничный,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
	|				И ОтработанноеВремя.Регистратор ССЫЛКА Документ.Командировка
	|				И ОтработанноеВремя.Регистратор = ОтработанноеВремя.ДокументОснование
	|			ТОГДА ОтработанноеВремя.ОтработаноДней
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РабочиеДниКомандировка,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
	|				И ОтработанноеВремя.Регистратор ССЫЛКА Документ.Отпуск
	|				И ОтработанноеВремя.Регистратор = ОтработанноеВремя.ДокументОснование
	|			ТОГДА ОтработанноеВремя.ОтработаноЧасов / 8
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РабочиеДниОтпуск,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
	|				И (ОтработанноеВремя.Регистратор ССЫЛКА Документ.ОтпускБезСохраненияОплаты
	|					ИЛИ ОтработанноеВремя.Регистратор ССЫЛКА Документ.ОтпускБезСохраненияОплатыСписком)
	|			ТОГДА ОтработанноеВремя.ОтработаноДней
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РабочиеДниОтпускБезСохранения,
// + СБит 2025-11-13 #УВМ 290661 
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
	|				И ОтработанноеВремя.Регистратор ССЫЛКА Документ.ПрогулНеявка
	|			ТОГДА ОтработанноеВремя.ОтработаноЧасов / 8
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РабочиеДниОтсутствие,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Регистратор ССЫЛКА Документ.ПрогулНеявка
	|			ТОГДА ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала) * 6)) / 6 + 1, 1) + ""-"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания) * 6)) / 6 + 1, 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПериодОтсутствие,
// - СБит 2025-11-13 #УВМ
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Регистратор ССЫЛКА Документ.БольничныйЛист
	|			ТОГДА ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала) * 6)) / 6 + 1, 1) + ""-"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания) * 6)) / 6 + 1, 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПериодБольничный,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Регистратор ССЫЛКА Документ.Командировка
	|			ТОГДА ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала) * 6)) / 6 + 1, 1) + ""-"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания) * 6)) / 6 + 1, 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПериодКомандировка,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Регистратор ССЫЛКА Документ.Отпуск
	|			ТОГДА ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска) * 6)) / 6 + 1, 1) + ""-"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска) * 6)) / 6 + 1, 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПериодОтпуск,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Регистратор ССЫЛКА Документ.ОтпускБезСохраненияОплаты
	|			ТОГДА ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала) * 6)) / 6 + 1, 1) + ""-"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания) * 6)) / 6 + 1, 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПериодОтпускБезСохранения
	|ПОМЕСТИТЬ ВТПериодыОтработанноеВремяСКорректировками
	|ИЗ
	|	РегистрНакопления.ОтработанноеВремяПоСотрудникам КАК ОтработанноеВремя
	|ГДЕ
	|	ОтработанноеВремя.Период МЕЖДУ &ОтработанноеВремяПараметрНачалоПериода И &ОтработанноеВремяПараметрОкончаниеПериода
	|{ГДЕ
	|	ОтработанноеВремя.Сотрудник.*,
	|	ОтработанноеВремя.ФизическоеЛицо.*,
	|	ОтработанноеВремя.Организация.*,
	|	ОтработанноеВремя.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.Период, МЕСЯЦ),
	|	ОтработанноеВремя.ПериодДействия,
	|	ОтработанноеВремя.Регистратор,
	|	ОтработанноеВремя.Сотрудник,
	|	ОтработанноеВремя.Организация,
	|	ОтработанноеВремя.Подразделение,
	|	ОтработанноеВремя.Начисление,
	|	ОтработанноеВремя.ДокументОснование,
	|	ОтработанноеВремя.ДатаНачала,
	|	ОтработанноеВремя.ВремяВЧасах,
	|	ОтработанноеВремя.ИдентификаторСтроки,
	|	ОтработанноеВремя.ОтработаноДней,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
	|			ТОГДА ОтработанноеВремя.ОтработаноДней
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	NULL,
	|	ОтработанноеВремя.ОплаченоДней,
	|	NULL,
	|	0,
	|	0,
	|	0,
	|	0,
// + СБит 2025-11-13 #УВМ 290661 
	|	0,
	|	"""",
// - СБит 2025-11-13 #УВМ
	|	"""",
	|	"""",
	|	"""",
	|	""""
	|ИЗ
	|	РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка КАК ОтработанноеВремя
	|ГДЕ
	|	ОтработанноеВремя.Период МЕЖДУ &ОтработанноеВремяПараметрНачалоПериода И &ОтработанноеВремяПараметрОкончаниеПериода
	|{ГДЕ
	|	ОтработанноеВремя.Сотрудник.*,
	|	ОтработанноеВремя.ФизическоеЛицо.*,
	|	ОтработанноеВремя.Организация.*,
	|	ОтработанноеВремя.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.ПериодДействия, МЕСЯЦ),
	|	ОтработанноеВремя.ПериодДействия,
	|	ОтработанноеВремя.Регистратор,
	|	ОтработанноеВремя.Сотрудник,
	|	ОтработанноеВремя.Организация,
	|	ОтработанноеВремя.Подразделение,
	|	ОтработанноеВремя.Начисление,
	|	ОтработанноеВремя.ДокументОснование,
	|	ОтработанноеВремя.ДатаНачала,
	|	ОтработанноеВремя.ВремяВЧасах,
	|	ОтработанноеВремя.ИдентификаторСтроки,
	|	0,
	|	0,
	|	ОтработанноеВремя.ОтработаноДней,
	|	ОтработанноеВремя.ОтработаноЧасов,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
	|				И ОтработанноеВремя.Регистратор ССЫЛКА Документ.БольничныйЛист
	|				И ОтработанноеВремя.Регистратор = ОтработанноеВремя.ДокументОснование
	|			ТОГДА ОтработанноеВремя.ОтработаноДней
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
	|				И ОтработанноеВремя.Регистратор ССЫЛКА Документ.Командировка
	|				И ОтработанноеВремя.Регистратор = ОтработанноеВремя.ДокументОснование
	|			ТОГДА ОтработанноеВремя.ОтработаноДней
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
	|				И ОтработанноеВремя.Регистратор ССЫЛКА Документ.Отпуск
	|				И ОтработанноеВремя.Регистратор = ОтработанноеВремя.ДокументОснование
	|			ТОГДА ОтработанноеВремя.ОтработаноЧасов / 8
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
	|				И (ОтработанноеВремя.Регистратор ССЫЛКА Документ.ОтпускБезСохраненияОплаты
	|					ИЛИ ОтработанноеВремя.Регистратор ССЫЛКА Документ.ОтпускБезСохраненияОплатыСписком)
	|			ТОГДА ОтработанноеВремя.ОтработаноДней
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	// + СБит 2025-11-13 #УВМ 290661 
	|	ВЫБОР
	|		КОГДА 
	//|				ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия И
	|				ОтработанноеВремя.Регистратор ССЫЛКА Документ.ПрогулНеявка
	|			ТОГДА ОтработанноеВремя.ОтработаноДней
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Регистратор ССЫЛКА Документ.ПрогулНеявка
	|			ТОГДА ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаНачала) * 6)) / 6 + 1, 1) + ""-"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ПрогулНеявка).ДатаОкончания) * 6)) / 6 + 1, 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	// - СБит 2025-11-13 #УВМ
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Регистратор ССЫЛКА Документ.БольничныйЛист
	|			ТОГДА ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаНачала) * 6)) / 6 + 1, 1) + ""-"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.БольничныйЛист).ДатаОкончания) * 6)) / 6 + 1, 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Регистратор ССЫЛКА Документ.Командировка
	|			ТОГДА ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаНачала) * 6)) / 6 + 1, 1) + ""-"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Командировка).ДатаОкончания) * 6)) / 6 + 1, 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Регистратор ССЫЛКА Документ.Отпуск
	|			ТОГДА ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаНачалаОсновногоОтпуска) * 6)) / 6 + 1, 1) + ""-"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.Отпуск).ДатаОкончанияОсновногоОтпуска) * 6)) / 6 + 1, 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОтработанноеВремя.Регистратор ССЫЛКА Документ.ОтпускБезСохраненияОплаты
	|			ТОГДА ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаНачала) * 6)) / 6 + 1, 1) + ""-"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВЫРАЗИТЬ(ОтработанноеВремя.Регистратор КАК Документ.ОтпускБезСохраненияОплаты).ДатаОкончания) * 6)) / 6 + 1, 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.ОтработанноеВремяПоСотрудникам КАК ОтработанноеВремя
	|ГДЕ
	|	ОтработанноеВремя.ПериодДействия МЕЖДУ &ОтработанноеВремяПараметрНачалоПериода И &ОтработанноеВремяПараметрОкончаниеПериода
	|	И ОтработанноеВремя.Период <> ОтработанноеВремя.ПериодДействия
	|{ГДЕ
	|	ОтработанноеВремя.Сотрудник.*,
	|	ОтработанноеВремя.ФизическоеЛицо.*,
	|	ОтработанноеВремя.Организация.*,
	|	ОтработанноеВремя.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.ПериодДействия, МЕСЯЦ),
	|	ОтработанноеВремя.ПериодДействия,
	|	ОтработанноеВремя.Регистратор,
	|	ОтработанноеВремя.Сотрудник,
	|	ОтработанноеВремя.Организация,
	|	ОтработанноеВремя.Подразделение,
	|	ОтработанноеВремя.Начисление,
	|	ОтработанноеВремя.ДокументОснование,
	|	ОтработанноеВремя.ДатаНачала,
	|	ОтработанноеВремя.ВремяВЧасах,
	|	ОтработанноеВремя.ИдентификаторСтроки,
	|	0,
	|	0,
	|	ОтработанноеВремя.ОтработаноДней,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// + СБит 2025-11-13 #УВМ 290661
	|	0,
	|	"""",
	// - СБит 2025-11-13 #УВМ
	|	"""",
	|	"""",
	|	"""",
	|	""""
	|ИЗ
	|	РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка КАК ОтработанноеВремя
	|ГДЕ
	|	ОтработанноеВремя.ПериодДействия МЕЖДУ &ОтработанноеВремяПараметрНачалоПериода И &ОтработанноеВремяПараметрОкончаниеПериода
	|	И ОтработанноеВремя.Период <> ОтработанноеВремя.ПериодДействия
	|{ГДЕ
	|	ОтработанноеВремя.Сотрудник.*,
	|	ОтработанноеВремя.ФизическоеЛицо.*,
	|	ОтработанноеВремя.Организация.*,
	|	ОтработанноеВремя.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтработанноеВремяВПериодахСКорректировками.МесяцНачисления КАК МесяцНачисления,
	|	ОтработанноеВремяВПериодахСКорректировками.ПериодДействия КАК ПериодДействия,
	|	ОтработанноеВремяВПериодахСКорректировками.Регистратор КАК Регистратор,
	|	ОтработанноеВремяВПериодахСКорректировками.Сотрудник КАК Сотрудник,
	|	ОтработанноеВремяВПериодахСКорректировками.Организация КАК Организация,
	|	ОтработанноеВремяВПериодахСКорректировками.Подразделение КАК Подразделение,
	|	ОтработанноеВремяВПериодахСКорректировками.ВидРасчета КАК ВидРасчета,
	|	ОтработанноеВремяВПериодахСКорректировками.ДокументОснование КАК ДокументОснование,
	|	ОтработанноеВремяВПериодахСКорректировками.ДатаНачала КАК ДатаНачала,
	|	ОтработанноеВремяВПериодахСКорректировками.ВремяВЧасах КАК ВремяВЧасах,
	|	ОтработанноеВремяВПериодахСКорректировками.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОтработаноДней) КАК ОтработаноДней,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОтработаноЧасов) КАК ОтработаноЧасов,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОтработаноДнейВПериоде) КАК ОтработаноДнейВПериоде,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОтработаноЧасовВПериоде) КАК ОтработаноЧасовВПериоде,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОплаченоДней) КАК ОплаченоДней,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОплаченоЧасов) КАК ОплаченоЧасов,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.РабочиеДниБольничный) КАК РабочиеДниБольничный,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.РабочиеДниКомандировка) КАК РабочиеДниКомандировка,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.РабочиеДниОтпуск) КАК РабочиеДниОтпуск,
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.РабочиеДниОтпускБезСохранения) КАК РабочиеДниОтпускБезСохранения,
	// + СБит 2025-11-13 #УВМ 290661
	|	СУММА(ОтработанноеВремяВПериодахСКорректировками.РабочиеДниОтсутствие) КАК РабочиеДниОтсутствие,
	|	МАКСИМУМ(ОтработанноеВремяВПериодахСКорректировками.ПериодОтсутствие) КАК ПериодОтсутствие,
	// - СБит 2025-11-13 #УВМ
	|	МАКСИМУМ(ОтработанноеВремяВПериодахСКорректировками.ПериодБольничный) КАК ПериодБольничный,
	|	МАКСИМУМ(ОтработанноеВремяВПериодахСКорректировками.ПериодКомандировка) КАК ПериодКомандировка,
	|	МАКСИМУМ(ОтработанноеВремяВПериодахСКорректировками.ПериодОтпуск) КАК ПериодОтпуск,
	|	МАКСИМУМ(ОтработанноеВремяВПериодахСКорректировками.ПериодОтпускБезСохранения) КАК ПериодОтпускБезСохранения
	|ПОМЕСТИТЬ ВТПериодыОтработанноеВремя
	|ИЗ
	|	ВТПериодыОтработанноеВремяСКорректировками КАК ОтработанноеВремяВПериодахСКорректировками
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтработанноеВремяВПериодахСКорректировками.МесяцНачисления,
	|	ОтработанноеВремяВПериодахСКорректировками.ПериодДействия,
	|	ОтработанноеВремяВПериодахСКорректировками.Регистратор,
	|	ОтработанноеВремяВПериодахСКорректировками.Сотрудник,
	|	ОтработанноеВремяВПериодахСКорректировками.Подразделение,
	|	ОтработанноеВремяВПериодахСКорректировками.ВидРасчета,
	|	ОтработанноеВремяВПериодахСКорректировками.ДокументОснование,
	|	ОтработанноеВремяВПериодахСКорректировками.ДатаНачала,
	|	ОтработанноеВремяВПериодахСКорректировками.ВремяВЧасах,
	|	ОтработанноеВремяВПериодахСКорректировками.ИдентификаторСтроки,
	|	ОтработанноеВремяВПериодахСКорректировками.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПериодыОтработанноеВремяСКорректировками";	
	//--dar 25.01.24 (164660)
	#КонецВставки

	Если ТипЗнч(НачалоПериода) = Тип("Строка") Тогда
		ТекстЗапросаСКорректировками = СтрЗаменить(ТекстЗапросаСКорректировками, "&ОтработанноеВремяПараметрНачалоПериода", НачалоПериода);
	КонецЕсли;

	Если ТипЗнч(ОкончаниеПериода) = Тип("Строка") Тогда
		ТекстЗапросаСКорректировками = СтрЗаменить(ТекстЗапросаСКорректировками, "&ОтработанноеВремяПараметрОкончаниеПериода", ОкончаниеПериода);
	КонецЕсли;

	Если Не ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьЗапросСозданияВременнойТаблицы(Запрос.Текст, "ВТПериодыОтработанноеВремя", ТекстЗапросаСКорректировками) Тогда
		ВызватьИсключение НСтр("ru='Неправильный текст запроса к отработанному времени'");
	КонецЕсли;

	Возврат Запрос;

КонецФункции
