#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мНастройкиИзмерений Экспорт; // Хранит настройки дополнительных измерений.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СписокПараметровНаФорме = Новый СписокЗначений;
	
	СписокПараметровНаФорме.Добавить("Период");
	СписокПараметровНаФорме.Добавить("Бюджет");
	СписокПараметровНаФорме.Добавить("Сценарий");
	СписокПараметровНаФорме.Добавить("СценарийЭталон");
	СписокПараметровНаФорме.Добавить("Периодичность");
	СписокПараметровНаФорме.Добавить("ОтображатьПустыеСтроки");
    СписокПараметровНаФорме.Добавить("ОтображатьПериодыБезОборотов");
	
	Для каждого ЭлементСписка Из СписокПараметровНаФорме Цикл
		
		ИмяПараметра = ЭлементСписка.Значение;
		бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек, 
																 ЭтотОбъект[ИмяПараметра], 
																 ИмяПараметра);
		
	КонецЦикла; 
															 
	Если ЗначениеЗаполнено(Сценарий) Тогда
		ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВалютаСценария"));
        ЗначениеПараметра.Значение = Сценарий.Валюта;
        Если Не ЗначениеПараметра.Использование Тогда
            ЗначениеПараметра.Использование = Истина;
		КонецЕсли; 
	КонецЕсли;
	Если ЗначениеЗаполнено(СценарийЭталон) Тогда
		ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВалютаСценарияЭталон"));
        ЗначениеПараметра.Значение = СценарийЭталон.Валюта;
        Если Не ЗначениеПараметра.Использование Тогда
            ЗначениеПараметра.Использование = Истина;
        КонецЕсли;
	КонецЕсли;  	
	
	// ++ЕРП
	ТекущиеНастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	Для каждого СтруктураПолей Из ТекущиеНастройкиОтчета.Структура Цикл
		Если ТипЗнч(СтруктураПолей) = Тип("ТаблицаКомпоновкиДанных") Тогда
			ЗначениеСравнения = "";
			Если СтрСравнить(СтруктураПолей.Имя, "НачальныеОстатки") = 0 Тогда
			    ЗначениеСравнения = "НачальныеОстатки";
			ИначеЕсли СтрСравнить(СтруктураПолей.Имя, "Обороты") = 0 Тогда
				ЗначениеСравнения = "Обороты";
			ИначеЕсли СтрСравнить(СтруктураПолей.Имя, "КонечныеОстатки") = 0 Тогда
				ЗначениеСравнения = "КонечныеОстатки";
			КонецЕсли;
			
			ДополнитьОтборГруппировокОтчета(СтруктураПолей.Колонки, ЗначениеСравнения);
		КонецЕсли; 
	КонецЦикла;
	// --ЕРП
	
    Для каждого Набор Из СхемаКомпоновкиДанных.НаборыДанных Цикл
		бит_ОтчетыСервер.УстановитьЗаголовкиПолейСумма(Набор.Поля, Строка(ЭтотОбъект.СценарийЭталон), Строка(ЭтотОбъект.Сценарий));
	КонецЦикла;
	
КонецПроцедуры // ПриКомпоновкеРезультата()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьОтборГруппировокОтчета(Элементы, ЗначениеСравнения)
	
	Для каждого ЭлементГруппировки Из Элементы Цикл
		ЭлементГруппировки.Отбор.Элементы.Очистить();
        ЭлементОтбора = ЭлементГруппировки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ВидДвижения")).Поле;
        ЭлементОтбора.ПравоеЗначение = ЗначениеСравнения;
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;		
		ДополнитьОтборГруппировокОтчета(ЭлементГруппировки.Структура, ЗначениеСравнения);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Инициализация

мНастройкиИзмерений = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();

бит_МеханизмДопИзмерений.НастроитьПоляДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, "НаборДанных1");
					
// Изменение синонима поля аналитики "Организация" на "Организация_Аналитика".
Поля = СхемаКомпоновкиДанных.НаборыДанных["НаборДанных1"].Поля;
	
Для Каждого Поле Из Поля Цикл		
	Если Поле.Заголовок = "Организация" Тогда
		Поле.Заголовок = Поле.Заголовок + "_Аналитика";
		Прервать
	КонецЕсли;		
КонецЦикла;

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли