
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		Запись.Организация = Параметры.Организация;
		КодБКНДС = Параметры.КодБКНДС;
		Если ЗначениеЗаполнено(Параметры.КодыБК) Тогда
			ТаблицаКБК = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(Параметры.КодыБК);
			КодыБК.Загрузить(ТаблицаКБК);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КодБКНДС) Тогда
		СтатьиДоходовБюджетаРФ = ЕдиныйНалоговыйСчет.КБКПоВидамНалогов(ТекущаяДатаСеанса());
		КодБКНДСВидНалога = СтатьиДоходовБюджетаРФ.Получить(Справочники.ВидыНалоговВзносов.НДС_ВвозимыеТовары);
		КодБКНДС = РегистрыСведений.ДокументыОПредстоящейПоставке.УточнитьКБК(КодБКНДСВидНалога.Получить(0));
		
		КодыБК.Загрузить(РегистрыСведений.ДокументыОПредстоящейПоставке.ПолучитьКодыБК(КодБКНДС));
	КонецЕсли;
	
	УстановитьВидимость(Элементы.ДатаСобытия, Запись.Состояние);
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Запись.Состояние) И Не ЗначениеЗаполнено(Запись.ДатаСобытия) Тогда
	
		ОчиститьСообщения();
		Если Запись.Состояние = ПредопределенноеЗначение("Перечисление.СостояниеДОПП.ПоставкаОтменена") Тогда
			ТекстСообщения = НСтр("ru = 'Поле ""Дата отмены поставки"" не заполнено';
									|en = 'Поле ""Дата отмены поставки"" не заполнено'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Поле ""Дата принятия к учету"" не заполнено';
									|en = 'Поле ""Дата принятия к учету"" не заполнено'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Состояние) Тогда
		Запись.ДатаСобытия = Дата(1,1,1);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КБКНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",          НСтр("ru = 'Выбор КБК';
														|en = 'Выбор КБК'"));
	ПараметрыФормы.Вставить("ТаблицаЗначений",    КодыБК);
	Если ЗначениеЗаполнено(Запись.КатегорияПодакцизногоТовара) Тогда
		ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура("Код", СокрЛП(Запись.КатегорияПодакцизногоТовара)));
	Иначе
		ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура("Код", КодБКНДС));
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКБКЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ФормаВыбораЗначенияИзТаблицы",
		ПараметрыФормы,
		ЭтотОбъект,
		УникальныйИдентификатор, , ,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеВключенияВДекларациюПриИзменении(Элемент)
	
	УстановитьВидимость(Элементы.ДатаСобытия, Запись.Состояние);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборКБКЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запись.КБК = РезультатВыбора.Код;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(Элемент, Состояние)
	
	Элемент.Видимость = ЗначениеЗаполнено(Состояние);
	Если Состояние = ПредопределенноеЗначение("Перечисление.СостояниеДОПП.ПоставкаОтменена") Тогда
		Элемент.Заголовок = НСтр("ru = 'Дата отмены поставки';
								|en = 'Дата отмены поставки'");
	ИначеЕсли Состояние = ПредопределенноеЗначение("Перечисление.СостояниеДОПП.ПоставкаПроизошла") Тогда
		Элемент.Заголовок = НСтр("ru = 'Дата принятия к учету';
								|en = 'Дата принятия к учету'");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти