#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	НачальнаяНастройкаПрограммыЗавершена = НЕ Значение;
	Если НачальнаяНастройкаПрограммыЗавершена <> Константы.бит_ум_НеВыполнятьНачальнуюНастройкуПрограммы.Получить() Тогда
		Константы.бит_ум_НеВыполнятьНачальнуюНастройкуПрограммы.Установить(НачальнаяНастройкаПрограммыЗавершена);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли