#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму(
		"Обработка.бит_ПанельАдминистрированияБФУП.Форма.НастройкиСоответствияАналитик",
		Новый Структура,
		ПараметрыВыполненияКоманды.Источник,
		"Обработка.бит_ПанельАдминистрированияБФУП.Форма.НастройкиСоответствияАналитик" + ?(ПараметрыВыполненияКоманды.Окно = Неопределено, ".ОтдельноеОкно", ""),
		ПараметрыВыполненияКоманды.Окно);
		
КонецПроцедуры

#КонецОбласти
