////////////////////////////////////////////////////////////////////////////////
// Ввод бюджета: функционал, связанный с работой Формы ввода бюджета
// и др. документов, имеющих в интефейсе табличный документ ввода бюджета. 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ИнициироватьКомпоновщикПереопределяемый(НастройкаФормыВвода, Компоновщик, УникальныйИдентификатор) Экспорт

	АдресКомпоновки = ПоместитьВоВременноеХранилище(Новый СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	Если НЕ ЗначениеЗаполнено(НастройкаФормыВвода) Тогда
		Возврат АдресКомпоновки;	
	КонецЕсли;
	
	Версия_2 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаФормыВвода, "Версия_2");	
	Если Версия_2 Тогда
		
		Реквизиты = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(НастройкаФормыВвода); 
		АдресКомпоновки = ИнициироватьКомпоновщик(Реквизиты, Компоновщик, Истина);
	Иначе	
		ТекстЗапроса	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаФормыВвода, "ТекстЗапроса");
		АдресКомпоновки = Документы.бит_ФормаВводаБюджета.ИнициализироватьКомпоновщик(ТекстЗапроса, 
							Компоновщик, УникальныйИдентификатор);	
	КонецЕсли;

	Возврат АдресКомпоновки;
	
КонецФункции

Функция ТекстЗапросаПоНастройкеФормыВводаБюджета(НастройкаСтруктурыБюджета, НастройкаПоБюджету = Ложь) Экспорт

	ТекстЗапроса   = "";
	РежимПоБюджету = Ложь;
	ИзмеренияБюдж  = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("все", "имя");		
		
	НастройкиСвязейПоВладельцу = Новый ТаблицаЗначений;
	НастройкиСвязейПоВладельцу.Колонки.Добавить("ИмяИзмерения");
	НастройкиСвязейПоВладельцу.Колонки.Добавить("МетаданныеТаблицы");
	НастройкиСвязейПоВладельцу.Колонки.Добавить("Владельцы");
	НастройкиСвязейПоВладельцу.Колонки.Добавить("ИмяВладельца");
	НастройкиСвязейПоВладельцу.Колонки.Добавить("ИмяВременнойТаблицы");
	НастройкиСвязейПоВладельцу.Колонки.Добавить("ИмяВременнойТаблицыВладельца");
	
	ТекстыЗапросов = Новый Структура;
	НомераТаблиц = Новый Массив;
	Для каждого СтрокаТаблицы Из НастройкаСтруктурыБюджета Цикл
		ИмяИзмерения      = СтрокаТаблицы.Имя;
		ОписаниеИзмерения = ИзмеренияБюдж[ИмяИзмерения];
		
		Если ТипЗнч(ОписаниеИзмерения) <> Тип("Структура") Тогда
			Продолжить;		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ИмяТипаПоУмолчанию) Тогда
			Имена = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(СтрокаТаблицы.ИмяТипаПоУмолчанию);
			ОписаниеИзмерения.Имя = Имена.ИмяОбъекта;
			ОписаниеИзмерения.ИмяТипа = Имена.ИмяКласса + "Ссылка." + Имена.ИмяОбъекта;
		КонецЕсли; 
		
		ТекстЗапросаВременнаяТаблицаПроизвольногоИзмерения(НомераТаблиц, ИмяИзмерения, 
			ОписаниеИзмерения.ИмяТипа, НастройкаПоБюджету);
		
		ОписаниеЗапроса  = НомераТаблиц[НомераТаблиц.Количество() - 1];
		МетаданныеТаблицы = ОписаниеЗапроса.МетаданныеТаблицы;
		
		НоваяСтрока = НастройкиСвязейПоВладельцу.Добавить();
		НоваяСтрока.ИмяИзмерения 	  	= ИмяИзмерения;
		НоваяСтрока.МетаданныеТаблицы 	= МетаданныеТаблицы;
		НоваяСтрока.Владельцы 		  	= МетаданныеТаблицы.Владельцы;
		НоваяСтрока.ИмяВладельца 	  	= "";
		НоваяСтрока.ИмяВременнойТаблицы = ОписаниеЗапроса.ИмяВременнойТаблицы;
		НоваяСтрока.ИмяВременнойТаблицыВладельца = "";

	КонецЦикла;
	
	// Анализ возможных связей таблиц по владельцу.
	Для каждого СтрокаТаблицы Из НастройкиСвязейПоВладельцу Цикл
		Если СтрокаТаблицы.Владельцы.Количество() > 0  Тогда
			Для каждого МетаданныеВладельца Из СтрокаТаблицы.Владельцы Цикл
				РезультаПоиска = НастройкиСвязейПоВладельцу.Найти(МетаданныеВладельца, "МетаданныеТаблицы");
				Если РезультаПоиска <> Неопределено Тогда
					СтрокаТаблицы.ИмяВладельца 				   = РезультаПоиска.ИмяИзмерения;
					СтрокаТаблицы.ИмяВременнойТаблицыВладельца = РезультаПоиска.ИмяВременнойТаблицы;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;

	// ОписаниеЗапроса - структура с ключами: ИмяВременнойТаблицы, ИмяИзмерения, ТекстЗапроса, МетаданныеТаблицы
	ТекстыЗапросов = Новый Массив;
	
	Для каждого ОписаниеЗапроса Из НомераТаблиц Цикл
		ТекстыЗапросов.Добавить(ОписаниеЗапроса.ТекстЗапроса);	
	КонецЦикла;
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	ЗапросПакета = СхемаЗапроса.ПакетЗапросов.Добавить();
	Оператор 	 = ЗапросПакета.Операторы[0];	
	Оператор.ВыбиратьРазличные = Истина;
	
	// Заполнение источников.
	ИсточникСхемы0 			 		  = Неопределено;
	НомерСоединения 		 		  = 0;
	ИмяВременнойТаблицыСтатьиОборотов = "";
	Для каждого ОписаниеЗапроса Из НомераТаблиц Цикл
		
		Если ОписаниеЗапроса.МетаданныеТаблицы = Метаданные.Справочники.бит_СтатьиОборотов Тогда
			ИмяВременнойТаблицыСтатьиОборотов = ОписаниеЗапроса.ИмяВременнойТаблицы;
		КонецЕсли;
		
		Если НомерСоединения = 0 Тогда
			ИсточникСхемы0 = Оператор.Источники.Добавить(ОписаниеЗапроса.ИмяВременнойТаблицы);
			ИсточникСхемы0.Соединения.Очистить();
		Иначе	
			НовыйИсточникСхемы = Оператор.Источники.Добавить(ОписаниеЗапроса.ИмяВременнойТаблицы);
			ИсточникСхемы0.Соединения.Добавить(НовыйИсточникСхемы);
			
			НастройкаСвязиСлева  = НастройкиСвязейПоВладельцу.Найти(ОписаниеЗапроса.ИмяИзмерения ,"ИмяИзмерения");
			НастройкаСвязиСправа = НастройкиСвязейПоВладельцу.Найти(ОписаниеЗапроса.ИмяИзмерения ,"ИмяВладельца");
			НастройкаСвязи 		 = Неопределено;
			Если ЗначениеЗаполнено(НастройкаСвязиСлева) ИЛИ ЗначениеЗаполнено(НастройкаСвязиСправа) Тогда
				Если НЕ ПустаяСтрока(НастройкаСвязиСлева.ИмяВладельца) Тогда
					НастройкаСвязи = НастройкаСвязиСлева;
				Иначе	
					НастройкаСвязи = НастройкаСвязиСправа;
				КонецЕсли;
			КонецЕсли;
			
			Если НастройкаСвязи = Неопределено Тогда
				НовоеСоединение = ИсточникСхемы0.Соединения.НайтиПоПсевдониму(ОписаниеЗапроса.ИмяВременнойТаблицы);
				НовоеСоединение.ТипСоединения = ТипСоединенияСхемыЗапроса.ЛевоеВнешнее;
				НовоеСоединение.Условие = Новый ВыражениеСхемыЗапроса("ИСТИНА");
			Иначе
				
				ЛевыйИсточник  = Оператор.Источники.НайтиПоИмени(НастройкаСвязи.ИмяВременнойТаблицыВладельца);
				ПравыйИсточник = Оператор.Источники.НайтиПоИмени(НастройкаСвязи.ИмяВременнойТаблицы);
				Если ЛевыйИсточник = Неопределено ИЛИ ПравыйИсточник = Неопределено Тогда
					НовоеСоединение = ИсточникСхемы0.Соединения.НайтиПоПсевдониму(ОписаниеЗапроса.ИмяВременнойТаблицы);
					НовоеСоединение.ТипСоединения = ТипСоединенияСхемыЗапроса.ЛевоеВнешнее;
					НовоеСоединение.Условие = Новый ВыражениеСхемыЗапроса("ИСТИНА");
				Иначе	
					ТекстВыражения = "%1.%2 = %3.Владелец";
					ТекстВыражения = СтрШаблон(ТекстВыражения, НастройкаСвязи.ИмяВременнойТаблицыВладельца, 
											НастройкаСвязи.ИмяВладельца, НастройкаСвязи.ИмяВременнойТаблицы);
											
					НовоеСоединение = ИсточникСхемы0.Соединения.НайтиПоПсевдониму(ОписаниеЗапроса.ИмяВременнойТаблицы);
					НовоеСоединение.ТипСоединения = ТипСоединенияСхемыЗапроса.Внутреннее;
					НовоеСоединение.Условие = Новый ВыражениеСхемыЗапроса(ТекстВыражения);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
		НомерСоединения = НомерСоединения + 1;
	КонецЦикла;
	
	// Заполнение полей выполняется после заполнения всех источников, что бы можно было 
	// использовать выражение ВЫБОР. Если Статьи оборотов не будут описаны в источниках,
	// будет вызвано исключение.
	ТекстыОтборов = Новый Массив;
	ИндексКолонки = 0;
	Для каждого ОписаниеЗапроса Из НомераТаблиц Цикл
		Если НомераТаблиц.Количество() = 1 Тогда
			Оператор.ВыбираемыеПоля.Добавить(ОписаниеЗапроса.ИмяИзмерения);
		ИначеЕсли ПустаяСтрока(ИмяВременнойТаблицыСтатьиОборотов) Тогда
			Оператор.ВыбираемыеПоля.Добавить(ОписаниеЗапроса.ИмяИзмерения);
		Иначе	
			Если ОписаниеЗапроса.ИмяВременнойТаблицы = ИмяВременнойТаблицыСтатьиОборотов 
			 ИЛИ ОписаниеЗапроса.ИмяИзмерения = "ЦФО"
			 ИЛИ ОписаниеЗапроса.ИмяИзмерения = "Организация" Тогда
				Оператор.ВыбираемыеПоля.Добавить(ОписаниеЗапроса.ИмяИзмерения);
			Иначе	
				// Пример: "ВЫБОР КОГДА СтатьиОборотов.Учет_Проект ТОГДА Проект ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ".
				ТекстВыражения = "ВЫБОР КОГДА %1.Учет_%2 ТОГДА %3 ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ";
				ТекстВыражения = СтрШаблон(ТекстВыражения, ИмяВременнойТаблицыСтатьиОборотов, 
									ОписаниеЗапроса.ИмяИзмерения, ОписаниеЗапроса.ИмяИзмерения);
									
				Оператор.ВыбираемыеПоля.Добавить(ТекстВыражения);
				
				Колонка = ЗапросПакета.Колонки.Получить(ИндексКолонки);
				Колонка.Псевдоним = ОписаниеЗапроса.ИмяИзмерения;
			КонецЕсли;
		КонецЕсли;
		
		Колонка = ЗапросПакета.Колонки.Получить(ИндексКолонки);
		Колонка.Псевдоним = ОписаниеЗапроса.ИмяИзмерения;
		ИндексКолонки = ИндексКолонки + 1;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстыОтборов) Тогда
		ТекстОтбора = СтрСоединить(ТекстыОтборов, " ИЛИ ");
		Оператор.Отбор.Добавить(ТекстОтбора);
	КонецЕсли;
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ИнициироватьКомпоновщик(Реквизиты, Компоновщик, ПрименитьСтандартныеНастройки = Истина) Экспорт
		
	АдресСхемыВХранилище = ИнициироватьСхемуКомпоновкиДанных(Реквизиты);
	
	КопияНастроек = Компоновщик.ПолучитьНастройки();
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыВХранилище);
	Попытка
		Компоновщик.Инициализировать(ИсточникНастроек);
	Исключение
		ТекстСообщения = НСтр("ru='Не удалось инициализировать компоновщик для отбора. Попробуйте обновить текст запроса в настройке. Описание ошибки: %1.';
							  |en='Failed to initialize builder for selection. Try refreshing the query text. Description of error: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	СКД = ПолучитьИзВременногоХранилища(АдресСхемыВХранилище);
	Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	
	Если НЕ ПрименитьСтандартныеНастройки Тогда
		бит_ОтчетыБФКлиентСервер.СкопироватьЭлементы(Компоновщик.Настройки.Отбор, КопияНастроек.Отбор);
		бит_ОтчетыБФКлиентСервер.СкопироватьЭлементы(Компоновщик.Настройки.Порядок, КопияНастроек.Порядок);
		Компоновщик.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	КонецЕсли;	
	
	Возврат АдресСхемыВХранилище;
	
КонецФункции

Функция ПериодыПланированияБюджета(НастройкаФормы, ПараметрыОбновления) Экспорт

	ДатаНачалаПланирования    = ПараметрыОбновления.ДатаНачалаПланирования;
	ДатаОкончанияПланирования = ПараметрыОбновления.ДатаОкончанияПланирования;
	ДатаАктуализации		  = ПараметрыОбновления.ДатаАктуализации;
	
	Если НЕ ЗначениеЗаполнено(ДатаНачалаПланирования) Тогда
		ДатаНачалаПланирования = НачалоГода(ТекущаяДатаСеанса());
	КонецЕсли;
		
	// Признак того, что нужно обработать выходные дни.
	ОбработатьВыходные = ?(ПараметрыОбновления.Периодичность = Перечисления.бит_ПериодичностьПланирования.День 
	                          И НЕ НастройкаФормы.ОтображениеВыходных = Перечисления.бит_РежимыОтображенияВыходныхДнейФормыВвода.Обычный, Истина, Ложь);
							  	
	// Вывод заголовка периодов.
	Периодичность        = ПараметрыОбновления.Периодичность;
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончанияПланирования) Тогда
		КоличествоИнтервалов = ПараметрыОбновления.ПродолжительностьИнтервала;
	Иначе
		КоличествоИнтервалов = бит_ОбщегоНазначенияКлиентСервер.РазностьДат(ДатаНачалаПланирования, ДатаОкончанияПланирования, Периодичность)+1;
	КонецЕсли; 
		
	// Проверим, следует ли создавать дополнительные итоговые колонки.
	ПериодыИтогов = Новый Массив;
	Для каждого СтрНастройки Из НастройкаФормы.ДополнительныеИтоги Цикл
		Если Перечисления.бит_ПериодичностьПланирования.Индекс(СтрНастройки.Периодичность) > Перечисления.бит_ПериодичностьПланирования.Индекс(Периодичность) Тогда
			  ПериодыИтогов.Добавить(СтрНастройки);
		КонецЕсли; 
	КонецЦикла; 
	
	ВыходныеДни = Новый Соответствие;
	Если ОбработатьВыходные Тогда
		
		// Получим календарь по которому будем проверять выходные.
	    Календарь = бит_НастройкиПрограммы.Календарь(Неопределено, ДатаНачалаПланирования);
		
		Если ЗначениеЗаполнено(Календарь) Тогда
			
			МассивВидов = Новый Массив;
			МассивВидов.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота);
			МассивВидов.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье);
			МассивВидов.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник);
			
			ДатаОкончанияКалендаря = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ДатаНачалаПланирования,КоличествоИнтервалов,Периодичность);
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ПроизводственныйКалендарь", Календарь);
			Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаПланирования);
			Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияКалендаря);
			Запрос.УстановитьПараметр("МассивВидов", МассивВидов);
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТабКалендарь.Дата
			|ИЗ
			|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ТабКалендарь
			|ГДЕ
			|	ТабКалендарь.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
			|	И ТабКалендарь.ВидДня В(&МассивВидов)
			|	И ТабКалендарь.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ВыходныеДни.Вставить(Выборка.Дата, Истина);
			КонецЦикла; 
		Иначе	
			ОбработатьВыходные = Ложь;
			ТекстСообщения = НСтр("ru='Невозможно определить выходные дни, т.к. не установлен Календарь в настройках программы (БИТ).';
								  |en='It is impossible to define the weekend as Calendar is not set in the program settings (BIT).'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
	КонецЕсли; 
	
	Периоды 	   = Новый Массив;
	НомерИнтервала = 1;
	ВерхнийИндекс  = КоличествоИнтервалов - 1;
	
	Для ИндексИнтервала = 0 По ВерхнийИндекс Цикл
	
		ТекущийПериод = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ДатаНачалаПланирования, ИндексИнтервала, Периодичность);
		
		Синоним = бит_ОбщегоНазначения.СформироватьПредставлениеПериода(ТекущийПериод, Периодичность);		
		ПараметрыОписанияПериода 		 		  = бит_Бюджетирование.НовыеПараметрыОписаниеПериода();
		ПараметрыОписанияПериода.Период  		  = ТекущийПериод;
		ПараметрыОписанияПериода.Синоним		  = Синоним;
		ПараметрыОписанияПериода.ДатаАктуализации = ДатаАктуализации;
		
		ОписаниеПериода = бит_Бюджетирование.ОписаниеПериода(ПараметрыОписанияПериода);
		
		Если ОбработатьВыходные Тогда
			Если ВыходныеДни[ТекущийПериод] = Истина Тогда
				Если НастройкаФормы.ОтображениеВыходных = Перечисления.бит_РежимыОтображенияВыходныхДнейФормыВвода.НеОтображать Тогда				   
				       Продолжить;				   
				КонецЕсли; 
				ОписаниеПериода.ЭтоВыходной = Истина;
			КонецЕсли; 
		КонецЕсли; 
		
		Периоды.Добавить(ОписаниеПериода);
		
		// Добавление дополнительных итоговых колонок по периодам.
		КонецТекПериода = бит_ОбщегоНазначенияКлиентСервер.ПолучитьКонецПериода(ТекущийПериод, Периодичность);		
		Для каждого СтрНастройки Из ПериодыИтогов Цикл
			
			КонецИтПериода = бит_ОбщегоНазначенияКлиентСервер.ПолучитьКонецПериода(ТекущийПериод, СтрНастройки.Периодичность);
			
			Если КонецТекПериода = КонецИтПериода Тогда
			
				Синоним = бит_ОбщегоНазначения.СформироватьПредставлениеПериода(ТекущийПериод, СтрНастройки.Периодичность);
				НачалоИтПериода = бит_ОбщегоНазначенияКлиентСервер.ПолучитьНачалоПериода(ТекущийПериод, СтрНастройки.Периодичность);
				
				ПараметрыОписанияПериода = бит_Бюджетирование.НовыеПараметрыОписаниеПериода();
				ПараметрыОписанияПериода.Период  			= НачалоИтПериода;
				ПараметрыОписанияПериода.Синоним 			= Синоним;
				ПараметрыОписанияПериода.Имя 				= "Ит_" + Формат(НомерИнтервала, "ЧГ=");
				ПараметрыОписанияПериода.ЭтоИтог 			= Истина;
				ПараметрыОписанияПериода.ЭтоНарастающийИтог = СтрНастройки.НарастающийИтог;
				ПараметрыОписанияПериода.КонецПериода 		= КонецИтПериода;
				ПараметрыОписанияПериода.Периодичность		= СтрНастройки.Периодичность;
				ПараметрыОписанияПериода.ДатаАктуализации   = ДатаАктуализации;
				
				ОписаниеПериода = бит_Бюджетирование.ОписаниеПериода(ПараметрыОписанияПериода);
		        Периоды.Добавить(ОписаниеПериода);				
				
				НомерИнтервала = НомерИнтервала + 1;
			КонецЕсли; 
		КонецЦикла; // ПериодыИтогов.
	КонецЦикла; // По интервалам.

	// Колонки итогов.
	Если НастройкаФормы.ВыводитьОбщиеИтоги Тогда
		ПараметрыОписанияПериода = бит_Бюджетирование.НовыеПараметрыОписаниеПериода();
		ПараметрыОписанияПериода.Период  		  = Дата('00010101');
		ПараметрыОписанияПериода.Синоним 		  = НСтр("ru = 'Итого'");
		ПараметрыОписанияПериода.Имя 	 		  = "Итог";
		ПараметрыОписанияПериода.ЭтоИтог		  = Истина;
		ПараметрыОписанияПериода.ДатаАктуализации = ДатаАктуализации;
		ОписаниеПериода = бит_Бюджетирование.ОписаниеПериода(ПараметрыОписанияПериода);
		Периоды.Добавить(ОписаниеПериода);
	КонецЕсли; 
		
	Возврат Периоды;

КонецФункции

Функция ИдентификаторРасшифровки(Группировки, Период = '0001-01-01', НомерПериода = 0) Экспорт

	Значение = Новый Массив();
	
	Если ТипЗнч(Группировки) = Тип("Массив") Тогда
		Для каждого Элемент Из Группировки Цикл
	   		Значение.Добавить(Элемент)
		КонецЦикла;
	Иначе	
		Значение = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Группировки);
	КонецЕсли;
	 
	Значение.Добавить(Формат(Период,"ДФ=yyyy-MM-dd"));
	Значение.Добавить(Формат(НомерПериода,"ЧГ="));
		
	ИдентификаторРасшифровки = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(Значение, ХешФункция.MD5);
	
	Возврат ИдентификаторРасшифровки;
	
КонецФункции

Функция НовыеПараметрыПосроенияМакетаБюджета() Экспорт

	Параметры = Новый Структура;
	
	Параметры.Вставить("Периодичность",				 Перечисления.бит_ПериодичностьПланирования.ПустаяСсылка());
	Параметры.Вставить("ПродолжительностьИнтервала", 0);
	Параметры.Вставить("ДатаНачалаПланирования", 	 '0001-01-01');
	Параметры.Вставить("ДатаОкончанияПланирования",	 '0001-01-01');
	Параметры.Вставить("ДатаАктуализации", 		 	 '0001-01-01');
	Параметры.Вставить("СхемаКомпоновкиДанных",		 Новый СхемаКомпоновкиДанных);
	Параметры.Вставить("НастройкиКомпоновщика",		 Новый КомпоновщикНастроекКомпоновкиДанных);
	Параметры.Вставить("МестоИспользования", 		 "");
	
	Возврат Параметры;
	
КонецФункции 

Функция РезультатПостроенияМакетаБюджета(Настройка, ПараметрыОбновления) Экспорт
	
	Настройки = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(Настройка);	
	Бюджет 	  = Настройки.Бюджет;	
	
	Если ЗначениеЗаполнено(Бюджет) И Справочники.бит_Бюджеты.БюджетЗапрещенВПланировании(Бюджет) Тогда
		ТекстИсключения = НСтр("ru = 'Выполнение операции остановлено.
								|Бюджет настройки формы ввода не должен содержать дубли статей оборотов.';
								|en = 'The operation is stopped.
								|Budget setting entry forms should not contain duplicates revolutions articles.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	НастройкиДопИзмерений = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();
	НастройкиИзмерений 	  = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();
		
	Бюджет 				  = Настройки.Бюджет; 
	СКД 				  = ПараметрыОбновления.СхемаКомпоновкиДанных;
	НастройкиКомпоновщика = ПараметрыОбновления.НастройкиКомпоновщика;
	
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновщика, "Бюджет", Бюджет);
	Для каждого КлючЗначение Из НастройкиДопИзмерений Цикл
		СвойстваДопИзмерения = КлючЗначение.Значение;	
		Если СвойстваДопИзмерения.ТипЗначения.СодержитТип(Тип("СправочникСсылка.бит_ДополнительныеЗначенияАналитик")) Тогда
			бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновщика, КлючЗначение.Ключ, СвойстваДопИзмерения.Аналитика);
		КонецЕсли;
	КонецЦикла;
		
	ПараметрыВыгрузкиСКД = бит_ОтчетыБФСервер.ПараметрыВыгрузитьРезультатСКД();
	ПараметрыВыгрузкиСКД.СхемаКомпоновки	 = СКД;
	ПараметрыВыгрузкиСКД.НастройкиКомпоновки = НастройкиКомпоновщика;
	ПараметрыВыгрузкиСКД.ТипРезультата 		 = "ДеревоЗначений";
	
	РезультатСКД = бит_ОтчетыБФСервер.ВыгрузитьРезультатСКД(ПараметрыВыгрузкиСКД);
	
	Настройки.МестоИспользования = ПараметрыОбновления.МестоИспользования;
	
	Если Настройки.МестоИспользования = "бит_АктуализацияБюджета" Тогда
		Макет = Документы.бит_АктуализацияБюджета.ПолучитьМакет("Макет");	
	Иначе	
		Макет = Документы.бит_ФормаВводаБюджета.ПолучитьМакет("Макет");	
	КонецЕсли;
	
	ИмяОсновногоМакетаОформления = бит_ОтчетыБФСервер.ИмяОсновногоМакетаОформленияОтчета();
	
	Если ПустаяСтрока(Настройки.МакетОформления) Тогда
		ИмяМакетаОформления = ИмяОсновногоМакетаОформления;
	Иначе
		ИмяМакетаОформления = Настройки.МакетОформления;
	КонецЕсли;
	
	ЭлементБиблиотекиМакетов = БиблиотекаМакетовОформленияКомпоновкиДанных.Найти(ИмяМакетаОформления);
	Если ЭлементБиблиотекиМакетов = Неопределено Тогда
		ЭлементБиблиотекиМакетов = БиблиотекаМакетовОформленияКомпоновкиДанных.Найти(ИмяОсновногоМакетаОформления);
	КонецЕсли;
		
	МакетыОбластей = Новый Структура;

	МакетыОбластей.Вставить("Макет", Макет); 
	МакетыОбластей.Вставить("НастройкиМакетаОформления");
	
	// ++ NB Использование синонимов оставлено для обратной совместимости с пред. версиями. 
	// Использовать при анализе кода.
	
	МакетыОбластей.Вставить("Заголовок_Кодификатор", "Шапка|Кодификатор");
	МакетыОбластей.Вставить("Заголовок_Измерение",   "Шапка|Измерение");
	МакетыОбластей.Вставить("Заголовок_Поле",		 "Шапка|Поле");
	МакетыОбластей.Вставить("Заголовок_ПолеДубль",   "ВысокаяШапка|ПолеДубль");
	
	МакетыОбластей.Вставить("Строка_Кодификатор", 			   "ЗаголовокГруппировки|Кодификатор");
	МакетыОбластей.Вставить("Строка_Измерение", 			   "ЗаголовокГруппировки|Измерение");
	МакетыОбластей.Вставить("Строка_ПолеКоличество",		   "ЗаголовокГруппировки|ПолеКоличество");
	МакетыОбластей.Вставить("Строка_ПолеСумма",			   		"ЗаголовокГруппировки|ПолеСумма");
	МакетыОбластей.Вставить("Строка_ПолеДубль",			   		"ЗаголовокГруппировки|ПолеДубль");
	МакетыОбластей.Вставить("СтрокаРасчетная_ПолеКоличество", 	"Итоги|ПолеКоличество");
	МакетыОбластей.Вставить("СтрокаРасчетная_ПолеСумма", 	   "Итоги|ПолеСумма");
	МакетыОбластей.Вставить("СтрокаРасчетная_ПолеДубль", 	   "Итоги|ПолеДубль");

	ИменаМакетовШапки = Новый Массив;
	ИменаМакетовШапки.Добавить("Заголовок_Кодификатор");
	ИменаМакетовШапки.Добавить("Заголовок_Измерение");
	ИменаМакетовШапки.Добавить("Заголовок_Поле");
	ИменаМакетовШапки.Добавить("Заголовок_ПолеДубль");
	
	ИменаМакетовТаблицы = Новый Массив;
	ИменаМакетовТаблицы.Добавить("Строка_ПолеКоличество");
	ИменаМакетовТаблицы.Добавить("Строка_ПолеСумма");
	ИменаМакетовТаблицы.Добавить("Строка_ПолеДубль");
	
	НастройкиМакетаОформления = НастройкиМакетаОформления(ЭлементБиблиотекиМакетов);
	
	МакетыОбластей.НастройкиМакетаОформления = НастройкиМакетаОформления;
	
	// Вывод дерева данных.								   
	Периоды = ПериодыПланированияБюджета(Настройки, ПараметрыОбновления); 
	
	ВывестиШапку(ДокументРезультат, МакетыОбластей, Настройки, Периоды);
	
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	
	ВывестиГруппировки(РезультатСКД, ДокументРезультат, МакетыОбластей, Настройки, Периоды);
	
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	
	ДокументРезультат.НаправлениеПерехода = ТипНаправленияПереходаТабличногоДокумента.БезПерехода;
	
	ЗначенияГруппировок = ЗначенияГруппировок(РезультатСКД, Настройки);
	Для каждого КлючЗначение Из ЗначенияГруппировок Цикл
		Ключ 	 = КлючЗначение.Ключ;
		Значение = ОбщегоНазначенияКлиентСервер.СвернутьМассив(КлючЗначение.Значение);
		ЗначенияГруппировок.Вставить(Ключ, Значение);
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ДокументРезультат",   ДокументРезультат);
	Результат.Вставить("ЗначенияГруппировок", ЗначенияГруппировок);
	
	Возврат Результат;
	
КонецФункции

Процедура ВосстановитьСохраненныеНастройки(СохраненнаяНастройка, Компоновщик, Бюджет) Экспорт

	Если ТипЗнч(СохраненнаяНастройка) <> Тип("Структура") Тогда
		Возврат;	
	КонецЕсли;
	
	НастройкиКомпоновщика = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СохраненнаяНастройка, "НастройкиКомпоновщика");
	
	Если ТипЗнч(НастройкиКомпоновщика) = Тип("НастройкиКомпоновкиДанных")  Тогда
		
		НастройкиИсточник = НастройкиКомпоновщика;
		НастройкиПриемник = Компоновщик.ПолучитьНастройки();
		
		бит_ОтчетыБФКлиентСервер.СкопироватьЭлементы(НастройкиПриемник.Отбор, НастройкиИсточник.Отбор);
		бит_ОтчетыБФКлиентСервер.СкопироватьЭлементы(НастройкиПриемник.Порядок, НастройкиИсточник.Порядок);
		
		Если ЗначениеЗаполнено(Бюджет) Тогда
			бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиПриемник, "Бюджет", Бюджет);			
		КонецЕсли;
		
		Компоновщик.ЗагрузитьНастройки(НастройкиПриемник);
		Компоновщик.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициироватьСхемуКомпоновкиДанных(ПараметрыИнициализации)
	
	НастройкаСтруктуры 	 	= ПараметрыИнициализации.НастройкаСтруктурыБюджета;
	ТекстЗапроса			= ПараметрыИнициализации.ТекстЗапроса;
	УникальныйИдентификатор = ПараметрыИнициализации.УникальныйИдентификатор;
	Бюджет 					= ПараметрыИнициализации.Бюджет;
	ВыводитьКодификатор		= ПараметрыИнициализации.ВыводитьКодификатор;
	
	НастройкиДопИзмерений = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();
	
	СКД	      = бит_ОтчетыБФСервер.ПустаяСхема();
	Настройки = СКД.НастройкиПоУмолчанию;
	
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		
		ИмяНабораДанных = "Основной";
		
		НовыйНабор = бит_ОтчетыБФСервер.ДобавитьПустойНаборДанных(СКД, Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"), ИмяНабораДанных);
		НовыйНабор.Запрос 						= ТекстЗапроса;
		НовыйНабор.АвтоЗаполнениеДоступныхПолей = Истина;
		
		ПараметрБюджет = бит_ОтчетыБФСервер.ДобавитьПараметр(СКД, "Бюджет", 
							Новый ОписаниеТипов("СправочникСсылка.бит_Бюджеты"), Бюджет, Истина);
		ПараметрБюджет.ВключатьВДоступныеПоля = Ложь;
		
		Для каждого СтрокаТаблицы Из НастройкаСтруктуры Цикл
		
			НастройкаДопИзмерения = НастройкиДопИзмерений[СтрокаТаблицы.Имя];
			Если НастройкаДопИзмерения <> Неопределено 
				 И НастройкаДопИзмерения.ТипЗначения.СодержитТип(Тип("СправочникСсылка.бит_ДополнительныеЗначенияАналитик")) Тогда
			
				 НовыйПараметр = бит_ОтчетыБФСервер.ДобавитьПараметр(СКД, СтрокаТаблицы.Имя,, НастройкаДопИзмерения.Аналитика, Истина);
				 НовыйПараметр.ВключатьВДоступныеПоля = Ложь;
			КонецЕсли; 
		КонецЦикла; 
		
		// Формирование полей.
		// Поля набора - это псевдонимы полей запроса пакет. 
		// Они же имена измерений, по которым выполняется "разворот".
		// Вычисляемые поля - вспомогательные поля, используемые при выводе результата 
		// компоновки в табличный документ:
		// <ИмяИзмерения>.Шифроник  - кодификатор для вывода; // Бывш. Кодификатор
		// <ИмяИзмерения>.ЭтоКоллекция - признак, что текущее значение группа.
		// <ИмяИзмерения>.Коэффициент - коэффициент статьи бюджета. Используется только, когда ФВБ по бюджету.
		// <ИмяИзмерения>.ПараметрРасшифровки - значение измерения, которое будет установленов Расшифровку.
		// <ИмяИзмерения>.Представление - строковое представление значения, выводимого в ячейку.
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		ЗапросПакета  = СхемаЗапроса.ПакетЗапросов.Получить(СхемаЗапроса.ПакетЗапросов.Количество() - 1);
		КолонкиПакета = ЗапросПакета.Колонки;
		Для каждого Колонка Из КолонкиПакета Цикл
			
			ТипДанных		  = Колонка.ТипЗначения.Типы()[0];
			МетаданныеКолонки = Метаданные.НайтиПоТипу(ТипДанных);
			
			Если МетаданныеКолонки = Метаданные.Справочники.бит_СтатьиБюджета Тогда
				НовоеПоле = бит_ОтчетыБФСервер.НовоеПолеНабора(НовыйНабор, Колонка.Псевдоним,,
									НСтр("ru = 'Статья бюджета'"), Колонка.ТипЗначения);
									
				//СвязиПараметровВыбора = НовоеПоле.ПараметрыРедактирования.Элементы.Найти("СвязиПараметровВыбора");
				//СвязиПараметровВыбора.Использование = Истина;
				//
				//СвязьПараметровВыбора = СвязиПараметровВыбора.Значение.Добавить();
				//СвязьПараметровВыбора.Имя  = "Отбор.Владелец";
				//СвязьПараметровВыбора.Поле = Новый ПолеКомпоновкиДанных("ПараметрыДанных.Бюджет");
				
				бит_ОтчетыБФСервер.НовоеПолеВыбора(СКД.НастройкиПоУмолчанию, Колонка.Псевдоним);
			Иначе	
				бит_ОтчетыБФСервер.НовоеПолеНабора(НовыйНабор, Колонка.Псевдоним,,, Колонка.ТипЗначения);
				бит_ОтчетыБФСервер.НовоеПолеВыбора(СКД.НастройкиПоУмолчанию, Колонка.Псевдоним);
			КонецЕсли;		
			
			ЭтоСправочник = ОбщегоНазначения.ЭтоСправочник(МетаданныеКолонки) 
									ИЛИ ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеКолонки);
									
			ИмяРеквизитаКодификатор = "";
			МожетБытьГруппой		= Ложь;
			
			ИндексКолонки = КолонкиПакета.Индекс(Колонка);
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Кодификатор", МетаданныеКолонки) Тогда
				ИмяРеквизитаКодификатор = "Кодификатор";	
			Иначе	
				Если ЭтоСправочник И МетаданныеКолонки.ДлинаКода <> 0 Тогда
					ИмяРеквизитаКодификатор = "Код";
				КонецЕсли;
			КонецЕсли;
			
			Если ИмяРеквизитаКодификатор <> "" Тогда
				Выражение = Колонка.Псевдоним + "." + ИмяРеквизитаКодификатор;
			Иначе
				Выражение = """""";
			КонецЕсли;
			
			// В связи с тем, что по вычисляемому полю неправильно работает сортировка в иерархии,
			// пришлось назвать "Шифроник".
			НовоеПоле = СКД.ВычисляемыеПоля.Добавить();
			НовоеПоле.Выражение	  = Выражение;
			НовоеПоле.ПутьКДанным = СтрШаблон("%1.Шифроник", Колонка.Псевдоним);
			НовоеПоле.Заголовок	  = НСтр("ru = 'Шифроник'");
			// Это служебное поле непредназначенное для операций пользователя.
			НовоеПоле.ОграничениеИспользования.Порядок = Истина;
			НовоеПоле.ОграничениеИспользования.Условие = Истина;
			
			бит_ОтчетыБФСервер.НовоеПолеВыбора(СКД.НастройкиПоУмолчанию, НовоеПоле.ПутьКДанным);
			
			Если ЭтоСправочник 
			   И МетаданныеКолонки.Иерархический 
			   И МетаданныеКолонки.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
			
				МожетБытьГруппой = Истина;	
			КонецЕсли;

			// В связи с тем, что по вычисляемому полю неправильно работает сортировка в иерархии,
			// пришлось назвать "это коллекция".
			// Сортировку по "ЭтоГруппа" задам по реквизиту.
			Выражение = "ВЫБОР КОГДА %1 = НЕОПРЕДЕЛЕНО ТОГДА ЛОЖЬ ИНАЧЕ %1.ЭтоГруппа КОНЕЦ";
			Выражение = ?(МожетБытьГруппой, СтрШаблон(Выражение, Колонка.Псевдоним), "ЛОЖЬ");
			
			НовоеПоле = СКД.ВычисляемыеПоля.Добавить();
			НовоеПоле.Выражение	  = Выражение;
			НовоеПоле.ПутьКДанным = СтрШаблон("%1.ЭтоКоллекция", Колонка.Псевдоним);
			НовоеПоле.Заголовок	  = НСтр("ru = 'Это коллекция'");
			бит_ОтчетыБФСервер.НовоеПолеВыбора(СКД.НастройкиПоУмолчанию, НовоеПоле.ПутьКДанным);
			
			Если МетаданныеКолонки = Метаданные.Справочники.бит_СтатьиБюджета Тогда
				НовоеПоле = СКД.ВычисляемыеПоля.Добавить();
				Выражение = 
				"ВЫБОР 
				|	КОГДА СтатьяОборотов.ЭтоГруппа ТОГДА 1 
				|	ИНАЧЕ  
				|		ВЫБОР 
				|			КОГДА СтатьяОборотов.НеВключатьВИтоги ТОГДА 0 
				|			ИНАЧЕ СтатьяОборотов.Коэффициент 
				|		КОНЕЦ 
				|КОНЕЦ";
				
				НовоеПоле.Выражение	  = Выражение;
				НовоеПоле.ПутьКДанным = СтрШаблон("%1.Коэффициент", Колонка.Псевдоним);
				НовоеПоле.Заголовок	  = НСтр("ru = 'Коэффициент'");
				бит_ОтчетыБФСервер.НовоеПолеВыбора(СКД.НастройкиПоУмолчанию, НовоеПоле.ПутьКДанным);
				
				// У групп статей бюджета может быть не заполнен реквизит "СтатьяОборотов". 
				// Для элементов значение реквизиты важно и используется как классификатор
				// и элемент отбора строк с даными бюджета. У групп этот реквизит в отборах не
				// участвует, однако, "ПараметрРасшифровки" должен быть заполнен, т.к. по нему 
				// формируется идентификатор расшифровки.
				// Решение: если у группы реквизит пустой, подсунуть самму группу.
				Выражение = "ВЫБОР КОГДА ЗначениеЗаполнено(%1.СтатьяОборотов) ТОГДА %1.СтатьяОборотов ИНАЧЕ %1 КОНЕЦ";
				НовоеПоле = СКД.ВычисляемыеПоля.Добавить();
				НовоеПоле.Выражение	  = СтрШаблон(Выражение, Колонка.Псевдоним); // "%1.СтатьяОборотов"
				НовоеПоле.ПутьКДанным = СтрШаблон("%1.ПараметрРасшифровки", Колонка.Псевдоним);
				НовоеПоле.Заголовок	  = НСтр("ru = 'Значение расшифровки'");
				НовоеПоле.ОграничениеИспользования.Условие = Истина;
				НовоеПоле.ОграничениеИспользования.Порядок = Истина;
				бит_ОтчетыБФСервер.НовоеПолеВыбора(СКД.НастройкиПоУмолчанию, НовоеПоле.ПутьКДанным);
				
				Если ПараметрыИнициализации.ИспользоватьНаименованияСтатейБюджета Тогда
					НовоеПоле = СКД.ВычисляемыеПоля.Добавить();
					НовоеПоле.Выражение	  = СтрШаблон("СТРОКА(%1)", Колонка.Псевдоним);
					НовоеПоле.ПутьКДанным = СтрШаблон("%1.Представление", Колонка.Псевдоним);
					НовоеПоле.Заголовок	  = НСтр("ru = 'Представление'");
					бит_ОтчетыБФСервер.НовоеПолеВыбора(СКД.НастройкиПоУмолчанию, НовоеПоле.ПутьКДанным);
				Иначе	
					НовоеПоле = СКД.ВычисляемыеПоля.Добавить();
					НовоеПоле.Выражение	  = СтрШаблон("СТРОКА(%1.СтатьяОборотов)", Колонка.Псевдоним);
					НовоеПоле.ПутьКДанным = СтрШаблон("%1.Представление", Колонка.Псевдоним);
					НовоеПоле.Заголовок	  = НСтр("ru = 'Представление'");
					бит_ОтчетыБФСервер.НовоеПолеВыбора(СКД.НастройкиПоУмолчанию, НовоеПоле.ПутьКДанным);
				КонецЕсли;
			Иначе
				НовоеПоле = СКД.ВычисляемыеПоля.Добавить();
				НовоеПоле.Выражение	  = Колонка.Псевдоним;
				НовоеПоле.ПутьКДанным = СтрШаблон("%1.ПараметрРасшифровки", Колонка.Псевдоним);
				НовоеПоле.Заголовок	  = НСтр("ru = 'Значение расшифровки'");
				НовоеПоле.ОграничениеИспользования.Условие = Истина;
				НовоеПоле.ОграничениеИспользования.Порядок = Истина;
				бит_ОтчетыБФСервер.НовоеПолеВыбора(СКД.НастройкиПоУмолчанию, НовоеПоле.ПутьКДанным);
				
				НовоеПоле = СКД.ВычисляемыеПоля.Добавить();
				Выражение = "ВЫБОР КОГДА %1 = НЕОПРЕДЕЛЕНО ТОГДА """" ИНАЧЕ СТРОКА(%1) КОНЕЦ";
				НовоеПоле.Выражение	  = СтрШаблон(Выражение, Колонка.Псевдоним);
				НовоеПоле.ПутьКДанным = СтрШаблон("%1.Представление", Колонка.Псевдоним);
				НовоеПоле.Заголовок	  = НСтр("ru = 'Представление'");
				бит_ОтчетыБФСервер.НовоеПолеВыбора(СКД.НастройкиПоУмолчанию, НовоеПоле.ПутьКДанным);
			КонецЕсли;
		КонецЦикла;
		
		Группировка 				   = СКД.НастройкиПоУмолчанию.Структура;
		ВыражениеИтога				   = Новый Массив;
		ИмяГруппировкиДетальныхЗаписей = "";
		УстановитьОтборПоЗначениюПоля  = Истина;
		
		Для каждого СтрокаТаблицы Из НастройкаСтруктуры Цикл
			ИмяГруппировкиДетальныхЗаписей = СтрокаТаблицы.Имя;

			ИмяГруппировки 	  = СтрокаТаблицы.Имя;
			Колонка			  = КолонкиПакета.Найти(ИмяГруппировки);
			ТипДанных		  = Колонка.ТипЗначения.Типы()[0];
			МетаданныеКолонки = Метаданные.НайтиПоТипу(ТипДанных);
			ЭтоСправочник 	  = ОбщегоНазначения.ЭтоСправочник(МетаданныеКолонки) 
									ИЛИ ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеКолонки);
			
			Если СтрокаТаблицы.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.РазворачиватьСИерархией Тогда
				ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
			Иначе	
				ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
			КонецЕсли;			
			
			Группировка = бит_ОтчетыБФСервер.НоваяГруппировка(Группировка, 
							ИмяГруппировки, ТипГруппировки, Истина);
			Группировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
			
			Если ИмяГруппировки = "СтатьяОборотов" Тогда
				// Отбор на пустые поля группировок устанавливаем когда группировка
				// выше группировки "СтатьяОборотов", что бы не показывать пустые значения
				// в структуре отчета.
				УстановитьОтборПоЗначениюПоля = Ложь;
			КонецЕсли;
			
			Если УстановитьОтборПоЗначениюПоля Тогда
				бит_ОтчетыБФКлиентСервер.ДобавитьОтбор(Группировка.Отбор, ИмяГруппировки,, ВидСравненияКомпоновкиДанных.Заполнено);
			КонецЕсли;
				
			ТекстВыражения = СтрШаблон("КОГДА ВычислитьВыражение(1, ""%1"") = 1 ТОГДА ""%1""", СтрокаТаблицы.Имя);
			ВыражениеИтога.Вставить(0, ТекстВыражения);
		КонецЦикла;			
		
		//// Для случаев, когда первая группировка - это справочник с иерархией групп и элементов,
		//// требуется добавление сортировки по полю "ЭтоГруппа". 
		//// Если этого не сделать, то группы могут оказаться внутри списка элементов.
		//Если ЭтоСправочник И МетаданныеКолонки.Иерархический Тогда
		//	ВыражениеПоля = СтрШаблон("%1.ЭтоГруппа", ИмяГруппировки);
		//	НовоеПоле = СКД.НастройкиПоУмолчанию.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		//	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(ВыражениеПоля);
		//	НовоеПоле.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
		//	НовоеПоле.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
		//КонецЕсли;
		
		// Вычисляемое поле для маркировки имени измерения.
		НовоеПоле = СКД.ВычисляемыеПоля.Добавить();
		НовоеПоле.Выражение	  = СтрШаблон("""%1""", ИмяГруппировкиДетальныхЗаписей);
		НовоеПоле.ПутьКДанным = "ИмяИзмерения";
		НовоеПоле.Заголовок	  = НСтр("ru = 'Имя измерения'");
		НовоеПоле.ОграничениеИспользования.Условие = Истина;
		НовоеПоле.ОграничениеИспользования.Порядок = Истина;
		бит_ОтчетыБФСервер.НовоеПолеВыбора(СКД.НастройкиПоУмолчанию, НовоеПоле.ПутьКДанным);

		НовоеПолеИтога = СКД.ПоляИтога.Добавить();
		НовоеПолеИтога.ПутьКДанным = НовоеПоле.ПутьКДанным;
		НовоеПолеИтога.Выражение = СтрШаблон("ВЫБОР %1 КОНЕЦ", СтрСоединить(ВыражениеИтога, Символы.ПС));
		
		// Установка дополнительных настроек.
		бит_ОтчетыБФСервер.УстановитьПараметрВывода(СКД.НастройкиПоУмолчанию,
			"ГоризонтальноеРасположениеОбщихИтогов", РасположениеИтоговКомпоновкиДанных.Нет);
		бит_ОтчетыБФСервер.УстановитьПараметрВывода(СКД.НастройкиПоУмолчанию,
			"ВертикальноеРасположениеОбщихИтогов", РасположениеИтоговКомпоновкиДанных.Нет);
		бит_ОтчетыБФСервер.УстановитьПараметрВывода(СКД.НастройкиПоУмолчанию,
			"РасположениеПолейГруппировки", РасположениеПолейГруппировкиКомпоновкиДанных.Отдельно);
	
		бит_МеханизмДопИзмерений.НастроитьПоляДополнительныхИзмеренийВСКД(СКД, ИмяНабораДанных);	
	
	КонецЕсли;
			
	АдресСхемыВХранилище = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);

	Возврат АдресСхемыВХранилище;
	
КонецФункции

Процедура ТекстЗапросаВременнаяТаблицаПроизвольногоИзмерения(НомераТаблиц, ИмяИзмерения, ИмяТипа, НастройкаПоБюджету = Ложь) 
	
	МетаданныеСправочника = Метаданные.НайтиПоТипу(Тип(ИмяТипа));
	Если МетаданныеСправочника.Иерархический Тогда
		ИерархияГруппИЭлементов  = (МетаданныеСправочника.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов);
	Иначе	
		ИерархияГруппИЭлементов  = Ложь;
	КонецЕсли;
	
	ЭтоСправочник 			  = ОбщегоНазначения.ЭтоСправочник(МетаданныеСправочника);
	ЭтоПланВидовХарактеристик = ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеСправочника);
	ЭтоСтатьиОборотов		  = МетаданныеСправочника = Метаданные.Справочники.бит_СтатьиОборотов;
	ЭтоСтатьиБюджетов		  = ЭтоСтатьиОборотов И НастройкаПоБюджету;
	
	Если НЕ ЭтоСправочник И НЕ ЭтоПланВидовХарактеристик Тогда
		ТекстСообщения = НСтр("ru = 'Тип данных ""%1"" не поддерживается.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Тип(ИмяТипа));
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ЕстьВладельцы = (МетаданныеСправочника.Владельцы.Количество() > 0);
	
	ТекстЗапроса = "";
	Если ЭтоСтатьиБюджетов Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатьиБюджета.Ссылка КАК СтатьяБюджета,
		|	СтатьиБюджета.Ссылка КАК ПолеВыборки,
		|	Таблица.Учет_Количество КАК Учет_Количество,
		|	Таблица.Учет_Сумма КАК Учет_Сумма,
		|	Таблица.Учет_Аналитика_1 КАК Учет_Аналитика_1,
		|	Таблица.Учет_Аналитика_2 КАК Учет_Аналитика_2,
		|	Таблица.Учет_Аналитика_3 КАК Учет_Аналитика_3,
		|	Таблица.Учет_Аналитика_4 КАК Учет_Аналитика_4,
		|	Таблица.Учет_Аналитика_5 КАК Учет_Аналитика_5,
		|	Таблица.Учет_Аналитика_6 КАК Учет_Аналитика_6,
		|	Таблица.Учет_Аналитика_7 КАК Учет_Аналитика_7,
		// ++ ЕРП 
		|	Таблица.Учет_Аналитика_8 КАК Учет_Аналитика_8,
		|	Таблица.Учет_Аналитика_9 КАК Учет_Аналитика_9,
		|	Таблица.Учет_Аналитика_10 КАК Учет_Аналитика_10,
		|	Таблица.Учет_Аналитика_11 КАК Учет_Аналитика_11,
		|	Таблица.Учет_Аналитика_12 КАК Учет_Аналитика_12
		// -- ЕРП 
		|ПОМЕСТИТЬ #ВременнаяТаблица
		|ИЗ
		|	Справочник.бит_СтатьиБюджета КАК СтатьиБюджета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_СтатьиОборотов КАК Таблица
		|		ПО СтатьиБюджета.СтатьяОборотов = Таблица.Ссылка
		|ГДЕ
		|	НЕ Таблица.ЭтоГруппа
		|	И НЕ Таблица.ПометкаУдаления
		|	И СтатьиБюджета.Владелец = &Бюджет
		|	И НЕ СтатьиБюджета.ЭтоГруппа
		|	И НЕ СтатьиБюджета.ПометкаУдаления
		|	И НЕ СтатьиБюджета.ЭтоРасчет";
		
	ИначеЕсли ЭтоСтатьиОборотов Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.Ссылка КАК ПолеВыборки,
		|	Таблица.Учет_Количество КАК Учет_Количество,
		|	Таблица.Учет_Сумма КАК Учет_Сумма,
		|	Таблица.Учет_Аналитика_1 КАК Учет_Аналитика_1,
		|	Таблица.Учет_Аналитика_2 КАК Учет_Аналитика_2,
		|	Таблица.Учет_Аналитика_3 КАК Учет_Аналитика_3,
		|	Таблица.Учет_Аналитика_4 КАК Учет_Аналитика_4,
		|	Таблица.Учет_Аналитика_5 КАК Учет_Аналитика_5,
		|	Таблица.Учет_Аналитика_6 КАК Учет_Аналитика_6,
		|	Таблица.Учет_Аналитика_7 КАК Учет_Аналитика_7,
		// ++ ЕРП 
		|	Таблица.Учет_Аналитика_8 КАК Учет_Аналитика_8,
		|	Таблица.Учет_Аналитика_9 КАК Учет_Аналитика_9,
		|	Таблица.Учет_Аналитика_10 КАК Учет_Аналитика_10,
		|	Таблица.Учет_Аналитика_11 КАК Учет_Аналитика_11,
		|	Таблица.Учет_Аналитика_12 КАК Учет_Аналитика_12
		// -- ЕРП
		|ПОМЕСТИТЬ #ВременнаяТаблица
		|ИЗ
		|	Справочник.бит_СтатьиОборотов КАК Таблица
		|ГДЕ
		|	НЕ Таблица.ЭтоГруппа
		|	И НЕ Таблица.ПометкаУдаления";
		
	ИначеЕсли ИерархияГруппИЭлементов Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.Ссылка КАК ПолеВыборки,
		|	&ПолеВладелец КАК Владелец
		|ПОМЕСТИТЬ #ВременнаяТаблица
		|ИЗ
		|	#Таблица КАК Таблица
		|ГДЕ
		|	НЕ Таблица.ЭтоГруппа
		|	И НЕ Таблица.ПометкаУдаления
		|	И &ВладелецЗначенийДопАналитик";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.Ссылка КАК ПолеВыборки,
		|	&ПолеВладелец КАК Владелец
		|ПОМЕСТИТЬ #ВременнаяТаблица
		|ИЗ
		|	#Таблица КАК Таблица
		|ГДЕ
		|	НЕ Таблица.ПометкаУдаления
		|	И &ВладелецЗначенийДопАналитик";
	КонецЕсли;	
	
	ИмяВременнойТаблицы = "ВременнаяТаблица" + Формат(НомераТаблиц.Количество(), "ЧН=; ЧГ=");
	
	ЧтоЗаменить	  = "#Таблица";
	НаЧтоЗаменить = МетаданныеСправочника.ПолноеИмя();
	ТекстЗапроса  = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, НаЧтоЗаменить);
		
	ЧтоЗаменить	  = "#ВременнаяТаблица";
	НаЧтоЗаменить = ИмяВременнойТаблицы;
	ТекстЗапроса  = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, НаЧтоЗаменить);
	
	ЧтоЗаменить	  = "ПолеВыборки";
	НаЧтоЗаменить = ИмяИзмерения;
	ТекстЗапроса  = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, НаЧтоЗаменить);
	
	Владельцы = МетаданныеСправочника.Владельцы;
	
	Если Владельцы.Количество() = 0 Тогда
		НаЧтоЗаменить = "НЕОПРЕДЕЛЕНО";
	Иначе	
		НаЧтоЗаменить = "Таблица.Владелец";	
	КонецЕсли;
	ЧтоЗаменить	  = "&ПолеВладелец";
	ТекстЗапроса  = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, НаЧтоЗаменить);

	Если МетаданныеСправочника = Метаданные.Справочники.бит_ДополнительныеЗначенияАналитик Тогда
		ЧтоЗаменить	  = "&ВладелецЗначенийДопАналитик";
		НаЧтоЗаменить = "Таблица.Владелец = &" + ИмяИзмерения;
		ТекстЗапроса  = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, НаЧтоЗаменить);	
	Иначе	
		ЧтоЗаменить	  = "&ВладелецЗначенийДопАналитик";
		НаЧтоЗаменить = "ИСТИНА";
		ТекстЗапроса  = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, НаЧтоЗаменить);	
	КонецЕсли;
	
	ОписаниеТаблицы = Новый Структура("ИмяВременнойТаблицы, ИмяИзмерения, ТекстЗапроса, МетаданныеТаблицы", 
						ИмяВременнойТаблицы, ИмяИзмерения, ТекстЗапроса, МетаданныеСправочника);
						
	НомераТаблиц.Добавить(ОписаниеТаблицы);
	
КонецПроцедуры

Процедура ВывестиШапку(ДокументРезультат, Области, НастройкаФормы, Периоды) Экспорт
	
	НастройкиМакетаОформления = Области.НастройкиМакетаОформления;
	ОсновнойМакет 			  = Области.Макет;
		
	УчетПоКоличеству = НастройкаФормы.УчетКоличество;
	УчетПоСумме      = НастройкаФормы.УчетСумма;
	ВыводитьРесурсы  = (УчетПоКоличеству И УчетПоСумме);
	ИмяОбластиПериод = ?(ВыводитьРесурсы, "Заголовок_ПолеДубль", "Заголовок_Поле");

	ОтдельноеРасположениеПолейГруппировок = 
		(НастройкаФормы.РасположениеПолейГруппировок = Перечисления.бит_РасположениеПолейГруппировок.Отдельно);
		
	СпособЗаполненияРазворачивать = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать;							  
	Группировки					  = НастройкаФормы.СпособыЗаполнения[СпособЗаполненияРазворачивать];
	
	Если ОтдельноеРасположениеПолейГруппировок Тогда
		ВысотаШапки = ?(ВыводитьРесурсы, 2, 1); // Высота области с ресурсами 2. 
	Иначе	
		ВысотаШапки = Макс(?(ВыводитьРесурсы, 2, 1), Группировки.Количество());
	КонецЕсли;
	
	// Колонка кодификатор. 
	Если НастройкаФормы.ВыводитьКодификатор Тогда
		
		ОбластьМакета = ОсновнойМакет.ПолучитьОбласть(Области.Заголовок_Кодификатор);
		УстановитьОформлениеОбласти(ОбластьМакета, "ЗаголовокТаблицы", 0, НастройкиМакетаОформления);
		
		Если ВысотаШапки > 1 Тогда
			ОбластьЯчеек = ОбластьМакета.Область(1, 1, ВысотаШапки, 1);
			ОбластьЯчеек.Объединить();
			ОбластьЯчеек.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
			ОбластьЯчеек.ГраницаСнизу = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 1);					
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьМакета);
	КонецЕсли;
	
	// Имена измерений.
	Сборка = Новый ТабличныйДокумент;
	
	Для каждого Имя Из Группировки Цикл
		
		ОбластьМакета = ОсновнойМакет.ПолучитьОбласть(Области.Заголовок_Измерение);
		УстановитьОформлениеОбласти(ОбластьМакета, "ЗаголовокТаблицы", 0, НастройкиМакетаОформления);
		
		Если НастройкаФормы.ИспользоватьНаименованияСтатейБюджета И НастройкаФормы.Измерения[Имя].Имя = "СтатьяОборотов" Тогда
			ОбластьМакета.Параметры.ИмяИзмерения = НСтр("ru = 'Статьи бюджета'");
		Иначе	
			ОбластьМакета.Параметры.ИмяИзмерения = НастройкаФормы.Измерения[Имя].Синоним;
		КонецЕсли;   
				
		Если ОтдельноеРасположениеПолейГруппировок Тогда
			Если ВысотаШапки > 1 Тогда
				ОбластьЯчеек = ОбластьМакета.Область(1, 1, ВысотаШапки, 1);
				ОбластьЯчеек.Объединить();
				ОбластьЯчеек.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
				ОбластьЯчеек.ГраницаСнизу = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 1);					
			КонецЕсли;
			Если Сборка.ШиринаТаблицы = 0 Тогда
				Сборка.Вывести(ОбластьМакета); 
			Иначе	
				Сборка.Присоединить(ОбластьМакета);
			КонецЕсли;		
		Иначе	
			Если ВысотаШапки > 1 И Группировки.Количество() = 1 Тогда
				ОбластьЯчеек = ОбластьМакета.Область(1, 1, ВысотаШапки, 1);
				ОбластьЯчеек.Объединить();
				ОбластьЯчеек.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
				ОбластьЯчеек.ГраницаСнизу = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 1);
			КонецЕсли;
			Сборка.Вывести(ОбластьМакета);		
		КонецЕсли;
		
	КонецЦикла; 
	
	ОбластьДляВывода = Сборка.ПолучитьОбласть(1, 1, Сборка.ВысотаТаблицы, Сборка.ШиринаТаблицы); 
	
	Если ДокументРезультат.ШиринаТаблицы = 0 Тогда
		ДокументРезультат.Вывести(ОбластьДляВывода); 
	Иначе	
		ДокументРезультат.Присоединить(ОбластьДляВывода);
	КонецЕсли;
		
	НаКодификатор = ?(НастройкаФормы.ВыводитьКодификатор, 1, 0);
	ФиксацияСлева = 1;
	Если ОтдельноеРасположениеПолейГруппировок Тогда
		ФиксацияСлева = НастройкаФормы.КоличествоРазворачивать;
	КонецЕсли;
	
	// Фиксация области измерений.
	ДокументРезультат.ФиксацияСверху = ДокументРезультат.ВысотаТаблицы;
	ДокументРезультат.ФиксацияСлева  = ФиксацияСлева + НаКодификатор;
	
	Сборка 		  = Новый ТабличныйДокумент;
	ОбластьМакета = ОсновнойМакет.ПолучитьОбласть(Области[ИмяОбластиПериод]);
	УстановитьОформлениеОбласти(ОбластьМакета, "ЗаголовокТаблицы", 0, НастройкиМакетаОформления);
	
	ЦветТекста   = ОбластьМакета.Область(1, 1, 1, 1).ЦветТекста;
	ЦветФона     = ОбластьМакета.Область(1, 1, 1, 1).ЦветФона;
	ШрифтТекста  = ОбластьМакета.Область(1, 1, 1, 1).Шрифт;
	ГраницаСлева = ОбластьМакета.Область(1, 1, 1, 1).ГраницаСлева;
	
	НомерПериода  = 1;
	Индекс		  = 0;
	Для каждого ОписаниеПериода Из Периоды Цикл
		
		ОбластьМакета.Параметры.ИмяПоля = ОписаниеПериода.Синоним;
		ИмяЯчейки = "Период_" + Формат(НомерПериода, "ЧГ=");
		ВидЯчейки 	= бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБПериод();
		Расшифровка = бит_Бюджетирование.РасшифровкаЯчейки(ИмяЯчейки, Неопределено, ОписаниеПериода.Период, ВидЯчейки);
		Расшифровка.Периодичность = ОписаниеПериода.Периодичность;
		Расшифровка.ЦветФона 	  = ЦветФона;
		
		ОбластьЯчеек = ОбластьМакета.Область(1,1,1,1);
		ОбластьЯчеек.ИспользованиеРасшифровки = ИспользованиеРасшифровкиТабличногоДокумента.БезОбработки;
		ОбластьЯчеек.Имя = ИмяЯчейки;
		ОбластьЯчеек.Расшифровка = Расшифровка;
		
		Если ОписаниеПериода.ЭтоВыходной 
			 И НастройкаФормы.ОтображениеВыходных = Перечисления.бит_РежимыОтображенияВыходныхДнейФормыВвода.Выделять Тогда		
			 ОбластьЯчеек.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;			 
		Иначе			 
			 ОбластьЯчеек.ЦветТекста = ЦветТекста;			 
		КонецЕсли; 
		
		Если ОписаниеПериода.ВыделитьЗаголовок Тогда
			ОбластьЯчеек.Шрифт = Новый Шрифт(ОбластьЯчеек.Шрифт,,, Истина);	
		Иначе
			ОбластьЯчеек.Шрифт = Новый Шрифт(ШрифтТекста);
		КонецЕсли;
		
		Если ОписаниеПериода.ВыделитьЛевуюГраницу Тогда
			ОбластьЯчеек.ГраницаСлева = Новый Линия(ГраницаСлева.ТипЛинии, 3, ГраницаСлева.Отступ);	
		Иначе
			ОбластьЯчеек.ГраницаСлева = Новый Линия(ГраницаСлева.ТипЛинии, ГраницаСлева.Толщина, ГраницаСлева.Отступ);
		КонецЕсли;
		
		ВысотаОбласти = ?(ВыводитьРесурсы, 2, 1);
		ШиринаОбласти = ?(ВыводитьРесурсы, 2, 1);

		Если ВысотаОбласти < ВысотаШапки Тогда
			Если ВысотаОбласти = 1 Тогда
				НомерПервойСтроки = 1;
				НомерПоследнейСтроки = ВысотаШапки;
			Иначе	
				НомерПервойСтроки = 2; 
				НомерПоследнейСтроки = ВысотаШапки;
			КонецЕсли;
			
			ОбластьЯчеек = ОбластьМакета.Область(НомерПервойСтроки, 1, НомерПоследнейСтроки, 1);
			ОбластьЯчеек.Объединить();
			ОбластьЯчеек.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
			ОбластьЯчеек.ГраницаСнизу  = Новый Линия(ГраницаСлева.ТипЛинии, ГраницаСлева.Толщина, ГраницаСлева.Отступ);
			
			Если ШиринаОбласти > 1 Тогда
				ОбластьЯчеек = ОбластьМакета.Область(НомерПервойСтроки, ШиринаОбласти, НомерПоследнейСтроки, ШиринаОбласти);
				ОбластьЯчеек.Объединить();
				ОбластьЯчеек.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
				ОбластьЯчеек.ГраницаСнизу  = Новый Линия(ГраницаСлева.ТипЛинии, ГраницаСлева.Толщина, ГраницаСлева.Отступ);
			КонецЕсли;
		КонецЕсли;
		
		Если ВыводитьРесурсы Тогда
			ОбластьЯчеек = ОбластьМакета.Область(ВысотаШапки, 1, ВысотаШапки, 1);
			Если ОписаниеПериода.ВыделитьЛевуюГраницу Тогда
				ОбластьЯчеек.ГраницаСлева = Новый Линия(ГраницаСлева.ТипЛинии, 3, ГраницаСлева.Отступ);	
			Иначе
				ОбластьЯчеек.ГраницаСлева = Новый Линия(ГраницаСлева.ТипЛинии, ГраницаСлева.Толщина, ГраницаСлева.Отступ);
			КонецЕсли;
		КонецЕсли;

		Если Индекс = 0 Тогда
			Сборка.Вывести(ОбластьМакета);
		Иначе	
			Сборка.Присоединить(ОбластьМакета);
		КонецЕсли;
		Индекс = Индекс + 1;
		НомерПериода = НомерПериода + 1;
	КонецЦикла; 
	
	ОбластьДляВывода = Сборка.ПолучитьОбласть(1, 1, Сборка.ВысотаТаблицы, Сборка.ШиринаТаблицы); 
	ДокументРезультат.Присоединить(ОбластьДляВывода);

КонецПроцедуры

Процедура ВывестиГруппировки(ВладелецКоллекции, ДокументРезультат, Макеты, НастройкаФормы, Периоды) Экспорт
			
	НомерПоПорядку = 1;
	Если НастройкаФормы.РасположениеПолейГруппировок = Перечисления.бит_РасположениеПолейГруппировок.Отдельно Тогда
		ВывестиГруппировкиОтдельно(ВладелецКоллекции, ДокументРезультат, Макеты, НастройкаФормы, Периоды, НомерПоПорядку);
	Иначе	
		ВывестиГруппировкиВместе(ВладелецКоллекции, ДокументРезультат, Макеты, НастройкаФормы, Периоды, НомерПоПорядку);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиГруппировкиПериодов(ДокументРезультат, ИменаЯчеек, ПараметрыВывода)
		
	ОбластиМакета 		  = ПараметрыВывода.Области;
	Периоды 			  = ПараметрыВывода.Периоды;
	ЕстьПодчиненныеСтроки = ПараметрыВывода.ЕстьПодчиненныеСтроки;
	ЗначенияИзмерений 	  = ПараметрыВывода.ЗначенияИзмерений;
	ИдИзмерений 		  = ПараметрыВывода.ИдИзмерений;
	Коэффициент 		  = ПараметрыВывода.Коэффициент;
	НастройкаФормы 		  = ПараметрыВывода.НастройкаФормы;
	ОградитьОтрицательные = ПараметрыВывода.ОградитьОтрицательные;
	
	ИндексГруппировки	  = ПараметрыВывода.ИндексГруппировки;
	КоличествоГруппировок = ПараметрыВывода.КоличествоГруппировок;
	ЭтоКоллекция		  = ПараметрыВывода.ЭтоКоллекция;
	
	ОсновнойМакет 			  = ОбластиМакета.Макет;
	НастройкиМакетаОформления = ОбластиМакета.НастройкиМакетаОформления;	
	
	ВидыРасшифровокФВБ = бит_БюджетированиеКлиентСервер.ВидыРасшифровокФВБ();
	
	// Ячейки данных.
	ИмяСтрокиМакета = ?(ЕстьПодчиненныеСтроки, "СтрокаРасчетная", "Строка");
	ВидЯчейки  	    = ?(ЕстьПодчиненныеСтроки, ВидыРасшифровокФВБ.Формула, ВидыРасшифровокФВБ.Значение);

	ИспользоватьДваРесурса	 = (НастройкаФормы.УчетСумма И НастройкаФормы.УчетКоличество);
	
	Если ИспользоватьДваРесурса Тогда 
		ИмяКолонкиМакета = "ПолеДубль";
	Иначе	
		Если НастройкаФормы.УчетКоличество Тогда
			ИмяКолонкиМакета = "ПолеКоличество";
		Иначе	
			ИмяКолонкиМакета = "ПолеСумма";
		КонецЕсли;
	КонецЕсли;
	
	ИмяОбласти 	   = ИмяСтрокиМакета + "_" + ИмяКолонкиМакета;
	ИмяОбластиИтог = "СтрокаРасчетная_" + ИмяКолонкиМакета;
		
	Префиксы = Новый Структура;
	Префиксы.Вставить("ИмяСумма","СП");
	Префиксы.Вставить("ИмяКоличество","КП");
	
	Если НастройкаФормы.МестоИспользования = "бит_АктуализацияБюджета" Тогда
		Префиксы.Вставить("ИмяСуммаФакт","СФ");
		Префиксы.Вставить("ИмяКоличествоФакт","КФ");
	КонецЕсли;

	Аргументы	= Новый Структура;  // Хранит аргументы для формул.
	Имена		= Новый Структура;  // Хранит имена различных типов ячеек.
	Для каждого КлючЗначение Из Префиксы Цикл
		Аргументы.Вставить(КлючЗначение.Значение, Новый Массив);
		Имена.Вставить(КлючЗначение.Значение, "");
	КонецЦикла; 
	
	Для каждого ОписаниеПериода Из Периоды Цикл
		
		// Подготовка имен.
		Для каждого КлючЗначение Из Префиксы Цикл
			
			ТипИмени = КлючЗначение.Ключ;
			Префикс  = КлючЗначение.Значение;
			
			ТекИмяБезАналитики = ОписаниеПериода[ТипИмени];
			ТекИмяЯчейки	   = ТекИмяБезАналитики + "_" + ИдИзмерений;
			
			Имена[Префикс] = ТекИмяЯчейки;
			Если ИменаЯчеек[ТекИмяБезАналитики] = Неопределено Тогда
				ИменаЯчеек[ТекИмяБезАналитики] = Новый Массив;
			КонецЕсли; 
			Если Коэффициент <> 0 Тогда
				ИменаЯчеек[ТекИмяБезАналитики].Добавить(Новый Структура("Имя, Коэф", Имена[Префикс], Коэффициент));
			КонецЕсли;
			
			Если НЕ ОписаниеПериода.ЭтоИтог Тогда
				Аргументы[Префикс].Добавить(Имена[Префикс]);
			КонецЕсли;
			
		КонецЦикла; // Префиксы.
		
		Если ИспользоватьДваРесурса Тогда
			
			// Форма с двумя ресурсами.
			
			Если ОписаниеПериода.ЭтоИтог Тогда
				
				АдресНастройки = АдресНастройкиМакетаОформленияКолонок(ИндексГруппировки, КоличествоГруппировок, 
									ЭтоКоллекция, Истина);
													
				ИмяНастройкиМакетаОформления 	= АдресНастройки.ИмяНастройкиМакетаОформления;
				ИндексНастройкиМакетаОформления = АдресНастройки.ИндексНастройкиМакетаОформления;

				ОбластьЯчеек = ОсновнойМакет.ПолучитьОбласть(ОбластиМакета[ИмяОбластиИтог]);
				
				УстановитьОформлениеОбласти(ОбластьЯчеек, ИмяНастройкиМакетаОформления, 
					ИндексНастройкиМакетаОформления, НастройкиМакетаОформления);
					
				ЦветФона = ОбластьЯчеек.Область(1, 1, 1, 1).ЦветФона;				
				
				ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
				ПараметрыДоработки.ТД 			   = ОбластьЯчеек;
				ПараметрыДоработки.НомСтроки 	   = 1;
				ПараметрыДоработки.НомСтолбца 	   = 1;
				ПараметрыДоработки.Имя 			   = Имена.КП;
				ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
				ПараметрыДоработки.ОписаниеПериода = ОписаниеПериода;
				ПараметрыДоработки.Вид 			   = ВидыРасшифровокФВБ.Формула;
				ПараметрыДоработки.Аргументы 	   = Аргументы.КП;
				ПараметрыДоработки.СмежныеОбласти  = Имена;
				ПараметрыДоработки.ЦветФона		   = ЦветФона;	
				
				Ячейка = ОбластьЯчеек.Область(1, 1, 1, 1);
				бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Ячейка);
				бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
				
				Если ОписаниеПериода.ВыделитьЛевуюГраницу Тогда
					Ячейка.ГраницаСлева = Новый Линия(Ячейка.ГраницаСлева.ТипЛинии, 3, Ячейка.ГраницаСлева.Отступ);			
				КонецЕсли;

				ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
				ПараметрыДоработки.ТД 			   = ОбластьЯчеек;
				ПараметрыДоработки.НомСтроки 	   = 1;
				ПараметрыДоработки.НомСтолбца 	   = 2;
				ПараметрыДоработки.Имя 			   = Имена.СП;
				ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
				ПараметрыДоработки.ОписаниеПериода = ОписаниеПериода;
				ПараметрыДоработки.Вид 			   = ВидыРасшифровокФВБ.Формула;
				ПараметрыДоработки.Аргументы 	   = Аргументы.СП;
				ПараметрыДоработки.СмежныеОбласти  = Имена;
				ПараметрыДоработки.ЦветФона		   = ЦветФона;
				
				Ячейка = ОбластьЯчеек.Область(1, 2, 1, 2);
				бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Ячейка);
				бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
				
				Если НастройкаФормы.МестоИспользования = "бит_АктуализацияБюджета" Тогда
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = ОбластьЯчеек;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = Имена.КФ;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ОписаниеПериода;
					ПараметрыДоработки.Вид 			   = ВидыРасшифровокФВБ.Формула;
					ПараметрыДоработки.Аргументы 	   = Аргументы.КФ;
					ПараметрыДоработки.СмежныеОбласти  = Имена;
					ПараметрыДоработки.ЦветФона		   = ЦветФона;
					
					Ячейка = ОбластьЯчеек.Область(2, 1, 2, 1);
					бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Ячейка);
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
				
					Если ОписаниеПериода.ВыделитьЛевуюГраницу Тогда
						Ячейка.ГраницаСлева = Новый Линия(Ячейка.ГраницаСлева.ТипЛинии, 3, Ячейка.ГраницаСлева.Отступ);			
					КонецЕсли;

					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = ОбластьЯчеек;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 2;
					ПараметрыДоработки.Имя 			   = Имена.СФ;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ОписаниеПериода;
					ПараметрыДоработки.Вид 			   = ВидыРасшифровокФВБ.Формула;
					ПараметрыДоработки.Аргументы 	   = Аргументы.СФ;
					ПараметрыДоработки.СмежныеОбласти  = Имена;
					ПараметрыДоработки.ЦветФона		   = ЦветФона;
					
					Ячейка = ОбластьЯчеек.Область(2, 2, 2, 2);
					бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Ячейка);
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);										
				КонецЕсли;
				ДокументРезультат.Присоединить(ОбластьЯчеек);					
			Иначе	
				
				// Колонки для ввода данных.
				ОбластьЯчеек = ОсновнойМакет.ПолучитьОбласть(ОбластиМакета[ИмяОбласти]);
				
				АдресНастройки = АдресНастройкиМакетаОформленияКолонок(ИндексГруппировки, КоличествоГруппировок, 
									ЭтоКоллекция, Ложь);
													
				ИмяНастройкиМакетаОформления 	= АдресНастройки.ИмяНастройкиМакетаОформления;
				ИндексНастройкиМакетаОформления = АдресНастройки.ИндексНастройкиМакетаОформления;
				
				УстановитьОформлениеОбласти(ОбластьЯчеек, ИмяНастройкиМакетаОформления, 
					ИндексНастройкиМакетаОформления, НастройкиМакетаОформления);

				ЦветФона = ОбластьЯчеек.Область(1, 1, 1, 1).ЦветФона;
				
				ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
				ПараметрыДоработки.ТД 			   = ОбластьЯчеек;
				ПараметрыДоработки.НомСтроки 	   = 1;
				ПараметрыДоработки.НомСтолбца 	   = 1;
				ПараметрыДоработки.Имя 			   = Имена.КП;
				ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
				ПараметрыДоработки.ОписаниеПериода = ОписаниеПериода;
				ПараметрыДоработки.Вид 			   = ВидЯчейки;
				ПараметрыДоработки.СмежныеОбласти  = Имена;
				ПараметрыДоработки.ЦветФона		   = ЦветФона;
				
				Ячейка = ОбластьЯчеек.Область(1, 1, 1, 1);
				бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Ячейка);
				бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
				
				Если ОписаниеПериода.ВыделитьЛевуюГраницу Тогда
					Ячейка.ГраницаСлева = Новый Линия(Ячейка.ГраницаСлева.ТипЛинии, 3, Ячейка.ГраницаСлева.Отступ);			
				КонецЕсли;
				
				ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
				ПараметрыДоработки.ТД 			   = ОбластьЯчеек;
				ПараметрыДоработки.НомСтроки 	   = 1;
				ПараметрыДоработки.НомСтолбца 	   = 2;
				ПараметрыДоработки.Имя 			   = Имена.СП;
				ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
				ПараметрыДоработки.ОписаниеПериода = ОписаниеПериода;
				ПараметрыДоработки.Вид 			   = ВидЯчейки;
				ПараметрыДоработки.СмежныеОбласти  = Имена;
				ПараметрыДоработки.ЦветФона		   = ЦветФона;
				
				Ячейка = ОбластьЯчеек.Область(1, 2, 1, 2);
				бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Ячейка);
				бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
								
				Если НастройкаФормы.МестоИспользования = "бит_АктуализацияБюджета" Тогда
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = ОбластьЯчеек;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = Имена.КФ;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ОписаниеПериода;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					ПараметрыДоработки.СмежныеОбласти  = Имена;
					ПараметрыДоработки.ЦветФона		   = ЦветФона;
					
					Ячейка = ОбластьЯчеек.Область(2, 1, 2, 1);
					бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Ячейка);
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);					
					
					Если ОписаниеПериода.ВыделитьЛевуюГраницу Тогда
						Ячейка.ГраницаСлева = Новый Линия(Ячейка.ГраницаСлева.ТипЛинии, 3, Ячейка.ГраницаСлева.Отступ);			
					КонецЕсли;
				
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = ОбластьЯчеек;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 2;
					ПараметрыДоработки.Имя 			   = Имена.СФ;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ОписаниеПериода;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					ПараметрыДоработки.СмежныеОбласти  = Имена;
					ПараметрыДоработки.ЦветФона		   = ЦветФона;
					
					Ячейка = ОбластьЯчеек.Область(2, 2, 2, 2);
					бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Ячейка);
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
				КонецЕсли;
				ДокументРезультат.Присоединить(ОбластьЯчеек);
			КонецЕсли; 
		Иначе	
			
			// Форма с одним ресурсом.
			ИмяЯчейки = ?(НастройкаФормы.УчетКоличество, Имена.КП, Имена.СП);
			
			ИмяЯчейкиФакт = "";
			Если НастройкаФормы.МестоИспользования = "бит_АктуализацияБюджета" Тогда
				ИмяЯчейкиФакт = ?(НастройкаФормы.УчетКоличество, Имена.КФ, Имена.СФ);
			КонецЕсли;
			
			Если ОписаниеПериода.ЭтоИтог Тогда
				
				АдресНастройки = АдресНастройкиМакетаОформленияКолонок(ИндексГруппировки, КоличествоГруппировок, 
									ЭтоКоллекция, Истина);
													
				ИмяНастройкиМакетаОформления 	= АдресНастройки.ИмяНастройкиМакетаОформления;
				ИндексНастройкиМакетаОформления = АдресНастройки.ИндексНастройкиМакетаОформления;

				ОбластьЯчеек = ОсновнойМакет.ПолучитьОбласть(ОбластиМакета[ИмяОбластиИтог]);
				УстановитьОформлениеОбласти(ОбластьЯчеек, ИмяНастройкиМакетаОформления, 
					ИндексНастройкиМакетаОформления, НастройкиМакетаОформления);

				ЦветФона = ОбластьЯчеек.Область(1, 1, 1, 1).ЦветФона;
				
				ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
				ПараметрыДоработки.ТД 			   = ОбластьЯчеек;
				ПараметрыДоработки.НомСтроки 	   = 1;
				ПараметрыДоработки.НомСтолбца 	   = 1;
				ПараметрыДоработки.Имя 			   = ИмяЯчейки;
				ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
				ПараметрыДоработки.ОписаниеПериода = ОписаниеПериода;
				ПараметрыДоработки.Вид 			   = ВидыРасшифровокФВБ.Формула;
				ПараметрыДоработки.Аргументы 	   = ?(НастройкаФормы.УчетКоличество, Аргументы.КП, Аргументы.СП);
				ПараметрыДоработки.СмежныеОбласти  = Имена;
				ПараметрыДоработки.ЦветФона		   = ЦветФона;
				
				Ячейка = ОбластьЯчеек.Область(1, 1, 1, 1);
				бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Ячейка);
				бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
				
				Если ОписаниеПериода.ВыделитьЛевуюГраницу Тогда
					Ячейка.ГраницаСлева = Новый Линия(Ячейка.ГраницаСлева.ТипЛинии, 3, Ячейка.ГраницаСлева.Отступ);			
				КонецЕсли;

				Если НастройкаФормы.МестоИспользования = "бит_АктуализацияБюджета" Тогда
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = ОбластьЯчеек;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = ИмяЯчейкиФакт;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ОписаниеПериода;
					ПараметрыДоработки.Вид 			   = ВидыРасшифровокФВБ.Формула;
					ПараметрыДоработки.Аргументы 	   = ?(НастройкаФормы.УчетКоличество, Аргументы.КФ, Аргументы.СФ);
					ПараметрыДоработки.СмежныеОбласти  = Имена;
					ПараметрыДоработки.ЦветФона		   = ЦветФона;
					
					Ячейка = ОбластьЯчеек.Область(2, 1, 2, 1);
					бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Ячейка);
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					Если ОписаниеПериода.ВыделитьЛевуюГраницу Тогда
						Ячейка.ГраницаСлева = Новый Линия(Ячейка.ГраницаСлева.ТипЛинии, 3, Ячейка.ГраницаСлева.Отступ);			
					КонецЕсли;
				КонецЕсли;
				ДокументРезультат.Присоединить(ОбластьЯчеек);
			Иначе	
				
				АдресНастройки = АдресНастройкиМакетаОформленияКолонок(ИндексГруппировки, КоличествоГруппировок, 
									ЭтоКоллекция, Ложь);
													
				ИмяНастройкиМакетаОформления 	= АдресНастройки.ИмяНастройкиМакетаОформления;
				ИндексНастройкиМакетаОформления = АдресНастройки.ИндексНастройкиМакетаОформления;
				
				ОбластьЯчеек = ОсновнойМакет.ПолучитьОбласть(ОбластиМакета[ИмяОбласти]);
				УстановитьОформлениеОбласти(ОбластьЯчеек, ИмяНастройкиМакетаОформления, 
					ИндексНастройкиМакетаОформления, НастройкиМакетаОформления);

				ЦветФона = ОбластьЯчеек.Область(1, 1, 1, 1).ЦветФона;
				
				ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
				ПараметрыДоработки.ТД 			   = ОбластьЯчеек;
				ПараметрыДоработки.НомСтроки 	   = 1;
				ПараметрыДоработки.НомСтолбца 	   = 1;
				ПараметрыДоработки.Имя 			   = ИмяЯчейки;
				ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
				ПараметрыДоработки.ОписаниеПериода = ОписаниеПериода;
				ПараметрыДоработки.Вид 			   = ВидЯчейки;
				ПараметрыДоработки.СмежныеОбласти  = Имена;
				ПараметрыДоработки.ЦветФона		   = ЦветФона;
				
				Ячейка = ОбластьЯчеек.Область(1, 1, 1, 1);
				бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Ячейка);
				бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
				
				Если ОписаниеПериода.ВыделитьЛевуюГраницу Тогда
					Ячейка.ГраницаСлева = Новый Линия(Ячейка.ГраницаСлева.ТипЛинии, 3, Ячейка.ГраницаСлева.Отступ);			
				КонецЕсли;
				
				Если НастройкаФормы.МестоИспользования = "бит_АктуализацияБюджета" Тогда
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = ОбластьЯчеек;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = ИмяЯчейкиФакт;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ОписаниеПериода;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					ПараметрыДоработки.СмежныеОбласти  = Имена;
					ПараметрыДоработки.ЦветФона		   = ЦветФона;
					
					Ячейка = ОбластьЯчеек.Область(2, 1, 2, 1);
					бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Ячейка);
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					Если ОписаниеПериода.ВыделитьЛевуюГраницу Тогда
						Ячейка.ГраницаСлева = Новый Линия(Ячейка.ГраницаСлева.ТипЛинии, 3, Ячейка.ГраницаСлева.Отступ);			
					КонецЕсли;
				КонецЕсли;
				ДокументРезультат.Присоединить(ОбластьЯчеек);
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ВывестиГруппировкиОтдельно(ВладелецКоллекции, ДокументРезультат, Макеты, НастройкаФормы, Периоды, НомерПоПорядку) 
	
	ИменаЯчеек = Новый Соответствие;
	
	Области					  = Макеты;
	ОсновнойМакет 			  = Макеты.Макет;
	НастройкиМакетаОформления = Макеты.НастройкиМакетаОформления;
	
	СпособЗаполненияРазворачивать = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать;
	Группировки 				  = НастройкаФормы.СпособыЗаполнения[СпособЗаполненияРазворачивать];
	КоличествоГруппировок		  = Группировки.Количество();
	ЭтоНастройкаПоБюджету		  = ЗначениеЗаполнено(НастройкаФормы.Бюджет);
	ИспользоватьКоэффициенты	  = НастройкаФормы.ИспользоватьКоэффициенты;
	
	ВыведеноЭлементов   = 0;
	КоличествоЭлементов = ВладелецКоллекции.Строки.Количество();

	Для каждого СтрокаДерева Из ВладелецКоллекции.Строки Цикл
		
		Уровень = СтрокаДерева.Уровень();
		ЕстьПодчиненныеСтроки = (СтрокаДерева.Строки.Количество() > 0);
		// Если настройка не по бюджету, коэффициент всегда 1.
		// Для настройки по бюджету, для групп коэффициент 1, для статей берем указанный в статье.
		Коэффициент = 1;
		Если ИспользоватьКоэффициенты Тогда
			ИмяПоляКоэффициентСтатьиБюджета = "СтатьяОборотовКоэффициент";
			СвойствоСтроки = Новый Структура(ИмяПоляКоэффициентСтатьиБюджета);
			ЗаполнитьЗначенияСвойств(СвойствоСтроки, СтрокаДерева);
			
			Если СвойствоСтроки.СтатьяОборотовКоэффициент <> Неопределено Тогда
				Коэффициент =  СвойствоСтроки.СтатьяОборотовКоэффициент;
			КонецЕсли;
		КонецЕсли;
				
		// Измерения.
		ЗначенияИзмерений = Новый Структура;
		ИдИзмерений 	  = "";
		ЭтоКоллекция 	  = СтрокаДерева[Группировки[0] + "ЭтоКоллекция"];
		ИндексГруппировки = Группировки.Найти(СтрокаДерева.ИмяИзмерения);
		
		Если ЭтоКоллекция = Неопределено Тогда
			// Особенности рассчета "вычисляемых полей" СКД в группировке неиерархческого справочника.
			ЭтоКоллекция = Ложь;		
		КонецЕсли;
		
		АдресНастройки = АдресНастройкиМакетаОформленияСтрок(ИндексГруппировки, КоличествоГруппировок, ЭтоКоллекция);
		ИмяНастройкиМакетаОформления	= АдресНастройки.ИмяНастройкиМакетаОформления;
		ИндексНастройкиМакетаОформления = АдресНастройки.ИндексНастройкиМакетаОформления;
		
		Сч = 1;
		Для каждого ИмяПоляГруппировки Из Группировки Цикл			
			
			ТекЗначение			  = СтрокаДерева[ИмяПоляГруппировки + "ПараметрРасшифровки"];
			ПредставлениеЗначения = СтрокаДерева[ИмяПоляГруппировки + "Представление"];

			Если ЗначениеЗаполнено(ТекЗначение) Тогда
				ЗначенияИзмерений.Вставить(ИмяПоляГруппировки, ТекЗначение);		
			КонецЕсли;
			
			Если Сч = 1 И НастройкаФормы.ВыводитьКодификатор Тогда
				// Вывод кодификатора для первого измерения.
				// Если группировок > 1 на уровне детальных записей кодификатор не выводим.
				Если КоличествоГруппировок > 1 И НЕ ЕстьПодчиненныеСтроки Тогда
					Кодификатор = "";
				Иначе	
					Кодификатор = СтрокаДерева[ИмяПоляГруппировки + "Шифроник"];
				КонецЕсли;
				
				//ОбластьМакета = Области.Строка_Кодификатор;
				ОбластьМакета = ОсновнойМакет.ПолучитьОбласть(Области.Строка_Кодификатор);
				УстановитьОформлениеОбласти(ОбластьМакета, ИмяНастройкиМакетаОформления, 
					ИндексНастройкиМакетаОформления, НастройкиМакетаОформления);
					
				ОбластьМакета.Параметры.Кодификатор = Кодификатор;
				ОбластьМакета.Параметры.р			= Новый Структура("Уровень", Уровень);
				ДокументРезультат.Вывести(ОбластьМакета, Уровень);
			КонецЕсли; 

			ИдИзмерений = ИдентификаторРасшифровки(ЗначенияИзмерений,, Уровень);
			ИмяЯчейки	= бит_Бюджетирование.ИмяОбластиИзмерение(ИмяПоляГруппировки, НомерПоПорядку);
			ВидЯчейки 	= бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБИзмерение();
			Расшифровка = бит_Бюджетирование.РасшифровкаЯчейки(ИмяЯчейки, Неопределено, Неопределено,
							ВидЯчейки, ,ТекЗначение);
			
			ОбластьМакета = ОсновнойМакет.ПолучитьОбласть(Области.Строка_Измерение);
			
			УстановитьОформлениеОбласти(ОбластьМакета, ИмяНастройкиМакетаОформления, 
				ИндексНастройкиМакетаОформления, НастройкиМакетаОформления);
			
			ОбластьЯчеек = ОбластьМакета.Область(1, 1, 1, 1);
			
			Расшифровка.ЦветФона = ОбластьЯчеек.ЦветФона;
			
			Если Сч = 1 Тогда
				ОбластьЯчеек.Отступ = Уровень;
			КонецЕсли;
			
			ОбластьЯчеек.Имя						  = ИмяЯчейки;
			ОбластьМакета.Параметры.ЗначениеИзмерения = ПредставлениеЗначения;
			ОбластьМакета.Параметры.р 				  = Расшифровка; 
			
			Если Сч = 1 И НЕ НастройкаФормы.ВыводитьКодификатор Тогда
				ДокументРезультат.Вывести(ОбластьМакета, Уровень);
           	Иначе
				ДокументРезультат.Присоединить(ОбластьМакета, Уровень);
			КонецЕсли;                                                 
						
			Сч = Сч +1;
		КонецЦикла;  // По именам измерений.
		
		ВыведеноЭлементов = ВыведеноЭлементов + 1;	

		Если ВыведеноЭлементов = КоличествоЭлементов И КоличествоЭлементов > 1 И НЕ ЕстьПодчиненныеСтроки И КоличествоГруппировок > 1 Тогда
			НомерПервойСтроки   = ДокументРезультат.ВысотаТаблицы - ВыведеноЭлементов + 1;
			
			ОбъединяемаяОбласть	= ДокументРезультат.Область(НомерПервойСтроки, 1, ДокументРезультат.ВысотаТаблицы, 1);
			ОбъединяемаяОбласть.Объединить();
			ОбъединяемаяОбласть.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
			
			Если НастройкаФормы.ВыводитьКодификатор Тогда
				ОбъединяемаяОбласть	= ДокументРезультат.Область(НомерПервойСтроки, 2, ДокументРезультат.ВысотаТаблицы, 2);
				ОбъединяемаяОбласть.Объединить();
				ОбъединяемаяОбласть.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
			КонецЕсли;
		КонецЕсли;

		ПараметрыВывода = НовыеПараметрыВыводаПериодов();
		ПараметрыВывода.Области 			  = Области;
		ПараметрыВывода.Периоды				  = Периоды;
		ПараметрыВывода.ЕстьПодчиненныеСтроки = ЕстьПодчиненныеСтроки;
		ПараметрыВывода.ЗначенияИзмерений	  =	ЗначенияИзмерений;
		ПараметрыВывода.ИдИзмерений 		  = ИдИзмерений;
		ПараметрыВывода.Коэффициент			  = Коэффициент;
		ПараметрыВывода.НастройкаФормы		  = НастройкаФормы;
		
		ПараметрыВывода.ИндексГруппировки	  = ИндексГруппировки;
		ПараметрыВывода.КоличествоГруппировок = КоличествоГруппировок;
		ПараметрыВывода.ЭтоКоллекция 		  = ЭтоКоллекция;
		ПараметрыВывода.ОградитьОтрицательные = НастройкаФормы.ИспользоватьКоэффициенты;
		
		ВывестиГруппировкиПериодов(ДокументРезультат, ИменаЯчеек, ПараметрыВывода);
			
		НомерПоПорядку = НомерПоПорядку + 1;	
		
		ИменаПодчиненныхЯчеек = ВывестиГруппировкиОтдельно(СтрокаДерева, ДокументРезультат, Макеты, НастройкаФормы, Периоды, НомерПоПорядку);
		
		// Установим формулы для вычисления итогов по группам.
		Если ИменаПодчиненныхЯчеек.Количество() > 0 Тогда
			Для каждого ТекОписание Из Периоды Цикл
				Если НастройкаФормы.УчетКоличество Тогда
					
					бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ДокументРезультат, ИменаПодчиненныхЯчеек,
						ТекОписание.ИмяКоличество, ИдИзмерений);
						
					Если НастройкаФормы.МестоИспользования = "бит_АктуализацияБюджета" Тогда
						бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ДокументРезультат, ИменаПодчиненныхЯчеек,
							ТекОписание.ИмяКоличествоФакт, ИдИзмерений);
					КонецЕсли;					
				КонецЕсли; 
				
				Если НастройкаФормы.УчетСумма Тогда
					бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ДокументРезультат, ИменаПодчиненныхЯчеек,
						ТекОписание.ИмяСумма, ИдИзмерений);
					
					Если НастройкаФормы.МестоИспользования = "бит_АктуализацияБюджета" Тогда
						бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ДокументРезультат, ИменаПодчиненныхЯчеек,
						ТекОписание.ИмяСуммаФакт, ИдИзмерений);
					КонецЕсли;					
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
	КонецЦикла; // По строкам дерева данного уровня.
		
	Возврат ИменаЯчеек;
	
КонецФункции

Функция ВывестиГруппировкиВместе(ВладелецКоллекции, ДокументРезультат, Макеты, НастройкаФормы, Периоды, НомерПоПорядку)
	
	ИменаЯчеек = Новый Соответствие;
	
	Области					  = Макеты;
	ОсновнойМакет 			  = Макеты.Макет;
	НастройкиМакетаОформления = Макеты.НастройкиМакетаОформления;
	
	СпособЗаполненияРазворачивать = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать;
	Группировки 				  = НастройкаФормы.СпособыЗаполнения[СпособЗаполненияРазворачивать];
	КоличествоГруппировок 		  = Группировки.Количество(); 
	ЭтоНастройкаПоБюджету   	  = ЗначениеЗаполнено(НастройкаФормы.Бюджет);
	ИспользоватьКоэффициенты 	  = НастройкаФормы.ИспользоватьКоэффициенты;
			
	Для каждого СтрокаДерева Из ВладелецКоллекции.Строки Цикл
	
		Уровень				  = СтрокаДерева.Уровень();
		ЕстьПодчиненныеСтроки = (СтрокаДерева.Строки.Количество() > 0);
		
		// Если настройка не по бюджету, коэффициент всегда 1.
		// Для настройки по бюджету, для групп коэффициент 1, для статей берем указанный в статье.
		Коэффициент = 1;
		Если ИспользоватьКоэффициенты Тогда
			ИмяПоляКоэффициентСтатьиБюджета = "СтатьяОборотовКоэффициент";
			СвойствоСтроки = Новый Структура(ИмяПоляКоэффициентСтатьиБюджета);
			ЗаполнитьЗначенияСвойств(СвойствоСтроки, СтрокаДерева);
			
			Если СвойствоСтроки.СтатьяОборотовКоэффициент <> Неопределено Тогда
				Коэффициент =  СвойствоСтроки.СтатьяОборотовКоэффициент;
			КонецЕсли;
		КонецЕсли;
		
		ИмяПоляГруппировки 	  = СтрокаДерева.ИмяИзмерения;
		ТекЗначение			  = СтрокаДерева[ИмяПоляГруппировки + "ПараметрРасшифровки"];
		ЭтоКоллекция 		  = СтрокаДерева[ИмяПоляГруппировки + "ЭтоКоллекция"];
		ПредставлениеЗначения = СтрокаДерева[ИмяПоляГруппировки + "Представление"];
		ИндексГруппировки 	  = Группировки.Найти(ИмяПоляГруппировки);
		
		Если ЭтоКоллекция = Неопределено Тогда
			// Особенности рассчета "вычисляемых полей" СКД в группировке неиерархческого справочника.
			ЭтоКоллекция = Ложь;		
		КонецЕсли;
		
		АдресНастройки = АдресНастройкиМакетаОформленияСтрок(ИндексГруппировки, КоличествоГруппировок, ЭтоКоллекция);
		ИмяНастройкиМакетаОформления	= АдресНастройки.ИмяНастройкиМакетаОформления;
		ИндексНастройкиМакетаОформления = АдресНастройки.ИндексНастройкиМакетаОформления;

		// Измерения.
		ЗначенияИзмерений = Новый Структура;
		ИдИзмерений		  = "";		
		
		Если НастройкаФормы.ВыводитьКодификатор Тогда				

			ОбластьМакета = ОсновнойМакет.ПолучитьОбласть(Области.Строка_Кодификатор);
			УстановитьОформлениеОбласти(ОбластьМакета, ИмяНастройкиМакетаОформления, 
				ИндексНастройкиМакетаОформления, НастройкиМакетаОформления);
			
			ОбластьМакета.Параметры.Кодификатор = СтрокаДерева[ИмяПоляГруппировки + "Шифроник"];
			ОбластьМакета.Параметры.р			= Новый Структура("Уровень", Уровень);
			
			ОбластьЯчеек = ОбластьМакета.Область(1, 1, 1, 1);
				
			ДокументРезультат.Вывести(ОбластьМакета, Уровень);
		КонецЕсли; 
		
		Для каждого ИмяПоля Из Группировки Цикл
			ЗначениеПоля = СтрокаДерева[ИмяПоля + "ПараметрРасшифровки"];
			Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
				ЗначенияИзмерений.Вставить(ИмяПоля, ЗначениеПоля);
			КонецЕсли;
		КонецЦикла;
		
		 // NB:	Добавление последнего параметра нужно чтобы избежать повторения контрольной суммы из которой формируется имя ячейки.
		 //     Например ЦФО. Элемент, имеющий подчиненные элементы в макете встречается дважды: как группировка и как детальная запись. 
		 //     Опыт с подстановкой уровня группировки привел к чувствительности изменения архитектуры групп/элементов в рамках справочника.
		 //     Стало изменяться имя ячейки, "поплыли" пользовательские формулы.
		 //     Подстановка информации о наличии подчиненных строк решила проблему. 
		 //     Справочники с иерархией групп и элементов не изменят эту информацию для элементов, 
		 //		а иерархия элементов очень хорошо отработала. При добавлении подчиненных элементов или перемещении по иерархии
		 //     формулы восстанавливаются.
		 //	    Так не работает: бит_ВводБюджета.ИдентификаторРасшифровки(ЗначенияИзмерений,, Уровень);
		
		ИдИзмерений = бит_ВводБюджета.ИдентификаторРасшифровки(ЗначенияИзмерений,, ЕстьПодчиненныеСтроки); 
		ИмяЯчейки	= бит_Бюджетирование.ИмяОбластиИзмерение(ИмяПоляГруппировки, НомерПоПорядку);
		ВидЯчейки 	= бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБИзмерение();
		Расшифровка = бит_Бюджетирование.РасшифровкаЯчейки(ИмяЯчейки, Неопределено, Неопределено,
						ВидЯчейки, ,ТекЗначение);
		
		
		ОбластьМакета = ОсновнойМакет.ПолучитьОбласть(Области.Строка_Измерение);
		УстановитьОформлениеОбласти(ОбластьМакета, ИмяНастройкиМакетаОформления, 
				ИндексНастройкиМакетаОформления, НастройкиМакетаОформления);	
		
		ОбластьЯчеек = ОбластьМакета.Область(1, 1, 1, 1);
		ОбластьЯчеек.Отступ  = Уровень;
		ОбластьЯчеек.Имя	 = ИмяЯчейки;
		Расшифровка.ЦветФона = ОбластьЯчеек.ЦветФона;
		ОбластьМакета.Параметры.ЗначениеИзмерения = ПредставлениеЗначения;
		ОбластьМакета.Параметры.р 				  = Расшифровка; 
		
		Если НастройкаФормы.ВыводитьКодификатор Тогда
			ДокументРезультат.Присоединить(ОбластьМакета, Уровень);
		Иначе	
			ДокументРезультат.Вывести(ОбластьМакета, Уровень);
		КонецЕсли;
		
		ПараметрыВывода = НовыеПараметрыВыводаПериодов();
		ПараметрыВывода.Области 			  = Области;
		ПараметрыВывода.Периоды				  = Периоды;
		ПараметрыВывода.ЕстьПодчиненныеСтроки = ЕстьПодчиненныеСтроки;
		ПараметрыВывода.ЗначенияИзмерений	  =	ЗначенияИзмерений;
		ПараметрыВывода.ИдИзмерений 		  = ИдИзмерений;
		ПараметрыВывода.Коэффициент			  = Коэффициент;
		ПараметрыВывода.НастройкаФормы		  = НастройкаФормы;

		ПараметрыВывода.ИндексГруппировки	  = ИндексГруппировки;
		ПараметрыВывода.КоличествоГруппировок = КоличествоГруппировок;
		ПараметрыВывода.ЭтоКоллекция 		  = ЭтоКоллекция;
		ПараметрыВывода.ОградитьОтрицательные = НастройкаФормы.ИспользоватьКоэффициенты;
		
		ВывестиГруппировкиПериодов(ДокументРезультат, ИменаЯчеек, ПараметрыВывода);
		
		НомерПоПорядку = НомерПоПорядку + 1;	
		
		ИменаПодчиненныхЯчеек = ВывестиГруппировкиВместе(СтрокаДерева, ДокументРезультат, Макеты, НастройкаФормы, Периоды, НомерПоПорядку);

		// Установим формулы для вычисления итогов по группам.
		Если ИменаПодчиненныхЯчеек.Количество() > 0 Тогда
			Для каждого ТекОписание Из Периоды Цикл
				Если НастройкаФормы.УчетКоличество Тогда
					
					бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ДокументРезультат, ИменаПодчиненныхЯчеек,
						ТекОписание.ИмяКоличество, ИдИзмерений);
						
					Если НастройкаФормы.МестоИспользования = "бит_АктуализацияБюджета" Тогда
						бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ДокументРезультат, ИменаПодчиненныхЯчеек,
							ТекОписание.ИмяКоличествоФакт, ИдИзмерений);
					КонецЕсли;					
				КонецЕсли; 
				
				Если НастройкаФормы.УчетСумма Тогда
					бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ДокументРезультат, ИменаПодчиненныхЯчеек,
						ТекОписание.ИмяСумма, ИдИзмерений);
					
					Если НастройкаФормы.МестоИспользования = "бит_АктуализацияБюджета" Тогда
						бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ДокументРезультат, ИменаПодчиненныхЯчеек,
						ТекОписание.ИмяСуммаФакт, ИдИзмерений);
					КонецЕсли;					
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИменаЯчеек;
	
КонецФункции

Функция НовыеПараметрыВыводаПериодов()

	ПараметрыВывода = Новый Структура;
	ПараметрыВывода.Вставить("Области");
	ПараметрыВывода.Вставить("Периоды");
	ПараметрыВывода.Вставить("ЕстьПодчиненныеСтроки");
	ПараметрыВывода.Вставить("ЗначенияИзмерений");
	ПараметрыВывода.Вставить("ИдИзмерений");
	ПараметрыВывода.Вставить("Коэффициент");
	ПараметрыВывода.Вставить("НастройкаФормы");
	ПараметрыВывода.Вставить("ОградитьОтрицательные");
	ПараметрыВывода.Вставить("ИндексГруппировки");
	ПараметрыВывода.Вставить("КоличествоГруппировок");
	ПараметрыВывода.Вставить("ЭтоКоллекция");
	
	Возврат ПараметрыВывода;

КонецФункции

Функция ЗначенияГруппировок(РезультатСКД, Настройки)

	// ++ NB После реализации хранилища расшифровок, получать данные из хранилища.
	
	НастройкаСтруктурыБюджета = Настройки.НастройкаСтруктурыБюджета;
	ЗначенияГруппировок = Новый Структура;
	Для каждого ИмяГруппировки Из НастройкаСтруктурыБюджета Цикл
		ЗначенияГруппировок.Вставить(ИмяГруппировки.Имя, Новый Массив);		
	КонецЦикла;	

	Стек = Новый Массив; 
	Для каждого СтрокаТаблицы Из РезультатСКД.Строки Цикл
		
		Стек.Добавить(СтрокаТаблицы);
	
		Пока Стек.Количество() > 0 Цикл
			
			ТекущийОбъект = Стек.Получить(Стек.ВГраница());
			Стек.Удалить(Стек.ВГраница());
			
			Для каждого КлючЗначение Из ЗначенияГруппировок Цикл
				Значение = ТекущийОбъект[КлючЗначение.Ключ + "ПараметрРасшифровки"];
				Если ЗначениеЗаполнено(Значение) Тогда
					КлючЗначение.Значение.Добавить(Значение);
				КонецЕсли;
			КонецЦикла;
			
			Для каждого Элемент Из ТекущийОбъект.Строки Цикл
				Стек.Добавить(Элемент);
			КонецЦикла; 
		КонецЦикла;
	КонецЦикла;
	
	Возврат ЗначенияГруппировок;
	
КонецФункции

Процедура УстановитьОформлениеШапкиТаблицы(Макеты, ИменаМакетовШапки, НастройкиМакета)

	НастройкиОформления = НастройкиМакета.ЗаголовокТаблицы;
	НастройкаОформления = НастройкиОформления[0];
	
	ОсновнойМакет = Макеты.Макет;
	
	Для каждого СинонимМакета Из ИменаМакетовШапки Цикл
		ИмяМакета = Макеты[СинонимМакета];
		//Макет = Макеты[ИмяМакета];	
		Макет = ОсновнойМакет.ПолучитьОбласть(ИмяМакета);
		ВысотаТаблицы = Макет.ВысотаТаблицы;
		ШиринаТаблицы = Макет.ШиринаТаблицы;

		Для Строка = 1 По ВысотаТаблицы Цикл
			Для Колонка = 1 По ШиринаТаблицы Цикл
				Область = Макет.Область(Строка, Колонка, Строка, Колонка);
				Для каждого ЭлементОформления Из НастройкаОформления Цикл
					Область[ЭлементОформления.Ключ] = ЭлементОформления.Значение;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;	

КонецПроцедуры

Процедура УстановитьОформлениеОбласти(Макет, ИмяЭлементаНастройки, Индекс, НастройкиМакета)

	НастройкиОформления = НастройкиМакета[ИмяЭлементаНастройки];
	
	Если НастройкиОформления.Вграница() < Индекс Тогда
		НастройкаОформления = НастройкиОформления[0];
	Иначе	
		НастройкаОформления = НастройкиОформления[Индекс];
	КонецЕсли;
	
	Если ТипЗнч(НастройкаОформления) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ВысотаТаблицы = Макет.ВысотаТаблицы;
	ШиринаТаблицы = Макет.ШиринаТаблицы;

	Для Строка = 1 По ВысотаТаблицы Цикл
		Для Колонка = 1 По ШиринаТаблицы Цикл
			Область = Макет.Область(Строка, Колонка, Строка, Колонка);
			Для каждого ЭлементОформления Из НастройкаОформления Цикл
				Область[ЭлементОформления.Ключ] = ЭлементОформления.Значение;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Функция НастройкиМакетаОформления(ЭлементБиблиотекиМакетов)

	// См. БиблиотекаМакетовОформленияКомпоновкиДанных

	МакетОформления	= ЭлементБиблиотекиМакетов.ПолучитьМакет();
	
	НастройкиМакета = Новый Структура;
	НастройкиМакета.Вставить("ЗаголовокТаблицы", Новый Массив);
	НастройкиМакета.Вставить("ЗаголовокИерархическойГруппировки", Новый Массив);	
	НастройкиМакета.Вставить("ЗаголовокГруппировки", Новый Массив);
	НастройкиМакета.Вставить("ЗаголовокГруппировкиКолонки", Новый Массив);
	НастройкиМакета.Вставить("РесурсыЗаголовкаИерархическойГруппировки", Новый Массив);	
	НастройкиМакета.Вставить("РесурсыЗаголовкаГруппировки", Новый Массив);

	ПараметрыОформления = Новый Структура;
	ПараметрыОформления.Вставить("ЦветФона");
	ПараметрыОформления.Вставить("ЦветТекста");
	ПараметрыОформления.Вставить("ЦветГраницы");
	ПараметрыОформления.Вставить("СтильГраницы");
	ПараметрыОформления.Вставить("Шрифт");
	
	Синонимы = Новый Структура;
	Синонимы.Вставить("ЦветФона",	  "ЦветФона");
	Синонимы.Вставить("ЦветТекста",	  "ЦветТекста");
	Синонимы.Вставить("ЦветРамки",	  "ЦветГраницы");
	Синонимы.Вставить("ГраницаСверху","СтильГраницы");
	Синонимы.Вставить("ГраницаСнизу", "СтильГраницы");
	Синонимы.Вставить("ГраницаСправа","СтильГраницы");
	Синонимы.Вставить("ГраницаСлева", "СтильГраницы");
	Синонимы.Вставить("Шрифт",		  "Шрифт");
	
	Для каждого НастройкаМакета Из НастройкиМакета Цикл
		
		ЭлементМакетаОформления    = МакетОформления.Элементы.Найти(НастройкаМакета.Ключ);
		ЗначенияНастроекОформления = НастройкаМакета.Значение;
		
		Для каждого ОбластьМакетаОформления Из ЭлементМакетаОформления.Значение Цикл
			Уровень	   = ОбластьМакетаОформления.Уровень;
			Оформление = ОбластьМакетаОформления.Оформление;
			
			Если ЗначенияНастроекОформления.ВГраница() < Уровень Тогда
				// Элементы макета оформления бывают неупорядоченны по уровню.
				// Например, 1-2-0. Что бы установить элемент с уровнем по индексу,
				// заполним массив элементами.
				Пока ЗначенияНастроекОформления.ВГраница() < Уровень Цикл
					ЗначенияНастроекОформления.Добавить(Новый Структура);
				КонецЦикла;
			КонецЕсли;
			
			Для каждого ПараметрОформления Из ПараметрыОформления Цикл
				ЗначениеПараметра = Оформление.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ПараметрОформления.Ключ));
				Использование 	  = ЗначениеПараметра.Использование;
				Значение		  = ЗначениеПараметра.Значение;
				Если ПараметрОформления.Ключ = "Шрифт" Тогда
					// Шрифт диалогов с макетах нечитаемый. СКД меняет на Aria.	
					Значение = Новый Шрифт(Значение, "Arial");
				КонецЕсли;
				ПараметрыОформления.Вставить(ПараметрОформления.Ключ, 
					Новый Структура("Использование, Значение", Использование, Значение));
			КонецЦикла;
			
			НастройкиОформления = Новый Структура;
			Для каждого ИменаПараметров Из Синонимы Цикл
				ПараметрОформления = ПараметрыОформления[ИменаПараметров.Значение];	
				Если ПараметрОформления.Использование Тогда
					ЗначениеОформления = ПараметрОформления.Значение;
					НастройкиОформления.Вставить(ИменаПараметров.Ключ, ЗначениеОформления);
				КонецЕсли;
			КонецЦикла;
			ЗначенияНастроекОформления.Установить(Уровень, НастройкиОформления);
		КонецЦикла;
	КонецЦикла;

	Возврат НастройкиМакета;
	
КонецФункции

Функция АдресНастройкиМакетаОформленияСтрок(Знач ИндексГруппировки, Знач КоличествоГруппировок, Знач ЭтоКоллекция)
	
	ИмяНастройки 	= "ЗаголовокГруппировки";
	ИндексНастройки = 0;
	
	Если КоличествоГруппировок = 2 Тогда
		Если ЭтоКоллекция Тогда
			ИмяНастройки 	= "ЗаголовокИерархическойГруппировки";
			ИндексНастройки = ?(ИндексГруппировки = 0, 1, 3);
		Иначе	
			ИмяНастройки 	= "ЗаголовокГруппировки";
			Если ИндексГруппировки = КоличествоГруппировок - 1 Тогда
				ИндексНастройки = 0;
			Иначе	
				ИндексНастройки = ?(ИндексГруппировки = 0, 2, 0);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ИндексГруппировки = 0 Тогда
			Если ЭтоКоллекция Тогда
				ИмяНастройки 	= "ЗаголовокИерархическойГруппировки";
				ИндексНастройки = ?(ИндексГруппировки = 0, 1, 3);
			Иначе	
				ИмяНастройки 	= "ЗаголовокГруппировки";
				Если ИндексГруппировки = КоличествоГруппировок - 1 Тогда
					ИндексНастройки = 0;
				Иначе	
					ИндексНастройки = ?(ИндексГруппировки = 0, 2, 0);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ИндексГруппировки = 1 Тогда
			ИмяНастройки 	= "ЗаголовокИерархическойГруппировки";
			ИндексНастройки = 3;
		Иначе
			ИмяНастройки 	= "ЗаголовокГруппировки";
			ИндексНастройки = 0;
		КонецЕсли;
	КонецЕсли;

	АдресНастройки = Новый Структура;
	АдресНастройки.Вставить("ИмяНастройкиМакетаОформления",    ИмяНастройки);
	АдресНастройки.Вставить("ИндексНастройкиМакетаОформления", ИндексНастройки);
	
	Возврат АдресНастройки;
	
КонецФункции

Функция АдресНастройкиМакетаОформленияКолонок(Знач ИндексГруппировки, Знач КоличествоГруппировок, Знач ЭтоКоллекция, Знач ЭтоИтог)
	
	ИмяНастройки 	= "РесурсыЗаголовкаГруппировки";
	ИндексНастройки = 0;
	
	Если ЭтоИтог Тогда
		Если КоличествоГруппировок = 2 Тогда
			Если ЭтоКоллекция Тогда
				ИмяНастройки 	= "РесурсыЗаголовкаИерархическойГруппировки";
				ИндексНастройки = ?(ИндексГруппировки = 0, 1, 3);
			Иначе	
				Если ИндексГруппировки = КоличествоГруппировок - 1 Тогда
					ИмяНастройки 	= "РесурсыЗаголовкаИерархическойГруппировки";
					ИндексНастройки = 3;
				Иначе
					ИмяНастройки 	= "РесурсыЗаголовкаГруппировки";
					ИндексНастройки = 2;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ИндексГруппировки = 0 Тогда
				Если ЭтоКоллекция Тогда
					ИмяНастройки 	= "РесурсыЗаголовкаИерархическойГруппировки";
					ИндексНастройки = ?(ИндексГруппировки = 0, 1, 3);
				Иначе	
					Если ИндексГруппировки = КоличествоГруппировок - 1 Тогда
						ИмяНастройки 	= "РесурсыЗаголовкаИерархическойГруппировки";
						ИндексНастройки = 3;
					Иначе
						ИмяНастройки 	= "РесурсыЗаголовкаГруппировки";
						ИндексНастройки = 2;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ИндексГруппировки = 1 Тогда
				ИмяНастройки 	= "РесурсыЗаголовкаГруппировки";
				ИндексНастройки = 2;
			Иначе
				ИмяНастройки 	= "РесурсыЗаголовкаИерархическойГруппировки";
				ИндексНастройки = 3;
			КонецЕсли;
		КонецЕсли;
	Иначе	
		Результат 		= АдресНастройкиМакетаОформленияСтрок(ИндексГруппировки, 
							КоличествоГруппировок, ЭтоКоллекция);
							
		ИмяНастройки 	= Результат.ИмяНастройкиМакетаОформления;
		ИндексНастройки = Результат.ИндексНастройкиМакетаОформления;
	КонецЕсли;
	

	АдресНастройки = Новый Структура;
	АдресНастройки.Вставить("ИмяНастройкиМакетаОформления",    ИмяНастройки);
	АдресНастройки.Вставить("ИндексНастройкиМакетаОформления", ИндексНастройки);
	
	Возврат АдресНастройки;
	
КонецФункции

#КонецОбласти