		  
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоответствияАналитик(Команда)

	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("КлючВарианта", "СоответствияАналитик");
	
	Попытка
		ОткрытьФорму("Отчет.бит_СоответствияАналитик.ФормаОбъекта", ПараметрыПередачи);	
	Исключение
		ТекстСообщения = НСтр("ru = 'Неправильное имя отчета. Обратитесь в группу разработки.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
	КонецПопытки; 

КонецПроцедуры

&НаКлиенте
Процедура УниверсальныеСоответствияАналитик(Команда)

	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("КлючВарианта", "УниверсальныеСоответствияАналитик");
	
	Попытка
		ОткрытьФорму("Отчет.бит_УниверсальныеСоответствияАналитик.ФормаОбъекта", ПараметрыПередачи);	
	Исключение
		ТекстСообщения = НСтр("ru = 'Неправильное имя отчета. Обратитесь в группу разработки.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
	КонецПопытки; 

КонецПроцедуры

#КонецОбласти