
#Область ОписаниеПеременных

&НаКлиенте
Перем мБуфер;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов.
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов.
	
	// СтандартныеПодсистемы.Обновление версии ИБ
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Обновление версии ИБ

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда 		
		Возврат;    		
	КонецЕсли; 
		
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьКэшЗначений();
		ДоработатьТаблицуИзмерения();
		ПрочитатьДополнительныеИтоги(Объект);
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда	
			ОбъектНастроек = Параметры.ЗначениеКопирования.ПолучитьОбъект();
			ПрочитатьДанныеВХранилищах(ОбъектНастроек);
		Иначе
			ОбъектНастроек = РеквизитФормыВЗначение("Объект");
			ПрочитатьДанныеВХранилищах(ОбъектНастроек);
		КонецЕсли;
		
		ТекущаяДатаНачалаПланирования     = Объект.ДатаНачалаПланирования;
		ТекущаяДатаОкончанияПланирования  = Объект.ДатаОкончанияПланирования;
		ТекущаяПериодичность              = Объект.ПериодичностьПланирования;
		ТекущаяПродолжительностьИнтервала = Объект.ПродолжительностьИнтервала;
		ТекущийБюджет					  = Объект.Бюджет;
		ТекущиеНастройкиГруппировок 		  = НастройкиГруппировокБюджета(ЭтотОбъект);
	КонецЕсли;
	
	Элементы.Измерения.ОтборСтрок = Новый ФиксированнаяСтруктура("Отключено", Ложь);
	
	// Это свойство не отображается, но не дает привычно редактировать список значений.
	Элементы.КомпоновщикНастройкиОтборПравоеЗначение.РасширенноеРедактированиеМножественныхЗначений = Ложь;
	
	УстановитьУсловноеОформление();	
	ЗаполнитьМакетыОформления();
	УправлениеФормой(ЭтотОбъект);
	УстановитьПараметрыВыбораСпособаЗаполнения(ЭтотОбъект);
	
	// Редактор формул.
	бит_РедакторФормулСервер.рф_ИнициализацияРедактораФормул(ЭтотОбъект, Истина);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьКэшЗначений();
	ДоработатьТаблицуИзмерения();
	ПрочитатьДополнительныеИтоги(ТекущийОбъект);
	ПрочитатьДанныеВХранилищах(ТекущийОбъект);
	
	ТекущаяДатаНачалаПланирования     = ТекущийОбъект.ДатаНачалаПланирования;
	ТекущаяДатаОкончанияПланирования  = ТекущийОбъект.ДатаОкончанияПланирования;
	ТекущаяПериодичность              = ТекущийОбъект.ПериодичностьПланирования;
	ТекущаяПродолжительностьИнтервала = ТекущийОбъект.ПродолжительностьИнтервала;
	ТекущийБюджет					  = ТекущийОбъект.Бюджет;
	ТекущиеНастройкиГруппировок		  	  = НастройкиГруппировокБюджета(ЭтотОбъект);

	ПроверитьВозможностьРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СписокСмежности	  = бит_БюджетированиеКлиентСервер.СписокСмежности(ТабДокДанные);
	РезультатПроверки = бит_Бюджетирование.ЕстьЦиклыВФормулах(ТабДокДанные, СписокСмежности);
	Если РезультатПроверки.ЕстьЦикл Тогда
		ОбщегоНазначения.СообщитьПользователю(РезультатПроверки.ТекстСообщения,,, Отказ);
	КонецЕсли;

	Если ТекущийОбъект.Вид = Перечисления.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет Тогда
		Если ТабДокДанные.ВысотаТаблицы = 0 ИЛИ Элементы.ТабДокДанные.ОтображениеСостояния.Видимость Тогда
			ТекстСообщения = НСтр("ru='Пред записью заполните макет.';
								  |en='Previous retaining element, create a layout.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "ТабДокДанные",, Отказ);
		КонецЕсли; 
	КонецЕсли; 

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НадоОбновитьТекстЗапроса Тогда
		ТекущийОбъект.ТекстЗапроса = ТекущийОбъект.СФормироватьТекстЗапроса();
		НадоОбновитьТекстЗапроса   = Ложь;
		
		Если СтрСравнить(Объект.ТекстЗапроса, ТекущийОбъект.ТекстЗапроса) <> 0 Тогда
			ИнициироватьКомпоновщик(ТекущийОбъект, Ложь);
		КонецЕсли; 
	КонецЕсли;
	
	СохранитьЦветаОформления(ТекущийОбъект);
		
	ТекущийОбъект.СохранитьДерево(ТабДокДанные);	
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("НастройкиКомпоновщика", Компоновщик.ПолучитьНастройки());
	
	ТекущийОбъект.СохранитьНастройкиПостроителя(СтруктураНастройки);
	ТекущийОбъект.СохранитьСписокСмежностиВХранилище(СписокСмежности);
	
	ЗаполнитьДополнительныеИтоги(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДоработатьТаблицуИзмерения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если ЭтотОбъект.рфРедакторФормулОткрыт И ЭтотОбъект.рфФормула <> ЭтотОбъект.рфСтараяФормула Тогда
	  	ТекстСообщения = НСтр("ru='Не закончен ввод формулы.
								  |Для окончания ввода закройте окно редактора или нажмите кнопку ""=""(равно) в окне редактора.';
							  |en='Not finished a formula.
							 	  |To finish, I close the editor window, or press the ""="" (equal) in the editor window.'");
	  	ПоказатьПредупреждение(,ТекстСообщения, , НСтр("ru='Редактор формулы';en='Formula Editor'"));
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПараметрНормНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоВалюты", Истина);
	ОткрытьФорму("ПланВидовХарактеристик.бит_ВидыПроизвольныхПараметров.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Модифицированность 
		 И (ТекущаяСтраница.Имя = "ГруппаСтраницаОтбор" 
		    ИЛИ ТекущаяСтраница.Имя = "ГруппаСтраницаМакет") Тогда
		
		Если НадоОбновитьТекстЗапроса Тогда
			ОбновитьТекстЗапроса(); 		
		КонецЕсли;
		
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);

	ОчиститьОтборПоСвязямПараметровВыбора();
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
	// Поменялся принцип заполнения - по бюджету / по статьям.
	Если ЗначениеЗаполнено(ТекущийБюджет) И НЕ ЗначениеЗаполнено(Объект.Бюджет)
		ИЛИ НЕ ЗначениеЗаполнено(ТекущийБюджет) И ЗначениеЗаполнено(Объект.Бюджет) Тогда
	
		НадоОбновитьТекстЗапроса = Истина;
	КонецЕсли;	
	
	ТекущийБюджет = Объект.Бюджет;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДатаНачалаПланированияПриИзменении(Элемент)
		
	Результат = Ждать ЗадатьВопросОбОчисткеДанных();
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьМакет();
		ТекущаяДатаНачалаПланирования = Объект.ДатаНачалаПланирования;
		ПериодПланирования.ДатаНачала = Объект.ДатаНачалаПланирования;
	Иначе	
		Объект.ДатаНачалаПланирования = ТекущаяДатаНачалаПланирования;
		ПериодПланирования.ДатаНачала = Объект.ДатаНачалаПланирования;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДатаОкончанияПланированияПриИзменении(Элемент)
		
	Результат = Ждать ЗадатьВопросОбОчисткеДанных();
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьМакет();
		ТекущаяДатаОкончанияПланирования = Объект.ДатаОкончанияПланирования;
		ПериодПланирования.ДатаОкончания  = Объект.ДатаОкончанияПланирования;	
	Иначе	
		Объект.ДатаОкончанияПланирования = ТекущаяДатаОкончанияПланирования;
		ПериодПланирования.ДатаОкончания = Объект.ДатаОкончанияПланирования;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокДанныеОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаИзмеренияФВБ(Расшифровка) И ЗначениеЗаполнено(Расшифровка.Значение) Тогда
			ПоказатьЗначение(,Расшифровка.Значение);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаПредставлениеПриИзменении(Элемент)
	
	Формула = ФормулаПредставление;
	// Формирование формулы по представлению.
	МассивАргументы = бит_СтрокиКлиентСервер.РазобратьФормулу(ФормулаПредставление);
	Для Каждого Аргумент Из МассивАргументы Цикл
		АргументПоиска = СтрЗаменить(Аргумент, " ", "");
		АргументПоиска = СтрЗаменить(Аргумент, Символы.НПП, "");
		ОблАрг = ТабДокДанные.Область(АргументПоиска);
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОблАрг) Тогда
			Формула = СтрЗаменить(Формула, Аргумент, ОблАрг.Имя);
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Цвет_ГруппаПриИзменении(Элемент)
	
	Объект.ИспользоватьЦветГруппы = Истина;
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Цвет_ЯчейкаПриИзменении(Элемент)
	
	Объект.ИспользоватьЦветЯчейки = Истина;
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Цвет_ФормулаПриИзменении(Элемент)
	
	Объект.ИспользоватьЦветФормулы = Истина;
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Цвет_АргументПриИзменении(Элемент)
	
	Объект.ИспользоватьЦветАргумента = Истина;
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПериодичностьПланированияПриИзменении(Элемент)
		
	Результат = Ждать ЗадатьВопросОбОчисткеДанных();
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьМакет();
		ТекущаяПериодичность = Объект.ПериодичностьПланирования;
	Иначе	
		Объект.ПериодичностьПланирования = ТекущаяПериодичность;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПродолжительностьИнтервалаПриИзменении(Элемент)
	
	Результат = Ждать ЗадатьВопросОбОчисткеДанных();
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьМакет();
		ТекущаяПродолжительностьИнтервала = Объект.ПродолжительностьИнтервала;
	Иначе	
		Объект.ПродолжительностьИнтервала = ТекущаяПродолжительностьИнтервала;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗащитаЯчейкиПриИзменении(Элемент)
	
	Для каждого ТекущаяОбласть Из ТабДокДанные.ВыделенныеОбласти Цикл
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ТекущаяОбласть) Тогда
			ШиринаОбласти = ТекущаяОбласть.Право - ТекущаяОбласть.Лево;
			ВысотаОбласти = ТекущаяОбласть.Низ   - ТекущаяОбласть.Верх;
			Для Колонка = 0 По ШиринаОбласти Цикл
				Лево = ТекущаяОбласть.Лево + Колонка;
				Для Строка = 0 По ВысотаОбласти Цикл
					Верх 	= ТекущаяОбласть.Верх + Строка;
					Область = ТабДокДанные.Область(Верх, Лево, Верх, Лево);
					Если бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЯчейкиФВБ(Область.Расшифровка)
						И (Область.Расшифровка.Вид = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБЗначение()
						ИЛИ Область.Расшифровка.Вид = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБФормула()) Тогда
						Область.Защита  = ЗащитаЯчейки;
						Модифицированность = Истина;
					КонецЕсли;
				КонецЦикла; 
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла;  

КонецПроцедуры

&НаКлиенте
Процедура МакетОформленияПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.МакетОформления) Тогда
		Объект.МакетОформления = Элементы.МакетОформления.СписокВыбора[0].Значение;	
	КонецЕсли;
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Учет_КоличествоПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Учет_СуммаПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьНаименованияСтатейБюджетаПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКоэффициентыСтатейБюджетаПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЦветГруппыПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЦветЯчейкиПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЦветФормулыПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЦветАргументаПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтображенияВыходныхДнейПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединятьЯчейкиПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьКодификаторПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РасположениеПолейГруппировокПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьОбщиеИтогиПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабДокДанные

&НаКлиенте
Процедура ТабДокДанныеПриАктивизацииОбласти(Элемент)

	ПодключитьОбработчикОжидания("ОбработчикТабДокДанныеПриАктивизацииОбласти", 0.1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикТабДокДанныеПриАктивизацииОбласти()

	Если ТабДокДанные.ВысотаТаблицы = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОблМакета = Элементы.ТабДокДанные.ТекущаяОбласть;
	
	// Очищаем выделенные области табличного документа.
	бит_БюджетированиеКлиентСервер.ОчиститьВыделениеАргументов(ТабДокДанные, фВыделенныеОбласти);
	
	Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОблМакета) Тогда
		ДельтаГ = ОблМакета.Право - ОблМакета.Лево + 1;
		ДельтаВ = ОблМакета.Низ   - ОблМакета.Верх + 1;
		Если бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЯчейкиФВБ(ОблМакета.Расшифровка) И ДельтаГ = 1 И ДельтаВ = 1 Тогда
			  Расшифровка = ОблМакета.Расшифровка;
		      ЗащитаЯчейки = ОблМакета.Защита;
              Элементы.ЗащитаЯчейки.Доступность = (Расшифровка.Вид = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБЗначение());
			  Если фВводФормулы Тогда
			      Если НЕ ОблМакета.Имя = фИмяЯчейкиВводФормулы Тогда
			    	  НетОперандов = ?(Прав(СокрЛП(Формула),1)="]",Истина,Ложь);
			    	  Формула = Формула+?(НетОперандов," + "," ")+"["+Расшифровка.Имя+"]";
			    	  // Формирование представления формулы.
			    	  ФормулаПредставление = бит_БюджетированиеКлиент.ПользовательскоеПредставлениеФормулы(ТабДокДанные, Формула);
			    	  Если ВыделятьАргументы И Объект.ИспользоватьЦветАргумента Тогда
			    		  бит_БюджетированиеКлиент.ВыделитьАргументыФормулы(ТабДокДанные, Формула, фВыделенныеОбласти, Цвет_Аргумент);					  
			    	  КонецЕсли; 
			      КонецЕсли; 
			  Иначе
			      Если Не ЭтотОбъект.рфРедакторФормулОткрыт Тогда
			    	  фИмяЯчейкиВводФормулы = Расшифровка.Имя;
			      КонецЕсли;
			      Формула = Расшифровка.Формула;
			      // Формирование представления формулы.
			      ФормулаПредставление = бит_БюджетированиеКлиент.ПользовательскоеПредставлениеФормулы(ТабДокДанные, Формула);
			      Если ВыделятьАргументы И Объект.ИспользоватьЦветАргумента Тогда
			    	  бит_БюджетированиеКлиент.ВыделитьАргументыФормулы(ТабДокДанные, Формула, фВыделенныеОбласти, Цвет_Аргумент);					  
			      КонецЕсли; 
			  КонецЕсли; 
		  КонецЕсли; // ИмяКласса подходит.
	КонецЕсли; // ОблМакета подходит.
	
	// Редактор формул.
	Если ЭтотОбъект.рфРедакторФормулОткрыт Тогда
		ПодключитьОбработчикОжидания("рф_АнализЗначенияВводФормул", 0.3, Истина);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИзмерения

&НаКлиенте
Процедура ИзмеренияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ТекущиеДанные = Элементы.Измерения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипЗнч(ТекущиеДанные.ЗначениеПоУмолчанию));   		
	ОписаниеТипаПоля = Новый ОписаниеТипов(МассивТипов);
	Элементы.ИзмеренияЗначениеПоУмолчанию.ОграничениеТипа = ОписаниеТипаПоля;
	
	// Переменная для минимизации вызова обработки события "ПриИзменении" элемента "Измерения". 
	ИзмеренияРедактируютсяПользователем = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ИзмеренияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
			
	ИзмеренияРедактируютсяПользователем = Ложь;
	ОбработатьИзменениеТаблицыИзмерения();	

	Если НадоОбновитьТекстЗапроса Тогда
		ОчиститьБюджет();
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
	// При изменении данных таблицы нужно переустановить отбор или сделать серверный вызов.
	// Иначе элемент управления перестает реагировать на изменение данных, на пример, перестановку строк.
	Элементы.Измерения.ОтборСтрок = Новый ФиксированнаяСтруктура("Отключено", Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура ИзмеренияПриИзменении(Элемент)
	
	ОбработатьИзменениеТаблицыИзмерения();	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмеренияЗначениеПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	ТекущаяСтрока = Элементы.Измерения.ТекущиеДанные;
    бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект
	                                                      , Элемент
	                                                      , ТекущаяСтрока
														  , ТекущаяСтрока.Имя
														  , СтандартнаяОбработка
														  , КэшЗначений.НастройкиИзмерений
                                                          , "ЗначениеПоУмолчанию");
										  														  
КонецПроцедуры

&НаКлиенте
Процедура ИзмеренияЗначениеПоУмолчаниюАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
		
    ТекущаяСтрока = Элементы.Измерения.ТекущиеДанные;
    бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(
		ЭтотОбъект, Элемент, ТекущаяСтрока, ТекущаяСтрока.Имя, СтандартнаяОбработка, 
		КэшЗначений.НастройкиИзмерений, "ЗначениеПоУмолчанию");  													  											  
														  
КонецПроцедуры

&НаКлиенте
Процедура ИзмеренияЗначениеПоУмолчаниюОчистка(Элемент, СтандартнаяОбработка)
	
	
	ТекущаяСтрока = Элементы.Измерения.ТекущиеДанные;
	Контейнер = Новый Структура;
	Контейнер.Вставить(ТекущаяСтрока.Имя, ТекущаяСтрока.ЗначениеПоУмолчанию);	
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(
		Элемент, Контейнер, ТекущаяСтрока.Имя, СтандартнаяОбработка,
		КэшЗначений.НастройкиИзмерений);
		
	ТекущаяСтрока.ЗначениеПоУмолчанию = Контейнер[ТекущаяСтрока.Имя];													  
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмеренияСпособЗаполненияПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Измерения.ТекущиеДанные;
	Если ТекущаяСтрока.СпособЗаполнения = ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать")
	 ИЛИ ТекущаяСтрока.СпособЗаполнения = ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.РазворачиватьСИерархией") Тогда
		ТекущаяСтрока.ЗначениеПоУмолчанию = Неопределено;
	КонецЕсли; 
			
КонецПроцедуры

&НаКлиенте
Процедура ИзмеренияИмяТипаПоУмолчаниюАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)

	ТекущаяСтрока = Элементы.Измерения.ТекущиеДанные;
	ТекНастройка = КэшЗначений.НастройкиИзмерений[ТекущаяСтрока.Имя];
	Если НЕ ТекНастройка = Неопределено 
		 И ЗначениеЗаполнено(ТекНастройка.Аналитика) Тогда
		
		 МассивВыбора = ТипыПоУмолчанию(ТекНастройка.Аналитика);
		 Если МассивВыбора.Количество() > 1 Тогда
			 ДанныеВыбора = Новый СписокЗначений;		 
			 Для каждого Эл Из МассивВыбора Цикл
				 ДанныеВыбора.Добавить(Эл);
			 КонецЦикла; 
			 СтандартнаяОбработка = Ложь;
		 КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеИтогиПериодов

&НаКлиенте
Процедура ДополнительныеИтогиПериодовПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеИтогиПериодовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ДополнительныеИтогиПериодов.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока.Выполнять = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеИтогиПериодовНарастающийИтогПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДополнительныеИтогиПериодов.ТекущиеДанные;
	Если ТекущиеДанные.НарастающийИтог Тогда
		ТекущиеДанные.Выполнять = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастройкиОтбор

&НаКлиенте
Процедура КомпоновщикНастройкиОтборПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастройкиОтборПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	// Сброс параметров выбора.
	НовыйМассив = Новый Массив();
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элемент.ПараметрыВыбора = НовыеПараметры;
	
	// Подготовка новых параметров выбора.
	Если Элементы.КомпоновщикНастройкиОтбор.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипСтатьяБюджета = Новый ОписаниеТипов("СправочникСсылка.бит_СтатьиБюджета");
	ТипДопЗначенияАналитик = Новый ОписаниеТипов("СправочникСсылка.бит_ДополнительныеЗначенияАналитик");
	
	Поле	= Элементы.КомпоновщикНастройкиОтбор.ТекущиеДанные.ЛевоеЗначение;
	ТипПоля = бит_ОбщегоНазначенияКлиент.ПолучитьСвойствоПоля(
		Компоновщик.Настройки.Отбор.ДоступныеПоляОтбора, Поле, "Тип");
	
	Если ТипПоля = ТипСтатьяБюджета
		И ЗначениеЗаполнено(Объект.Бюджет) Тогда
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", Объект.Бюджет);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элемент.ПараметрыВыбора = НовыеПараметры;
	ИначеЕсли ТипПоля = ТипДопЗначенияАналитик Тогда
		
		НастройкиДопИзмерений = КэшЗначений.НастройкиИзмерений;
		НастройкиИзмерения 	  = НастройкиДопИзмерений[Строка(Поле)];
		Если НастройкиИзмерения <> Неопределено Тогда
			ВидДопАналитики = НастройкиИзмерения.Аналитика;
			НовыйПараметр	= Новый ПараметрВыбора("Отбор.Владелец", ВидДопАналитики);
			НовыйМассив 	= Новый Массив();
			НовыйМассив.Добавить(НовыйПараметр);
			НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
			Элемент.ПараметрыВыбора = НовыеПараметры;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастройкиПорядок

&НаКлиенте
Процедура КомпоновщикНастройкиПорядокПриИзменении(Элемент)
	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ОбновитьТекстЗапроса();
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура КомандаЗаполнитьПоУмолчанию(Команда)
	
	ТекстВопроса = НСтр("ru='Табличная часть ""Измерения"" будет перезаполнена. Продолжить?';
						|en='Tabular section of ""Measurements"" will be refilled. Continue?'");
	
	Результат = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет);
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьИзмеренияПоУмолчанию();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура КомандаВывестиТекстЗапроса(Команда)
	
	Если НадоОбновитьТекстЗапроса Тогда
		ТекстВопроса = НСтр("ru = 'После изменения настроек требуется обновить текст запроса. 
                             |Обновить текст запроса или вывести текущий?';
							 |en = 'After changing the settings, you need to update the query text. 
                            	 |Update the query text or output the current one?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Обновить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Показать текущий'"));
		
		Результат = Ждать ВопросАсинх(ТекстВопроса, Кнопки);
		Если Результат = КодВозвратаДиалога.Да Тогда
			ОбновитьТекстЗапроса();
		КонецЕсли;
	КонецЕсли;
	
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(Объект.ТекстЗапроса);
	Текст.Показать(НСтр("ru = 'Текст запроса для построения структуры бюджета';
						|en = 'The text of the request for building the budget structure'"));
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура КомандаРедактироватьПериод(Команда)
	
	Диалог		  = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = ПериодПланирования;
	Период	 	  = Ждать Диалог.РедактироватьАсинх();
	
	Если Период = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Результат = Ждать ЗадатьВопросОбОчисткеДанных();
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьМакет();
		ПериодПланирования = Период;
		Объект.ДатаНачалаПланирования     = ПериодПланирования.ДатаНачала;
		Объект.ДатаОкончанияПланирования  = ПериодПланирования.ДатаОкончания;			
		ТекущаяДатаНачалаПланирования    = Объект.ДатаНачалаПланирования;
		ТекущаяДатаОкончанияПланирования = Объект.ДатаОкончанияПланирования;	
		Модифицированность = Истина;			
	Иначе	
		Объект.ДатаНачалаПланирования    = ТекущаяДатаНачалаПланирования;
		Объект.ДатаОкончанияПланирования = ТекущаяДатаОкончанияПланирования;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьМакет(Команда)
	
	ОбновитьМакет();
	УстановитьСостояниеПоляТабличногоДокумента(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВводФормулы(Команда)		
	
	Если Не ЭтотОбъект.рфРедакторФормулОткрыт Тогда
		фВводФормулы = НЕ фВводФормулы;
		Элементы.КомандаВводФормулы.Пометка = фВводФормулы;
		Элементы.ФормулаПредставление.ТолькоПросмотр = НЕ фВводФормулы;
		
		Если фВводФормулы Тогда
			
			ОбластьПриемник = ТабДокДанные.ТекущаяОбласть;
			Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОбластьПриемник) 
				 И (бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЗначенияФВБ(ОбластьПриемник.Расшифровка)
				 ИЛИ бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаФормулыФВБ(ОбластьПриемник.Расшифровка)) Тогда
				 
				// Вручную формулы можно устанавливать только для ячеек значение.
				фИмяЯчейкиВводФормулы = ТабДокДанные.ТекущаяОбласть.Имя;
			Иначе
				// Формулу вводить нельзя.
				фИмяЯчейкиВводФормулы = "";
				фВводФормулы = Ложь;
				Элементы.КомандаВводФормулы.Пометка = фВводФормулы;			
				Элементы.ФормулаПредставление.ТолькоПросмотр = НЕ фВводФормулы;
			КонецЕсли; 
		Иначе	
			
			Если НЕ ПустаяСтрока(фИмяЯчейкиВводФормулы) Тогда
				ОбластьПриемник = ТабДокДанные.Области.Найти(фИмяЯчейкиВводФормулы);
				Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОбластьПриемник) 
					И бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЯчейкиФВБ(ОбластьПриемник.Расшифровка)  Тогда
					Если НЕ ПустаяСтрока(Формула)  Тогда
						Если НЕ бит_СтрокиКлиент.ФормулаКорректна(Формула, Истина) Тогда
							// Формула введена некорректно - продолжим редактирование.
							фВводФормулы = Истина;
							Элементы.КомандаВводФормулы.Пометка = фВводФормулы;
							Элементы.ФормулаПредставление.ТолькоПросмотр = НЕ фВводФормулы;						
							Возврат;
						КонецЕсли; 
						
						Если СтрСравнить(ОбластьПриемник.Расшифровка.Формула, Формула) = 0 Тогда
							Возврат;
						КонецЕсли;
						
						// Удаления зависимостей от предыдущих аргументов.
						ПредыдущиеАргументы = ОбластьПриемник.Расшифровка.Аргументы;
						Для каждого Арг Из ПредыдущиеАргументы Цикл
							Если СписокСмежности.Свойство(Арг) Тогда
								ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(СписокСмежности[Арг], ОбластьПриемник.Имя);
							КонецЕсли;
						КонецЦикла;
						ОбластьПриемник.Расшифровка.Аргументы = Новый Массив();
						
						// Добавление новых аргументов.
						МассивАргументы = бит_СтрокиКлиентСервер.РазобратьФормулу(Формула);
						Для каждого Арг Из МассивАргументы Цикл
							ОбластьПриемник.Расшифровка.Аргументы.Добавить(Арг);
							// Необходимо установить зависимости ячеек.
							Если СписокСмежности.Свойство(Арг) Тогда
								Если СписокСмежности[Арг].Найти(фИмяЯчейкиВводФормулы) = Неопределено Тогда
									СписокСмежности[Арг].Добавить(фИмяЯчейкиВводФормулы);
								КонецЕсли;
							Иначе
								СмежныеВершины = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(фИмяЯчейкиВводФормулы);
								СписокСмежности.Вставить(Арг, СмежныеВершины); 
							КонецЕсли; 
						КонецЦикла; 
						
						// Устанавливаем формулу.
						Расшифровка = ОбластьПриемник.Расшифровка;
						Расшифровка.Формула = Формула;
						
						Если Объект.ИспользоватьЦветФормулы Тогда
							ОбластьПриемник.ЦветФона = Цвет_Формула;						
						КонецЕсли;
						
						Если Объект.ЗащищатьФормулы Тогда
							 ОбластьПриемник.Защита = Истина;
						КонецЕсли; 
						
						// Записываем формулу в таб. часть формулы чтобы при обновлении дерева она не сбросилась.
						ЗаписатьФормулуВТабЧасть(ОбластьПриемник.Имя, Расшифровка.Формула, Объект.Формулы);					
						Модифицированность    = Истина;
						бит_БюджетированиеКлиентСервер.ВычислитьФормулу(ТабДокДанные, ОбластьПриемник);
						ИзменениеСодержимогоОбласти(ОбластьПриемник);
					Иначе	
						// Формула пустая - очистим в расшифровке и таб. части.
						ОчиститьФормулу(ОбластьПриемник);
					КонецЕсли;  
				КонецЕсли; // Ячейка подходит. 	
			КонецЕсли; // Указана ячейка ввода формулы.
		КонецЕсли; // Режим ввода формулы.
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьФормулу(Команда)
	
	Если НЕ фВводФормулы Тогда
		Обл = ТабДокДанные.ТекущаяОбласть;
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Обл) 
			 И (бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЗначенияФВБ(Обл.Расшифровка) 
			 ИЛИ бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаФормулыФВБ(Обл.Расшифровка)) Тогда
		
			 // Параметр обновления зав. ячеек обязателен, т.к. защищает от удаления формул в целой области.
			 ОчиститьФормулу(Обл, Истина);
		КонецЕсли; 
	Иначе
		Формула = "";
		ФормулаПредставление = "";
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЦветаПоУмолчанию(Команда)
	
	УстановитьЦветаПоУмолчанию();	
	УстановитьСостояниеПоляТабличногоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокДанныеПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ОблМакета = Элементы.ТабДокДанные.ТекущаяОбласть;
	ИзменениеСодержимогоОбласти(ОблМакета);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьФормулы(Команда)
	
	Оповещение = Новый ОписаниеОповещения("КомандаОчиститьФормулыОкончание", ЭтотОбъект); 
	ТекстВопроса = НСтр("ru='Все формулы, введенные вручную будут очищены. Продолжить?';
					    |en='All formulas manually entered will be cleared. Proceed?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

// Процедура окончание процедуры "КомандаОчиститьФормулы".
// 
&НаКлиенте 
Процедура КомандаОчиститьФормулыОкончание(Ответ, ДополнительныеДанные) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	КоличествоСтрок = Объект.Формулы.Количество();
	Для Сч = 1 По КоличествоСтрок Цикл
		Счй = КоличествоСтрок - Сч;
		СтрокаТаблицы = Объект.Формулы[Счй];
		Обл = ТабДокДанные.Области.Найти(СтрокаТаблицы.ИмяЯчейки);
		
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Обл) 
			И бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЯчейкиФВБ(Обл.Расшифровка) Тогда
			
			Обл.Расшифровка.Формула = "";
			Обл.Расшифровка.Аргументы = Новый Массив;
			Обл.ЦветФона = Цвет_Ячейка;
			Обл.Защита   = Ложь;
		КонецЕсли; 
	КонецЦикла; 
	Объект.Формулы.Очистить();
	Модифицированность = Истина;
	
	Формула = "";
	ФормулаПредставление = "";
	
	СписокСмежности = бит_БюджетированиеКлиентСервер.СписокСмежности(ТабДокДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКопироватьФормулу(Команда)
	
	флОтказ = Истина;
	мБуфер = Неопределено;
	ОблВыделенная = ТабДокДанные.ТекущаяОбласть;
	
	Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОблВыделенная) Тогда
		мБуфер = Новый Массив;		
		// Необходимо определить координаты всех ячеек выделенной области
		// и обойти по отдельности эти ячейки.
		ДельтаГ = ОблВыделенная.Право - ОблВыделенная.Лево + 1;
		ДельтаВ = ОблВыделенная.Низ   - ОблВыделенная.Верх + 1;
		ЛевоНач = ОблВыделенная.Лево;
		ВерхНач = ОблВыделенная.Верх;
		Для нг = 1 По ДельтаГ Цикл
			Лево   = ЛевоНач + нг-1;
			Для нв = 1 По ДельтаВ Цикл
				Верх = ВерхНач + нв-1;
				Обл  = ТабДокДанные.Область(Верх, Лево, Верх, Лево);
				// Если выделенная ячейка является ячейкой вида Значение - сохраним параметры, необходимые для копирования в буфер.
				Расшифровка = Обл.Расшифровка;
				Если (бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЗначенияФВБ(Расшифровка)
					 ИЛИ бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаФормулыФВБ(Расшифровка))
					 И ЗначениеЗаполнено(Расшифровка.Формула) Тогда
					 
					флОтказ = Ложь;
					ПарамКопирования = Новый Структура;
					ПарамКопирования.Вставить("ИмяКласса", "БуферКопированияФормыВвода");
					ПарамКопирования.Вставить("Период"   , Расшифровка.Период);
					ПарамКопирования.Вставить("Измерения", Расшифровка.Измерения);
					ПарамКопирования.Вставить("Формула"  , Расшифровка.Формула);
					ПарамКопирования.Вставить("Аргументы", Расшифровка.Аргументы);
					ПарамКопирования.Вставить("Лево"     , Лево);
					ПарамКопирования.Вставить("Верх"     , Верх);
					ПарамКопирования.Вставить("СдвигГор" , нг-1);
					ПарамКопирования.Вставить("СдвигВерт", нв-1);
					мБуфер.Добавить(ПарамКопирования);
				КонецЕсли; // ИмяКласса подходит.
			КонецЦикла; 
		КонецЦикла; 
	КонецЕсли; // ОблМакета подходит.
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВставитьФормулу(Команда)
	
	Если ТипЗнч(мБуфер) = Тип("Массив") Тогда
		Для каждого Обл Из ТабДокДанные.ВыделенныеОбласти Цикл
			Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Обл) 
				И (бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЗначенияФВБ(Обл.Расшифровка)
					 ИЛИ бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаФормулыФВБ(Обл.Расшифровка)) Тогда
				
				ПараметрыВставки = Новый Структура; 
				ПараметрыВставки.Вставить("ИмяОбласти", Обл.Имя);
				ПараметрыВставки.Вставить("Верх", Обл.Верх);
				ПараметрыВставки.Вставить("Лево", Обл.Лево);
				ПараметрыВставки.Вставить("Низ", Обл.Низ);
				ПараметрыВставки.Вставить("Право",Обл.Право);
				ВыполнитьКопированиеДанных(мБуфер, ПараметрыВставки);
				ТабДокДанныеПриАктивизацииОбласти(Элементы.ТабДокДанные);
			КонецЕсли; // ОблМакета подходит.
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ИзменитьВерсиюФВБ(Команда)
	
	ТекстВопроса = НСтр("ru = 'При переходе будут очищены:
                         |- отбор,
                         |- сортировка,
                         |- макет формы ввода бюджета.
                         |
                         |Продолжить?'; 
						 |en = 'They will be cleared during the transition:
                         |- selection,
                         |- setting up the order,
                         |- layout of the budget input form.
                         |
                         |Continue?'");
	
	Результат = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.Версия_2 = НЕ Объект.Версия_2;

	Объект.ИспользоватьЦветГруппы 				 = Истина;
	Объект.ИспользоватьЦветЯчейки 				 = Истина;
	Объект.ИспользоватьНаименованияСтатейБюджета = Истина;
	
	ТабДокДанные = Новый ТабличныйДокумент;
	
	Если НЕ Объект.Версия_2 Тогда
		Для каждого СтрокаТаблицы Из Объект.Измерения Цикл
			Если СтрокаТаблицы.СпособЗаполнения = ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.РазворачиватьСИерархией") Тогда
				СтрокаТаблицы.СпособЗаполнения = ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать");			
			КонецЕсли;
		КонецЦикла;
		ОчиститьБюджет();
	КонецЕсли;
	
	// Очистка элементов порядка требуется из-за разных путей к данным в СКД вер. 1 и 2.
	Компоновщик.Настройки.Порядок.Элементы.Очистить();
	
	ОбновитьТекстЗапроса();	
	УстановитьПараметрыВыбораСпособаЗаполнения(ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет кэш значений.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("НастройкиИзмерений", бит_Бюджетирование.НастройкиИзмеренийБюджетирования());
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	ВыделятьАргументы = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ВыделятьАргументыФормулФормыВвода", ТекПользователь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ИзмеренияСпособЗаполнения");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Измерения.Имя", ВидСравненияКомпоновкиДанных.Равно, "Сценарий");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ТекстНедоступнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<не требуется>';en='<Not required>'"));
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Измерения");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Измерения.Отключено", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ТекстНедоступнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ИзмеренияЗначениеПоУмолчанию");
	
	СпособыГруппировок = Новый СписокЗначений;
	СпособыГруппировок.Добавить(Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать);
	СпособыГруппировок.Добавить(Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.РазворачиватьСИерархией);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Измерения.СпособЗаполнения", ВидСравненияКомпоновкиДанных.ВСписке, 
		СпособыГруппировок);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ТекстНедоступнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<не требуется>';en='<Not required>'"));
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	бит_ОтчетыБФКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Измерения");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Измерения.СпособЗаполнения", ВидСравненияКомпоновкиДанных.ВСписке, СпособыГруппировок);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ФонПодписьВерна);

КонецПроцедуры

// Процедура очищает отборы по связям параметров выбора.
//
&НаКлиенте
Процедура ОчиститьОтборПоСвязямПараметровВыбора()
	
	Если ЗначениеЗаполнено(Объект.Бюджет) Тогда
		ПустаяСтатья = ПредопределенноеЗначение("Справочник.бит_СтатьиБюджета.ПустаяСсылка");	
		
		Поле = Новый ПолеКомпоновкиДанных("СтатьяОборотов");
		ЭлементыДляУдаления = ПолучитьЭлементыОтбора(Компоновщик.Настройки.Отбор);
		Для каждого УдаляемыйЭлемент Из ЭлементыДляУдаления Цикл
			Если УдаляемыйЭлемент.ЛевоеЗначение = Поле Тогда
				УдаляемыйЭлемент.ПравоеЗначение = ПустаяСтатья;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЭлементыОтбора(ЭлементСтруктуры, ТолькоГруппы = Ложь)
		
	МассивПолей = Новый Массив;
	
	ДобавитьЭлементыОтбораВМассив(ЭлементСтруктуры.Элементы, МассивПолей, ТолькоГруппы);
	Возврат МассивПолей;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьЭлементыОтбораВМассив(ЭлементыОтбора, МассивПолей, ТолькоГруппы = Ложь)
	
	Для каждого Элемент Из ЭлементыОтбора Цикл
		Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Если ТолькоГруппы Тогда
				МассивПолей.Добавить(Элемент);
			КонецЕсли;
			ДобавитьЭлементыОтбораВМассив(Элемент.Элементы, МассивПолей, ТолькоГруппы);
		Иначе
			Если Не ТолькоГруппы Тогда
				МассивПолей.Добавить(Элемент);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Дозаполняет служебные поля таблицы Измерения, необходимые для отображения.
// 
&НаСервере
Процедура ДоработатьТаблицуИзмерения()

	// Установка видимости дополнительных измерений.
	ИзмеренияПроизвольные = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("все","имя","массив");
	Для каждого Имя Из ИзмеренияПроизвольные Цикл
		Настройка = КэшЗначений.НастройкиИзмерений[Имя];
		СтрОтбор = Новый Структура("Имя", Имя);
		Строки = Объект.Измерения.НайтиСтроки(СтрОтбор);
		Если Строки.Количество() > 0 Тогда
			ПерваяСтрока = Строки[0];
			Если Настройка = Неопределено Тогда
				ПерваяСтрока.Представление = "(" + НСтр("ru = 'не используется'; en = 'not used'") + ") " + Имя;
				ПерваяСтрока.Отключено	   = Истина;
			Иначе
				ПерваяСтрока.Представление = Настройка.Синоним;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция МожноИспользоватьСтатьиБюджета(Форма)
	
	Объект = Форма.Объект;
	
	Если Объект.Версия_2 Тогда
		МожноИспользоватьСтьиБюджета = Истина;	
	Иначе	
		МожноИспользоватьСтьиБюджета = Ложь;
		// Бюджет доступен только если первый разворот идет по статьям.
		Результат = ГруппировкиБюджета(Форма);
		Если Результат.Количество() > 0 Тогда
			СтрокаПервая = Результат[0];
			МожноИспользоватьСтьиБюджета = (СтрокаПервая.Имя = "СтатьяОборотов");		
		КонецЕсли; 
	КонецЕсли;

	Возврат МожноИспользоватьСтьиБюджета;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект 	 = Форма.Объект;
	
	ЭтоФиксМакет = (Объект.Вид = ПредопределенноеЗначение("Перечисление.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет"));
	
	Элементы.Бюджет.Доступность                              	  = МожноИспользоватьСтатьиБюджета(Форма);
	Элементы.ИспользоватьКоэффициентыСтатейБюджета.Видимость 	  = ЗначениеЗаполнено(Объект.Бюджет);
	Элементы.ИспользоватьНаименованияСтатейБюджета.Видимость	  = НЕ Объект.Версия_2 И ЗначениеЗаполнено(Объект.Бюджет);
	
	Элементы.ГруппаСтраницаМакет.Видимость = ЭтоФиксМакет;
	
	Элементы.МакетОформления.Видимость 				= Объект.Версия_2;
	Элементы.ГруппаЦветГруппы.Видимость 			= НЕ Объект.Версия_2;
	Элементы.ГруппаЦветЯчейки.Видимость 			= НЕ Объект.Версия_2;
	Элементы.РасположениеПолейГруппировок.Видимость = Объект.Версия_2;
	Элементы.ОбъединятьЯчейки.Видимость 			= НЕ Объект.Версия_2;
	
	Если Объект.Версия_2 Тогда
		ЗаголовокКнопки = НСтр("ru = 'Вернуться к старой версии'; en = 'Go back to the old version'");
	Иначе	
		ЗаголовокКнопки = НСтр("ru = 'Попробовать новую версию'; en = 'Try the new version'");
	КонецЕсли;
	Элементы.ИзменитьВерсиюФВБ.Заголовок = ЗаголовокКнопки;
	
	ЕстьСвязанныеДокументы = Форма.ЕстьСвязанныеДокументы;
	
	Элементы.СтраницаОтбор.ТолькоПросмотр 						  = ЕстьСвязанныеДокументы;
	Элементы.ИзмеренияКомандаЗаполнитьПоУмолчанию.Доступность	  = НЕ ЕстьСвязанныеДокументы;
	Элементы.Вид.Доступность 									  = НЕ ЕстьСвязанныеДокументы;	
	Элементы.ГруппаИзмерения.ТолькоПросмотр						  = ЕстьСвязанныеДокументы;
	Элементы.Бюджет.ТолькоПросмотр								  = ЕстьСвязанныеДокументы;
	Элементы.Учет_Количество.ТолькоПросмотр 					  = ЕстьСвязанныеДокументы;
	Элементы.Учет_Сумма.ТолькоПросмотр 							  = ЕстьСвязанныеДокументы;
	Элементы.ПараметрНорм.ТолькоПросмотр 						  = ЕстьСвязанныеДокументы;
	Элементы.ИспользоватьНаименованияСтатейБюджета.ТолькоПросмотр = ЕстьСвязанныеДокументы;
	Элементы.ИзменитьВерсиюФВБ.Доступность						  = НЕ ЕстьСвязанныеДокументы;
	
	Элементы.КомандаВводФормулы.Пометка = Форма.фВводФормулы;	

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьБюджет()

	Если НЕ МожноИспользоватьСтатьиБюджета(ЭтотОбъект) Тогда
		Объект.Бюджет = ПредопределенноеЗначение("Справочник.бит_Бюджеты.ПустаяСсылка");
		ОчиститьОтборПоСвязямПараметровВыбора();
	КонецЕсли; 

КонецПроцедуры

// Обновляет текст запроса согласно настройке измерений. 
// 
&НаСервере
Процедура ОбновитьТекстЗапроса()
	
	// Проверка на двойной разворот по статьи.
	Отказ = Ложь;
	Справочники.бит_НастройкиФормВводаБюджета.ПроверитьМножественныйРазворотПоСтатьям(Объект.Измерения, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	Объект.ТекстЗапроса = ОбъектФормы.СформироватьТекстЗапроса();

	НадоОбновитьТекстЗапроса = Ложь;
	
	ИнициироватьКомпоновщик(ОбъектФормы, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ИнициироватьКомпоновщик(ОбъектФормы, СтандартныеНастройки = Истина)
	
	Перем РеквизитыОбъекта;
	
	Если Объект.Версия_2 Тогда
		РеквизитыОбъекта = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(ОбъектФормы);
		АдресКомпоновки = бит_ВводБюджета.ИнициироватьКомпоновщик(РеквизитыОбъекта, Компоновщик, СтандартныеНастройки);
	Иначе	
		АдресКомпоновки = Справочники.бит_НастройкиФормВводаБюджета.ИнициализироватьКомпоновщик(ОбъектФормы.ТекстЗапроса, 
							Компоновщик, УникальныйИдентификатор, , ОбъектФормы.Бюджет);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзмеренияПоУмолчанию()
	
	СпрОб = РеквизитФормыВЗначение("Объект");
	СпрОб.ЗаполнитьИзмеренияПоУмолчанию();
	ЗначениеВРеквизитФормы(СпрОб, "Объект");

	ОбновитьТекстЗапроса();
	ДоработатьТаблицуИзмерения();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВозможностьРедактирования()

	ЕстьСвязанныеДокументы = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 10
	|	бит_ФормаВводаБюджета.Представление КАК ПредставлениеСсылки
	|ИЗ
	|	Документ.бит_ФормаВводаБюджета КАК бит_ФормаВводаБюджета
	|ГДЕ
	|	бит_ФормаВводаБюджета.НастройкаФормы = &НастройкаФормы
	|	И бит_ФормаВводаБюджета.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 10
	|	бит_АктуализацияБюджета.Представление
	|ИЗ
	|	Документ.бит_АктуализацияБюджета КАК бит_АктуализацияБюджета
	|ГДЕ
	|	бит_АктуализацияБюджета.НастройкаФормы = &НастройкаФормы
	|	И бит_АктуализацияБюджета.Проведен";
	
	Запрос.УстановитьПараметр("НастройкаФормы",Объект.Ссылка);	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();

		ТекстСообщения = НСтр("ru='Редактирование настройки ""%1"" запрещено. Эта настройка используется в проведенных документах:';
							  |en='Editing configuration of budget ""%1"" entry forms is prohibited. This configuration is used in the entered documents:'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Объект.Ссылка);
		
		ТекстыСообщений = Новый Массив;
		ТекстыСообщений.Добавить(ТекстСообщения);
		
		Пока Выборка.Следующий() Цикл
			ТекстыСообщений.Добавить("- " + Выборка.ПредставлениеСсылки);
		КонецЦикла; 
		
		ОбщегоНазначения.СообщитьПользователю(СтрСоединить(ТекстыСообщений, Символы.ПС),,, "Объект");
		
		ЕстьСвязанныеДокументы = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьМакет()

	Объект.Формулы.Очистить();
	ТабДокДанные = Новый ТабличныйДокумент;

КонецПроцедуры

&НаСервере
Процедура ОбновитьМакет()

	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли; 

	Если НадоОбновитьТекстЗапроса Тогда
		ОбновитьТекстЗапроса();
	КонецЕсли;
	
	ЗаполнитьДополнительныеИтоги(Объект);
	
	ТабДокДанные.Очистить();
	
	НастройкиКомпоновщика = Компоновщик.ПолучитьНастройки();
	
	ПараметрыОбновленияДерева = Документы.бит_ФормаВводаБюджета.НовыеПараметрыДерева();
	ПараметрыОбновленияДерева.СхемаКомпоновкиДанных		= ПолучитьИзВременногоХранилища(АдресКомпоновки);
	ПараметрыОбновленияДерева.НастройкиКомпоновщика		= НастройкиКомпоновщика;
	ПараметрыОбновленияДерева.Периодичность				= Объект.ПериодичностьПланирования;
	ПараметрыОбновленияДерева.ПродолжительностьИнтервала= Объект.ПродолжительностьИнтервала;	
	ПараметрыОбновленияДерева.ДатаНачалаПланирования	= Объект.ДатаНачалаПланирования;
	ПараметрыОбновленияДерева.ДатаОкончанияПланирования	= Объект.ДатаОкончанияПланирования;
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	СохранитьЦветаОформления(ОбъектФормы);

	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("НастройкиКомпоновщика", НастройкиКомпоновщика);	
	ОбъектФормы.СохранитьНастройкиПостроителя(СтруктураНастройки);
	

	Если Объект.Версия_2 Тогда
		ПараметрыПередачи = бит_ВводБюджета.НовыеПараметрыПосроенияМакетаБюджета();
		ЗаполнитьЗначенияСвойств(ПараметрыПередачи, ПараметрыОбновленияДерева);
		Результат = бит_ВводБюджета.РезультатПостроенияМакетаБюджета(ОбъектФормы, ПараметрыПередачи);
	Иначе	
		Результат = Документы.бит_ФормаВводаБюджета.ОбновитьДеревоДанныхДинамическийМакет(ОбъектФормы, ПараметрыОбновленияДерева);
	КонецЕсли;
	
	ТабДокДанные = Результат.ДокументРезультат;
	
	// Зависимости формул, установленных вручную.
	СопоставлениеСтатей = Новый Соответствие();
	Если ЗначениеЗаполнено(Объект.Бюджет) И НЕ Объект.Версия_2 Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Бюджет", Объект.Бюджет);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СтатьиБюджета.Ссылка КАК СтатьяБюджета,
		|	СтатьиБюджета.СтатьяОборотов КАК СтатьяОборотов
		|ИЗ
		|	Справочник.бит_СтатьиБюджета КАК СтатьиБюджета
		|ГДЕ
		|	СтатьиБюджета.ЭтоГруппа
		|	И СтатьиБюджета.СтатьяОборотов <> ЗНАЧЕНИЕ(Справочник.бит_СтатьиОборотов.ПустаяСсылка)
		|	И СтатьиБюджета.Владелец = &Бюджет";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ИДСтатьяБюджета = СтрЗаменить(XMLСтрока(Выборка.СтатьяБюджета), "-", "");
			ИДСтатьяОборотов = СтрЗаменить(XMLСтрока(Выборка.СтатьяОборотов), "-", "");
			СопоставлениеСтатей.Вставить(ИДСтатьяБюджета, ИДСтатьяОборотов);	
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыВосстановления = бит_БюджетированиеКлиентСервер.ПараметрыВосстановленияФормул();
	ПараметрыВосстановления.ТабДокДанные		= ТабДокДанные;
	ПараметрыВосстановления.ТаблицаФормулы		= Объект.Формулы;
	ПараметрыВосстановления.ЦветФормула			= Цвет_Формула;
	ПараметрыВосстановления.ЗащищатьФормулы		= Объект.ЗащищатьФормулы;
	ПараметрыВосстановления.СопоставлениеСтатей	= СопоставлениеСтатей;
	
	бит_БюджетированиеКлиентСервер.ВосстановитьПользовательскиеФормулы(ПараметрыВосстановления);
	
	СписокСмежности = бит_БюджетированиеКлиентСервер.СписокСмежности(ТабДокДанные);
	
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура УстановитьЦветаПоУмолчанию()

	ЦветаОформления = Справочники.бит_НастройкиФормВводаБюджета.НовыеЦветаОформления();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЦветаОформления);
	
КонецПроцедуры

&НаСервере
Процедура ПреобразоватьЦвета(ОбъектНастроек)

	ЦветаОформления = ОбъектНастроек.ЦветаОформления.Получить();
	
	Если ЦветаОформления = Неопределено Тогда
		ЦветаОформления = Справочники.бит_НастройкиФормВводаБюджета.НовыеЦветаОформления();
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЦветаОформления);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеИтоги(ОбъектНастроек)
	
	ОбъектНастроек.ДополнительныеИтоги.Очистить();

	Для каждого СтрокаТаблицы Из ДополнительныеИтогиПериодов Цикл
		Если СтрокаТаблицы.Выполнять Тогда
			НоваяСтрока = ОбъектНастроек.ДополнительныеИтоги.Добавить();
			НоваяСтрока.Периодичность   = СтрокаТаблицы.Периодичность;
			НоваяСтрока.НарастающийИтог = СтрокаТаблицы.НарастающийИтог;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДополнительныеИтоги(ОбъектНастроек)

	ДополнительныеИтогиПериодов.Очистить();
	
	Для каждого Значение Из Перечисления.бит_ПериодичностьПланирования Цикл
		НоваяСтрока = ДополнительныеИтогиПериодов.Добавить();
		НоваяСтрока.Периодичность = Значение;
		
		Фильтр 	  = Новый Структура("Периодичность", Значение);
		Результат = Объект.ДополнительныеИтоги.НайтиСтроки(Фильтр);
		Если ЗначениеЗаполнено(Результат) Тогда
			НоваяСтрока.Выполнять		= Истина;
			НоваяСтрока.НарастающийИтог = Результат[0].НарастающийИтог;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеВХранилищах(ОбъектНастроек)
		
	СохраненнаяНастройка = ОбъектНастроек.ПолучитьНастройкиПостроителя();
	ТабДокДанные 		 = ОбъектНастроек.ПолучитьДерево();
	СписокСмежности		 = ОбъектНастроек.СписокСмежности();
		
	ПреобразоватьЦвета(ОбъектНастроек);
	ИнициироватьКомпоновщик(ОбъектНастроек);
	
	Если СохраненнаяНастройка.Свойство("НастройкиКомпоновщика") 
		И ТипЗнч(СохраненнаяНастройка.НастройкиКомпоновщика) = Тип("НастройкиКомпоновкиДанных")  Тогда
		
		бит_ОтчетыБФКлиентСервер.СкопироватьЭлементы(Компоновщик.Настройки.Отбор, СохраненнаяНастройка.НастройкиКомпоновщика.Отбор);
		бит_ОтчетыБФКлиентСервер.СкопироватьЭлементы(Компоновщик.Настройки.Порядок, СохраненнаяНастройка.НастройкиКомпоновщика.Порядок);
		Компоновщик.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);

	Иначе
		// Если сохранена еще старая настройка выполним конвертацию отбора построителя в отбор компоновщика.
		бит_МеханизмПолученияДанных.КонвертацияОтборПостроителяОтборКомпоновщика(СохраненнаяНастройка, Компоновщик, Объект.ТекстЗапроса);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипыПоУмолчанию(Знач Аналитика)
	
	МассивВыбора = РегистрыСведений.бит_НазначениеДополнительныхИзмерений.ТипыДополнительнойАналитики(Аналитика);	
	Возврат МассивВыбора;
	
КонецФункции

&НаКлиенте
Процедура РедакторФормул(Команда)
	
	Если Не Элементы.КомандаВводФормулы.Пометка Тогда
		ОбластьПриемник = ТабДокДанные.ТекущаяОбласть;
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОбластьПриемник) 
			 И (бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЗначенияФВБ(ОбластьПриемник.Расшифровка)
					 ИЛИ бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаФормулыФВБ(ОбластьПриемник.Расшифровка)) Тогда
			 
			// Вручную формулы можно устанавливать только для ячеек значение.
			фИмяЯчейкиВводФормулы = ТабДокДанные.ТекущаяОбласть.Имя;
	    	рф_Открыть();
			Если ЭтотОбъект.рфРедакторФормулОткрыт Тогда
				рфФормула = ФормулаПредставление;
			КонецЕсли;	
		Иначе
			// Формулу вводить нельзя.
			фИмяЯчейкиВводФормулы = "";
			фВводФормулы = Ложь;
			Элементы.КомандаВводФормулы.Пометка = фВводФормулы;			
			Элементы.ФормулаПредставление.ТолькоПросмотр = НЕ фВводФормулы;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

// Процедура обрабатывает изменения при работе с Редактором формул.
// 
&НаКлиенте
Процедура ПринятьИзменения()
	
	ОбластьПриемник = ТабДокДанные.Области.Найти(фИмяЯчейкиВводФормулы);
			
	Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОбластьПриемник) 
		И бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЯчейкиФВБ(ОбластьПриемник.Расшифровка)  Тогда
		
		Если НЕ ПустаяСтрока(ЭтотОбъект.рфФормула)  Тогда
			Если НЕ бит_СтрокиКлиент.ФормулаКорректна(ЭтотОбъект.рфФормула, Истина) Тогда
				// Формула введена некорректно - продолжим редактирование.
				фВводФормулы = Истина;
				Элементы.КомандаВводФормулы.Пометка = фВводФормулы;
				Элементы.ФормулаПредставление.ТолькоПросмотр = НЕ фВводФормулы;						
				Возврат;
			КонецЕсли; 
			
			Если ПустаяСтрока(Формула) Тогда
				Формула = бит_БюджетированиеКлиент.ПолучитьФормулуИзПредставления(ТабДокДанные, ЭтотОбъект.рфФормула);
			КонецЕсли;
			
			Если СтрСравнить(ОбластьПриемник.Расшифровка.Формула, Формула) = 0 Тогда
				Возврат;
			КонецЕсли;
			
			// Удаления зависимостей от предыдущих аргументов.
			ПредыдущиеАргументы = ОбластьПриемник.Расшифровка.Аргументы;
			Для каждого Арг Из ПредыдущиеАргументы Цикл
				Если СписокСмежности.Свойство(Арг) Тогда
					ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(СписокСмежности[Арг], ОбластьПриемник.Имя);
				КонецЕсли;
			КонецЦикла;
			ОбластьПриемник.Расшифровка.Аргументы = Новый Массив();
			
			// Добавление новых аргументов.
			МассивАргументы = бит_СтрокиКлиентСервер.РазобратьФормулу(Формула);
			Для каждого Арг Из МассивАргументы Цикл
				ОбластьПриемник.Расшифровка.Аргументы.Добавить(Арг);
				// Необходимо установить зависимости ячеек.
				Если СписокСмежности.Свойство(Арг) Тогда
					Если СписокСмежности[Арг].Найти(Арг) = Неопределено Тогда
						СписокСмежности[Арг].Добавить(фИмяЯчейкиВводФормулы);
					КонецЕсли;
				Иначе
					СмежныеВершины = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(фИмяЯчейкиВводФормулы);
					СписокСмежности.Вставить(Арг, СмежныеВершины); 
				КонецЕсли; 
			КонецЦикла; 
			
			// Устанавливаем формулу.
			Расшифровка = ОбластьПриемник.Расшифровка;
			Расшифровка.Формула	 = Формула;
			Расшифровка.ЦветФона = ОбластьПриемник.ЦветФона;
			
			ОбластьПриемник.ЦветФона = Цвет_Формула;
			Если Объект.ЗащищатьФормулы Тогда
				ОбластьПриемник.Защита = Истина;
			КонецЕсли; 
			
			// Записываем формулу в таб. часть формулы чтобы при обновлении дерева она не сбросилась.
			ЗаписатьФормулуВТабЧасть(ОбластьПриемник.Имя, Расшифровка.Формула, Объект.Формулы);					
			Модифицированность    = Истина;
			ИзменениеСодержимогоОбласти(ОбластьПриемник);
		Иначе	
			// Формула пустая - очистим в расшифровке и таб. части.
			ОчиститьФормулу(ОбластьПриемник);
		КонецЕсли;  
		
	КонецЕсли; // Ячейка подходит.
	
КонецПроцедуры

// Процедура обрабатывает изменение содержимого области. 
// 
&НаКлиенте
Процедура ИзменениеСодержимогоОбласти(ОблМакета)
	
	Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОблМакета) Тогда
		Модифицированность = Истина;
		ОчиститьСообщения();
		РезультатРасчета = бит_БюджетированиеКлиент.РассчитатьЗависимыеФормулы(ТабДокДанные, ОблМакета.Имя, СписокСмежности);
		Если РезультатРасчета = Ложь Тогда
			ОчиститьФормулу(ОблМакета, Истина);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Функция ЗадатьВопросОбОчисткеДанных() 
	
	Результат = КодВозвратаДиалога.Да;
	
	Если Объект.Вид = ПредопределенноеЗначение("Перечисление.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет") 
		 И ТабДокДанные.ВысотаТаблицы > 0 Тогда
		 
		ТекстВопроса = НСтр("ru='Макет будет очищен. Продолжить?';en='The layout will be cleared. Continue?'");
		Результат	 = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет,5,КодВозвратаДиалога.Нет);
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

// Процедура очищает формулу в области и очищает строку соответствующую формуле в табличной части Формулы.
// 
// Параметры:
//  Обл - ТабличныйДокумент.
// 
&НаКлиенте
Процедура ОчиститьФормулу(Обл, ОбновитьЗависимостиЯчеек = Ложь)
	
	Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Обл) 
		И бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЯчейкиФВБ(Обл.Расшифровка) Тогда
		
		Обл.Расшифровка.Формула = "";
		ПредыдущиеАргументы = Обл.Расшифровка.Аргументы;
		Обл.Расшифровка.Аргументы = Новый Массив;
		
		Обл.ЦветФона = Обл.Расшифровка.ЦветФона;
		Обл.Защита   = Ложь;
		
		СтрОтбор = Новый Структура("ИмяЯчейки", Обл.Имя);
		МассивСтрок = НайтиСтрокиСканированием(Объект.Формулы, СтрОтбор);
		
		Для каждого СтрокаТаблицы Из МассивСтрок Цикл
			Объект.Формулы.Удалить(СтрокаТаблицы);
		КонецЦикла; 
		
		Формула = "";
		ФормулаПредставление = "";
		Модифицированность = Истина;
		
		Если ОбновитьЗависимостиЯчеек Тогда
			// Зависимости формул, установленных вручную.
			ПараметрыВосстановления = бит_БюджетированиеКлиентСервер.ПараметрыВосстановленияФормул();
			ПараметрыВосстановления.ТабДокДанные	= ТабДокДанные;
			ПараметрыВосстановления.ТаблицаФормулы	= Объект.Формулы;
			ПараметрыВосстановления.ЦветФормула		= Цвет_Формула;
			ПараметрыВосстановления.ЗащищатьФормулы	= Объект.ЗащищатьФормулы;
			бит_БюджетированиеКлиентСервер.ВосстановитьПользовательскиеФормулы(ПараметрыВосстановления);
			СписокСмежности = бит_БюджетированиеКлиентСервер.СписокСмежности(ТабДокДанные);
		Иначе
			// Удаляем предыдущую связь по формуле.
			Для каждого Арг Из ПредыдущиеАргументы Цикл
				Если СписокСмежности.Свойство(Арг) Тогда
					ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(СписокСмежности[Арг], Обл.Имя);
				КонецЕсли;
			КонецЦикла; 	
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

// Процедура записывает формулу в табличную часть Формулы.
// 
// Параметры:
//  ИмяОбласти - Строка.
//  Формула - Строка
//  ТабЧасть - ТабличнаяЧасть
// 
&НаКлиенте
Процедура ЗаписатьФормулуВТабЧасть(ИмяОбласти, Формула, ТабЧасть)
	
	СтрОтбор = Новый Структура;
	СтрОтбор.Вставить("ИмяЯчейки", ИмяОбласти);
	МассивСтрок = НайтиСтрокиСканированием(ТабЧасть, СтрОтбор);
	Если МассивСтрок.Количество() = 0 Тогда
		СтрокаФормулы = ТабЧасть.Добавить();
		СтрокаФормулы.ИмяЯчейки = ИмяОбласти;
	Иначе	
		СтрокаФормулы = МассивСтрок[0];
	КонецЕсли; 
	СтрокаФормулы.Формула = Формула;
	
КонецПроцедуры

// Процедура выполняет копирование данных из буфера. 
// 
// Параметры:
//  Буфер      - Массив.
//  ПараметрыВставки - Структура
// 
&НаКлиенте
Процедура ВыполнитьКопированиеДанных(Буфер, ПараметрыВставки)
	
	КоличествоСкопированных = Буфер.Количество();
	Приемники = Новый Массив;
	// Определение ячеек приемников.
	Если КоличествоСкопированных = 0 Тогда
		// Ничего делать не нужно.
	ИначеЕсли КоличествоСкопированных = 1 Тогда
		// Если скопирована одна ячейка, то в случае выделения области ее нужно вставить во вся ячейки области.
		ДельтаГ = ПараметрыВставки.Право - ПараметрыВставки.Лево + 1;
		ДельтаВ = ПараметрыВставки.Низ   - ПараметрыВставки.Верх + 1;
		
		ЛевоНач = ПараметрыВставки.Лево;
		ВерхНач = ПараметрыВставки.Верх;
		Для нг = 1 По ДельтаГ Цикл
			Лево   = ЛевоНач + нг-1;
			Для нв = 1 По ДельтаВ Цикл
				Верх = ВерхНач + нв-1;
				Обл  = ТабДокДанные.Область(Верх, Лево, Верх, Лево);
				// Если выделенная ячейка является ячейкой вида Значение - запомним координаты.
				Расшифровка = Обл.Расшифровка;
				Если (бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЗначенияФВБ(Расшифровка)
					 ИЛИ бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаФормулыФВБ(Расшифровка)) Тогда
					
					Приемники.Добавить(Обл);
				КонецЕсли; // ИмяКласса подходит.
			КонецЦикла; 
		КонецЦикла; 
	Иначе	
		// Если копируется более одной ячейки - 
		// выполняем копирование области начиная с левого верхнего угла выделенной области.
		Обл = ТабДокДанные.Область(ПараметрыВставки.Верх, ПараметрыВставки.Лево, ПараметрыВставки.Верх, ПараметрыВставки.Лево);
		Расшифровка = Обл.Расшифровка;
		Если (бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЗначенияФВБ(Расшифровка)
			 ИЛИ бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаФормулыФВБ(Расшифровка)) Тогда
			
			Приемники.Добавить(Обл);
		КонецЕсли; // ИмяКласса подходит.
	КонецЕсли; 
	
	// Выполнение копирования.
	Для каждого ОбластьПриемник Из Приемники Цикл
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОбластьПриемник) Тогда
			ЛевоНач = ОбластьПриемник.Лево;
			ВерхНач = ОбластьПриемник.Верх;
			Для каждого ПараметрыКопирования Из Буфер Цикл
				Лево = ЛевоНач+ПараметрыКопирования.СдвигГор;
				Верх = ВерхНач+ПараметрыКопирования.СдвигВерт;
				Обл = ТабДокДанные.Область(Верх, Лево, Верх, Лево);
				
				Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Обл) 
					И (бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЗначенияФВБ(Обл.Расшифровка)
					 ИЛИ бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаФормулыФВБ(Обл.Расшифровка)) Тогда
					
					Расшифровка = Обл.Расшифровка;
					Если РежимСдвигаФормулы = 0
						И СтрСравнить(Расшифровка.Формула, ПараметрыКопирования.Формула) = 0 Тогда
						Продолжить;
					КонецЕсли;
										
					Расшифровка.Формула		= ПараметрыКопирования.Формула;
					// Удаления зависимостей от предыдущих аргументов.
					ПредыдущиеАргументы = Расшифровка.Аргументы;
					Для каждого Арг Из ПредыдущиеАргументы Цикл
						Если СписокСмежности.Свойство(Арг) Тогда
							ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(СписокСмежности[Арг], Обл.Имя);
						КонецЕсли;
					КонецЦикла;
					Расшифровка.Аргументы	= ПараметрыКопирования.Аргументы;
					Если Объект.ЗащищатьФормулы Тогда
						Обл.Защита = Истина;
					КонецЕсли; 
					Обл.ЦветФона = Цвет_Формула;
					
					// Сдвиг относительно первоначальной скопированной ячейки.
					ДельтаГ = ЛевоНач - ПараметрыКопирования.Лево+ПараметрыКопирования.СдвигГор;
					ДельтаВ = ВерхНач - ПараметрыКопирования.Верх+ПараметрыКопирования.СдвигВерт;
					ВыполнитьСдвигФормулы(Расшифровка, ДельтаГ, ДельтаВ, РежимСдвигаФормулы);
					
					Для каждого Арг Из  Расшифровка.Аргументы Цикл
						// Необходимо установить зависимости ячеек.
						Если СписокСмежности.Свойство(Арг) Тогда
							Если СписокСмежности[Арг].Найти(Обл.Имя) = Неопределено Тогда
								СписокСмежности[Арг].Добавить(Обл.Имя);
							КонецЕсли;
						Иначе
							СмежныеВершины = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Обл.Имя);
							СписокСмежности.Вставить(Арг, СмежныеВершины); 
						КонецЕсли; 
					КонецЦикла; 
					
					// Записываем формулу в таб. часть формулы чтобы при обновлении дерева она не сбросилась.
					ЗаписатьФормулуВТабЧасть(Обл.Имя, Расшифровка.Формула, Объект.Формулы);
					ИзменениеСодержимогоОбласти(Обл);
					Модифицированность    = Истина;						 
					
				КонецЕсли; 
			КонецЦикла; // По данным копирования.
		КонецЕсли; // Область приемник подходит.
	КонецЦикла; // Приемники.
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСдвигФормулы(Расшифровка, ДельтаГ, ДельтаВ, РежимСдвигаФормулы)
	
	Если НЕ РежимСдвигаФормулы = 1 И НЕ РежимСдвигаФормулы = 2 И НЕ РежимСдвигаФормулы = 3 Тогда
		Возврат;
	КонецЕсли; 
	
	Расшифровка.Аргументы = бит_РаботаСКоллекциямиКлиентСервер.УдалитьПовторяющиесяЭлементыМассива(Расшифровка.Аргументы);
	АргСоотв = Новый Соответствие;
	
	Для й = 0 По Расшифровка.Аргументы.ВГраница() Цикл
		АргСтарый = Расшифровка.Аргументы[й];
		ИмяАрг = "%Арг_"+Формат(й+1, "ЧГ=")+"%";
		Расшифровка.Формула = СтрЗаменить(Расшифровка.Формула, АргСтарый, ИмяАрг);
		ОблНач = ТабДокДанные.Области.Найти(АргСтарый);
		Лево = ОблНач.Лево+?(РежимСдвигаФормулы = 3 ИЛИ РежимСдвигаФормулы = 1, ДельтаГ, 0);
		Верх = ОблНач.Верх+?(РежимСдвигаФормулы = 3 ИЛИ РежимСдвигаФормулы = 2, ДельтаВ, 0);
		Обл = ТабДокДанные.Область(Верх, Лево, Верх, Лево);
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Обл)  
			И (бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЗначенияФВБ(Обл.Расшифровка)
			ИЛИ бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаФормулыФВБ(Обл.Расшифровка))  Тогда
			
			Расшифровка.Аргументы[й] = Обл.Имя;
		Иначе
			Расшифровка.Аргументы[й] = АргСтарый;
		КонецЕсли; 
		АргСоотв.Вставить(ИмяАрг, Расшифровка.Аргументы[й]);
	КонецЦикла;
	
	Для каждого КиЗ Из АргСоотв Цикл
		Расшифровка.Формула = СтрЗаменить(Расшифровка.Формула, КиЗ.Ключ, КиЗ.Значение);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКоллекцияюЭлементов(Коллекция)
	
	ЭлементыДляУдаления = Новый Массив;
	Для Каждого ЭлементКоллекции Из Коллекция Цикл
			ЭлементыДляУдаления.Добавить(ЭлементКоллекции);
	КонецЦикла;
	Для Каждого Элемент Из ЭлементыДляУдаления Цикл
		Коллекция.Удалить(Элемент);
	КонецЦикла;
	
КонецПроцедуры

#Область ПроцедурыИФункцииДляРаботыСРедакторомФормул

&НаКлиенте
Процедура рф_АнализЗначенияВводФормул()

	бит_РедакторФормулКлиент.АнализЗначенияВводФормул(ЭтотОбъект, ТабДокДанные, ПравилаЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура рф_Открыть()

	бит_РедакторФормулКлиент.ОткрытьРедакторФормул(ЭтотОбъект, ТабДокДанные);
	
КонецПроцедуры

&НаКлиенте 
Процедура рф_РедакторФормул_ЗавершитьРедактированиеОкончание(Ответ, ДополнительныеДанные) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПринятьИзменения();   						
	КонецЕсли; 
	бит_РедакторФормулКлиент.рф_ЗакрытьСервер(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РедакторФормул_ПростыеКоманды(Команда)
	
	бит_РедакторФормулКлиент.РедакторФормул_ПростыеКоманды(Команда, ЭтотОбъект);
				
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РедакторФормул_Очистить(Команда)
	
	бит_РедакторФормулКлиент.РедакторФормул_Очистить(ЭтотОбъект);  	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РедакторФормул_Функция(Команда)
	
	бит_РедакторФормулКлиент.РедакторФормул_Функция(Команда, ЭтотОбъект);  	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РедакторФормул_Вернуть()

	бит_РедакторФормулКлиент.РедакторФормул_Вернуть(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РедакторФормул_ЗавершитьРедактирование(Команда)
	
	Если ЭтотОбъект.рфРедакторФормулОткрыт Тогда
		Оповещение = Новый ОписаниеОповещения("рф_РедакторФормул_ЗавершитьРедактированиеОкончание", ЭтотОбъект); 
		Если Команда.Имя = "РедакторФормул_ОК" Тогда
			ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
		Иначе	
			Если ЭтотОбъект.рфФормула <> ЭтотОбъект.рфСтараяФормула Тогда
				ТекстВопроса = НСтр("ru='Формула изменена, принять изменения?';en='Formula was changed, accept the changes?'");
				ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, ,КодВозвратаДиалога.Нет);
			Иначе
				ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Нет);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыбранныеОбластиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	бит_РедакторФормулКлиент.ВыбранныеОбластиВыбор(ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыбранныеОбластиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	бит_РедакторФормулКлиент.ВыбранныеОбластиПередНачаломДобавления(ЭтотОбъект, Отказ);
			
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыбранныеОбластиПередУдалением(Элемент, Отказ)
	
	бит_РедакторФормулКлиент.ВыбранныеОбластиПередУдалением(ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтрокаНазадОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	бит_РедакторФормулКлиент.СтрокаНазадОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ФормулаПриИзменении(Элемент)

	бит_РедакторФормулКлиент.ПриИзмененииФормулы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти  

// Выполняет поиск строк в таблице сканированием, что бы исключить переход на сервер в клиентских алгоритмах.
//
&НаКлиентеНаСервереБезКонтекста
Функция НайтиСтрокиСканированием(Таблица, Фильтры)

	РезультатПоиска = Новый Массив;	
	Для каждого СтрокаТаблицы Из Таблица Цикл
		Успех = Ложь;
		Для каждого КлючЗначение Из Фильтры Цикл
			Если ТипЗнч(КлючЗначение.Значение) = Тип("Массив") 
			   И КлючЗначение.Значение.Найти(СтрокаТаблицы[КлючЗначение.Ключ]) <> Неопределено Тогда
				Успех = Истина;
			ИначеЕсли СтрокаТаблицы[КлючЗначение.Ключ] = КлючЗначение.Значение Тогда
				Успех = Истина;
			Иначе	
				Успех = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Успех Тогда
			РезультатПоиска.Добавить(СтрокаТаблицы);	
		КонецЕсли;	
	КонецЦикла;

	Возврат РезультатПоиска;
	
КонецФункции

&НаСервере
Процедура СохранитьЦветаОформления(ТекущийОбъект)
	
	Перем ЦветаОформления;
	
	ЦветаОформления = Справочники.бит_НастройкиФормВводаБюджета.НовыеЦветаОформления();
	ЗаполнитьЗначенияСвойств(ЦветаОформления, ЭтотОбъект);
	ТекущийОбъект.ЦветаОформления = Новый ХранилищеЗначения(ЦветаОформления, Новый СжатиеДанных(9));

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеПоляТабличногоДокумента(Показать)

	ОтображениеСостояния = Элементы.ТабДокДанные.ОтображениеСостояния;
	
	Если ТабДокДанные.ВысотаТаблицы > 0 И Показать Тогда
		ОтображениеСостояния.Видимость                      = Истина;
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
		ОтображениеСостояния.Картинка                       = Новый Картинка;
		ОтображениеСостояния.Текст                          = НСтр("ru = 'Макет не сформирован. Нажмите ""Обновить макет"" для заполнения макета.'");
	Иначе
		ОтображениеСостояния.Видимость                      = Ложь;
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
		ОтображениеСостояния.Картинка                       = Новый Картинка;
		ОтображениеСостояния.Текст                          = "";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМакетыОформления()

	СписокМакетовОформления = бит_ОтчетыБФСервер.СписокМакетовОформления();
	Для каждого ЭлементСписка Из СписокМакетовОформления Цикл
		Элементы.МакетОформления.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ГруппировкиБюджета(Форма)

	Объект  = Форма.Объект;
	
	ЗначенияФильтра = Новый Массив; 
	ЗначенияФильтра.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать"));
	ЗначенияФильтра.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.РазворачиватьСИерархией"));
	
	Фильтры = Новый Структура("СпособЗаполнения", ЗначенияФильтра);
				
	Возврат НайтиСтрокиСканированием(Объект.Измерения, Фильтры);	

КонецФункции

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьПараметрыВыбораСпособаЗаполнения(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	НовыеПараметры = Новый Массив; 
	НовыеПараметры.Добавить(Новый ПараметрВыбора("Отбор.Версия_2", Объект.Версия_2));
	
	Элементы.ИзмеренияСпособЗаполнения.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметры);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НастройкиГруппировокБюджета(Форма)

	Результат 	= ГруппировкиБюджета(Форма);
	НовыйСписок = Новый СписокЗначений;
	Для каждого СтрокаТаблицы Из Результат Цикл
		НовыйСписок.Добавить(СтрокаТаблицы.СпособЗаполнения, СтрокаТаблицы.Имя);	
	КонецЦикла;

	Возврат НовыйСписок;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеТаблицыИзмерения()

	Если ИзмеренияРедактируютсяПользователем Тогда
		Возврат;
	КонецЕсли;

	НовыеНастройкиГруппировок = НастройкиГруппировокБюджета(ЭтотОбъект);
	НадоОбновитьСКД		 	  = Ложь;
	
	Если ТекущиеНастройкиГруппировок.Количество() <> НовыеНастройкиГруппировок.Количество() Тогда
		НадоОбновитьТекстЗапроса = Истина;	
	Иначе
		Индекс = ТекущиеНастройкиГруппировок.Количество() - 1;
		
		// Проверка измерения порядка и настроек группировок для цели определения необходимости обновления схемы компоновки данных.
		Пока Индекс >= 0 Цикл
			СтаряЗапись = ТекущиеНастройкиГруппировок.Получить(Индекс);
			НоваяЗапись = НовыеНастройкиГруппировок.Получить(Индекс);
			Если СтаряЗапись.Значение <> НоваяЗапись.Значение ИЛИ СтаряЗапись.Представление <> НоваяЗапись.Представление Тогда
				НадоОбновитьСКД = Истина;
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
		
		// Проверка измерения состава группировок для цели определения необходимости обновления текста запроса.
		КопияТекущиеНастройкиГруппировок = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ТекущиеНастройкиГруппировок);
		КопияНовыеНастройкиГруппировок 	 = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(НовыеНастройкиГруппировок);
		
		КопияТекущиеНастройкиГруппировок.СортироватьПоПредставлению();
		КопияНовыеНастройкиГруппировок.СортироватьПоПредставлению();
		
		Пока Индекс >= 0 Цикл
			СтаряЗапись = КопияТекущиеНастройкиГруппировок.Получить(Индекс);
			НоваяЗапись = КопияНовыеНастройкиГруппировок.Получить(Индекс);
			Если СтаряЗапись.Значение <> НоваяЗапись.Значение Тогда
				НадоОбновитьТекстЗапроса = Истина;
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
	КонецЕсли;
	ТекущиеНастройкиГруппировок = НовыеНастройкиГруппировок;

	Если НадоОбновитьСКД И НЕ НадоОбновитьТекстЗапроса Тогда		
		ОбработатьИзменениеТаблицыИзмеренияНаСервере();
	КонецЕсли;
	
	Если НадоОбновитьСКД ИЛИ НадоОбновитьТекстЗапроса Тогда
		УстановитьСостояниеПоляТабличногоДокумента(Истина);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеТаблицыИзмеренияНаСервере()

	Объектформы = РеквизитФормыВЗначение("Объект");
	ИнициироватьКомпоновщик(Объектформы, Ложь);

КонецПроцедуры

#КонецОбласти
