////////////////////////////////////////////////////////////////////////////////
// Подсистема "Учет мигрантов".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет, что конфигурация работает в режиме отдельной конфигурации, а не в
// составе типовой.
//
// Возвращаемое значение:
//   Булево
//
Функция ЭтоУМ() Экспорт
	
	Возврат Метаданные.Имя = "УчетМигрантов";
	
КонецФункции

// Находит в справочнике "Виды оформляемых документов" элемент по имени макета
// и возвращает ссылку на него.
//
// Параметры:
//   ИмяМакета - Строка - имя макета формы отчетности.
//
// Возвращаемое значение:
//   СправочникСсылка.бит_ум_ВидыОформляемыхДокументов - вид оформляемого документа,
//		соответствующий макету.
//
Функция ПолучитьВидОформляемогоДокументаПоИмени(ИмяМакета) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ИмяМакета", ИмяМакета);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыОформляемыхДокументов.Ссылка
	|ИЗ
	|	Справочник.бит_ум_ВидыОформляемыхДокументов КАК ВидыОформляемыхДокументов
	|ГДЕ
	|	ВидыОформляемыхДокументов.ИмяМакета = &ИмяМакета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Вид оформляемого документа ""%1"" не найден.'"), ИмяМакета);
	КонецЕсли;
		
	Возврат Выборка.Ссылка;

КонецФункции

// Для указанного вида оформляемого документа возвращает список используемых параметров
// печати.
//
// Параметры:
//   ВидОформляемогоДокумента - СправочникСсылка.бит_ум_ВидыОформляемыхДокументов - вид документа,
//		для которого нужно получить параметры печати.
//
// Возвращаемое значение:
//   Массив - список параметров печати.
//
Функция ПолучитьСписокПараметровПечати(ВидОформляемогоДокумента) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ВидОформляемогоДокумента", ВидОформляемогоДокумента);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НазначениеДополнительныхПараметровПечати.ДополнительныйПараметрПечати КАК ПараметрПечати
	|ИЗ
	|	РегистрСведений.бит_ум_НазначениеДополнительныхПараметровПечати КАК НазначениеДополнительныхПараметровПечати
	|ГДЕ
	|	НазначениеДополнительныхПараметровПечати.ВидОформляемогоДокумента = &ВидОформляемогоДокумента
	|	И НазначениеДополнительныхПараметровПечати.ДополнительныйПараметрПечати <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.ПустаяСсылка)
	|	И НазначениеДополнительныхПараметровПечати.ДополнительныйПараметрПечати.Автозаполнение = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НазначениеДополнительныхПараметровПечати.ДополнительныйПараметрПечати.РеквизитДопУпорядочивания";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПараметрПечати");
	
КонецФункции

// Для указанного вида оформляемого документа возвращает список используемых параметров
// печати, которые определяются их свойств других объектов.
//
// Параметры:
//   ВидОформляемогоДокумента - СправочникСсылка.бит_ум_ВидыОформляемыхДокументов - вид документа,
//		для которого нужно получить параметры печати.
//
// Возвращаемое значение:
//   Массив - список параметров печати.
//
Функция ПолучитьСписокПараметровСвойств(ВидОформляемогоДокумента) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ВидОформляемогоДокумента", ВидОформляемогоДокумента);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НазначениеДополнительныхПараметровПечати.ДополнительныйПараметрПечати КАК ПараметрПечати,
	|	НазначениеДополнительныхПараметровПечати.ДополнительныйПараметрПечати.Свойство КАК Свойство,
	|	НазначениеДополнительныхПараметровПечати.ДополнительныйПараметрПечати.Свойство.НаборСвойств.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	РегистрСведений.бит_ум_НазначениеДополнительныхПараметровПечати КАК НазначениеДополнительныхПараметровПечати
	|ГДЕ
	|	НазначениеДополнительныхПараметровПечати.ВидОформляемогоДокумента = &ВидОформляемогоДокумента
	|	И НазначениеДополнительныхПараметровПечати.ДополнительныйПараметрПечати <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.ПустаяСсылка)
	|	И НазначениеДополнительныхПараметровПечати.ДополнительныйПараметрПечати.Автозаполнение = ИСТИНА
	|	И НазначениеДополнительныхПараметровПечати.ДополнительныйПараметрПечати.ИмяПараметра <> """"";
	
	Если Метаданные.Справочники.НаборыДополнительныхРеквизитовИСведений.Реквизиты.Найти("ИмяПредопределенногоНабора") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"НазначениеДополнительныхПараметровПечати.ДополнительныйПараметрПечати.Свойство.НаборСвойств.ИмяПредопределенныхДанных",
			"ВЫБОР
			|	КОГДА НазначениеДополнительныхПараметровПечати.ДополнительныйПараметрПечати.Свойство.НаборСвойств.ИмяПредопределенногоНабора = """" ТОГДА
			|		НазначениеДополнительныхПараметровПечати.ДополнительныйПараметрПечати.Свойство.НаборСвойств.ИмяПредопределенныхДанных
			|	ИНАЧЕ
			|		НазначениеДополнительныхПараметровПечати.ДополнительныйПараметрПечати.Свойство.НаборСвойств.ИмяПредопределенногоНабора
			|КОНЕЦ");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Получает значение настройки из константы.
//
// Параметры:
//   ИмяВида - Строка - имя константы без префикса.
// 
// Возвращаемое значение:
//   Произвольный - значение константы.
//
Функция ПолучитьКонстантуИзНастроек(ИмяВида) Экспорт
	
	Возврат Константы["бит_ум_" + ИмяВида].Получить();
	
КонецФункции

// Проверяет существование регистра сведений по имени.
//
// Параметры:
//   Имя - Строка - имя регистра сведений.
//
// Возвращаемое значение:
//   Булево - истина, если регистр сведений существует, иначе ложь.
//
Функция РегистрСведенийСуществует(Имя) Экспорт
	
	Возврат Метаданные.РегистрыСведений.Найти(Имя) <> Неопределено;
	
КонецФункции

// Проверяет существование регистра накопления по имени.
//
// Параметры:
//   Имя - Строка - имя регистра накопления.
//
// Возвращаемое значение:
//   Булево - истина, если регистр накопления существует, иначе ложь.
//
Функция РегистрНакопленияСуществует(Имя) Экспорт
	
	Возврат Метаданные.РегистрыНакопления.Найти(Имя) <> Неопределено;
	
КонецФункции

// Возвращает список возможных дополнительных настроек для вида оформляемого документа.
//
// Параметры:
//   ВидОформляемогоДокумента - СправочникСсылка.бит_ум_ВидыОформляемыхДокументов
//     - вид оформляемого документа, для которого нужно получить настройки.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с колонками:
//     * Настройка - ПланВидовХарактеристикСсылка.бит_ум_НастройкиДействий.
//     * НачальноеЗначение - Произвольный - начальное значение настройки.
//
Функция СписокВозможныхНастроекВидаОформляемогоДокумента(ВидОформляемогоДокумента) Экспорт
	
	Возврат Справочники.бит_ум_ВидыОформляемыхДокументов.СписокВозможныхНастроек(ВидОформляемогоДокумента);
	
КонецФункции

#КонецОбласти