
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьНадписиИсточникПриемник();
	ПодготовленаПриЧтении = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ПодготовленаПриЧтении Тогда
		ЗаполнитьНадписиИсточникПриемник();	
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПравилоЗаполненияПриИзменении(Элемент)
	
	ЗаполнитьНадписиИсточникПриемник();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСистемыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидыОбъектов = Новый СписокЗначений;
	ВидыОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Документ"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы", Запись.ОбъектСистемы);
	ПараметрыФормы.Вставить("ВидыОбъектов"        , ВидыОбъектов);
	
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСистемыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		ПодобратьОбъектСистемыПоТексту(Текст, ДанныеВыбора);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбъектСистемыОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		ПодобратьОбъектСистемыПоТексту(Текст, ДанныеВыбора);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбъектСистемыПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Запись.ОбъектСистемы) Тогда
		Запись.ЭтоИсключение	 = Ложь;	
		Запись.УсловиеПрименения = Неопределено;	
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНадписиИсточникПриемник()

	Источник = Неопределено;
	Приемник = Неопределено;
	
	Если ЗначениеЗаполнено(Запись.ПравилоЗаполнения) Тогда
		РеквизитыПравила = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.ПравилоЗаполнения, "Источник, Приемник"); 
		Источник = РеквизитыПравила.Источник;
		Приемник = РеквизитыПравила.Приемник
	КонецЕсли;

КонецПроцедуры

&НаКлиенте 
Процедура ПодобратьОбъектСистемыПоТексту(Текст, ДанныеВыбора)
	
	ДоступныеОбъекты = ДоступныеОбъектыСистемы();
	ДанныеВыбора	 = Новый СписокЗначений;
	
	Для каждого ЭлементСписка Из ДоступныеОбъекты Цикл
		Если СтрНачинаетсяС(ВРег(ЭлементСписка.Значение), ВРег(Текст)) Тогда
			ДанныеВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Если ДанныеВыбора.Количество() = 1 Тогда
		Запись.ОбъектСистемы = ДанныеВыбора[0].Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ДоступныеОбъектыСистемы()
	
	ДоступныеОбъекты = Новый СписокЗначений;
	
	ОбъектыСистемы = Новый Массив;
	Для каждого МетаОбъект Из Метаданные.Документы Цикл

		Если СтрЧислоВхождений(МетаОбъект.Имя, "удалить") <> 0 Тогда
			Продолжить;	
		КонецЕсли; 
		
		ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);
		Если ЗначениеЗаполнено(ОбъектСистемы) Тогда  
			ОбъектыСистемы.Добавить(ОбъектСистемы);			
		КонецЕсли; 
	КонецЦикла;
	
	ВидыОбъектов = Новый Массив;
	ВидыОбъектов.Добавить(Перечисления.бит_ВидыОбъектовСистемы.Документ);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ВидОбъекта", 	ВидыОбъектов);
	Запрос.УстановитьПараметр("ОбъектыСистемы", ОбъектыСистемы);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ОбъектыСистемы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
	|ГДЕ
	|	бит_ОбъектыСистемы.Ссылка В(&ОбъектыСистемы)
	|	И бит_ОбъектыСистемы.ВидОбъекта В(&ВидОбъекта)";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ДоступныеОбъекты.ЗагрузитьЗначения(Результат.Выгрузить().ВыгрузитьКолонку("Ссылка"));	
	КонецЕсли;
	
	Возврат ДоступныеОбъекты;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Запись	 = Форма.Запись;
	Элементы = Форма.Элементы;

	Элементы.ЭтоИсключение.Доступность 	   = ЗначениеЗаполнено(Запись.ОбъектСистемы);
	Элементы.УсловиеПрименения.Доступность = ЗначениеЗаполнено(Запись.ОбъектСистемы);
	
КонецПроцедуры

#КонецОбласти