
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Физлицо", Физлицо);
	Параметры.Свойство("Руководитель", Руководитель);
	Параметры.Свойство("ИзФормыСотрудника", ИзФормыСотрудника);
	
	Если ИзФормыСотрудника Тогда
		Если ЗначениеЗаполнено(Физлицо) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Физлицо", Физлицо);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Руководитель) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Руководитель", Руководитель);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
