#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		ДатаНачала = Дата;
		// Заполнение шапки.
		бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), Неопределено);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ПривестиЗначенияВТаблице();
	
КонецПроцедуры
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
				
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проверка заполнения при программном проведении документа.
	// Выполняется, если эта проверка не была выполнена раньше.
	ПроверитьЗаполнение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, 
									"ПроверитьЗаполнение", Истина);
	
	Если ПроверитьЗаполнение Тогда
		Если НЕ ПроверитьЗаполнение() Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли; 
 	
	// Сбросим флаг, что бы при повторном программном проведении, вызвать проверку. См. ОбработкаПроверкиЗаполнения().
	ДополнительныеСвойства.Вставить("ПроверитьЗаполнение", Истина);
	
	// Проверка ручной корректировки.
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,"",ЭтотОбъект,Ложь) Тогда
		Возврат
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ТаблицаЗависимостей = ПодготовитьТаблицуЗависимостей();
	
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаЗависимостей,Отказ);
	КонецЕсли;
	
	// Проверка на зацикливание.
	Если НЕ Отказ
		И ВидОперации <> Перечисления.бит_ВидыОперацийУстановкиЗависимыхОборотов.ОтражениеНаДругомСценарии Тогда
		Реквизиты = Новый Структура();
		Реквизиты.Вставить("Сценарий", Сценарий);
		Реквизиты.Вставить("ДатаНачала", ДатаНачала);
		Реквизиты.Вставить("Ссылка", Ссылка);
		Документы.бит_УстановкаЗависимыхОборотов.ПроверитьтЗацикливаниеТаблицы(Реквизиты, "", Отказ);
	КонецЕсли; 
    
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьРеквизиты(Отказ, ПроверяемыеРеквизиты);
	ДополнительныеСвойства.Вставить("ПроверитьЗаполнение", Ложь);
	
	Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкиЗависимыхОборотов.ОтражениеНаДругомСценарии Тогда
		ПроверяемыеРеквизиты.Добавить("Сценарий");
		ПроверяемыеРеквизиты.Добавить("ЗависимыйСценарий");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьРеквизиты(Отказ, ПроверяемыеРеквизиты)
	
	Ошибки = Неопределено;
	// Проверка заполнения коэффициентов и реквизитов для расчета зависимых оборотов.
	Для Каждого СтрокаТаблицы Из ЗависимыеОбороты Цикл
		Если СтрокаТаблицы.КоэффициентКоличество = 0 И СтрокаТаблицы.КоэффициентСумма = 0 
		 	И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ФункцияКоличество) И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ФункцияСумма) Тогда			
			ТекстСообщения = НСтр("ru = 'В строке № %1 табличной части ""Зависимые обороты""  не указан ни коэффициент для суммы, ни коэффициент для количества, ни пользовательские функции для расчета.'; 
								  |en = 'Line number ""%1"" of the table ""Dependent turnover"" is missing both the total and quantity coefficients'");
		  	ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"",ТекстСообщения);
		КонецЕсли;

		Если СтрокаТаблицы.КоэффициентКоличество <> 0 И НЕ ЗначениеЗаполнено(СтрокаТаблицы.РеквизитКоличество) Тогда
		   	ТекстСообщения = НСтр("ru = 'В строке № %1 табличной части ""Зависимые обороты""  не указан реквизит для расчета количества.'; 
								  |en = 'Line number ""%1"" of the table ""Dependent turnover"" is missing detail for the calculation of quantity'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"",ТекстСообщения);
		КонецЕсли; 

		Если СтрокаТаблицы.КоэффициентСумма <> 0 И НЕ ЗначениеЗаполнено(СтрокаТаблицы.РеквизитСумма) Тогда
		   	ТекстСообщения = НСтр("ru = 'В строке № %1 табличной части ""Зависимые обороты"" не указан реквизит для расчета суммы.'; 
								  |en = 'Line number ""%1"" of the table ""Dependent turnover"" is missing detail for the calculation of total'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"",ТекстСообщения);
		КонецЕсли;		  
	КонецЦикла; 	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры

Процедура ПривестиЗначенияВТаблице()

	НастройкиИзмерений = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();
	ИзмеренияДоп       = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним");
	
	Для каждого Запись Из ЗависимыеОбороты Цикл
		Для каждого КлючИЗначение Из ИзмеренияДоп Цикл
			
			ИмяИзмерения = КлючИЗначение.Ключ;
			Если ИмяИзмерения = "Валюта" Или ИмяИзмерения = "Сценарий" Тогда
				Продолжить;		
			КонецЕсли;

			ТекущаяНастройка  = НастройкиИзмерений[ИмяИзмерения];
			
			ИмяКолонки = ИмяИзмерения;
			ПривестиЗначениеВСтрокеТаблицы(Запись, ИмяКолонки, ТекущаяНастройка);
			
			ИмяКолонки = ИмяИзмерения + "_Зависимый";
			ПривестиЗначениеВСтрокеТаблицы(Запись, ИмяКолонки, ТекущаяНастройка);
		КонецЦикла; // По дополнительным измерениям.
	КонецЦикла; // По записям набора.

КонецПроцедуры

Процедура ПривестиЗначениеВСтрокеТаблицы(Знач Запись, Знач ИмяКолонки, Знач ТекущаяНастройка)
	
	ЗначениеИзмерения = Запись[ИмяКолонки];
	Если НЕ ЗначениеЗаполнено(ЗначениеИзмерения) Тогда
		// Согласно стандарту пустые значения составного типа - приводим к неопределено.
		Запись[ИмяКолонки] = Неопределено;
	Иначе	
		Если ТекущаяНастройка = Неопределено Тогда
			Если ЗначениеИзмерения <> Неопределено Тогда
				// Настройки нет - приводим к неопределено.
				Запись[ИмяКолонки] = Неопределено;
			КонецЕсли; 
		Иначе	
			Если НЕ ТекущаяНастройка.Аналитика.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеИзмерения)) Тогда
				// Тип значения не соответствует настройке доп. измерения - приводим к неопределено.
				Запись[ИмяКолонки] = Неопределено
			КонецЕсли; 
		КонецЕсли; // Заполнена настройка для измерения. 
	КонецЕсли; // Заполнено значение измерения.

КонецПроцедуры

// Функция получает таблицу зависимых оборотов по табличной части.
// 
// Возвращаемое значение:
//  ТаблицаЗависимостей - ТаблицаЗначений.
//
Функция ПодготовитьТаблицуЗависимостей()

	ПараметрыРасчета    = ПараметрыРасчетаЗависимостей();
	ТаблицаЗависимостей = ДанныеТабличнойЧастиДокумента(ПараметрыРасчета);
	РаспределитьПоПрофилямАналитики(ТаблицаЗависимостей, ПараметрыРасчета);
	РаспределитьПоСценариям(ТаблицаЗависимостей);
	
	Возврат ТаблицаЗависимостей;
	
КонецФункции

Функция ПараметрыРасчетаЗависимостей()
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ЗависимыеИзмерения", Новый Массив);
	ПараметрыРасчета.Вставить("ПоляПрофилей", Новый Массив);
	ПараметрыРасчета.Вставить("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц);
	
	Для каждого ТекИзмерение Из Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам.Измерения Цикл
		ИмяИзмерения = ТекИзмерение.Имя;
		Если ИмяИзмерения = "Валюта" ИЛИ ИмяИзмерения = "Сценарий" ИЛИ ИмяИзмерения = "СценарийЗависимый" Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыРасчета.ЗависимыеИзмерения.Добавить(ИмяИзмерения);
		
		Если ИмяИзмерения = "СтатьяОборотов" Тогда
			Продолжить;
		КонецЕсли;
		ПараметрыРасчета.ПоляПрофилей.Добавить(ИмяИзмерения + "_ПрофильРаспределения");
	КонецЦикла;
	
	Возврат ПараметрыРасчета;
	
КонецФункции

Функция ДанныеТабличнойЧастиДокумента(ПараметрыРасчета)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗависимыеОбороты.Ссылка.ДатаНачала КАК Период,
	|	ЗависимыеОбороты.Ссылка.Сценарий КАК Сценарий,
	|	ВЫБОР
	|		КОГДА ЗависимыеОбороты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийУстановкиЗависимыхОборотов.ОтражениеНаДругомСценарии)
	|			ТОГДА ЗависимыеОбороты.Ссылка.ЗависимыйСценарий
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
	|	КОНЕЦ КАК СценарийЗависимый,
	|	&ПоляЗависимых КАК ПоляЗависимых,
	|	ЗависимыеОбороты.ПрофильРаспределения КАК ПрофильРаспределения,
	|	ЗависимыеОбороты.КоэффициентКоличество КАК КоэффициентКоличество,
	|	ЗависимыеОбороты.КоэффициентСумма КАК КоэффициентСумма,
	|	ЗависимыеОбороты.РеквизитКоличество КАК РеквизитКоличество,
	|	ЗависимыеОбороты.РеквизитСумма КАК РеквизитСумма,
	|	ЗависимыеОбороты.ФункцияКоличество КАК ФункцияКоличество,
	|	ЗависимыеОбороты.ФункцияСумма КАК ФункцияСумма,
	|	ЗависимыеОбороты.ИгнорироватьПриоритеты КАК ИгнорироватьПриоритеты,
	|	ЗависимыеОбороты.ИД КАК ИД,
	|	ЗависимыеОбороты.ИД_Родитель КАК ИД_Родитель,
	|	ЗависимыеОбороты.Ссылка.ДатаОкончания КАК ДатаОкончания,
	|	ЗависимыеОбороты.НомерСтроки КАК НомерСтроки,
	|	ЗависимыеОбороты.ИД КАК ДинамическийИД,
	|	ЗависимыеОбороты.ИД_Родитель КАК ДинамическийИД_Родитель
	|ПОМЕСТИТЬ ЗависимыеОбороты
	|ИЗ
	|	Документ.бит_УстановкаЗависимыхОборотов.ЗависимыеОбороты КАК ЗависимыеОбороты
	|ГДЕ
	|	ЗависимыеОбороты.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД_Родитель";
	ТекстПолей   = ТекстВыборкиПолейАналитик(ПараметрыРасчета);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляЗависимых КАК ПоляЗависимых", ТекстПолей);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	ЗависимыеОбороты КАК ЗависимыеОбороты
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|АВТОУПОРЯДОЧИВАНИЕ";
   	ТаблицаЗависимостей = Запрос.Выполнить().Выгрузить();
	ТаблицаЗависимостей.Индексы.Добавить("ИД_Родитель");
	ТаблицаЗависимостей.Индексы.Добавить("ДинамическийИД_Родитель");
	Возврат ТаблицаЗависимостей;
	
КонецФункции

Функция ТекстВыборкиПолейАналитик(ПараметрыРасчета)
	
	ПоляВыборки       = Новый Массив;
	ШаблонПоляВыборки = "ЗависимыеОбороты.%1 КАК %1";
	
	Для каждого ИмяИзмерения Из ПараметрыРасчета.ЗависимыеИзмерения Цикл
		ПоляВыборки.Добавить(СтрШаблон(ШаблонПоляВыборки, ИмяИзмерения)); 
		ПоляВыборки.Добавить(СтрШаблон(ШаблонПоляВыборки, ИмяИзмерения + "_Зависимый"));
	КонецЦикла;
	
	Для каждого ПолеПрофиля Из ПараметрыРасчета.ПоляПрофилей Цикл
		ПоляВыборки.Добавить(СтрШаблон(ШаблонПоляВыборки, ПолеПрофиля));
	КонецЦикла;
		
	Возврат СтрСоединить(ПоляВыборки, "," + Символы.ПС + Символы.Таб);
	
КонецФункции

Процедура РаспределитьПоПрофилямАналитики(ТаблицаЗависимостей, ПараметрыРасчета)
	
	Для каждого ПолеПрофильРаспределения Из ПараметрыРасчета.ПоляПрофилей Цикл
		РаспределитьПоПрофилю(ТаблицаЗависимостей, ПараметрыРасчета, ПолеПрофильРаспределения);
	КонецЦикла;
	
КонецПроцедуры

Процедура РаспределитьПоПрофилю(ТаблицаЗависимостей, ПараметрыРасчета, ПолеПрофильРаспределения)
	
	АналитикиПрофилей = АналитикиПрофилей(ПолеПрофильРаспределения, ПараметрыРасчета);
	Если АналитикиПрофилей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоляАналитики   = СтрЗаменить(ПолеПрофильРаспределения, "_ПрофильРаспределения", "");
	ИмяПоляЗависимости = ИмяПоляАналитики + "_Зависимый";
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗависимыеОбороты.ЦФО_ПрофильРаспределения КАК ПрофильРаспределения,
	|	ЗависимыеОбороты.ИД КАК ИД
	|ИЗ
	|	ЗависимыеОбороты КАК ЗависимыеОбороты
	|ГДЕ
	|	ЗависимыеОбороты.ЦФО_ПрофильРаспределения <> ЗНАЧЕНИЕ(Справочник.бит_ПрофилиРаспределенияПоПериодам.ПустаяСсылка)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЦФО_ПрофильРаспределения", ПолеПрофильРаспределения);
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗначенияАналитик   = АналитикиПрофилей.Получить(Выборка.ПрофильРаспределения);
		Отбор              = Новый Структура("ИД", Выборка.ИД);
		СтрокиЗависимостей = ТаблицаЗависимостей.НайтиСтроки(Отбор);
		Для каждого СтрокаОсновнойСтатьи Из СтрокиЗависимостей Цикл
			ЭтоПерваяАналитика = Истина;
			КоэффициентКоличествоСтроки = СтрокаОсновнойСтатьи.КоэффициентКоличество;
			КоэффициентСуммаСтроки      = СтрокаОсновнойСтатьи.КоэффициентСумма;
			Отбор              = Новый Структура("ДинамическийИД_Родитель", СтрокаОсновнойСтатьи.ДинамическийИД);
			ПодчиненныеСтроки  = ТаблицаЗависимостей.НайтиСтроки(Отбор);
			Для каждого РаспределениеПрофиля Из ЗначенияАналитик Цикл
				Если ЭтоПерваяАналитика Тогда
					ЭтоПерваяАналитика       = Ложь;
					РедактируемаяСтрока      = СтрокаОсновнойСтатьи;
					РедактируемыеПодчиненные = ПодчиненныеСтроки;
				Иначе
					РедактируемаяСтрока = ТаблицаЗависимостей.Добавить();
					ЗаполнитьЗначенияСвойств(РедактируемаяСтрока, СтрокаОсновнойСтатьи);
					РедактируемаяСтрока.ДинамическийИД = Строка(Новый УникальныйИдентификатор);
					РедактируемыеПодчиненные = Новый Массив;
					Для каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
						НоваяПодчиненная = ТаблицаЗависимостей.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяПодчиненная, ПодчиненнаяСтрока);
						НоваяПодчиненная.ДинамическийИД = Строка(Новый УникальныйИдентификатор);
						НоваяПодчиненная.ДинамическийИД_Родитель = РедактируемаяСтрока.ДинамическийИД;
						РедактируемыеПодчиненные.Добавить(НоваяПодчиненная);
					КонецЦикла;
				КонецЕсли;
				РедактируемаяСтрока[ИмяПоляЗависимости] = РаспределениеПрофиля.ЗначениеАналитики;
				РедактируемаяСтрока.КоэффициентКоличество = КоэффициентКоличествоСтроки * РаспределениеПрофиля.Процент / 100;
				РедактируемаяСтрока.КоэффициентСумма      = КоэффициентСуммаСтроки * РаспределениеПрофиля.Процент / 100;
				Для каждого РедактируемаяПодчиненнаяСтрока Из РедактируемыеПодчиненные Цикл
					РедактируемаяПодчиненнаяСтрока[ИмяПоляАналитики] = РаспределениеПрофиля.ЗначениеАналитики;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция АналитикиПрофилей(ПолеПрофильРаспределения, ПараметрыРасчета)
	
	АналитикиПрофилей = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗависимыеОбороты.ЦФО_ПрофильРаспределения КАК ПрофильРаспределения
	|ИЗ
	|	ЗависимыеОбороты КАК ЗависимыеОбороты
	|ГДЕ
	|	ЗависимыеОбороты.ЦФО_ПрофильРаспределения <> ЗНАЧЕНИЕ(Справочник.бит_ПрофилиРаспределенияПоПериодам.ПустаяСсылка)";
	ТекстЗапроса     = СтрЗаменить(ТекстЗапроса, "ЦФО_ПрофильРаспределения", ПолеПрофильРаспределения);
	Запрос.Текст     = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат АналитикиПрофилей;
	КонецЕсли;
	
	Профили = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПрофильРаспределения");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрофилиРаспределения.Ссылка КАК Ссылка,
	|	ПрофилиРаспределения.ЗначениеАналитики КАК ЗначениеАналитики,
	|	ПрофилиРаспределения.Процент КАК Процент
	|ИЗ
	|	Справочник.бит_ПрофилиРаспределенияПоПериодам.Профиль КАК ПрофилиРаспределения
	|ГДЕ
	|	ПрофилиРаспределения.Ссылка В(&Профили)
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("Профили", Профили);
	ВыборкаПрофилей = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПрофилей.Следующий() Цикл
		ПрофильРаспределения = ВыборкаПрофилей.Ссылка;
		ЗначенияАналитик     = Новый Массив;
		ВыборкаАналитик      = ВыборкаПрофилей.Выбрать();
		Пока ВыборкаАналитик.Следующий() Цикл
			РаспределениеПрофиля = Новый Структура;
			РаспределениеПрофиля.Вставить("ЗначениеАналитики", ВыборкаАналитик.ЗначениеАналитики);
			РаспределениеПрофиля.Вставить("Процент", ВыборкаАналитик.Процент);
			ЗначенияАналитик.Добавить(РаспределениеПрофиля);
		КонецЦикла;
		АналитикиПрофилей.Вставить(ПрофильРаспределения, ЗначенияАналитик);
	КонецЦикла;
	
	Возврат АналитикиПрофилей;
	
КонецФункции

Процедура РаспределитьПоСценариям(ТаблицаЗависимостей)
	
	Если Сценарии.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	КопияТаблицы = ТаблицаЗависимостей.СкопироватьКолонки();
	Для каждого СтрокаТаблицы Из ТаблицаЗависимостей Цикл
		Для каждого СтрокаСценирия Из Сценарии Цикл
			НоваяСтрока = КопияТаблицы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Сценарий = СтрокаСценирия.Сценарий;
		КонецЦикла;		
	КонецЦикла;
	
	ТаблицаЗависимостей = КопияТаблицы;
	
КонецПроцедуры

// Процедура выполняет движения по регистрам.
//                
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаЗависимостей,Отказ)
	
	// Движения по регистру зависимые обороты.
	НаборЗаписей = Движения.бит_ЗависимыеОбороты;
	Для Каждого СтрокаТаблицы Из ТаблицаЗависимостей Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы,, "НомерСтроки");
		Запись.НомерСтрокиЗависимыхОборотов = СтрокаТаблицы.НомерСтроки;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти 

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли