#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета.
//
// Параметры:
//   Настройки - Коллекция - настройки отчетов и вариантов отчетов конфигурации.
//	 ОписаниеОтчета - СтрокаДерева
//                  - ОбъектМетаданных - описание настроек, метаданные или ссылка отчета.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
		
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, Ложь);
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "АнализСчетаУправленческий");
	ОписаниеВарианта.Включен  = Истина;
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ оборотов управленческого учета
                                      |между выбранным счетом и всеми остальными счетами.
                                      |Данные в валютах регламентированного и управленческого учета.'");
		
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОСВПоСчетуСКорреспонденциейУправленческий");
	ОписаниеВарианта.Включен  = Истина;
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ сальдо и оборотов выбранного счета управленческого учета в разрезе аналитик и кор. счетов.
                                      |Данные в валютах регламентированного и управленческого учета.'");

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗагрузитьНастройкиПриИзмененииПараметров() Экспорт 
	
	Параметры = Новый Массив;
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("ПланСчетов"));
	
	Возврат Параметры;
	
КонецФункции

Функция ФиксированныеПараметры(Настройки, ПользовательскиеНастройки, ДоступныеЗначения) Экспорт 
	
	// Значения параметров по умолчанию.
	ФиксированныеПараметры = Новый Структура;
	ФиксированныеПараметры.Вставить("ПериодОтчета", 			 Новый СтандартныйПериод);
	ФиксированныеПараметры.Вставить("ПланСчетов", 		   		 1);
	ФиксированныеПараметры.Вставить("ПоказательСуммаРегл", 		 Истина);
	ФиксированныеПараметры.Вставить("ПоказательСуммаУпр", 	   	 Ложь);
	ФиксированныеПараметры.Вставить("ПоказательВалютнаяСумма", 	 Ложь);
	ФиксированныеПараметры.Вставить("ВыводитьНаименованиеСчета", Ложь);
	ФиксированныеПараметры.Вставить("РазвернутоеСальдо", 	   	 Ложь);
	
	Идентификаторы = ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(ФиксированныеПараметры, ",");
	Идентификаторы = СтрРазделить(Идентификаторы, ", ", Ложь);
	Для каждого Идентификатор Из Идентификаторы Цикл
		УстановитьФиксированныйПараметр(Идентификатор, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
	КонецЦикла; 
			
	Идентификаторы  = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ПланСчетов");
	ПараметрыДанных = Настройки.ПараметрыДанных.Элементы;
	Для Каждого Идентификатор Из Идентификаторы Цикл 
		ЭлементНастройки = ПараметрыДанных.Найти(Идентификатор);
		Если ЭлементНастройки = Неопределено
			Или ЭлементНастройки.Значение = ФиксированныеПараметры[Идентификатор] Тогда 
			Продолжить;
		КонецЕсли;
		
		Настройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Ложь);
		Прервать;
	КонецЦикла;
	
	Возврат ФиксированныеПараметры;
КонецФункции

// Устанавливает значения специализированных параметров универсального отчета.
//
// Параметры:
//  Отчет - 
//  ФиксированныеПараметры - см. ФиксированныеПараметры
//  Настройки - НастройкиКомпоновкиДанных - 
//  ПользовательскиеНастройки - ПользовательскиеНастройкиКомпоновкиДанных - 
//
Процедура УстановитьФиксированныеПараметры(Отчет, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки) Экспорт 
	ПараметрыДанных = Настройки.ПараметрыДанных;
	
	ДоступныеПараметры = ПараметрыДанных.ДоступныеПараметры;
	Если ДоступныеПараметры = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Параметр Из ФиксированныеПараметры Цикл 
		Если ДоступныеПараметры.Элементы.Найти(Параметр.Ключ) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		ЭлементНастройки = ПараметрыДанных.Элементы.Найти(Параметр.Ключ);
		Если ЭлементНастройки = Неопределено Тогда 
			ЭлементНастройки = ПараметрыДанных.Элементы.Добавить();
			ЭлементНастройки.Параметр = Новый ПараметрКомпоновкиДанных(Параметр.Ключ);
			ЭлементНастройки.Значение = Параметр.Значение;
			ЭлементНастройки.Использование = Истина;
		Иначе
			ПараметрыДанных.УстановитьЗначениеПараметра(Параметр.Ключ, Параметр.Значение);
		КонецЕсли;
				
		ЭлементПользовательскойНастройки = Неопределено;
		Если ПользовательскиеНастройки <> Неопределено Тогда 
			ЭлементПользовательскойНастройки = ПользовательскиеНастройки.Элементы.Найти(
				ЭлементНастройки.ИдентификаторПользовательскойНастройки);
		КонецЕсли;
		
		Если ЭлементПользовательскойНастройки <> Неопределено Тогда 
			ЗаполнитьЗначенияСвойств(ЭлементПользовательскойНастройки, ЭлементНастройки, "Использование, Значение");
		КонецЕсли;
	КонецЦикла;
	
	Если ПользовательскиеНастройки <> Неопределено Тогда 
		ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Истина);
	КонецЕсли;
КонецПроцедуры

// Устанавливает настройки по умолчанию.
//
// Параметры:
//  Отчет - ОтчетОбъект - 
//  ФиксированныеПараметры - см. ФиксированныеПараметры
//  Настройки - НастройкиКомпоновкиДанных - 
//  ПользовательскиеНастройки - ПользовательскиеНастройкиКомпоновкиДанных - 
//
Процедура УстановитьСтандартныеНастройки(Отчет, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки, КлючВарианта) Экспорт 
	ОтчетИнициализирован = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Настройки.ДополнительныеСвойства, "ОтчетИнициализирован", Ложь);
	
	Если ОтчетИнициализирован Тогда 
		Возврат;
	КонецЕсли;
	
	НаОснованииВарианта  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки.ДополнительныеСвойства, 
								"НаОснованииВарианта", "");
	
	СтандартныйВариант = СтандартныйВариант(Отчет.СхемаКомпоновкиДанных, КлючВарианта, НаОснованииВарианта);
	
	Если СтандартныйВариант = Неопределено Тогда
		НастройкиПоУмолчанию = Отчет.СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		НаОснованииВарианта  = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек[0].Имя;
	Иначе
		НастройкиПоУмолчанию = СтандартныйВариант.Настройки;
		НаОснованииВарианта  = СтандартныйВариант.Имя; 
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиПоУмолчанию);
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	
	УстановитьФиксированныеПараметры(Отчет, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
	
	Настройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Истина);
	Настройки.ДополнительныеСвойства.Вставить("НаОснованииВарианта",  НаОснованииВарианта);
	
КонецПроцедуры

Функция СхемаКомпоновкиДанных(ФиксированныеПараметры) Экспорт 
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	НаборОстатки = СхемаКомпоновкиДанных.НаборыДанных.ОсновнойНаборДанных.Элементы.Найти("Остатки");
	НаборОбороты = СхемаКомпоновкиДанных.НаборыДанных.ОсновнойНаборДанных.Элементы.Найти("Обороты");
	
	Индекс				= ФиксированныеПараметры.ПланСчетов;
	НаборОстатки.Запрос = СтрЗаменить(НаборОстатки.Запрос, "бит_Дополнительный_1", "бит_Дополнительный_" + Индекс);
	НаборОбороты.Запрос = СтрЗаменить(НаборОбороты.Запрос, "бит_Дополнительный_1", "бит_Дополнительный_" + Индекс);
	
	ТипВидаСубконтоСтр = СтрШаблон("ПланВидовХарактеристикСсылка.бит_ВидыСубконтоДополнительные_%1", Индекс);
	СхемаКомпоновкиДанных.Параметры.ВидСубконто.ТипЗначения = Новый ОписаниеТипов(ТипВидаСубконтоСтр);
	
	ТипПланаСчетовСтр = СтрШаблон("ПланСчетовСсылка.бит_Дополнительный_%1", Индекс);
	НаборОстатки.Поля.Найти("Счет").ТипЗначения = Новый ОписаниеТипов(ТипПланаСчетовСтр);
	НаборОбороты.Поля.Найти("Счет").ТипЗначения = Новый ОписаниеТипов(ТипПланаСчетовСтр);
	
	СхемаКомпоновкиДанных.НаборыДанных.ОсновнойНаборДанных.Поля.Найти("Счет").ТипЗначения = Новый ОписаниеТипов(ТипПланаСчетовСтр);
	
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтандартныйВариант(Схема, КлючВарианта, НаОснованииВарианта)
	
	СтандартныйВариант = Неопределено;
	
	Для каждого Вариант Из Схема.ВариантыНастроек Цикл
		Если Вариант.Имя = КлючВарианта Тогда
			СтандартныйВариант = Вариант;
		ИначеЕсли Вариант.Имя = НаОснованииВарианта Тогда
			СтандартныйВариант = Вариант;
		КонецЕсли;
		
		Если СтандартныйВариант <> Неопределено Тогда
			Прервать;	
		КонецЕсли;
	КонецЦикла; 

	Возврат СтандартныйВариант;
	
КонецФункции

Процедура УстановитьФиксированныйПараметр(Идентификатор, Параметры, Настройки, ПользовательскиеНастройки, ДоступныеЗначения = Неопределено)
	
	ФиксированныйПараметр = Параметры[Идентификатор];
	
	Если ДоступныеЗначения = Неопределено Тогда 
		ДоступныеЗначения = Новый СписокЗначений;
	КонецЕсли;
	
	ЭлементНастройки = Настройки.ПараметрыДанных.Элементы.Найти(Идентификатор);
	Если ЭлементНастройки = Неопределено Тогда 
		Если ДоступныеЗначения.Количество() > 0 Тогда 
			Параметры[Идентификатор] = ДоступныеЗначения[0].Значение;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементПользовательскойНастройки = Неопределено;
	Если ТипЗнч(ПользовательскиеНастройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных")
		И (Настройки.ДополнительныеСвойства.Свойство("ОтчетИнициализирован")
		Или ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ОтчетИнициализирован")) Тогда 
		
		ЭлементПользовательскойНастройки = ПользовательскиеНастройки.Элементы.Найти(
			ЭлементНастройки.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	
	Если ЭлементПользовательскойНастройки <> Неопределено
		И ДоступныеЗначения.НайтиПоЗначению(ЭлементПользовательскойНастройки.Значение) <> Неопределено Тогда 
		ФиксированныйПараметр = ЭлементПользовательскойНастройки.Значение;
	ИначеЕсли ДоступныеЗначения.НайтиПоЗначению(ЭлементНастройки.Значение) <> Неопределено Тогда 
		ФиксированныйПараметр = ЭлементНастройки.Значение;
	ИначеЕсли ДоступныеЗначения.Количество() > 0 Тогда 
		ФиксированныйПараметр = ДоступныеЗначения[0].Значение;
	ИначеЕсли ЭлементПользовательскойНастройки <> Неопределено
		И ЗначениеЗаполнено(ЭлементПользовательскойНастройки.Значение) Тогда 
		ФиксированныйПараметр = ЭлементПользовательскойНастройки.Значение;
	ИначеЕсли ЗначениеЗаполнено(ЭлементНастройки.Значение) Тогда 
		ФиксированныйПараметр = ЭлементНастройки.Значение;
	КонецЕсли;
	
	Параметры[Идентификатор] = ФиксированныйПараметр;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли