#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//   Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
//   Реквизиты - Массив - список имен реквизитов объекта.
//
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	Реквизиты.Добавить("НастройкиПостроителя");
	Реквизиты.Добавить("ХранилищеДерева");
	Реквизиты.Добавить("БДДС.ИД");
	Реквизиты.Добавить("ЗависимыеОбороты.ИД");
	Реквизиты.Добавить("ЗависимыеОбороты.ИД_Родитель");
	Реквизиты.Добавить("ЗависимыеОбороты.КомментарийРасчета");
	
	Реквизиты.Добавить("НаборыЗначенийДоступа.*");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
			
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// Функция подготавливает параметры проведения.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.бит_НазначениеСоответствияАналитик - ссылка на документ.
//  Отказ          - Булево - признак обнаружения ошибки и отказа от дальнейших действий.
//
// Возвращаемое значение:
//  Структура - структура параметров проведения.
//
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура(); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.ЦФО КАК ЦФО,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.КурсДокумента КАК КурсДокумента,
	|	Реквизиты.КратностьДокумента КАК КратностьДокумента,
	|	Реквизиты.СторнироватьЗависимыеОбороты КАК СторнироватьЗависимыеОбороты,
	|	Реквизиты.СверхБюджета КАК СверхБюджета,
	|	Реквизиты.Сценарий.ИспользоватьКурсыСценария КАК ИспользоватьКурсыСценария,
	|	Реквизиты.Сценарий.Валюта КАК ВалютаСценария,
	|	Реквизиты.СценарийЭталон КАК СценарийЭталон,
	|	Реквизиты.РежимПринятияКУчету КАК РежимПринятияКУчету,
	|	Реквизиты.СписатьЛимиты КАК СписатьЛимиты
	|ИЗ
	|	Документ.бит_АктуализацияБюджета КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить().Выгрузить();
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат[0]);
	
	Если НЕ бит_ОбщегоНазначения.ВалютаУпрУчетаУстановлена(Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;

	КурсыВалют = бит_Бюджетирование.КурсыВалютСценария(Реквизиты.Регистратор, 
											Реквизиты.Дата, Новый Структура("Документ, Регл, Упр, Сценарий"));
	
	Реквизиты.Вставить("КурсыВалют", КурсыВалют);
	
	ПриниматьКУчету = Истина;
	ПроводитьПослеУтверждения = бит_ВизированиеСервер.ПриниматьКУчетуПослеУтверждения(
								Метаданные.Документы.бит_АктуализацияБюджета.ПолноеИмя());
	Если ПроводитьПослеУтверждения И Реквизиты.РежимПринятияКУчету = 1 Тогда
		ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(ДокументСсылка);
		Если НЕ Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(ТекущийСтатус,
				Перечисления.бит_ТипыСтатусовОбъектов.Утвержден) Тогда
			ПриниматьКУчету = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыПроведения.Вставить("ТаблицаСторноДоИзменения", Новый ТаблицаЗначений);
	ПараметрыПроведения.Вставить("ТаблицаОборотыПоБюджетам", Новый ТаблицаЗначений);
	ПараметрыПроведения.Вставить("ВозвратЛимита", Новый ТаблицаЗначений);
	
	ПараметрыНастройки 		= Новый Структура("ЦФО, Организация", Реквизиты.ЦФО, Реквизиты.Организация);
	НеУчитыватьСверхБюджета = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету(
								ПараметрыНастройки, Реквизиты.Дата);
		
	Запрос.УстановитьПараметр("НеУчитыватьСверхБюджета", НеУчитыватьСверхБюджета);
	Запрос.УстановитьПараметр("СинонимБДДС", 			 НСтр("ru='Данные бюджета';en='Budget Data'"));
	Запрос.УстановитьПараметр("СинонимЗависимыеОбороты", НСтр("ru='Зависимые обороты';en='Dependent Line-Items'"));
	Запрос.УстановитьПараметр("СинонимДоИзменения", 	 НСтр("ru='До изменения';en='before the change'"));
	Запрос.УстановитьПараметр("Сценарий", 				 Реквизиты.Сценарий);
	Запрос.УстановитьПараметр("СценарийЭталон", 		 Реквизиты.СценарийЭталон);
	Запрос.УстановитьПараметр("Валюта", 				 Реквизиты.ВалютаДокумента);
	
	Если Реквизиты.СценарийЭталон = Реквизиты.Сценарий Тогда
		СценарииСовпадают = Истина;
	Иначе	
		СценарииСовпадают = Ложь;
	КонецЕсли;
	
	ИнициализироватьКлючиАналитик(Реквизиты);
	
	НомераТаблиц = Новый Структура(); 
	ТекстЗапроса = ТекстЗапросаВременнаяТаблицаДокумента(НомераТаблиц)
				 + ТекстЗапросаТаблицыВалютногоПерерасчета(НомераТаблиц)
				 + ТекстЗапросаКонтрольИсполненияБюджета(НомераТаблиц, СценарииСовпадают)
				 + ТекстЗапросаТаблицаОборотыПоБюджетам(НомераТаблиц, ПриниматьКУчету)
				 + ТекстЗапросаТаблицаСторноДоИзменения(НомераТаблиц, ПриниматьКУчету, СценарииСовпадают);
				 
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла; 	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	Если Реквизиты.СторнироватьЗависимыеОбороты И ЗначениеЗаполнено(ПараметрыПроведения.ТаблицаСторноДоИзменения) Тогда
		НаборОбороты = РегистрыНакопления.бит_ОборотыПоБюджетам.СоздатьНаборЗаписей();
		НаборОбороты.Загрузить(ПараметрыПроведения.ТаблицаСторноДоИзменения);
		бит_Бюджетирование.СформироватьЗависимыеОборотыПоНаборуЗаписей(ДокументСсылка, НаборОбороты);
		ПараметрыПроведения.ТаблицаСторноДоИзменения = НаборОбороты.Выгрузить();
	КонецЕсли; 
	
	ПодготовитьТаблицыДокументаРасчетыВВалюте(ПараметрыПроведения, Реквизиты);	
	
	ПодготовитьТаблицуИсполнениеБюджетаРасчетыВВалюте(ПараметрыПроведения.ИсполнениеБюджета, 
		ПараметрыПроведения.ИсполнениеБюджетаРеквизиты);
		
	ПодготовитьТаблицуИсполнениеБюджетаРасчетыВВалюте(ПараметрыПроведения.ВозвратЛимита, 
		ПараметрыПроведения.ИсполнениеБюджетаРеквизиты);	
		
	Возврат ПараметрыПроведения;
	
КонецФункции 

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	// ++ ЕРП
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиОбновленияИБ

Процедура ДоработатьДанныеРасшифровкиПриПереходеНаНовуюВерсию(Параметры) Экспорт

	ПолноеИмяОбъекта  = ПустаяСсылка().Метаданные().ПолноеИмя();
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);

	Для Каждого СтрокаТаблицы Из ОбновляемыеДанные Цикл
				
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СтрокаТаблицы.Ссылка);
			Блокировка.Заблокировать();
	
			ДокументОбъект 	 	= СтрокаТаблицы.Ссылка.ПолучитьОбъект();
			ПредставлениеСсылки = Строка(ДокументОбъект);
			
			Если ДокументОбъект = Неопределено Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтрокаТаблицы.Ссылка);
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;			
			
			ДокументРезультат = ДокументОбъект.ХранилищеДерева.Получить();
			
			ОбъектИзменен = Ложь;
			Для каждого Область Из ДокументРезультат.Области Цикл
				Если ТипЗнч(Область.Расшифровка) <> Тип("Структура") Тогда
					Продолжить;		
				КонецЕсли;	
				
				ИмяКласса = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Область.Расшифровка, "ИмяКласса", "");
				Если ИмяКласса <> "РасшифровкаЯчейкиФормыВвода" Тогда
					Продолжить;		
				КонецЕсли;
				
				ИдентификаторРасшифровки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Область.Расшифровка, "ИдентификаторРасшифровки", "");
				ОбработатьРасшифровку 	 = ПустаяСтрока(ИдентификаторРасшифровки);
				
				Если НЕ ОбработатьРасшифровку Тогда
					Продолжить;		
				КонецЕсли;
				
				СмежныеОбласти = Новый Структура;
				СмежныеОбласти.Вставить("СП", "");
				СмежныеОбласти.Вставить("КП", "");
				СмежныеОбласти.Вставить("СФ", "");
				СмежныеОбласти.Вставить("КФ", "");		
				
				ЧастиИмени = СтрРазделить(Область.Расшифровка.Имя, "_");
				Если ЧастиИмени.Количество() > 2 Тогда
					Префикс = ЧастиИмени[0];
					// Если префикс подойдет к одному из ключей структуры, значит это наша область.
					Если СмежныеОбласти.Свойство(Префикс) Тогда
						СмежныеОбласти[Префикс] = Область.Расшифровка.Имя;
						Для каждого КлючЗначение Из СмежныеОбласти Цикл
							Если КлючЗначение.Ключ = Префикс Тогда
								Продолжить;					
							КонецЕсли;
							ЧастиИмени[0] 	= КлючЗначение.Ключ;
							ИмяКандидата	= СтрСоединить(ЧастиИмени, "_");
							РезультатПоиска = ДокументРезультат.Области.Найти(ИмяКандидата);
							Если РезультатПоиска <> Неопределено Тогда
								СмежныеОбласти[КлючЗначение.Ключ] = ИмяКандидата;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;

				Область.Расшифровка.Вставить("СмежныеОбласти", 			 СмежныеОбласти);
				Область.Расшифровка.Вставить("ИдентификаторРасшифровки", Область.Расшифровка.Имя);
				Область.Расшифровка.Вставить("ИдентификаторСтроки", 	 "");
				Область.Расшифровка.Вставить("ЦветФона", 				 Область.ЦветФона);
				
				ЗначенияГруппировок = Новый Массив;
				Если ТипЗнч(Область.Расшифровка.Измерения) = Тип("Структура") Тогда
					Для каждого КлючЗначение Из Область.Расшифровка.Измерения Цикл
						ЗначенияГруппировок.Добавить(КлючЗначение.Значение);
					КонецЦикла;
				Иначе
					ЗначенияГруппировок.Добавить(Область.Расшифровка.Значение);
				КонецЕсли;
				Область.Расшифровка.ИдентификаторСтроки = бит_ВводБюджета.ИдентификаторРасшифровки(ЗначенияГруппировок, Область.Расшифровка.Период);
				
				ОбъектИзменен = Истина;
			КонецЦикла;
			
			Если ОбъектИзменен Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтрокаТаблицы.Ссылка);
			КонецЕсли;
		
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();

			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(СтрокаТаблицы.Ссылка, ПредставлениеСсылки, 
				ИнформацияОбОшибке());	
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

Процедура ЗаполнитьРазрезыАктуализацииПриПереходеНаНовуюВерсию(Параметры) Экспорт
	
	ИмяПроцедуры	     = "ЗаполнитьРазрезыАктуализацииПриПереходеНаНовуюВерсию";
	МетаданныеОбъекта    = ПустаяСсылка().Метаданные();
	ПредставлениеОбъекта = МетаданныеОбъекта.Представление();
	ПолноеИмяОбъекта 	 = МетаданныеОбъекта.ПолноеИмя();
	ОбновляемыеДанные	 = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
		
	ПроблемныхОбъектов = 0;
	ОбработаноОбъектов = 0;

	Для Каждого СтрокаТаблицы Из ОбновляемыеДанные Цикл
				
		ПредставлениеСсылки = Строка(СтрокаТаблицы.Ссылка);
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СтрокаТаблицы.Ссылка);
			Блокировка.Заблокировать();
	
			ДокументОбъект = СтрокаТаблицы.Ссылка.ПолучитьОбъект();
			
			Если ДокументОбъект = Неопределено Тогда
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ОбъектИзменен = Ложь;
			НастройкаФормы = ДокументОбъект.НастройкаФормы;
			Если ЗначениеЗаполнено(НастройкаФормы) Тогда
				ДанныеНастройки = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(НастройкаФормы);
								
				Если ЗначениеЗаполнено(ДанныеНастройки.ИмяРазворачивать) Тогда
					ОсновнойРазрез  = "Контроль" + ДанныеНастройки.ИмяРазворачивать;
					ДокументОбъект[ОсновнойРазрез] = Истина;
					ОбъектИзменен = Истина;
				КонецЕсли;
			КонецЕсли;
						
			Если ОбъектИзменен Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтрокаТаблицы.Ссылка);
			КонецЕсли;
			
			ОбработаноОбъектов  = ОбработаноОбъектов + 1;
			ЗафиксироватьТранзакцию();
		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(СтрокаТаблицы.Ссылка, ПредставлениеСсылки, 
				ИнформацияОбОшибке());	
		КонецПопытки;
	КонецЦикла;
	
	Если ОбработаноОбъектов = 0 Тогда
		ТекстСообщения = НСтр("ru='Процедуре ""%1"" не удалось обработать некоторые ""%2"" (пропущены): %3';
							  |en='Procedure ""%1"" failed to process some documents ""%2"" (skipped): %3'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПроцедуры, ПредставлениеОбъекта, ПроблемныхОбъектов);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, МетаданныеОбъекта,, ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru='Процедура ""%1"" обработала очередную порцию ""%2"": %3';
							  |en='Procedure ""%1"" processed the next batch of documents ""%2"": %3'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПроцедуры, ПредставлениеОбъекта, ОбработаноОбъектов);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Информация, МетаданныеОбъекта,, ТекстСообщения);
	КонецЕсли;	

	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеРасшифроки(Параметры) Экспорт

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.СпособВыборки 		 = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Ссылка УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Ссылка УБЫВ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бит_АктуализацияБюджета КАК Реквизиты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ";

	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));

КонецПроцедуры

Процедура ЗарегистрироватьДанныеКЗаполнениюРазрезовАктуализации(Параметры) Экспорт

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.СпособВыборки 		 = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Ссылка УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Ссылка УБЫВ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бит_АктуализацияБюджета КАК Реквизиты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ";

	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));

КонецПроцедуры

#КонецОбласти

#Область ФормированиеДерева

// Процедура обновляет дерево данных.
//
// Параметры:
//  ПараметрыОбновления	 - Структура - см. НовыеПараметрыОбновеления.
// 
// Возвращаемое значение:
//  Структура - Структура параметров:
//  * ТабДок - ТабличныйДокумент - Табличный документ данных бюджета.
//  * ФактическиеДанные - ТаблицаЗначений - Данные для ТЧ ФактическиеДанные.
//  * БДДС - ТаблицаЗначений - Данные для ТЧ БДДС.
//  * ДоИзменения - ТаблицаЗначений - Данные для ТЧ ДоИзменения.
//
Функция ОбновитьДеревоДанных(ПараметрыОбновления) Экспорт
	
	ТабДок				= ПараметрыОбновления.ТабДок;
	НастройкаФормы		= ПараметрыОбновления.НастройкаФормы;
	Настройки			= ПараметрыОбновления.Настройки;
	ТекстЗапроса		= ПараметрыОбновления.ТекстЗапроса;
	Сценарий			= ПараметрыОбновления.Сценарий;
	СценарийЭталон		= ПараметрыОбновления.СценарийЭталон;
	
	Бюджет = Настройки.Бюджет;
	Если ЗначениеЗаполнено(Бюджет) И Справочники.бит_Бюджеты.БюджетЗапрещенВПланировании(Бюджет) Тогда
		ТекстИсключения = НСтр("ru = 'Выполнение операции остановлено.
								|Бюджет настройки формы ввода не должен содержать дубли статей оборотов.';
								|en = 'The operation is stopped.
								|Budget setting entry forms should not contain duplicates revolutions articles.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ОсновноеИзмерение = Настройки.ИмяРазворачивать;
	
	Если Настройки.Версия_2 Тогда
		
		ПараметрыПередачи = бит_ВводБюджета.НовыеПараметрыПосроенияМакетаБюджета();
		ЗаполнитьЗначенияСвойств(ПараметрыПередачи, ПараметрыОбновления);
		
		ПараметрыПередачи.МестоИспользования 	= "бит_АктуализацияБюджета";
		ПараметрыПередачи.СхемаКомпоновкиДанных = ПараметрыОбновления.СхемаКомпоновкиСтруктура;
		ПараметрыПередачи.НастройкиКомпоновщика = ПараметрыОбновления.НастройкиКомпоновщикаСтруктура;

		РезультатОбновления 	   = бит_ВводБюджета.РезультатПостроенияМакетаБюджета(НастройкаФормы, ПараметрыПередачи);
		ПараметрыОбновления.ТабДок = РезультатОбновления.ДокументРезультат;
		
		ЗначенияГруппировок 	= РезультатОбновления.ЗначенияГруппировок;
		ЗначенияОсновногоОтбора = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначенияГруппировок, 
									ОсновноеИзмерение, Новый Массив);
	Иначе	
		ЗначенияОсновногоОтбора = ОбновитьДеревоДанныхДинамическийМакет(ПараметрыОбновления);
	КонецЕсли;	
	
	РезультатСКД = ДанныеБюджетаДляАктуализации(ЗначенияОсновногоОтбора, ПараметрыОбновления);
	
	ДоИзменения = РезультатСКД.СкопироватьКолонки();
	Если СценарийЭталон = Сценарий Тогда
		ДоИзменения = РезультатСКД.СкопироватьКолонки();
		Для каждого СтрокаТаблицы Из РезультатСКД Цикл
			Если СтрокаТаблицы.Сумма <> 0 ИЛИ СтрокаТаблицы.Количество <> 0 Тогда
				ЗаполнитьЗначенияСвойств(ДоИзменения.Добавить(), СтрокаТаблицы);			
			КонецЕсли;
		КонецЦикла;

		ДоИзменения.Колонки.Удалить("Сумма");
		ДоИзменения.Колонки.Удалить("Количество");
		
		Переименовать = Новый Структура(); 
		Переименовать.Вставить("КоличествоДоИзменения",		"Количество");
		Переименовать.Вставить("СуммаДоИзменения",			"Сумма");
		Переименовать.Вставить("СуммаРеглДоИзменения",		"СуммаРегл");
		Переименовать.Вставить("СуммаУпрДоИзменения",		"СуммаУпр");
		Переименовать.Вставить("СуммаСценарийДоИзменения",	"СуммаСценарий");
		
		Для каждого Колонки Из Переименовать Цикл
			ДоИзменения.Колонки[Колонки.Ключ].Имя = Колонки.Значение;
		КонецЦикла;
	КонецЕсли; 
	
	РезультатСКД.Колонки.Добавить("ИД", Новый ОписаниеТипов("Строка"));
	Для каждого СтрокаТаблицы Из РезультатСКД Цикл	
		СтрокаТаблицы.ИД = Строка(Новый УникальныйИдентификатор);	
	КонецЦикла; 
	
	// Установка значений в дерево.
	УстановитьЗначенияВДерево(РезультатСКД, ПараметрыОбновления);
	
	Результат = Новый Структура;
	Результат.Вставить("ТабДок",			ПараметрыОбновления.ТабДок);	
	Результат.Вставить("ФактическиеДанные",	Новый ТаблицаЗначений);	
	Результат.Вставить("БДДС",				РезультатСКД);
	Результат.Вставить("ДоИзменения",		ДоИзменения);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеБюджетаДляАктуализации(ЗначенияОсновногоОтбора, ПараметрыОбновления)
	
	ИмяИзмерения		 		= ПараметрыОбновления.Настройки.ИмяРазворачивать;
	Периодичность		 		= ПараметрыОбновления.Периодичность;
	ДатаЗапроса			 		= ПараметрыОбновления.Дата;
	ДатаАктуализации	 		= ПараметрыОбновления.ДатаАктуализации;
	НачалоПериода		 		= ПараметрыОбновления.ДатаНачалаПланирования;
	КонецПериода		 		= ПараметрыОбновления.ДатаОкончанияПланирования;
	ВалютаДокумента		 		= ПараметрыОбновления.ВалютаДокумента;
	СценарийЭталон		 		= ПараметрыОбновления.СценарийЭталон;
	Сценарий			 		= ПараметрыОбновления.Сценарий;
	СценарийФакт		 		= ПараметрыОбновления.СценарийФакт;
	КоличествоИнтервалов		= ПараметрыОбновления.ПродолжительностьИнтервала;
	СКД				  			= ПараметрыОбновления.СхемаКомпоновкиДанные;
	НастройкиКомпоновщикаДанные = ПараметрыОбновления.НастройкиКомпоновщикаДанные;
	
	Компоновщик		 = Новый КомпоновщикНастроекКомпоновкиДанных;
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);
	
	Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	НастройкиКомпоновки = Компоновщик.ПолучитьНастройки();
	
	ВычисляемоеПоле = СКД.ВычисляемыеПоля.Найти("Измерение");
	СКД.ВычисляемыеПоля.Найти("Измерение").ОграничениеИспользования.Условие = Ложь;
	
	бит_ОтчетыБФКлиентСервер.СкопироватьОтборКомпоновкиДанных(СКД, НастройкиКомпоновки, 
		НастройкиКомпоновщикаДанные); 
	
	бит_ОтчетыБФКлиентСервер.ДобавитьОтбор(НастройкиКомпоновки, "Измерение",
		ЗначенияОсновногоОтбора, ВидСравненияКомпоновкиДанных.ВСписке);
	
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		КонецПериода = КонецПериода;
	Иначе	
		КонецПериода = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(НачалоПериода,
							КоличествоИнтервалов - 1, Периодичность);
	КонецЕсли; 
	
	ГраницаАктуализации = бит_ОбщегоНазначенияКлиентСервер.ПолучитьНачалоПериода(ДатаАктуализации, Периодичность) - 1;
	КонецПериодаФакт	= бит_ОбщегоНазначенияКлиентСервер.ПолучитьКонецПериода(ГраницаАктуализации, Периодичность);
	
	Если НЕ ЗначениеЗаполнено(СценарийФакт) Тогда
		СценарийФакт = Справочники.СценарииПланирования.ФАКТ;
	КонецЕсли; 
	
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "ВалютаДокумента", 	 ВалютаДокумента);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "ДатаЗапроса", 		 ДатаЗапроса);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "НачалоПериода", 		 НачалоПериода);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "КонецПериода", 		 КонецПериода);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "КонецПериодаФакт", 	 КонецПериодаФакт);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "Сценарий", 			 СценарийЭталон);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "СценарийАктуализация", Сценарий);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "СценарийФакт", 		 СценарийФакт);
	
	ПараметрыВыгрузкиСКД = бит_ОтчетыБФСервер.ПараметрыВыгрузитьРезультатСКД();
	ПараметрыВыгрузкиСКД.СхемаКомпоновки	 = СКД;
	ПараметрыВыгрузкиСКД.НастройкиКомпоновки = НастройкиКомпоновки;
	ПараметрыВыгрузкиСКД.ТипРезультата 		 = "ТаблицаЗначений";
	
	РезультатСКД = бит_ОтчетыБФСервер.ВыгрузитьРезультатСКД(ПараметрыВыгрузкиСКД);
	РезультатСКД.Индексы.Добавить("Измерение, Период");
	Возврат РезультатСКД;

КонецФункции

// Процедура восстанавливает дерево по данным.
//
// Параметры:
//  ПараметрыВосстановления	 - Структура - см. НовыеПараметрыВосстановления.
// 
// Возвращаемое значение:
//  Структура - Структура параметров:
//  * ТабДок - ТабличныйДокумент - Табличный документ данных бюджета.
//
Функция ВосстановитьДеревоПоДанным(ПараметрыВосстановления) Экспорт

	ТабДок				= ПараметрыВосстановления.ТабДок;
	НастройкаФормы		= ПараметрыВосстановления.НастройкаФормы;
	Настройки			= ПараметрыВосстановления.Настройки;
	ТекстЗапроса		= ПараметрыВосстановления.ТекстЗапроса;
	БДДС				= ПараметрыВосстановления.БДДС;
	
	Бюджет = Настройки.Бюджет;
	Если ЗначениеЗаполнено(Бюджет) И Справочники.бит_Бюджеты.БюджетЗапрещенВПланировании(Бюджет) Тогда
		ВызватьИсключение НСтр("ru='Выполнение операции остановлено.
								|Бюджет настройки формы ввода не должен содержать дубли статей оборотов.';
							   	|en='The operation is stopped.
								|Budget setting entry forms should not contain duplicates revolutions articles.'");
	КонецЕсли;
	
	ИмяИзмерения = Настройки.ИмяРазворачивать;
	
	Если Настройки.Версия_2 Тогда		
		ПараметрыПередачи = бит_ВводБюджета.НовыеПараметрыПосроенияМакетаБюджета();
		ЗаполнитьЗначенияСвойств(ПараметрыПередачи, ПараметрыВосстановления);
		
		ПараметрыПередачи.МестоИспользования 	= "бит_АктуализацияБюджета";
		ПараметрыПередачи.СхемаКомпоновкиДанных = ПараметрыВосстановления.СхемаКомпоновкиСтруктура;
		ПараметрыПередачи.НастройкиКомпоновщика = ПараметрыВосстановления.НастройкиКомпоновщикаСтруктура;
		
		РезультатОбновления = бит_ВводБюджета.РезультатПостроенияМакетаБюджета(НастройкаФормы, ПараметрыПередачи);
		
		ПараметрыВосстановления.ТабДок = РезультатОбновления.ДокументРезультат;
		
		ЗначенияГруппировок = РезультатОбновления.ЗначенияГруппировок;
		МассивОтбор 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначенияГруппировок, ИмяИзмерения, Новый Массив);

	Иначе	
		МассивОтбор = ОбновитьДеревоДанныхДинамическийМакет(ПараметрыВосстановления);
	КонецЕсли;
	
	УстановитьЗначенияВДерево(БДДС, ПараметрыВосстановления);
	
	Результат = Новый Структура;
	Результат.Вставить("ТабДок", ПараметрыВосстановления.ТабДок);	
	
	Возврат Результат;
	
КонецФункции

// Процедура выполняет актуализацию.
//
// Параметры:
//  ПараметрыАктуализации	 - Структура - см. НовыеПараметрыАктуализации.
// 
// Возвращаемое значение:
//  Структура - Структура параметров:
//  * БДДС - ТаблицаЗначений - Данные для ТЧ БДДС.
//
Функция ВыполнитьАктуализацию(ПараметрыАктуализации) Экспорт
	
	АктуализироватьПо		  = ПараметрыАктуализации.АктуализироватьПо;
	ДатаАктуализации   		  = ПараметрыАктуализации.ДатаАктуализации;
	ОсновноеИзмерение  		  = ПараметрыАктуализации.Настройки.ИмяРазворачивать;
	СпособАктуализации 		  = ПараметрыАктуализации.СпособАктуализации;
	СуммовойУчет 	  		  = ПараметрыАктуализации.Настройки.УчетСумма;
	КоличественныйУчет		  = ПараметрыАктуализации.Настройки.УчетКоличество;
	ПропускатьФактБольшеПлана = ПараметрыАктуализации.НеАктуализироватьФактБольшеПлана;
	ПрофильРаспределения	  = ПараметрыАктуализации.ПрофильРаспределения;
	ИсключитьПериодыБезПлана  = ПараметрыАктуализации.ИсключитьПериодыБезПлана;
	АналитикиДляПодстановки   = ПараметрыАктуализации.АналитикиДляПодстановки;
		
	СКД 			 = ПолучитьМакет("ДанныеДляАктуализации");
	Компоновщик		 = Новый КомпоновщикНастроекКомпоновкиДанных;
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);
	
	Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	НастройкиКомпоновки = Компоновщик.ПолучитьНастройки();
	
	НастройкиКомпоновки.Структура.Очистить();
	
	ИменаПолейАктуализации = Новый Массив;
	ИзмеренияАктуализации  = Новый Структура;
	
	Для каждого СтрокаТаблицы Из АктуализироватьПо Цикл
		Если СтрокаТаблицы.ИспользоватьРазрез Тогда
			ИмяПоля		= СтрЗаменить(СтрокаТаблицы.ИмяРеквизита, "Контроль", "");
			СинонимПоля = ПараметрыАктуализации.Настройки.Измерения[ИмяПоля].Синоним;
			
			ИменаПолейАктуализации.Добавить(ИмяПоля);
			ИзмеренияАктуализации.Вставить(ИмяПоля, СинонимПоля);
		КонецЕсли;
	КонецЦикла;								
	
	ГруппировкаПоляАктуализации = бит_ОтчетыБФСервер.НоваяГруппировка(НастройкиКомпоновки.Структура,,
									ТипГруппировкиКомпоновкиДанных.Элементы, Ложь);
	
	Для каждого ПолеАктуализации Из ИменаПолейАктуализации Цикл
		бит_ОтчетыБФСервер.НовоеПолеГруппировки(ГруппировкаПоляАктуализации, ПолеАктуализации, 
			ТипГруппировкиКомпоновкиДанных.Элементы);
	КонецЦикла;								
	
	ГруппировкаДетальныеЗаписи = бит_ОтчетыБФСервер.НоваяГруппировка(ГруппировкаПоляАктуализации,,
										ТипГруппировкиКомпоновкиДанных.Элементы, Ложь);
											
	ДанныеДляАктуализации = ДанныеДляАктуализации(ПараметрыАктуализации);
	
	Периоды = ДанныеДляАктуализации.Периоды;
	Данные	= ДанныеДляАктуализации.Данные;
	
	ВнешниеНаборы = Новый Структура("Данные", Данные);
	
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "ДатаАктуализации", ДатаАктуализации);
	
	Индекс = 1;
	Для каждого ДанныеПериода Из Периоды Цикл
		КодПериода = СтрШаблон("Период%1", Индекс);
		бит_ОтчетыБФСервер.ДобавитьПараметр(СКД, КодПериода,, ДанныеПериода.Период);

		НовоеПоле = СКД.ВычисляемыеПоля.Добавить();
		НовоеПоле.ПутьКДанным = ДанныеПериода.Сумма;
		НовоеПоле.Выражение   = СтрШаблон("ВЫБОР КОГДА Период = &%1 ТОГДА Сумма ИНАЧЕ 0 КОНЕЦ", КодПериода);
		НовоеПоле.ТипЗначения = ОбщегоНазначения.ОписаниеТипаЧисло(15, 3);
		бит_ОтчетыБФСервер.НовоеПолеВыбора(НастройкиКомпоновки, НовоеПоле.ПутьКДанным);
		
		НовоеПолеИтога = СКД.ПоляИтога.Добавить();
		НовоеПолеИтога.ПутьКДанным = НовоеПоле.ПутьКДанным;
		НовоеПолеИтога.Выражение   = СтрШаблон("СУММА(%1)", НовоеПоле.ПутьКДанным);
		
		НовоеПоле = СКД.ВычисляемыеПоля.Добавить();
		НовоеПоле.ПутьКДанным = ДанныеПериода.Количество;
		НовоеПоле.Выражение = СтрШаблон("ВЫБОР КОГДА Период = &%1 ТОГДА Количество ИНАЧЕ 0 КОНЕЦ", КодПериода);
		НовоеПоле.ТипЗначения = ОбщегоНазначения.ОписаниеТипаЧисло(15, 3);
		бит_ОтчетыБФСервер.НовоеПолеВыбора(НастройкиКомпоновки, НовоеПоле.ПутьКДанным);
		
		НовоеПолеИтога = СКД.ПоляИтога.Добавить();
		НовоеПолеИтога.ПутьКДанным = НовоеПоле.ПутьКДанным;
		НовоеПолеИтога.Выражение   = СтрШаблон("СУММА(%1)", НовоеПоле.ПутьКДанным);
		
		НовоеПоле = СКД.ВычисляемыеПоля.Добавить();
		НовоеПоле.ПутьКДанным = ДанныеПериода.СуммаФакт;
		НовоеПоле.Выражение   = СтрШаблон("ВЫБОР КОГДА Период = &%1 ТОГДА СуммаФакт ИНАЧЕ 0 КОНЕЦ", КодПериода);
		НовоеПоле.ТипЗначения = ОбщегоНазначения.ОписаниеТипаЧисло(15, 3);
		бит_ОтчетыБФСервер.НовоеПолеВыбора(НастройкиКомпоновки, НовоеПоле.ПутьКДанным);
		
		НовоеПолеИтога = СКД.ПоляИтога.Добавить();
		НовоеПолеИтога.ПутьКДанным = НовоеПоле.ПутьКДанным;
		НовоеПолеИтога.Выражение   = СтрШаблон("СУММА(%1)", НовоеПоле.ПутьКДанным);
		
		НовоеПоле = СКД.ВычисляемыеПоля.Добавить();
		НовоеПоле.ПутьКДанным = ДанныеПериода.КоличествоФакт;
		НовоеПоле.Выражение = СтрШаблон("ВЫБОР КОГДА Период = &%1 ТОГДА КоличествоФакт ИНАЧЕ 0 КОНЕЦ", КодПериода);
		НовоеПоле.ТипЗначения = ОбщегоНазначения.ОписаниеТипаЧисло(15, 3);
		бит_ОтчетыБФСервер.НовоеПолеВыбора(НастройкиКомпоновки, НовоеПоле.ПутьКДанным);
		
		НовоеПолеИтога = СКД.ПоляИтога.Добавить();
		НовоеПолеИтога.ПутьКДанным = НовоеПоле.ПутьКДанным;
		НовоеПолеИтога.Выражение   = СтрШаблон("СУММА(%1)", НовоеПоле.ПутьКДанным);
				
		Индекс = Индекс + 1;
	КонецЦикла;
		
	ПараметрыВыгрузкиСКД = бит_ОтчетыБФСервер.ПараметрыВыгрузитьРезультатСКД();
	ПараметрыВыгрузкиСКД.СхемаКомпоновки	 = СКД;
	ПараметрыВыгрузкиСКД.НастройкиКомпоновки = НастройкиКомпоновки;
	ПараметрыВыгрузкиСКД.ТипРезультата 		 = "ДеревоЗначений";
	ПараметрыВыгрузкиСКД.ВнешниеНаборыДанных = ВнешниеНаборы;
	
	РезультатСКД = бит_ОтчетыБФСервер.ВыгрузитьРезультатСКД(ПараметрыВыгрузкиСКД);
	
	БДДС = ПараметрыАктуализации.БДДС.СкопироватьКолонки();
	
	Ресурсы = Новый Массив;
	Если СуммовойУчет Тогда
		Ресурсы.Добавить("Сумма");
	КонецЕсли;
	Если КоличественныйУчет Тогда
		Ресурсы.Добавить("Количество");
	КонецЕсли;
	
	БазаПрофиля = Новый Соответствие;
	Если ЗначениеЗаполнено(ПрофильРаспределения) Тогда
		БазаПрофиля = Справочники.бит_ПрофилиРаспределенияПоПериодам.ПолучитьКоэффициенты(ПрофильРаспределения, "К");
	КонецЕсли;
	
	ПараметрыРаспределения = Новый Структура;
	ПараметрыРаспределения.Вставить("СпособАктуализации", 		 СпособАктуализации);
	ПараметрыРаспределения.Вставить("ДатаАктуализации", 		 ДатаАктуализации);
	ПараметрыРаспределения.Вставить("ПропускатьФактБольшеПлана", ПропускатьФактБольшеПлана);
	ПараметрыРаспределения.Вставить("БазаПрофиля", 				 БазаПрофиля);
	ПараметрыРаспределения.Вставить("ИзмеренияАктуализации", 	 ИзмеренияАктуализации);
	ПараметрыРаспределения.Вставить("ИсключитьПериодыБезПлана",  ИсключитьПериодыБезПлана);
	ПараметрыРаспределения.Вставить("ОсновноеИзмерение",  		 ОсновноеИзмерение);
	ПараметрыРаспределения.Вставить("БудущиеПериоды",  		 	 Периоды);
	ПараметрыРаспределения.Вставить("АналитикиДляПодстановки",	 АналитикиДляПодстановки);
	
	Отказ = Ложь;
	Для каждого СтрокаТаблицы Из РезультатСКД.Строки Цикл						
		Для каждого ИмяРесурса Из Ресурсы  Цикл			
			ОбработатьРаспределениеФакта(СтрокаТаблицы, ИмяРесурса, ПараметрыРаспределения);
		КонецЦикла;
	КонецЦикла;
	
	БДДС.Очистить();
	
	Стек = Новый Массив; 
	Для каждого СтрокаТаблицы Из РезультатСКД.Строки Цикл
		
		Стек.Добавить(СтрокаТаблицы);
	
		Пока Стек.Количество() > 0 Цикл
			
			ТекущийОбъект = Стек.Получить(Стек.ВГраница());
			Стек.Удалить(Стек.ВГраница());
						
			Если ТекущийОбъект.Строки.Количество() = 0 Тогда
				Если ТекущийОбъект.СуммаОбработано ИЛИ ТекущийОбъект.КоличествоОбработано Тогда
					Для каждого ДанныеПериода Из Периоды Цикл
						Если ДанныеПериода.Период >= ДатаАктуализации Тогда
							ТекущийОбъект.Сумма		 = ТекущийОбъект.Сумма 		
													 + ?(ТекущийОбъект.СуммаОбработано, ТекущийОбъект[ДанныеПериода.Сумма], 0);
							ТекущийОбъект.Количество = ТекущийОбъект.Количество 
													 + ?(ТекущийОбъект.КоличествоОбработано, ТекущийОбъект[ДанныеПериода.Количество], 0);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если ТекущийОбъект.Сумма = 0 И ТекущийОбъект.Количество = 0 
				   И ТекущийОбъект.СуммаФакт = 0 И ТекущийОбъект.КоличествоФакт = 0 Тогда
					Продолжить;			
				КонецЕсли;

				ЗаполнитьЗначенияСвойств(БДДС.Добавить(), ТекущийОбъект);
			КонецЕсли;
			
			Для каждого Элемент Из ТекущийОбъект.Строки Цикл
				Стек.Добавить(Элемент);
			КонецЦикла; 
		КонецЦикла;
	КонецЦикла; 
	
	БДДС.Сортировать("НомерСтроки возр");
	
	Результа = Новый Структура;
	Результа.Вставить("БДДС", БДДС);
	
	Возврат Результа;
	
КонецФункции

// Параметры для функций обновления данных.
// 
// Возвращаемое значение:
//  Структура - Структура параметров:
//  * ТабДок - ТабличныйДокумент - Заготовка под макет.
//  * НастройкаФормы - СправочникСсылка.бит_НастройкиФормВводаБюджета - Выбранная настройка формы ввода бюджета.
//  * Настройки - Структура - Свойства настройки формы ввода бюджета.
//  * ТекстЗапроса - Строка - Текст запроса для актуализации.
//  * Сценарий - СправочникСсылка.СценарииПланирования - Сценарий.
//  * СценарийЭталон - СправочникСсылка.СценарииПланирования - Сценарий эталон.
//  * СценарийФакт - СправочникСсылка.СценарииПланирования - Сценарий факт.
//  * СхемаКомпоновкиСтруктура - СхемаКомпоновкиДанных - Схема компоновки данных.
//  * НастройкиКомпоновщикаСтруктура - НастройкиКомпоновкиДанных - Настройки компоновки данных.
//  * СхемаКомпоновкиДанные - СхемаКомпоновкиДанных - Схема компоновки данных.
//  * НастройкиКомпоновщикаДанные - НастройкиКомпоновкиДанных - Настройки компоновки данных.
//  * Дата - Дата - Дата документа.
//  * Периодичность - ПеречислениеСсылка.бит_ПериодичностьПланирования - Периодичность планирования.
//  * ДатаНачалаПланирования - Дата - Дата начала планирования.
//  * ДатаОкончанияПланирования - Дата - Дата окончания планирования.
//  * ПродолжительностьИнтервала - Число - Количество интервалов.
//  * ДатаАктуализации - Дата - Дата актуализации.
//  * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
//
Функция НовыеПараметрыОбновления() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТабДок",							Новый ТабличныйДокумент());
	Параметры.Вставить("НастройкаФормы",					Справочники.бит_НастройкиФормВводаБюджета.ПустаяСсылка());
	Параметры.Вставить("Настройки",							Новый Структура);
	Параметры.Вставить("ТекстЗапроса",						"");
	Параметры.Вставить("Сценарий",							Справочники.СценарииПланирования.ПустаяСсылка());
	Параметры.Вставить("СценарийЭталон",					Справочники.СценарииПланирования.ПустаяСсылка());
	Параметры.Вставить("СценарийФакт",						Справочники.СценарииПланирования.ПустаяСсылка());
	Параметры.Вставить("СхемаКомпоновкиСтруктура",			Новый СхемаКомпоновкиДанных);
	Параметры.Вставить("НастройкиКомпоновщикаСтруктура",	Новый НастройкиКомпоновкиДанных);
	Параметры.Вставить("СхемаКомпоновкиДанные",				Новый СхемаКомпоновкиДанных);
	Параметры.Вставить("НастройкиКомпоновщикаДанные",		Новый НастройкиКомпоновкиДанных);
	Параметры.Вставить("Дата",								Дата(1,1,1));
	Параметры.Вставить("Периодичность",						Перечисления.бит_ПериодичностьПланирования.ПустаяСсылка());
	Параметры.Вставить("ДатаНачалаПланирования",			Дата(1,1,1));
	Параметры.Вставить("ДатаОкончанияПланирования",			Дата(1,1,1));
	Параметры.Вставить("ПродолжительностьИнтервала",		12);
	Параметры.Вставить("ДатаАктуализации",					Дата(1,1,1));
	Параметры.Вставить("ВалютаДокумента",					Справочники.Валюты.ПустаяСсылка());
	
	Возврат Параметры;
	
КонецФункции

// Параметры для функций восстановления данных.
// 
// Возвращаемое значение:
//  Структура - Структура параметров:
//  * ТабДок - ТабличныйДокумент - Заготовка под макет.
//  * НастройкаФормы - СправочникСсылка.бит_НастройкиФормВводаБюджета - Выбранная настройка формы ввода бюджета.
//  * Настройки - Структура - Свойства настройки формы ввода бюджета.
//  * ТекстЗапроса - Строка - Текст запроса для актуализации.
//  * СхемаКомпоновкиСтруктура - СхемаКомпоновкиДанных - Схема компоновки данных.
//  * НастройкиКомпоновщикаСтруктура - НастройкиКомпоновкиДанных - Настройки компоновки данных.
//  * Периодичность - ПеречислениеСсылка.бит_ПериодичностьПланирования - Периодичность планирования.
//  * ДатаНачалаПланирования - Дата - Дата начала планирования.
//  * ДатаОкончанияПланирования - Дата - Дата окончания планирования.
//  * ПродолжительностьИнтервала - Число - Количество интервалов.
//  * ДатаАктуализации - Дата - Дата актуализации.
//  * БДДС - ТаблицаЗначений - Данные ТЧ БДДС.
//  * ФактическиеДанные - ТаблицаЗначений - Данные ТЧ ФактическиеДанные.
//
Функция НовыеПараметрыВосстановления() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТабДок",							Новый ТабличныйДокумент());
	Параметры.Вставить("НастройкаФормы",					Справочники.бит_НастройкиФормВводаБюджета.ПустаяСсылка());
	Параметры.Вставить("Настройки",							Новый Структура);
	Параметры.Вставить("ТекстЗапроса",						"");
	Параметры.Вставить("СхемаКомпоновкиСтруктура",			Новый СхемаКомпоновкиДанных);
	Параметры.Вставить("НастройкиКомпоновщикаСтруктура",	Новый НастройкиКомпоновкиДанных);
	Параметры.Вставить("Периодичность",						Перечисления.бит_ПериодичностьПланирования.ПустаяСсылка());
	Параметры.Вставить("ДатаНачалаПланирования",			Дата(1,1,1));
	Параметры.Вставить("ДатаОкончанияПланирования",			Дата(1,1,1));
	Параметры.Вставить("ПродолжительностьИнтервала",		12);
	Параметры.Вставить("ДатаАктуализации",					Дата(1,1,1));
	Параметры.Вставить("БДДС",								Новый ТаблицаЗначений);
	Параметры.Вставить("ФактическиеДанные",					Новый ТаблицаЗначений);
	
	Возврат Параметры;
	
КонецФункции

// Параметры для функций актуализации данных.
// 
// Возвращаемое значение:
//  Структура - Структура параметров:
//  * Настройки - Структура - свойства настройки формы ввода бюджета.
//  * Периодичность - ПеречислениеСсылка.бит_ПериодичностьПланирования - Периодичность планирования.
//  * ПродолжительностьИнтервала - Число - Количество интервалов.
//  * ДатаАктуализации - Дата - Дата актуализации.
//  * ДатаНачалаПланирования - Дата - Дата начала планирования.
//  * СпособАктуализации -  ПеречислениеСсылка.бит_СпособыАктуализации - Способ актуализации.
//  * ПрофильРаспределения - СправочникСсылка.бит_ПрофилиРаспределенияПоПериодам - Профиль распределения.
//  * НеАктуализироватьФактБольшеПлана - Булево - Свойство документа Актуализации.
//  * БДДС - ТаблицаЗначений - Данные ТЧ БДДС, нужны только для восстановления.
//  * ФактическиеДанные - ТаблицаЗначений - Данные ТЧ ФактическиеДанные.
//
Функция НовыеПараметрыАктуализации() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("АналитикиДляПодстановки",			Новый Структура);
	Параметры.Вставить("Настройки",							Новый Структура);
 	Параметры.Вставить("Периодичность",						Перечисления.бит_ПериодичностьПланирования.ПустаяСсылка());
 	Параметры.Вставить("ПродолжительностьИнтервала",		12);
	Параметры.Вставить("ДатаАктуализации",					Дата(1,1,1));
	Параметры.Вставить("ДатаНачалаПланирования",			Дата(1,1,1));
	Параметры.Вставить("ДатаОкончанияПланирования",			Дата(1,1,1));
	Параметры.Вставить("СпособАктуализации",				Перечисления.бит_СпособыАктуализации.ПустаяСсылка());
	Параметры.Вставить("ПрофильРаспределения",				Справочники.бит_ПрофилиРаспределенияПоПериодам.ПустаяСсылка());
	Параметры.Вставить("НеАктуализироватьФактБольшеПлана",	Ложь);
	Параметры.Вставить("БДДС",								Новый ТаблицаЗначений);
	Параметры.Вставить("АктуализироватьПо",					Новый ТаблицаЗначений);
	Параметры.Вставить("ИсключитьПериодыБезПлана",			Ложь);
	
	Возврат Параметры;
	
КонецФункции

// Параметры для функций актуализации данных.
//
// Параметры:
//  АктуализацияБюджета	 - ДокументСсылка, ДокументОбъект	 - Ссылка или объект документа Актуализация бюджета.
//  Настройки			 - Структура						 - Свойства настройки формы ввода бюджета.
//  ТолькоПоУмолчанию	 - Булево							 - ограничивает выбор способа заполнения.
// 
// Возвращаемое значение:
//  Результат - Структура - аналитики для подстановки в строки БДДС.
//
Функция АналитикиБДДСДляПодстановки(АктуализацияБюджета, Настройки, ТолькоПоУмолчанию = Ложь) Экспорт
	
	МетаОбъект 		 = Документы.бит_АктуализацияБюджета.ПустаяСсылка().Метаданные();
	ИменаПоУмолчанию = Настройки.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчанию];
	Если НЕ ТолькоПоУмолчанию Тогда
		Для каждого ИмяИзмерения Из Настройки.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчаниюРедактирование] Цикл
			ИменаПоУмолчанию.Добавить(ИмяИзмерения);
		КонецЦикла;
	КонецЕсли;
		
	Индекс = ИменаПоУмолчанию.ВГраница();
	Пока Индекс >= 0 Цикл
		ТекЗначение = ИменаПоУмолчанию[Индекс];
		Если НЕ бит_РаботаСМетаданными.ЕстьРеквизит(ТекЗначение, МетаОбъект) 
			ИЛИ НЕ бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти(ТекЗначение, МетаОбъект, "БДДС") Тогда
			ИменаПоУмолчанию.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(АктуализацияБюджета) Тогда
		РеквизитыАктуализации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(АктуализацияБюджета, ИменаПоУмолчанию);
	Иначе	
		РеквизитыАктуализации = Новый Структура(СтрСоединить(ИменаПоУмолчанию, ","));
		ЗаполнитьЗначенияСвойств(РеквизитыАктуализации, АктуализацияБюджета); 
	КонецЕсли;
	
	Результат  = Новый Структура;
	
	Для каждого Измерение Из РеквизитыАктуализации Цикл
		Если ЗначениеЗаполнено(Измерение.Значение) Тогда
			Результат.Вставить(Измерение.Ключ, Измерение.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

Процедура СформироватьДвиженияОборотыПоБюджетам(ДанныеБюджета, Реквизиты, Движения, Отказ) Экспорт 
	
	Для каждого СтрокаТаблицы Из ДанныеБюджета Цикл
		Движение = Движения.бит_ОборотыПоБюджетам.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицы);
	КонецЦикла; 
	Движения.бит_ОборотыПоБюджетам.Записывать = Истина;
	
КонецПроцедуры

Процедура СформироватьДвиженияБюджетирование(ДанныеБюджета, Реквизиты, Движения, Отказ) Экспорт 
	
	Если ЗначениеЗаполнено(ДанныеБюджета) Тогда
		бит_Бюджетирование.СформироватьПроводкиБюджетирования(ДанныеБюджета,
			Движения.бит_Бюджетирование, Ложь);
	КонецЕсли;
	Движения.бит_Бюджетирование.Записывать = Истина;
	
КонецПроцедуры

// Инициализирует компоновщик, используемый для фильтрации структуры дерева.
// 
Функция ИнициализироватьКомпоновщикСтруктура(Знач ТекстЗапроса, КомпоновщикСтруктура, УникальныйИдентификатор) Экспорт
	
	Возврат Документы.бит_ФормаВводаБюджета.ИнициализироватьКомпоновщик(ТекстЗапроса,
				КомпоновщикСтруктура, УникальныйИдентификатор);
	
КонецФункции

// Функция определяет новый статус объекта.
// Механизм определения статусов может быть переопределен алгоритмами.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект.бит_ФормаВводаБюджета.
//  ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
//   СправочникСсылка.бит_СтатусыОбъектов - новый статус объекта.
//
Функция НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Возврат бит_ВизированиеСервер.НовыйСтатусПоСтандартномуАлгоритму(ТекущийОбъект, ПараметрыУстановкиСтатуса);
	
КонецФункции

// Элементы формы, которые не блокируются в зависимости от статуса.
//
// Возвращаемое значение:
//   СписокЗначений - Список имен элементов.
//
Функция ЭлементыИсключенияНастройкиДоступности() Экспорт
  
  ИсключаемыеЭлементы = Новый СписокЗначений;
  
  Возврат ИсключаемыеЭлементы;
  
КонецФункции

// Элементы формы, которые блокируются программно.
//
// Возвращаемое значение:
//   СписокЗначений - Список имен элементов.
//
Функция ЭлементыПрограммнойБлокировкиНастройкиДоступности() Экспорт
  
  ЭлементыФормы = Новый СписокЗначений;
  
  Возврат ЭлементыФормы;
  
КонецФункции

Функция ДанныеХранилищДокумента(СсылкаНаДокумент) Экспорт
	
	ДанныеХранилищ = Новый Структура;
	ДанныеХранилищ.Вставить("ТабличныйДокумент");
	ДанныеХранилищ.Вставить("НастройкиПостроителя");
	
	РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент,
						"ХранилищеДерева, НастройкиПостроителя");
	
	ТабличныйДокумент = Неопределено;
	Если РеквизитыОбъекта.ХранилищеДерева <> Неопределено Тогда
		ТабличныйДокумент = РеквизитыОбъекта.ХранилищеДерева.Получить();
	КонецЕсли;
	Если ТипЗнч(ТабличныйДокумент) <> Тип("ТабличныйДокумент") Тогда
		ТабличныйДокумент = Новый ТабличныйДокумент;
	КонецЕсли; 
	ДанныеХранилищ.ТабличныйДокумент = ТабличныйДокумент;
	
	НастройкиПостроителя = Неопределено;
	Если РеквизитыОбъекта.НастройкиПостроителя <> Неопределено Тогда
		НастройкиПостроителя = РеквизитыОбъекта.НастройкиПостроителя.Получить();
	КонецЕсли;
	Если ТипЗнч(НастройкиПостроителя) <> Тип("Структура") Тогда
		НастройкиПостроителя = Новый Структура;
	КонецЕсли; 
	ДанныеХранилищ.НастройкиПостроителя = НастройкиПостроителя;
	
	Возврат ДанныеХранилищ;
	
КонецФункции

Функция СхемаПолученияДанныхБюджета(ИмяИзмерения, Периодичность) Экспорт

	Если НЕ ЗначениеЗаполнено(Периодичность) Тогда
		ПериодичностьПланирования = Перечисления.бит_ПериодичностьПланирования.Месяц;
	Иначе	
		ПериодичностьПланирования = Периодичность;
	КонецЕсли;
	
	СКД	= ПолучитьМакет("ОборотыПоБюджету");
	
	ВычисляемоеПоле = СКД.ВычисляемыеПоля.Найти("Измерение");
	ВычисляемоеПоле.Выражение = ИмяИзмерения;

	ВычисляемоеПоле = СКД.ВычисляемыеПоля.Найти("Период");
	СтрокаДлительностьПериода = ОбщегоНазначения.ИмяЗначенияПеречисления(ПериодичностьПланирования);
	ВычисляемоеПоле.Выражение = "Период" + СтрокаДлительностьПериода;
		
	бит_МеханизмДопИзмерений.НастроитьПоляДополнительныхИзмеренийВСКД(СКД, "НаборДанных2");
	
	Возврат СКД; 

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеДереваСлужебные

Функция ОбновитьДеревоДанныхДинамическийМакет(Параметры)
	
	ТабДок							= Параметры.ТабДок;
	НастройкаФормы					= Параметры.НастройкаФормы;
	Настройки						= Параметры.Настройки;
	ТекстЗапроса					= Параметры.ТекстЗапроса;
	СхемаКомпоновкиСтруктура		= Параметры.СхемаКомпоновкиСтруктура;
	НастройкиКомпоновщикаСтруктура	= Параметры.НастройкиКомпоновщикаСтруктура;
	
	СтрокаСортировки = "";	
	
	МассивОтбор = Новый Массив;
	
	// Инициализация построителя.
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Бюджет", Настройки.Бюджет);
	Попытка		
		Запрос.Текст = ТекстЗапроса;		
	Исключение		
		ТекстСообщения = НСтр("ru='Неверный текст запроса. Описание ошибки: %1.';
							  |en='Invalid query text. Description of error: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
	КонецПопытки;
	
	Если НЕ Настройки.ВыводитьКодификатор Тогда
		бит_ОтчетыБФСервер.УдалитьВыбранноеПолеИзВсехНастроекОтчета(НастройкиКомпоновщикаСтруктура, "Кодификатор");
	КонецЕсли;

	Если СхемаКомпоновкиСтруктура.НаборыДанных.Количество() <> 0 Тогда
		
		КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетСКД = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиСтруктура, НастройкиКомпоновщикаСтруктура);
		
		// Получаем запрос макета компоновки данных.
		Попытка				
			Запрос.Текст = МакетСКД.НаборыДанных.НаборДанныхОсновной.Запрос;				
		Исключение				
			ТекстСообщения = НСтр("ru='Не удалось установить отбор для получения структуры.';
									|en='Failed to set the selection for the structure.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);				
		КонецПопытки;
		
		// Устанавливаем параметры запроса.
		ОписаниеПараметровЗапроса = Запрос.НайтиПараметры();
		Для каждого ОписаниеПараметраЗапроса Из ОписаниеПараметровЗапроса Цикл				
			Если МакетСКД.ЗначенияПараметров.Найти(ОписаниеПараметраЗапроса.Имя) <> Неопределено Тогда					
				Запрос.УстановитьПараметр(ОписаниеПараметраЗапроса.Имя, МакетСКД.ЗначенияПараметров[ОписаниеПараметраЗапроса.Имя].Значение);					
			КонецЕсли;				
		КонецЦикла;			
		
	КонецЕсли; 
	
	
	// Формируем строку сортировки.
	СохраненнаяНастройка = Справочники.бит_ЭлементыДанных.ПолучитьНастройкиПостроителя(НастройкаФормы);
	Если СохраненнаяНастройка.Свойство("НастройкиКомпоновщика") 
		И ТипЗнч(СохраненнаяНастройка.НастройкиКомпоновщика) = Тип("НастройкиКомпоновкиДанных")  Тогда
		
		Для каждого ЭлПорядка Из СохраненнаяНастройка.НастройкиКомпоновщика.Порядок.Элементы Цикл
			
			Если ЭлПорядка.Использование = Истина И НЕ Строка(ЭлПорядка.Поле) = "" Тогда
				
				НаправлениеСтр = ?(ЭлПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв, "УБЫВ", "ВОЗР"); 
				СтрокаСортировки = СтрокаСортировки+?(ПустаяСтрока(СтрокаСортировки),"",",")+Строка(ЭлПорядка.Поле)+" "+НаправлениеСтр;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// Установка отбора под владельцу дополнительных аналитик при необходимости.
	НастройкиИзмерений = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();	
	ИзмеренияРазворачивать = Настройки.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать];
	Для каждого Имя Из ИзмеренияРазворачивать Цикл
	
		ТекущаяНастройка = НастройкиИзмерений[Имя];
		
		Если НЕ ТекущаяНастройка = Неопределено 
			 И ТекущаяНастройка.ТипЗначения.СодержитТип(Тип("СправочникСсылка.бит_ДополнительныеЗначенияАналитик")) Тогда
		
			 Запрос.УстановитьПараметр(Имя, ТекущаяНастройка.Аналитика);
		
		КонецЕсли; 
	
	КонецЦикла; 	
	
	Попытка		
		Результат = Запрос.Выполнить();		
	Исключение		
		ТекстСообщения = НСтр("ru='Не удалось заполнить дерево данных. Описание ошибки: %1.';
							  |en='Unable to complete the data tree. Description of error: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат МассивОтбор;		
	КонецПопытки;
	
	РезДерево = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ЭтоНовыйЗапрос = ?(РезДерево.Колонки.Найти("Ссылка") = Неопределено, Истина, Ложь);
	
	// Получение областей, необходимых для вывода.
	Макет = Документы.бит_АктуализацияБюджета.ПолучитьМакет("Макет");	
	Области = Новый Структура;
	Области.Вставить("Заголовок_Кодификатор",Макет.ПолучитьОбласть("Заголовок|Кодификатор"));
	Области.Вставить("Заголовок_Измерение"  ,Макет.ПолучитьОбласть("Заголовок|Измерение"));
	Области.Вставить("Заголовок_Поле"       ,Макет.ПолучитьОбласть("Заголовок|Поле"));
	Области.Вставить("Заголовок_ПолеДубль"  ,Макет.ПолучитьОбласть("Заголовок|ПолеДубль"));
	Области.Вставить("Строка_Кодификатор"   ,Макет.ПолучитьОбласть("Строка|Кодификатор"));
	Области.Вставить("Строка_Измерение"     ,Макет.ПолучитьОбласть("Строка|Измерение"));
	Области.Вставить("Строка_ПолеКоличество",Макет.ПолучитьОбласть("Строка|ПолеКоличество"));
	Области.Вставить("Строка_ПолеСумма"     ,Макет.ПолучитьОбласть("Строка|ПолеСумма"));
	Области.Вставить("Строка_ПолеДубль"     ,Макет.ПолучитьОбласть("Строка|ПолеДубль"));
	Области.Вставить("СтрокаРасчетная_ПолеКоличество", Макет.ПолучитьОбласть("СтрокаРасчетная|ПолеКоличество"));
	Области.Вставить("СтрокаРасчетная_ПолеСумма"     , Макет.ПолучитьОбласть("СтрокаРасчетная|ПолеСумма"));
	Области.Вставить("СтрокаРасчетная_ПолеДубль", Макет.ПолучитьОбласть("СтрокаРасчетная|ПолеДубль"));
	
	ЭтоНастройкаПоБюджету   = ?(ЗначениеЗаполнено(Настройки.Бюджет), Истина, Ложь);
	ИспользоватьКоэффициенты = ?(ЭтоНастройкаПоБюджету И Настройки.ИспользоватьКоэффициентыСтатейБюджета, Истина, Ложь);
	
	Если ИспользоватьКоэффициенты Тогда
		
		// Если используются коэффициенты статей бюджета необходимо установить специальный формат.
		Область = Области.Строка_ПолеСумма.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		Область = Области.Строка_ПолеКоличество.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		Область = Области.Строка_ПолеДубль.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		Область = Области.Строка_ПолеДубль.Область(1,2,1,2);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		
		Область = Области.СтрокаРасчетная_ПолеСумма.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		Область = Области.СтрокаРасчетная_ПолеКоличество.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		Область = Области.СтрокаРасчетная_ПолеДубль.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		Область = Области.СтрокаРасчетная_ПолеДубль.Область(1,2,1,2);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		
	КонецЕсли; 
	
	// Вывод дерева данных.
	Периоды = ВывестиШапку(Области, Параметры);
	
	ТабДок.НачатьАвтогруппировкуСтрок();

	// Сортировка по кодификатору.
	Если ПустаяСтрока(СтрокаСортировки) Тогда
		
		ИзмеренияРазворачивать  = Настройки.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать];
		Если ИзмеренияРазворачивать.Количество() > 1 Тогда
			
			ИмяПервого = ИзмеренияРазворачивать[0];
			ИмяКодификатор = СтрШаблон("%1_Кодификатор", ИмяПервого);
			
			Если РезДерево.Колонки.Найти(ИмяКодификатор) <> Неопределено Тогда				
				СтрокаСортировки = СтрШаблон("%1,%2", ИмяКодификатор, ИмяПервого);				
			КонецЕсли; 
			
		КонецЕсли; 	
		
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(СтрокаСортировки) Тогда
		
		Попытка			
			РезДерево.Строки.Сортировать(СтрокаСортировки, Истина);			
		Исключение			
			ТекстСообщения = НСтр("ru='Не удалось выполнить сортировку по настройке: %1. Описание ошибки: %2.';
							 	  |en='Unable to sort by setting: %1. Description of the error: %2.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаСортировки, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
		КонецПопытки;
		
	КонецЕсли; 

	СтатьиБезИтогов = бит_Бюджетирование.СтатьиБезИтогов(Настройки.Бюджет);
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ЭтоНовыйЗапрос",	ЭтоНовыйЗапрос);
	ДопПараметры.Вставить("СтатьиБезИтогов",СтатьиБезИтогов);
	
	ОбойтиДерево(РезДерево, Области, Периоды, 1, Параметры, ДопПараметры);
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.НаправлениеПерехода = ТипНаправленияПереходаТабличногоДокумента.БезПерехода;
	
	ИмяИзмеренияРазворачивать = Настройки.ИмяРазворачивать;
	Если ЭтоНовыйЗапрос Тогда
	   МассивОтбор = Результат.Выгрузить().ВыгрузитьКолонку(ИмяИзмеренияРазворачивать);
	Иначе	
	   МассивОтбор = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
    КонецЕсли; 
    бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивОтбор);	
	
	Возврат МассивОтбор;
	
КонецФункции

Процедура УстановитьЗначенияВДерево(БДДС, Параметры)
	
	ДокументРезультат = Параметры.ТабДок;
	ИмяИзмерения      = Параметры.Настройки.ИмяРазворачивать;
	
	ИндексыПоПериодИзмерение = Новый Структура; // Коллекция строк сгруппированных по комбинации Период + Измерение
	
	// Восстанавливаем значения областей по значениям табличной части БДДС.
	Для каждого Область Из ДокументРезультат.Области Цикл
		Если НЕ бит_БюджетированиеКлиентСервер.ЭтоРасшифровкаЯчейкиФВБ(Область.Расшифровка) Тогда
			Продолжить;		
		КонецЕсли;
		
		Расшифровка = Область.Расшифровка;
		Если Расшифровка.Вид <> бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБЗначение() Тогда
			Продолжить;		
		КонецЕсли;
		
		РезультатПоиска = Неопределено;
		Индекс			= "А_" + Расшифровка.ИдентификаторСтроки;
		Если НЕ ИндексыПоПериодИзмерение.Свойство(Индекс, РезультатПоиска) Тогда
			Фильтр = Новый Структура;
			Фильтр.Вставить("Период", 	 Расшифровка.Период);
			Для каждого КлючЗначение Из Расшифровка.Измерения Цикл
				Фильтр.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
			КонецЦикла;
			 
			РезультатПоиска = БДДС.НайтиСтроки(Фильтр);
			ИндексыПоПериодИзмерение.Вставить(Индекс, РезультатПоиска);	
		КонецЕсли;
		
		ИтогоСумма      = 0;				 
		ИтогоКоличество = 0;
		Для каждого СтрокаТаблицы Из РезультатПоиска Цикл
			ПолеСумма 	   = ?(Расшифровка.ПланФакт = "П", "Сумма", "СуммаФакт");
			ПолеКоличество = ?(Расшифровка.ПланФакт = "П", "Количество", "КоличествоФакт");
			
			ИтогоСумма      = ИтогоСумма + СтрокаТаблицы[ПолеСумма];
			ИтогоКоличество = ИтогоКоличество + СтрокаТаблицы[ПолеКоличество];
		КонецЦикла;
		
		Если Лев(Область.Имя,1) = "С" Тогда
			Область.Значение = ИтогоСумма;
		КонецЕсли; 
		
		Если Лев(Область.Имя,1) = "К" Тогда
			Область.Значение = ИтогоКоличество;
		КонецЕсли; 
	КонецЦикла;
	
	// Выполнение расчетов по формулам в табличном документе.
	бит_Бюджетирование.ВыполнитьРасчеты(ДокументРезультат);	

КонецПроцедуры

// Осуществляет вывод шапки дерева данных. 
// 
// Параметры:
//  ТабДок - ТабличныйДокумент.
//  Области - Структура - Области макета.
//  НастрФормы - Структура - Настройки формы ввода.
// 
Функция ВывестиШапку(Области, Параметры)
	
	ТабДок						= Параметры.ТабДок;
	Настройки					= Параметры.Настройки;
	Периодичность				= Параметры.Периодичность;
	ПродолжительностьИнтервала	= Параметры.ПродолжительностьИнтервала;
	ДатаНачалаПланирования		= Параметры.ДатаНачалаПланирования;
    ДатаОкончанияПланирования	= Параметры.ДатаОкончанияПланирования;
	
	ВыведеноОбластей = 0;
	// Колонка кодификатор. 
	Если Настройки.ВыводитьКодификатор Тогда
		ТабДок.Вывести(Области.Заголовок_Кодификатор); 
		ВыведеноОбластей = ВыведеноОбластей + 1;
	КонецЕсли;
	
	// Имена измерений.
	Для каждого Имя Из Настройки.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать] Цикл
		
		Если Настройки.ИспользоватьНаименованияСтатейБюджета И Настройки.Измерения[Имя].Имя = "СтатьяОборотов" Тогда
			Области.Заголовок_Измерение.Параметры.ИмяИзмерения = НСтр("ru = 'Статьи бюджета'");
		Иначе	
			Области.Заголовок_Измерение.Параметры.ИмяИзмерения = Настройки.Измерения[Имя].Синоним;
		КонецЕсли;
		
		Если ВыведеноОбластей = 0 Тогда
			ТабДок.Вывести(Области.Заголовок_Измерение); 
			ВыведеноОбластей = ВыведеноОбластей + 1;
		Иначе	
			ТабДок.Присоединить(Области.Заголовок_Измерение);
		КонецЕсли;
	
	КонецЦикла; 
	
	// Фиксация области измерений.
	ТабДок.ФиксацияСверху = 2;
	ТабДок.ФиксацияСлева  = Настройки.КоличествоРазворачивать+1;
	
	// Вывод заголовка периодов
	Если НЕ ЗначениеЗаполнено(ДатаОкончанияПланирования) Тогда
		КоличествоИнтервалов = ПродолжительностьИнтервала;
	Иначе
		КоличествоИнтервалов = бит_ОбщегоНазначенияКлиентСервер.РазностьДат(ДатаНачалаПланирования, ДатаОкончанияПланирования, Периодичность)+1;
	КонецЕсли; 
	
	ИмяОбластиПериод = ?(Настройки.УчетКоличество И Настройки.УчетСумма, "Заголовок_ПолеДубль","Заголовок_Поле");
	
	// Проверим, следует ли создавать дополнительные итоговые колонки.
	ПериодыИтогов = Новый Массив;
	Для каждого СтрНастройки Из Настройки.ДополнительныеИтоги Цикл
		Если Перечисления.бит_ПериодичностьПланирования.Индекс(СтрНастройки.Периодичность) > Перечисления.бит_ПериодичностьПланирования.Индекс(Периодичность) Тогда
			  ПериодыИтогов.Добавить(СтрНастройки);
		КонецЕсли; 
	КонецЦикла; 
	
	// Признак того, что нужно обработать выходные дни.
	НужноОбработатьВыходные = ?(Периодичность = Перечисления.бит_ПериодичностьПланирования.День 
	                          И НЕ Настройки.ОтображениеВыходных = Перечисления.бит_РежимыОтображенияВыходныхДнейФормыВвода.Обычный, Истина, Ложь);
	
							  
    ВыходныеДни = Новый Соответствие;
	Если НужноОбработатьВыходные Тогда
		
		// Получим календарь по которому будем проверять выходные.
		Календарь = бит_НастройкиПрограммы.Календарь(Неопределено, ДатаНачалаПланирования);
		
		Если ЗначениеЗаполнено(Календарь) Тогда
			
			МассивВидов = Новый Массив;
			МассивВидов.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота);
			МассивВидов.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье);
			МассивВидов.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник);
			
			ДатаОкончанияКалендаря = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ДатаНачалаПланирования,КоличествоИнтервалов,Периодичность);
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ПроизводственныйКалендарь",	Календарь);
			Запрос.УстановитьПараметр("ДатаНачала",					ДатаНачалаПланирования);
			Запрос.УстановитьПараметр("ДатаОкончания",				ДатаОкончанияКалендаря);
			Запрос.УстановитьПараметр("МассивВидов",				МассивВидов);
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТабКалендарь.Дата КАК Дата
			|ИЗ
			|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ТабКалендарь
			|ГДЕ
			|	ТабКалендарь.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
			|	И ТабКалендарь.ВидДня В(&МассивВидов)
			|	И ТабКалендарь.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
						   
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл			
				ВыходныеДни.Вставить(Выборка.Дата, Истина);			
			КонецЦикла; 			
			
		Иначе	
			
			НужноОбработатьВыходные = Ложь;
			ТекстСообщения = НСтр("ru='Невозможно определить выходные дни, т.к. не установлен Календарь в настройках программы (БИТ).';
								  |en='It is impossible to define the weekend as Calendar is not set in the program settings (BIT).'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли; 
		
	КонецЕсли;// Обработать выходные.						  
							  
	Периоды = Новый Массив;
	НомИт = 1;
	Для й=1 По КоличествоИнтервалов Цикл
	
		ТекущийПериод = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ДатаНачалаПланирования,й-1,Периодичность);
		Синоним 	  = бит_ОбщегоНазначения.СформироватьПредставлениеПериода(ТекущийПериод,Периодичность);		
		
		ПараметрыОписанияПериода = бит_Бюджетирование.НовыеПараметрыОписаниеПериода();
		ПараметрыОписанияПериода.Период  = ТекущийПериод;
		ПараметрыОписанияПериода.Синоним = Синоним;
		ТекОписаниеПериода = бит_Бюджетирование.ОписаниеПериода(ПараметрыОписанияПериода);
		
		Если НужноОбработатьВыходные Тогда
			Если ВыходныеДни[ТекущийПериод] = Истина Тогда
				Если Настройки.ОтображениеВыходных = Перечисления.бит_РежимыОтображенияВыходныхДнейФормыВвода.НеОтображать Тогда
					Продолжить;
				КонецЕсли; 
				ТекОписаниеПериода.ЭтоВыходной = Истина;
			КонецЕсли; 
		КонецЕсли; 
		
		
		Периоды.Добавить(ТекОписаниеПериода);
		
		// Добавление дополнительных итоговых колонок по периодам.
		КонецТекПериода = бит_ОбщегоНазначенияКлиентСервер.ПолучитьКонецПериода(ТекущийПериод, Периодичность);		
		Для каждого СтрНастройки Из ПериодыИтогов Цикл
			КонецИтПериода = бит_ОбщегоНазначенияКлиентСервер.ПолучитьКонецПериода(ТекущийПериод, СтрНастройки.Периодичность);
			Если КонецТекПериода = КонецИтПериода Тогда
			
				Синоним = бит_ОбщегоНазначения.СформироватьПредставлениеПериода(ТекущийПериод, СтрНастройки.Периодичность);
				НачалоИтПериода = бит_ОбщегоНазначенияКлиентСервер.ПолучитьНачалоПериода(ТекущийПериод, СтрНастройки.Периодичность);
				
				ПараметрыОписанияПериода = бит_Бюджетирование.НовыеПараметрыОписаниеПериода();
				ПараметрыОписанияПериода.Период  			= НачалоИтПериода;
				ПараметрыОписанияПериода.Синоним 			= Синоним;
				ПараметрыОписанияПериода.Имя 	 			= "Ит_"+Формат(НомИт,"ЧГ=");
				ПараметрыОписанияПериода.ЭтоИтог 			= Истина;
				ПараметрыОписанияПериода.ЭтоНарастающийИтог = СтрНастройки.НарастающийИтог;
				ПараметрыОписанияПериода.КонецПериода 		= КонецИтПериода;
				
				ТекОписаниеПериода = бит_Бюджетирование.ОписаниеПериода(ПараметрыОписанияПериода);
		        Периоды.Добавить(ТекОписаниеПериода);				
				
				НомИт = НомИт + 1;
			КонецЕсли; 
		
		КонецЦикла; // ПериодыИтогов.
		
	КонецЦикла; // По интервалам.

	// Колонки итогов
	Если Настройки.ВыводитьОбщиеИтоги Тогда
		ПараметрыОписанияПериода = бит_Бюджетирование.НовыеПараметрыОписаниеПериода();
		ПараметрыОписанияПериода.Период  			= Дата('00010101');
		ПараметрыОписанияПериода.Синоним 			= НСтр("ru='Итого';en='Total'");
		ПараметрыОписанияПериода.Имя 	 			= "Итог";
		ПараметрыОписанияПериода.ЭтоИтог 			= Истина;

		ТекОписаниеПериода = бит_Бюджетирование.ОписаниеПериода(ПараметрыОписанияПериода);
		Периоды.Добавить(ТекОписаниеПериода);
	КонецЕсли;
	
	Для каждого ТекОписание Из Периоды Цикл
		
		ОбластьПериод = Области[ИмяОбластиПериод];
		
		ОбластьПериод.Параметры.ИмяПоля = ТекОписание.Синоним;
		
		Область = ОбластьПериод.Область(1,1,1,1);
		
		Если ТекОписание.ЭтоВыходной 
			 И Настройки.ОтображениеВыходных = Перечисления.бит_РежимыОтображенияВыходныхДнейФормыВвода.Выделять Тогда
			 Область.ЦветТекста = WebЦвета.Красный;
		Иначе
			 Область.ЦветТекста = WebЦвета.Черный;
		КонецЕсли; 
		
		ТабДок.Присоединить(Области[ИмяОбластиПериод]);
		
	КонецЦикла; 
	
	Возврат Периоды;
	
КонецФункции

// Выводит группировки в дерево данных. 
// 
// Параметры:
//  СтрокаВерх - СтрокаДереваЗначений.
//  Области - Структура.
//  Периоды - Массив.
//  Ном - Число.
//  Параметры - Структура.
//  ДопПараметры - Структура.
// 
Функция ОбойтиДерево(СтрокаВерх, Области, Периоды, Ном, Параметры, ДопПараметры)
	
	ТабДок				= Параметры.ТабДок;
	Настройки			= Параметры.Настройки;
	ДатаАктуализации	= Параметры.ДатаАктуализации;
	
	ИменаЯчеек = Новый Соответствие;
	ИзмеренияРазворачивать  = Настройки.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать];
	КоличествоРазворачивать = Настройки.КоличествоРазворачивать;
	ЭтоНастройкаПоБюджету   = ?(ЗначениеЗаполнено(Настройки.Бюджет), Истина, Ложь);
	ИспользоватьКоэффициенты = ?(ЭтоНастройкаПоБюджету И Настройки.ИспользоватьКоэффициентыСтатейБюджета, Истина, Ложь);
	
	ЦветФактПрошлый = WebЦвета.Белый;
	ЦветНедоступный = WebЦвета.Лимонный;
	
	ВидыРасшифровокФВБ = бит_БюджетированиеКлиентСервер.ВидыРасшифровокФВБ();
	
	// Структура для хранения данных, используемых при анализе необходимости объединения ячеек.
	ДанныеВрем = бит_Бюджетирование.КонструкторСтруктурыПроверкиОбъединения(ИзмеренияРазворачивать, Настройки.ВыводитьКодификатор);
	
	Для каждого СтрокаДерева Из СтрокаВерх.Строки Цикл
		
		Уровень = СтрокаДерева.Уровень();
		ЕстьПодчиненныеСтроки = ?(СтрокаДерева.Строки.Количество() > 0, Истина, Ложь);
		// Если настройка не по бюджету, коэффициент всегда 1.
		// Для настройки по бюджету, для групп коэффициент 1, для статей берем указанный в статье.
		Коэффициент = ?(ИспользоватьКоэффициенты, ?(СтрокаДерева.СтатьяБюджета.ЭтоГруппа, 1, СтрокаДерева.СтатьяБюджета.Коэффициент), 1);
		
		// Если нет подчиненных строк - строку, содержащую группы выводить не нужно.
		ЕстьГруппы = Ложь;
		Для каждого Имя Из ИзмеренияРазворачивать Цикл
			Если ДопПараметры.ЭтоНовыйЗапрос Тогда
				// Новый формат запроса может содержать несколько измерений.
				ТекЗначение = СтрокаДерева[Имя];
				Если ЭтоНастройкаПоБюджету И ВРег(Имя) = ВРег("СтатьяОборотов") И НЕ ЗначениеЗаполнено(ТекЗначение) Тогда					
					Если СтрокаДерева.СтатьяБюджета.ЭтоГруппа Тогда
						Если Настройки.ИспользоватьНаименованияСтатейБюджета Тогда
							ТекЗначение = СтрокаДерева.СтатьяБюджета;
						Иначе
							ТекЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДерева.СтатьяБюджета, "СтатьяОборотов");
							Если НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
								ТекЗначение = СтрокаДерева.СтатьяБюджета;
							КонецЕсли;
						КонецЕсли;
					Иначе	
						ТекЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДерева.СтатьяБюджета, "СтатьяОборотов");
					КонецЕсли; 
				КонецЕсли; 
			Иначе
				// Формат запроса редакции 2.8 содержал, только одно измерение с именем Ссылка.
				ТекЗначение = СтрокаДерева.Ссылка; 
			КонецЕсли; 
			Если ЗначениеЗаполнено(ТекЗначение) И ТекЗначение.ЭтоГруппа Тогда
				ЕстьГруппы = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;  // По именам измерений.
		
		Если ЕстьГруппы И НЕ ЕстьПодчиненныеСтроки Тогда
			Продолжить;
		КонецЕсли; 
		
		// Если в подчиненных строках только группы - выводить не нужно.
		ТолькоГруппы = Истина;
		бит_Бюджетирование.ПроверитьНаличиеПодчиненныхЭлементов(СтрокаДерева, ИзмеренияРазворачивать, ДопПараметры.ЭтоНовыйЗапрос, ТолькоГруппы); 			
        Если ТолькоГруппы Тогда
			Продолжить;
		КонецЕсли; 
		
		// Измерения.
		ЗначенияИзмерений = Новый Структура;
		ИдИзмерений = "";
		ЕстьГруппа = Ложь;
		Сч = 1;
		Для каждого Имя Из ИзмеренияРазворачивать Цикл
			
			Если Сч = 1 И Настройки.ВыводитьКодификатор Тогда
				// Вывод кодификатора для первого измерения.
				Если ДопПараметры.ЭтоНовыйЗапрос Тогда
					Области.Строка_Кодификатор.Параметры.Кодификатор = СтрокаДерева[Имя+"_Кодификатор"];
				Иначе	
					Области.Строка_Кодификатор.Параметры.Кодификатор = СтрокаДерева.Кодификатор;
				КонецЕсли; 
				ТабДок.Вывести(Области.Строка_Кодификатор, Уровень);
			КонецЕсли; 
			
			// Вывод измерений в макет.
			Если ДопПараметры.ЭтоНовыйЗапрос Тогда
				ТекЗначение = СтрокаДерева[Имя];
				Если НЕ ЗначениеЗаполнено(ТекЗначение) И СтрСравнить(Имя, "СтатьяОборотов") = 0 И ЭтоНастройкаПоБюджету Тогда
					Если СтрокаДерева.СтатьяБюджета.ЭтоГруппа Тогда
						Если Настройки.ИспользоватьНаименованияСтатейБюджета Тогда
							ТекЗначение = СтрокаДерева.СтатьяБюджета;
						Иначе
							ТекЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДерева.СтатьяБюджета, "СтатьяОборотов");
							Если НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
								ТекЗначение = СтрокаДерева.СтатьяБюджета;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли; 
			Иначе	
				// Формат запроса редакции 2.8 содержал, только одно измерение с именем Ссылка.
				ТекЗначение = СтрокаДерева.Ссылка; 
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ТекЗначение) И ТекЗначение.ЭтоГруппа Тогда
				ЕстьГруппа = Истина;
			КонецЕсли;
			
			Если ЭтоНастройкаПоБюджету И Настройки.ИспользоватьНаименованияСтатейБюджета И СтрСравнить(Имя, "СтатьяОборотов") = 0 Тогда
				Области.Строка_Измерение.Параметры.ЗначениеИзмерения = СтрокаДерева.СтатьяБюджета;
			Иначе
				Области.Строка_Измерение.Параметры.ЗначениеИзмерения = ТекЗначение;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекЗначение) Тогда
			    ЗначенияИзмерений.Вставить(Имя, ТекЗначение);
				ИдИзмерений = ИдИзмерений+?(ПустаяСтрока(ИдИзмерений),"","_")+СтрЗаменить(Строка(ТекЗначение.УникальныйИдентификатор()),"-","");
			КонецЕсли; 
			
			ИмяЯчейки = бит_Бюджетирование.ИмяОбластиИзмерение(Имя, Ном);
			Обл		  = Области.Строка_Измерение.Область(1,1,1,1);
			Обл.Имя	  = ИмяЯчейки;
			ВидЯчейки = бит_БюджетированиеКлиентСервер.ВидРасшифровкиФВБИзмерение();
			Области.Строка_Измерение.Параметры.р = бит_Бюджетирование.РасшифровкаЯчейки(ИмяЯчейки, 
														Неопределено, '0001-01-01', ВидЯчейки, "", ТекЗначение);  
														
			Если Сч = 1 И НЕ Настройки.ВыводитьКодификатор Тогда
				ТабДок.Вывести(Области.Строка_Измерение, Уровень);
           	Иначе
				ТабДок.Присоединить(Области.Строка_Измерение, Уровень);			
			КонецЕсли;                                                 
			
			// Объединение ограничено 1 разворотом, чтобы избежать смещения в сетке табличного документа.
			Если Настройки.ОбъединятьЯчейки И Сч = 1 И КоличествоРазворачивать > 1 Тогда
				// Объединяем ячейки с повторяющимися значениями аналитик.
				бит_Бюджетирование.ПроверитьВыполнитьОбъединениеЯчеек(ТабДок, ДанныеВрем, Имя, ТекЗначение, ЕстьПодчиненныеСтроки);
			КонецЕсли; 
			Сч = Сч +1;
		КонецЦикла;  // По именам измерений.
		
		// Ячейки данных.
		ИспользуемДваРесурса = (Настройки.УчетСумма И Настройки.УчетКоличество);
		ИмяСтроки  			 = ?(НЕ ЕстьПодчиненныеСтроки И НЕ ЕстьГруппа , "Строка", "СтрокаРасчетная");
		ИмяКолонки 			 = ?(ИспользуемДваРесурса, "ПолеДубль", ?(Настройки.УчетКоличество,"ПолеКоличество","ПолеСумма"));
		ИмяОбласти 			 = ИмяСтроки+"_"+ИмяКолонки;
		ИмяОбластиИтог 		 = "СтрокаРасчетная_"+ИмяКолонки;
		ВидЯчейки  			 = ?(НЕ ЕстьПодчиненныеСтроки И НЕ ЕстьГруппа , ВидыРасшифровокФВБ.Значение, ВидыРасшифровокФВБ.Формула);
		
	    Префиксы = Новый Структура;
		Префиксы.Вставить("ИмяСумма","СП");
		Префиксы.Вставить("ИмяСуммаФакт","СФ");
		Префиксы.Вставить("ИмяКоличество","КП");
		Префиксы.Вставить("ИмяКоличествоФакт","КФ");
		
		Аргументы	= Новый Структура;  // Хранит аргументы для формул.
		Имена		= Новый Структура;  // Хранит имена различных типов ячеек.
		Для каждого КиЗ Из Префиксы Цикл
			Аргументы.Вставить(КиЗ.Значение, Новый Массив);
			Имена.Вставить(КиЗ.Значение, "");
		КонецЦикла; 
		
		Для каждого ТекОписание Из Периоды Цикл
			
			// Определение цвета ячейка фактических данных.
			Если НЕ ТекОписание.ЭтоИтог Тогда
				ЦветЯчейкиФакт = ?(ТекОписание.Период < ДатаАктуализации, ЦветФактПрошлый, ЦветНедоступный);
			Иначе	
				ЦветЯчейкиФакт = ?(ТекОписание.КонецПериода < ДатаАктуализации И ЗначениеЗаполнено(ТекОписание.Период), ЦветФактПрошлый, ЦветНедоступный);
			КонецЕсли; 
			
			// Подготовка имен.
			Для каждого КиЗ Из Префиксы Цикл
				
				ТипИмени = КиЗ.Ключ;
				Префикс  = КиЗ.Значение;
				
				ТекИмяБезАналитики = ТекОписание[ТипИмени];
				ТекИмяЯчейки = ТекОписание[ТипИмени]+"_"+ИдИзмерений;
				Имена[Префикс] = ТекИмяЯчейки;
				Если ИменаЯчеек[ТекИмяБезАналитики] = Неопределено Тогда
					ИменаЯчеек[ТекИмяБезАналитики] = Новый Массив;
				КонецЕсли; 
				
				// Проверка статьи бюджета на флаг "НеВключатьВИтоги".
				Если НЕ ЗначениеЗаполнено(Настройки.Бюджет)
					ИЛИ (ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДерева, "СтатьяБюджета")
					И ДопПараметры.СтатьиБезИтогов[СтрокаДерева.СтатьяБюджета] = Неопределено) Тогда
					ИменаЯчеек[ТекИмяБезАналитики].Добавить(Новый Структура("Имя, Коэф", Имена[Префикс], Коэффициент));
				КонецЕсли;
				Если НЕ ТекОписание.ЭтоИтог Тогда
					Аргументы[Префикс].Добавить(Имена[Префикс]);
				КонецЕсли;
			
			КонецЦикла; // Префиксы.
			
			Если ИспользуемДваРесурса Тогда
				
				// Форма с двумя ресурсами.
				
				Если ТекОписание.ЭтоИтог Тогда
					
					// Итоговые колонки.
					Обл = Области[ИмяОбластиИтог];
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = Имена.КП;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидыРасшифровокФВБ.Формула;
					ПараметрыДоработки.Аргументы 	   = Аргументы.КП;
					ПараметрыДоработки.ЦветФона		   = Обл.Область(1, 1, 1, 1).ЦветФона;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 2;
					ПараметрыДоработки.Имя 			   = Имена.СП;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидыРасшифровокФВБ.Формула;
					ПараметрыДоработки.Аргументы 	   = Аргументы.СП;
					ПараметрыДоработки.ЦветФона		   = Обл.Область(1, 1, 1, 1).ЦветФона;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = Имена.КФ;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидыРасшифровокФВБ.Формула;
					ПараметрыДоработки.Аргументы 	   = Аргументы.КФ;
					ПараметрыДоработки.ЦветФона		   = ЦветЯчейкиФакт;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 2;
					ПараметрыДоработки.Имя 			   = Имена.СФ;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидыРасшифровокФВБ.Формула;
					ПараметрыДоработки.Аргументы 	   = Аргументы.СФ;
					ПараметрыДоработки.ЦветФона		   = ЦветЯчейкиФакт;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);										
					
					ТабДок.Присоединить(Обл);					
				Иначе	
					
					// Колонки для ввода данных.
					Обл = Области[ИмяОбласти];
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = Имена.КП;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					ПараметрыДоработки.ЦветФона		   = Обл.Область(1, 1, 1, 1).ЦветФона;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);

					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 2;
					ПараметрыДоработки.Имя 			   = Имена.СП;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					ПараметрыДоработки.ЦветФона		   = Обл.Область(1, 1, 1, 1).ЦветФона;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = Имена.КФ;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					ПараметрыДоработки.ЦветФона		   = ЦветЯчейкиФакт;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);					
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 2;
					ПараметрыДоработки.Имя 			   = Имена.СФ;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					ПараметрыДоработки.ЦветФона		   = ЦветЯчейкиФакт;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);										
					
					ТабДок.Присоединить(Обл);
				КонецЕсли; 
			Иначе	
				
				// Форма с одним ресурсом.
				ИмяЯчейки     = ?(Настройки.УчетКоличество, Имена.КП, Имена.СП);
				ИмяЯчейкиФакт = ?(Настройки.УчетКоличество, Имена.КФ, Имена.СФ);
				Если ТекОписание.ЭтоИтог Тогда
					
					// Итоговая колонка.
					Обл = Области[ИмяОбластиИтог];
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = ИмяЯчейки;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидыРасшифровокФВБ.Формула;
					ПараметрыДоработки.Аргументы 	   = ?(Настройки.УчетКоличество, Аргументы.КП, Аргументы.СП);
					ПараметрыДоработки.ЦветФона		   = Обл.Область(1, 1, 1, 1).ЦветФона;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = ИмяЯчейкиФакт;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидыРасшифровокФВБ.Формула;
					ПараметрыДоработки.ЦветФона 	   = ЦветЯчейкиФакт;
					ПараметрыДоработки.Аргументы 	   = ?(Настройки.УчетКоличество, Аргументы.КФ, Аргументы.СФ);
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);										
					ТабДок.Присоединить(Обл);
				Иначе	
					
					// Колонка для ввода данных.
					Обл = Области[ИмяОбласти];
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = ИмяЯчейки;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					ПараметрыДоработки.ЦветФона		   = Обл.Область(1, 1, 1, 1).ЦветФона;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = ИмяЯчейкиФакт;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					ПараметрыДоработки.ЦветФона 	   = ЦветЯчейкиФакт;
					
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);					
					ТабДок.Присоединить(Обл);
				КонецЕсли; 
			КонецЕсли;  // ФлДваРесурса.
		КонецЦикла; // Периоды.
		
		ТекНом = Ном; // Фиксируем номер строки до входа в рекурсивный вызов.
		Ном = Ном + 1;	
		
		ИменаПодчиненныхЯчеек = ОбойтиДерево(СтрокаДерева, Области, Периоды, Ном, Параметры, ДопПараметры);
		
		// Установим формулы для вычисления итогов по группам.
		Если ИменаПодчиненныхЯчеек.Количество() > 0 Тогда
			// После выхода из подчиненного вызова сбрасываем параметры проверяющие объединение ячеек.
			ДанныеВрем = бит_Бюджетирование.КонструкторСтруктурыПроверкиОбъединения(ИзмеренияРазворачивать, Настройки.ВыводитьКодификатор);
			Для каждого ТекОписание Из Периоды Цикл
				Если Настройки.УчетКоличество Тогда
					 бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ТабДок, ИменаПодчиненныхЯчеек,
					 	ТекОписание.ИмяКоличество, ИдИзмерений);
					 бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ТабДок, ИменаПодчиненныхЯчеек,
					 	ТекОписание.ИмяКоличествоФакт, ИдИзмерений);
				КонецЕсли; 
				Если Настройки.УчетСумма Тогда
					 бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ТабДок, ИменаПодчиненныхЯчеек,
					 	ТекОписание.ИмяСумма, ИдИзмерений);
					 бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ТабДок, ИменаПодчиненныхЯчеек,
					 	ТекОписание.ИмяСуммаФакт, ИдИзмерений);
				КонецЕсли; 
			КонецЦикла; // Периоды - установка формул.
		КонецЕсли;
		
	КонецЦикла; // По строкам дерева данного уровня.
	
	Если Настройки.ОбъединятьЯчейки Тогда
		// Вызова процедуры объединения для объединения ячеек в случае завершения группировки.
		Сч = 1;
		Для каждого Имя Из ИзмеренияРазворачивать Цикл
			// Объединение ограничено 1 разворотом, чтобы избежать смещения в сетке табличного документа.
			Если Сч = 1 И КоличествоРазворачивать > 1 Тогда
				// Объединяем ячейки с повторяющимися значениями аналитик.
				ЕстьПодчиненныеСтроки = ?(ТипЗнч(СтрокаВерх) = Тип("ДеревоЗначений"), Истина, Ложь);
				бит_Бюджетирование.ПроверитьВыполнитьОбъединениеЯчеек(ТабДок, ДанныеВрем, Имя, "НереальноеЗначение", ЕстьПодчиненныеСтроки, Истина);
			КонецЕсли; 
			Сч = Сч +1;
		КонецЦикла;  // По именам измерений.
	КонецЕсли; 
	
	Возврат ИменаЯчеек;
	
КонецФункции

#КонецОбласти

Функция ТекстЗапросаВременнаяТаблицаДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента", 	 НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаДоИзменения", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""БДДС"" КАК ИмяСписка,
	|	&СинонимБДДС КАК СинонимСписка,
	|	1 КАК НомерТаблицы,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Период КАК Период,
	|	&Сценарий КАК Сценарий,
	|	&Валюта КАК Валюта,
	|	Таблица.ЦФО КАК ЦФО,
	|	Таблица.Организация КАК Организация,
	|	Таблица.СтатьяОборотов КАК СтатьяОборотов,
	|	Таблица.СтатьяОборотов.СтавкаНДС КАК СтавкаНДС,
	|	Таблица.СтатьяОборотов.ЭтоКоэффициент КАК ЭтоКоэффициент,
	|	Таблица.Количество КАК Количество,
	|	Таблица.Сумма КАК Сумма,
	|	0 КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаСценарий,
	|	Таблица.Комментарий КАК Комментарий,
	|	Таблица.Аналитика_1 КАК Аналитика_1,
	|	Таблица.Аналитика_2 КАК Аналитика_2,
	|	Таблица.Аналитика_3 КАК Аналитика_3,
	|	Таблица.Аналитика_4 КАК Аналитика_4,
	|	Таблица.Аналитика_5 КАК Аналитика_5,
	|	Таблица.Аналитика_6 КАК Аналитика_6,
	|	Таблица.Аналитика_7 КАК Аналитика_7,
	|	Таблица.Аналитика_8 КАК Аналитика_8,
	|	Таблица.Аналитика_9 КАК Аналитика_9,
	|	Таблица.Аналитика_10 КАК Аналитика_10,
	|	Таблица.Аналитика_11 КАК Аналитика_11,
	|	Таблица.Аналитика_12 КАК Аналитика_12,
	|	ЗНАЧЕНИЕ(Перечисление.бит_ТипыЗаписейОборотовПоБюджетам.ЗаписьБюджетногоДокумента) КАК ТипЗаписи,
	|	"""" КАК КомментарийРасчета
	|ПОМЕСТИТЬ ВременнаяТаблицаДокумента
	|ИЗ
	|	Документ.бит_АктуализацияБюджета.БДДС КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ЗависимыеОбороты"",
	|	&СинонимЗависимыеОбороты,
	|	2,
	|	Таблица.Ссылка,
	|	Таблица.НомерСтроки,
	|	Таблица.Период,
	|	ВЫБОР
	|		КОГДА Таблица.Сценарий = НЕОПРЕДЕЛЕНО
	|				ИЛИ Таблица.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
	|			ТОГДА &Сценарий
	|		ИНАЧЕ Таблица.Сценарий
	|	КОНЕЦ,
	|	&Валюта,
	|	Таблица.ЦФО,
	|	Таблица.Организация,
	|	Таблица.СтатьяОборотов,
	|	Таблица.СтатьяОборотов.СтавкаНДС,
	|	Таблица.СтатьяОборотов.ЭтоКоэффициент,
	|	Таблица.Количество,
	|	Таблица.Сумма,
	|	0,
	|	0,
	|	0,
	|	Таблица.Комментарий,
	|	Таблица.Аналитика_1,
	|	Таблица.Аналитика_2,
	|	Таблица.Аналитика_3,
	|	Таблица.Аналитика_4,
	|	Таблица.Аналитика_5,
	|	Таблица.Аналитика_6,
	|	Таблица.Аналитика_7,
	|	Таблица.Аналитика_8,
	|	Таблица.Аналитика_9,
	|	Таблица.Аналитика_10,
	|	Таблица.Аналитика_11,
	|	Таблица.Аналитика_12,
	|	ЗНАЧЕНИЕ(Перечисление.бит_ТипыЗаписейОборотовПоБюджетам.ЗависимыйОборот),
	|	Таблица.КомментарийРасчета
	|ИЗ
	|	Документ.бит_АктуализацияБюджета.ЗависимыеОбороты КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ДоИзменения"" КАК ИмяСписка,
	|	&СинонимДоИзменения КАК СинонимСписка,
	|	ТаблицаДанные.Ссылка КАК Ссылка,
	|	ТаблицаДанные.НомерСтроки КАК НомерСтроки,
	|	&Сценарий КАК Сценарий,
	|	&СценарийЭталон КАК СценарийЭталон,
	|	ТаблицаДанные.Валюта КАК Валюта,
	|	ТаблицаДанные.ЦФО КАК ЦФО,
	|	ТаблицаДанные.Организация КАК Организация,
	|	ТаблицаДанные.СтатьяОборотов КАК СтатьяОборотов,
	|	ТаблицаДанные.СтатьяОборотов.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДанные.Период КАК Период,
	|	ТаблицаДанные.Комментарий КАК Комментарий,
	|	ТаблицаДанные.Количество КАК Количество,
	|	ТаблицаДанные.Сумма КАК Сумма,
	|	ТаблицаДанные.СуммаРегл КАК СуммаРегл,
	|	ТаблицаДанные.СуммаУпр КАК СуммаУпр,
	|	ТаблицаДанные.СуммаСценарий КАК СуммаСценарий,
	|	ТаблицаДанные.Аналитика_1 КАК Аналитика_1,
	|	ТаблицаДанные.Аналитика_2 КАК Аналитика_2,
	|	ТаблицаДанные.Аналитика_3 КАК Аналитика_3,
	|	ТаблицаДанные.Аналитика_4 КАК Аналитика_4,
	|	ТаблицаДанные.Аналитика_5 КАК Аналитика_5,
	|	ТаблицаДанные.Аналитика_6 КАК Аналитика_6,
	|	ТаблицаДанные.Аналитика_7 КАК Аналитика_7,
	|	ТаблицаДанные.Аналитика_8 КАК Аналитика_8,
	|	ТаблицаДанные.Аналитика_9 КАК Аналитика_9,
	|	ТаблицаДанные.Аналитика_10 КАК Аналитика_10,
	|	ТаблицаДанные.Аналитика_11 КАК Аналитика_11,
	|	ТаблицаДанные.Аналитика_12 КАК Аналитика_12
	|ПОМЕСТИТЬ ВременнаяТаблицаДоИзменения
	|ИЗ
	|	Документ.бит_АктуализацияБюджета.ДоИзменения КАК ТаблицаДанные
	|ГДЕ
	|	ТаблицаДанные.Ссылка = &Ссылка";


	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаТаблицыВалютногоПерерасчета(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВремТаблицаПериодов",НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПериодов",	НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Сценарии",			НомераТаблиц.Количество());

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДанныеБюджета.Период КАК Период,
	|	ТаблицаДанныеБюджета.Сценарий КАК Сценарий,
	|	ТаблицаДанныеБюджета.Сценарий.ИспользоватьКурсыСценария КАК ИспользоватьКурсыСценария,
	|	ТаблицаДанныеБюджета.Сценарий.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВремТаблицаПериодов
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ТаблицаДанныеБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТаблицаПериодов.Период КАК Период,
	|	ВремТаблицаПериодов.Сценарий КАК Сценарий,
	|	ВремТаблицаПериодов.ИспользоватьКурсыСценария КАК ИспользоватьКурсыСценария
	|ИЗ
	|	ВремТаблицаПериодов КАК ВремТаблицаПериодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремТаблицаПериодов.Сценарий КАК Сценарий,
	|	ВремТаблицаПериодов.Валюта КАК Валюта
	|ИЗ
	|	ВремТаблицаПериодов КАК ВремТаблицаПериодов";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаТаблицаОборотыПоБюджетам(НомераТаблиц, ПриниматьКУчету)
	
	Если НЕ ПриниматьКУчету Тогда
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("ТаблицаОборотыПоБюджетам", НомераТаблиц.Количество());

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДанные.ИмяСписка КАК ИмяСписка,
	|	ТаблицаДанные.СинонимСписка КАК СинонимСписка,
	|	ТаблицаДанные.Ссылка КАК Ссылка,
	|	ТаблицаДанные.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДанные.Период КАК Период,
	|	ТаблицаДанные.Сценарий КАК Сценарий,
	|	ТаблицаДанные.Валюта КАК Валюта,
	|	ТаблицаДанные.ЦФО КАК ЦФО,
	|	ТаблицаДанные.Организация КАК Организация,
	|	ТаблицаДанные.СтатьяОборотов КАК СтатьяОборотов,
	|	ТаблицаДанные.СтатьяОборотов.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДанные.СтатьяОборотов.ЭтоКоэффициент КАК ЭтоКоэффициент,
	|	ТаблицаДанные.Количество КАК Количество,
	|	ТаблицаДанные.Сумма КАК Сумма,
	|	ТаблицаДанные.СуммаРегл КАК СуммаРегл,
	|	ТаблицаДанные.СуммаУпр КАК СуммаУпр,
	|	ТаблицаДанные.СуммаСценарий КАК СуммаСценарий,
	|	ТаблицаДанные.Комментарий КАК Комментарий,
	|	ТаблицаДанные.Аналитика_1 КАК Аналитика_1,
	|	ТаблицаДанные.Аналитика_2 КАК Аналитика_2,
	|	ТаблицаДанные.Аналитика_3 КАК Аналитика_3,
	|	ТаблицаДанные.Аналитика_4 КАК Аналитика_4,
	|	ТаблицаДанные.Аналитика_5 КАК Аналитика_5,
	|	ТаблицаДанные.Аналитика_6 КАК Аналитика_6,
	|	ТаблицаДанные.Аналитика_7 КАК Аналитика_7,
	|	ТаблицаДанные.Аналитика_8 КАК Аналитика_8,
	|	ТаблицаДанные.Аналитика_9 КАК Аналитика_9,
	|	ТаблицаДанные.Аналитика_10 КАК Аналитика_10,
	|	ТаблицаДанные.Аналитика_11 КАК Аналитика_11,
	|	ТаблицаДанные.Аналитика_12 КАК Аналитика_12,
	|	ЕСТЬNULL(АналитикаСценарийЦФО.КлючАналитики, ЗНАЧЕНИЕ(Справочник.бит_КлючиСценарийЦФО.ПустаяСсылка)) КАК КлючСценарийЦФО,
	|	ТаблицаДанные.ТипЗаписи КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.бит_ВидыОборотовОборотыПоБюджетам.Основной) КАК ВидОборота,
	|	ТаблицаДанные.КомментарийРасчета КАК КомментарийРасчета
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ТаблицаДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК АналитикаСценарийЦФО
	|		ПО ТаблицаДанные.ЦФО = АналитикаСценарийЦФО.ЦФО
	|			И ТаблицаДанные.Сценарий = АналитикаСценарийЦФО.Сценарий";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаТаблицаСторноДоИзменения(НомераТаблиц, ПриниматьКУчету, СценарииСовпадают)
	
	Если НЕ ПриниматьКУчету ИЛИ НЕ СценарииСовпадают Тогда
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("ТаблицаСторноДоИзменения", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""ДоИзменения"" КАК ИмяСписка,
	|	&СинонимДоИзменения КАК СинонимСписка,
	|	ТаблицаДанные.Ссылка КАК Ссылка,
	|	ТаблицаДанные.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДанные.Ссылка.Сценарий КАК Сценарий,
	|	ТаблицаДанные.Ссылка.СценарийЭталон КАК СценарийЭталон,
	|	ТаблицаДанные.Валюта КАК Валюта,
	|	ТаблицаДанные.ЦФО КАК ЦФО,
	|	ТаблицаДанные.Организация КАК Организация,
	|	ТаблицаДанные.СтатьяОборотов КАК СтатьяОборотов,
	|	ТаблицаДанные.СтатьяОборотов.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДанные.Период КАК Период,
	|	ТаблицаДанные.Комментарий КАК Комментарий,
	|	-ТаблицаДанные.Количество КАК Количество,
	|	-ТаблицаДанные.Сумма КАК Сумма,
	|	-ТаблицаДанные.СуммаРегл КАК СуммаРегл,
	|	-ТаблицаДанные.СуммаУпр КАК СуммаУпр,
	|	-ТаблицаДанные.СуммаСценарий КАК СуммаСценарий,
	|	ТаблицаДанные.Аналитика_1 КАК Аналитика_1,
	|	ТаблицаДанные.Аналитика_2 КАК Аналитика_2,
	|	ТаблицаДанные.Аналитика_3 КАК Аналитика_3,
	|	ТаблицаДанные.Аналитика_4 КАК Аналитика_4,
	|	ТаблицаДанные.Аналитика_5 КАК Аналитика_5,
	|	ТаблицаДанные.Аналитика_6 КАК Аналитика_6,
	|	ТаблицаДанные.Аналитика_7 КАК Аналитика_7,
	|	ТаблицаДанные.Аналитика_8 КАК Аналитика_8,
	|	ТаблицаДанные.Аналитика_9 КАК Аналитика_9,
	|	ТаблицаДанные.Аналитика_10 КАК Аналитика_10,
	|	ТаблицаДанные.Аналитика_11 КАК Аналитика_11,
	|	ТаблицаДанные.Аналитика_12 КАК Аналитика_12,
	|	ЕСТЬNULL(АналитикаСценарийЦФО.КлючАналитики, ЗНАЧЕНИЕ(Справочник.бит_КлючиСценарийЦФО.ПустаяСсылка)) КАК КлючСценарийЦФО
	|ИЗ
	|	ВременнаяТаблицаДоИзменения КАК ТаблицаДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК АналитикаСценарийЦФО
	|		ПО ТаблицаДанные.ЦФО = АналитикаСценарийЦФО.ЦФО
	|			И ТаблицаДанные.Сценарий = АналитикаСценарийЦФО.Сценарий";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаКонтрольИсполненияБюджета(НомераТаблиц, СценарииСовпадают)
	
	НомераТаблиц.Вставить("ИсполнениеБюджетаРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ИсполнениеБюджета", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.СверхБюджета КАК СверхБюджета,
	|	Реквизиты.КурсДокумента КАК Курс,
	|	Реквизиты.КратностьДокумента КАК Кратность,
	|	Реквизиты.Сценарий.Валюта КАК ВалютаСценария,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.Сценарий КАК СценарийКонтролируемый,
	|	ЗНАЧЕНИЕ(Перечисление.бит_РежимыКонтроляПоБюджету.Бюджет) КАК РежимКонтроля,
	|	ИСТИНА КАК КонтролироватьБюджет,
	|	&НеУчитыватьСверхБюджета КАК НеУчитыватьСверхБюджета,
	|	ЛОЖЬ КАК КонтролироватьВозвратЛимита,
	|	Реквизиты.СписатьЛимиты КАК СписатьЛимиты
	|ИЗ
	|	Документ.бит_АктуализацияБюджета КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.ИмяСписка КАК ИмяСписка,
	|	ТаблицаДокумента.СинонимСписка КАК СинонимСписка,
	|	ТаблицаДокумента.НомерТаблицы КАК НомерТаблицы,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Сценарий КАК Сценарий,
	|	ТаблицаДокумента.Валюта КАК Валюта,
	|	ТаблицаДокумента.ЦФО КАК ЦФО,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.СтатьяОборотов КАК СтатьяОборотов,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	НЕ ТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Сумма КАК КонтролироватьСумму,
	|	НЕ ТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Количество КАК КонтролироватьКоличество,
	|	НЕ ТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Бюджеты КАК КонтролироватьПоСтатье,
	|	ТаблицаДокумента.Аналитика_1 КАК Аналитика_1,
	|	ТаблицаДокумента.Аналитика_2 КАК Аналитика_2,
	|	ТаблицаДокумента.Аналитика_3 КАК Аналитика_3,
	|	ТаблицаДокумента.Аналитика_4 КАК Аналитика_4,
	|	ТаблицаДокумента.Аналитика_5 КАК Аналитика_5,
	|	ТаблицаДокумента.Аналитика_6 КАК Аналитика_6,
	|	ТаблицаДокумента.Аналитика_7 КАК Аналитика_7,
	|	ТаблицаДокумента.Аналитика_8 КАК Аналитика_8,
	|	ТаблицаДокумента.Аналитика_9 КАК Аналитика_9,
	|	ТаблицаДокумента.Аналитика_10 КАК Аналитика_10,
	|	ТаблицаДокумента.Аналитика_11 КАК Аналитика_11,
	|	ТаблицаДокумента.Аналитика_12 КАК Аналитика_12
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкаКонтроляПоСценариям КАК НастройкаКонтроляПоСценариям
	|		ПО (НастройкаКонтроляПоСценариям.Сценарий = &Сценарий)
	|			И ТаблицаДокумента.Период >= НастройкаКонтроляПоСценариям.Период
	|			И (ТаблицаДокумента.Период <= НастройкаКонтроляПоСценариям.ДатаОкончания
	|				ИЛИ НастройкаКонтроляПоСценариям.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТаблицы,
	|	НомерСтроки";
	
	Если СценарииСовпадают Тогда
		
		НомераТаблиц.Вставить("ВозвратЛимита", НомераТаблиц.Количество());
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ
		|	ТаблицаДокумента.ИмяСписка КАК ИмяСписка,
		|	ТаблицаДокумента.СинонимСписка КАК СинонимСписка,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Период КАК Период,
		|	ТаблицаДокумента.Сценарий КАК Сценарий,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.ЦФО КАК ЦФО,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.СтатьяОборотов КАК СтатьяОборотов,
		|	ТаблицаДокумента.Количество КАК Количество,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	НЕ ТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Сумма КАК КонтролироватьСумму,
		|	НЕ ТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Количество КАК КонтролироватьКоличество,
		|	НЕ ТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Бюджеты КАК КонтролироватьПоСтатье,
		|	ТаблицаДокумента.Аналитика_1 КАК Аналитика_1,
		|	ТаблицаДокумента.Аналитика_2 КАК Аналитика_2,
		|	ТаблицаДокумента.Аналитика_3 КАК Аналитика_3,
		|	ТаблицаДокумента.Аналитика_4 КАК Аналитика_4,
		|	ТаблицаДокумента.Аналитика_5 КАК Аналитика_5,
		|	ТаблицаДокумента.Аналитика_6 КАК Аналитика_6,
		|	ТаблицаДокумента.Аналитика_7 КАК Аналитика_7,
		|	ТаблицаДокумента.Аналитика_8 КАК Аналитика_8,
		|	ТаблицаДокумента.Аналитика_9 КАК Аналитика_9,
		|	ТаблицаДокумента.Аналитика_10 КАК Аналитика_10,
		|	ТаблицаДокумента.Аналитика_11 КАК Аналитика_11,
		|	ТаблицаДокумента.Аналитика_12 КАК Аналитика_12
		|ИЗ
		|	ВременнаяТаблицаДоИзменения КАК ТаблицаДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкаКонтроляПоСценариям КАК НастройкаКонтроляПоСценариям
		|		ПО (НастройкаКонтроляПоСценариям.Сценарий = &Сценарий)
		|			И ТаблицаДокумента.Период >= НастройкаКонтроляПоСценариям.Период
		|			И (ТаблицаДокумента.Период <= НастройкаКонтроляПоСценариям.ДатаОкончания
		|				ИЛИ НастройкаКонтроляПоСценариям.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Процедура ПодготовитьТаблицуИсполнениеБюджетаРасчетыВВалюте(ИсполнениеБюджета, ИсполнениеБюджетаРеквизиты)

	Если НЕ ЗначениеЗаполнено(ИсполнениеБюджета) ИЛИ НЕ ЗначениеЗаполнено(ИсполнениеБюджетаРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = ИсполнениеБюджетаРеквизиты[0];
	
	КурсВалютыДокумента = Новый Структура;
	КурсВалютыДокумента.Вставить("Валюта", 	  Реквизиты.Валюта);
	КурсВалютыДокумента.Вставить("Курс", 	  Реквизиты.Курс);
	КурсВалютыДокумента.Вставить("Кратность", Реквизиты.Кратность);
	
	КурсВалютыСценария = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Реквизиты.ВалютаСценария, Реквизиты.Дата);
	
	Для каждого СтрокаТаблицы Из ИсполнениеБюджета Цикл
		СтрокаТаблицы.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
								СтрокаТаблицы.Сумма, КурсВалютыДокумента, КурсВалютыСценария);
	КонецЦикла;																	

КонецПроцедуры
 
Процедура ПодготовитьТаблицыДокументаРасчетыВВалюте(ПараметрыПроведения, Реквизиты)

	Если ПараметрыПроведения.ТаблицаОборотыПоБюджетам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Сценарии		  = ПараметрыПроведения.Сценарии;
	ТаблицаПериодов	  = ПараметрыПроведения.ТаблицаПериодов;
	ОборотыПоБюджетам = ПараметрыПроведения.ТаблицаОборотыПоБюджетам;
	КурсыПоПериодам	  = Неопределено;
	
	Если ТаблицаПериодов.Количество() >= 1000 Тогда
		ТаблицаПериодов.Индексы.Добавить("Сценарий");
	КонецЕсли; 
	
	Если ОборотыПоБюджетам.Количество() >= 1000 Тогда
		ОборотыПоБюджетам.Индексы.Добавить("Сценарий");
	КонецЕсли;

	Если Реквизиты.ИспользоватьКурсыСценария Тогда
		Для каждого СтрокаТаблицы Из Сценарии Цикл
			
			Отбор	= Новый Структура("Сценарий", СтрокаТаблицы.Сценарий);
			Периоды = ТаблицаПериодов.Скопировать(Отбор);
			Валюты  =  бит_Бюджетирование.ЗаполнитьСтруктуруПараметровПолученияКурсовПоПериодам(СтрокаТаблицы.Сценарий, Реквизиты.ВалютаДокумента);
		
			КурсыПоПериодам = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(Периоды, Валюты, СтрокаТаблицы.Сценарий);
			
			НайденныеСтроки = ОборотыПоБюджетам.НайтиСтроки(Отбор);
			бит_Бюджетирование.ВыполнитьПересчетыВТаблицеОборотов(НайденныеСтроки, 
								КурсыПоПериодам, Реквизиты.КурсыВалют);

		КонецЦикла; 
	Иначе
		
		бит_Бюджетирование.ВыполнитьПересчетыВТаблицеОборотов(ОборотыПоБюджетам, 
								Неопределено, Реквизиты.КурсыВалют);
	КонецЕсли;
							
КонецПроцедуры

Процедура ИнициализироватьКлючиАналитик(Реквизиты)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Реквизиты.Регистратор);
	Запрос.УстановитьПараметр("Сценарий", 	 Реквизиты.Сценарий);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеБюджета.ЦФО КАК ЦФО,
	|	&Сценарий КАК Сценарий
	|ПОМЕСТИТЬ ДанныеБюджета
	|ИЗ
	|	Документ.бит_АктуализацияБюджета.БДДС КАК ДанныеБюджета
	|ГДЕ
	|	ДанныеБюджета.Ссылка = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗависимыеОбороты.ЦФО,
	|	&Сценарий
	|ИЗ
	|	Документ.бит_АктуализацияБюджета.ЗависимыеОбороты КАК ЗависимыеОбороты
	|ГДЕ
	|	ЗависимыеОбороты.Ссылка = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоИзменения.ЦФО,
	|	&Сценарий
	|ИЗ
	|	Документ.бит_АктуализацияБюджета.ДоИзменения КАК ДоИзменения
	|ГДЕ
	|	ДоИзменения.Ссылка = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеБюджета.Сценарий КАК Сценарий,
	|	ДанныеБюджета.ЦФО КАК ЦФО
	|ПОМЕСТИТЬ УникальныеДанныеБюджета
	|ИЗ
	|	ДанныеБюджета КАК ДанныеБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УникальныеДанныеБюджета.Сценарий КАК Сценарий,
	|	УникальныеДанныеБюджета.ЦФО КАК ЦФО,
	|	АналитикаСценарийЦФО.КлючАналитики КАК КлючАналитики
	|ИЗ
	|	УникальныеДанныеБюджета КАК УникальныеДанныеБюджета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК АналитикаСценарийЦФО
	|		ПО УникальныеДанныеБюджета.Сценарий = АналитикаСценарийЦФО.Сценарий
	|			И УникальныеДанныеБюджета.ЦФО = АналитикаСценарийЦФО.ЦФО
	|ГДЕ
	|	АналитикаСценарийЦФО.КлючАналитики ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Справочники.бит_КлючиСценарийЦФО.КлючиСценарийЦФОДокумента(Выборка);
	КонецЦикла;

КонецПроцедуры

Функция НовыеПараметрыШапки()
	
	ПараметрыШапки = Новый Структура;
	ПараметрыШапки.Вставить("Периодичность");
	ПараметрыШапки.Вставить("ПродолжительностьИнтервала");
	ПараметрыШапки.Вставить("ДатаНачалаПланирования");
	ПараметрыШапки.Вставить("ДатаОкончанияПланирования");
	ПараметрыШапки.Вставить("ДатаАктуализации");
	
	Возврат ПараметрыШапки;
	
КонецФункции

Функция ДанныеДляАктуализации(ПараметрыАктуализации)

	ДанныеДокумента		 	  = ПараметрыАктуализации.БДДС;
	НачалоПериода 		 	  = ПараметрыАктуализации.ДатаНачалаПланирования;
	КонецПериода		 	  = ПараметрыАктуализации.ДатаОкончанияПланирования;
	Периодичность			  = ПараметрыАктуализации.Периодичность;
	КоличествоИнтервалов 	  = ПараметрыАктуализации.ПродолжительностьИнтервала;
	ДатаАктуализации	 	  = ПараметрыАктуализации.ДатаАктуализации;
	ПропускатьФактБольшеПлана = ПараметрыАктуализации.НеАктуализироватьФактБольшеПлана;;
	АктуализироватьПо		  = ПараметрыАктуализации.АктуализироватьПо;
	ОсновноеИзмерение  		  = ПараметрыАктуализации.Настройки.ИмяРазворачивать;
	ИсключитьПериодыБезПлана  = ПараметрыАктуализации.ИсключитьПериодыБезПлана;
	СпособАктуализации		  = ПараметрыАктуализации.СпособАктуализации;
	
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		КонецПериода = КонецПериода;
	Иначе	
		КонецПериода = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(НачалоПериода,
							КоличествоИнтервалов - 1, Периодичность);
	КонецЕсли;
		
	Периоды = СеткаПериодов(НачалоПериода, КонецПериода, ДатаАктуализации, Периодичность);	
				
	ДанныеДляАктуализации = Новый Структура;
	ДанныеДляАктуализации.Вставить("Данные",  ДанныеДокумента);
	ДанныеДляАктуализации.Вставить("Периоды", Периоды);
	
	Возврат ДанныеДляАктуализации;
	
КонецФункции

// Функция формирует таблицу с сеткой дат по периоду актуализации данных.
//
// Параметры:
//  НачалоПериода	 - Дата	 - начало периода.
//  КонецПериода	 - Дата	 - конец периода.
//  Периодичность	 - ПеречислениеСсылка.бит_ПериодичностьПланирования	 - перидичность планирования.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с одной колонкой "Период". Содежит список периодов в диапазоне актуализации данных.
//
Функция СеткаПериодов(НачалоПериода, КонецПериода, ДатаАктуализации, Периодичность)

	СеткаПериодов = Новый ТаблицаЗначений;
	СеткаПериодов.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	СеткаПериодов.Колонки.Добавить("Сумма",  ОбщегоНазначения.ОписаниеТипаСтрока(50));
	СеткаПериодов.Колонки.Добавить("СуммаФакт",  ОбщегоНазначения.ОписаниеТипаСтрока(50));
	СеткаПериодов.Колонки.Добавить("Количество",  ОбщегоНазначения.ОписаниеТипаСтрока(50));
	СеткаПериодов.Колонки.Добавить("КоличествоФакт",  ОбщегоНазначения.ОписаниеТипаСтрока(50));
	СеткаПериодов.Колонки.Добавить("БудущийПериод",  Новый ОписаниеТипов("Булево"));
	
	ТекущаяДата = ДатаАктуализации;
	Сч = 1;
	Пока ТекущаяДата <= КонецПериода Цикл
		НоваяСтрока = СеткаПериодов.Добавить();
		НоваяСтрока.Период 		   = ТекущаяДата;
		НоваяСтрока.Сумма 		   = "Сумма" + Формат(Сч, "ЧГ=");
		НоваяСтрока.СуммаФакт 	   = "СуммаФакт" + Формат(Сч, "ЧГ=");
		НоваяСтрока.Количество 	   = "Количество" + Формат(Сч, "ЧГ=");
		НоваяСтрока.КоличествоФакт = "КоличествоФакт" + Формат(Сч, "ЧГ=");
		НоваяСтрока.БудущийПериод  = (ТекущаяДата >= ДатаАктуализации);
		ТекущаяДата = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ТекущаяДата, 1, Периодичность);
		Сч = Сч + 1;
	КонецЦикла;
	
    Возврат СеткаПериодов;
	
КонецФункции

Функция ПредставлениеВидаУчета(ИмяРесурса)

	ВидУчета = ?(ИмяРесурса = "Сумма", НСтр("ru = 'суммовом'"), НСтр("ru = 'количественном'"));
	Возврат ВидУчета;
	
КонецФункции

Функция НоваяСтрокаДетали(Детали, Периоды, ДанныеЗаполнения)

	НоваяСтрока = Детали.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Детали.Родитель);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеЗаполнения.АналитикиДляПодстановки);
	
	НоваяСтрока.ИД 		  = Строка(Новый УникальныйИдентификатор);
	НоваяСтрока.Измерение = НоваяСтрока[ДанныеЗаполнения.ОсновноеИзмерение];
	НоваяСтрока.Период	  = ДанныеЗаполнения.Период;
	
	Для каждого ТекущийПериод Из Периоды Цикл
		НоваяСтрока[ТекущийПериод.Сумма] 	  = 0;
		НоваяСтрока[ТекущийПериод.Количество] = 0;
		НоваяСтрока[ТекущийПериод.СуммаФакт] 	  = 0;
		НоваяСтрока[ТекущийПериод.КоличествоФакт] = 0;
	КонецЦикла;

	НоваяСтрока.Сумма 	   	   = 0;
	НоваяСтрока.Количество 	   = 0;
	НоваяСтрока.СуммаФакт	   = 0;
	НоваяСтрока.КоличествоФакт = 0;
	НоваяСтрока.НомерСтроки    = 0;
	
	Возврат НоваяСтрока;
	
КонецФункции 

Функция РаспределитьСуммуПропорциональноКоэффициентам(РаспределяемаяСумма, Коэффициенты, Точность = 2)

	Результат = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
							РаспределяемаяСумма, Коэффициенты, Точность);
							
	Если Результат = Неопределено Тогда
		Результат = Новый Массив;
		Индекс = Коэффициенты.ВГраница();
		Пока Индекс >= 0 Цикл
			Результат.Добавить(0);	
			Индекс = Индекс - 1;
		КонецЦикла;
	КонецЕсли;						

	Возврат Результат;
	
КонецФункции

Процедура ОбработатьРаспределениеФакта(КоллекцияСтрок, ИмяРесурса, ПараметрыРаспределения)
		
	СпособАктуализации		  = ПараметрыРаспределения.СпособАктуализации;
	ДатаАктуализации  		  = ПараметрыРаспределения.ДатаАктуализации;
	ПропускатьФактБольшеПлана = ПараметрыРаспределения.ПропускатьФактБольшеПлана;
	БазаПрофиля				  = ПараметрыРаспределения.БазаПрофиля;
	ИзмеренияАктуализации	  = ПараметрыРаспределения.ИзмеренияАктуализации;
	ИсключитьПериодыБезПлана  = ПараметрыРаспределения.ИсключитьПериодыБезПлана;
	ОсновноеИзмерение		  = ПараметрыРаспределения.ОсновноеИзмерение;
	БудущиеПериоды			  = ПараметрыРаспределения.БудущиеПериоды;
	АналитикиДляПодстановки	  = ПараметрыРаспределения.АналитикиДляПодстановки;
	
	РесурсБазаРаспределения = ИмяРесурса + "БазаРаспределения";
	РесурсОтлонение			= ИмяРесурса + "Отклонение";
	РесурсФакт				= ИмяРесурса + "Факт";
	РесурсОстатокПлан		= ИмяРесурса + "ОстатокПлан";			
	
	СуммаИБазаРаспределения = СуммаИБазаРаспределения(КоллекцияСтрок, ИмяРесурса, ПараметрыРаспределения);
	Если СуммаИБазаРаспределения.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДетальныеЗаписи = КоллекцияСтрок.Строки;
	Для каждого СтрокаДетали Из ДетальныеЗаписи Цикл
		Если СтрокаДетали[РесурсОтлонение] <> 0 Тогда
			СтрокаДетали[ИмяРесурса] = СтрокаДетали[РесурсФакт];
		КонецЕсли;
	КонецЦикла;

	КоэффициентыГруппировки = СуммаИБазаРаспределения.Коэффициенты;
	МожноРаспределить	    = СуммаИБазаРаспределения.МожноРаспределить;
	Результат				= СуммаИБазаРаспределения.Результат;
	
	ТочностьОкругления = ?(ИмяРесурса = "Сумма", 2, 3);
							
	ИндексБудущийПериод = 0;					
	Для каждого БудущийПериод Из БудущиеПериоды Цикл
		
		КоэффициентыПериода			= Новый Массив;
		ДетальныеЗаписиДляИзменения = Новый Массив;
		
		// Сумма по детальным записям всегда распределяется пропорционально.
		ДобавитьСтроку = Истина;
		Для каждого СтрокаДетали Из ДетальныеЗаписи Цикл
			Если СтрокаДетали.Период > БудущийПериод.Период Тогда
				// Детальные записи отсортированны по периоду на стороне СКД.
				Прервать;
			ИначеЕсли СтрокаДетали.Период <> БудущийПериод.Период Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавитьСтроку = Ложь;
			ТекущаяСтрока  = СтрокаДетали; 
			Если ТекущаяСтрока[БудущийПериод[ИмяРесурса]] = 0 Тогда
				Коэффициент = 0;
			Иначе	
				Коэффициент = ТекущаяСтрока[БудущийПериод[ИмяРесурса]];
			КонецЕсли;	
			ДетальныеЗаписиДляИзменения.Добавить(ТекущаяСтрока);
			КоэффициентыПериода.Добавить(Коэффициент);
		КонецЦикла;
		
		Если ДобавитьСтроку Тогда
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("ОсновноеИзмерение", 		 ОсновноеИзмерение);
			ДанныеЗаполнения.Вставить("Период", 		   		 БудущийПериод.Период);
			ДанныеЗаполнения.Вставить("АналитикиДляПодстановки", АналитикиДляПодстановки);
			
			ТекущаяСтрока = НоваяСтрокаДетали(ДетальныеЗаписи, БудущиеПериоды, ДанныеЗаполнения);
			Если ТекущаяСтрока[БудущийПериод[ИмяРесурса]] = 0 Тогда
				Коэффициент = ?(ИсключитьПериодыБезПлана, 0, 1);
			Иначе	
				Коэффициент = ТекущаяСтрока[БудущийПериод[ИмяРесурса]];
			КонецЕсли;
			ДетальныеЗаписиДляИзменения.Добавить(ТекущаяСтрока);
			КоэффициентыПериода.Добавить(Коэффициент);
		КонецЕсли;			
			
		РаспределяемаяСумма = Результат[ИндексБудущийПериод];
		РезультатДетали		= РаспределитьСуммуПропорциональноКоэффициентам(
								РаспределяемаяСумма, КоэффициентыПериода, ТочностьОкругления);
				
		ИндексДетальныеЗаписи = 0;					
		Для каждого СтрокаДетали Из ДетальныеЗаписиДляИзменения Цикл
			СуммаДетали = РезультатДетали[ИндексДетальныеЗаписи];
			
			СтрокаДетали[БудущийПериод[ИмяРесурса]] = СтрокаДетали[БудущийПериод[ИмяРесурса]] + СуммаДетали;
			СтрокаДетали[ИмяРесурса + "Обработано"] = Истина;
			СтрокаДетали[ИмяРесурса] 				= 0;
			ИндексДетальныеЗаписи = ИндексДетальныеЗаписи + 1;
		КонецЦикла;	
		ИндексБудущийПериод = ИндексБудущийПериод + 1;
	КонецЦикла;
			
КонецПроцедуры

Функция СуммаИБазаРаспределения(КоллекцияСтрок, ИмяРесурса, ПараметрыРаспределения)

	БудущиеПериоды 			  = ПараметрыРаспределения.БудущиеПериоды;
	СпособАктуализации 		  = ПараметрыРаспределения.СпособАктуализации;
	ИсключитьПериодыБезПлана  = ПараметрыРаспределения.ИсключитьПериодыБезПлана;
	БазаПрофиля				  = ПараметрыРаспределения.БазаПрофиля;
	ОсновноеИзмерение		  = ПараметрыРаспределения.ОсновноеИзмерение;
	ИзмеренияАктуализации	  = ПараметрыРаспределения.ИзмеренияАктуализации;
	ПропускатьФактБольшеПлана = ПараметрыРаспределения.ПропускатьФактБольшеПлана;
	
	РесурсБазаРаспределения = ИмяРесурса + "БазаРаспределения";
	РесурсОтлонение			= ИмяРесурса + "Отклонение";
	РесурсФакт				= ИмяРесурса + "Факт";
	РесурсОстатокПлан		= ИмяРесурса + "ОстатокПлан";		
	
	Отклонение	  	  = КоллекцияСтрок[РесурсОтлонение];
	Запланировано	  = КоллекцияСтрок[РесурсОстатокПлан];
	БазаРаспределения = КоллекцияСтрок[РесурсБазаРаспределения];
	План			  = КоллекцияСтрок[ИмяРесурса];
	Факт			  = КоллекцияСтрок[РесурсФакт];
	
	ПланПрошлогоПериода = БазаРаспределения - Запланировано;
	НетДанных			= (ПланПрошлогоПериода = 0 И Факт = 0);
	Отказ = Ложь;
	
	Если НетДанных Тогда
		// Нет данных - распределять нечего.
		Отказ = Истина;			
	КонецЕсли;

	СуммаИБазаРаспределения = Новый Структура;
	СуммаИБазаРаспределения.Вставить("Коэффициенты", 	  Новый Массив);
	СуммаИБазаРаспределения.Вставить("МожноРаспределить", 0);
	СуммаИБазаРаспределения.Вставить("Отказ",			  Истина);
	СуммаИБазаРаспределения.Вставить("Результат",		  Новый Массив);
	
	ФактБольшеПлана = ((План - Запланировано) < Факт);
	Если ФактБольшеПлана И ПропускатьФактБольшеПлана Тогда
		Отказ = Истина;	
	КонецЕсли;

	Если Отказ Тогда
		Возврат СуммаИБазаРаспределения;
	КонецЕсли;	
	
	ЧастиИзмерений = Новый Массив;
	Для каждого КлючЗначение Из ИзмеренияАктуализации Цикл
		Если ЗначениеЗаполнено(КоллекцияСтрок[КлючЗначение.Ключ]) Тогда
			ПредставлениеЗначения = Строка(КоллекцияСтрок[КлючЗначение.Ключ]);
		Иначе	
			ПредставлениеЗначения = НСтр("ru = '<не заполнено>'");
		КонецЕсли;
		ОписаниеИзмерения = СтрШаблон("""%1"" (%2)", ПредставлениеЗначения, Строка(КлючЗначение.Значение));
		ЧастиИзмерений.Добавить(ОписаниеИзмерения);
	КонецЦикла;
	
	// Проверка, что отрицательное отлонение (по модолю) меньше или равно остатку плана.
	Если Отклонение < 0 И Запланировано < - Отклонение Тогда
		
		ЧастиИзмерений = Новый Массив;
		Для каждого КлючЗначение Из ИзмеренияАктуализации Цикл
			ОписаниеИзмерения = СтрШаблон("""%1"" (%2)", КоллекцияСтрок[КлючЗначение.Ключ], Строка(КлючЗначение.Значение));
			ЧастиИзмерений.Добавить(ОписаниеИзмерения);
		КонецЦикла;

		ВидУчета		 = ПредставлениеВидаУчета(ИмяРесурса);
		ЗапланированоСтр = ?(ИмяРесурса = "Сумма", Формат(Запланировано, "ЧДЦ=2; ЧН="), Формат(Запланировано, "ЧДЦ=3; ЧН=")); 
		ОтклонениеСтр	 = ?(ИмяРесурса = "Сумма", Формат(Отклонение, "ЧДЦ=2; ЧН="), Формат(Отклонение, "ЧДЦ=3; ЧН=")); 
		
		ТекстСообщения = НСтр("ru = 'Актуализировать %1 невозможно по причине: остаток запланированных средств в %2 выражении меньше отклонения. Остаток плана: %3, отклонение %4.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, СтрСоединить(ЧастиИзмерений, ", "), ВидУчета,  
							ЗапланированоСтр, ОтклонениеСтр);

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;

	Если Отказ Тогда
		Возврат СуммаИБазаРаспределения;
	КонецЕсли;
	
	Коэффициенты 	  = Новый Массив;
	ИтогоКоэффициенты = 0;
	СчетчикПериодов   = 1;

	Для каждого БудущийПериод Из БудущиеПериоды Цикл
		Если СпособАктуализации = Перечисления.бит_СпособыАктуализации.Пропорционально Тогда 
			Коэффициент = КоллекцияСтрок[БудущийПериод[ИмяРесурса]];
		ИначеЕсли СпособАктуализации = Перечисления.бит_СпособыАктуализации.Равномерно Тогда	
			Если ИсключитьПериодыБезПлана И КоллекцияСтрок[БудущийПериод[ИмяРесурса]] = 0 Тогда
				Коэффициент = 0;
			Иначе	
				Коэффициент = 1;
			КонецЕсли;
		ИначеЕсли СпособАктуализации = Перечисления.бит_СпособыАктуализации.ПоПрофилю Тогда
			Коэффициент		  = 0;
			Если БазаПрофиля.Получить(СчетчикПериодов) <> Неопределено Тогда
				Коэффициент = БазаПрофиля.Получить(СчетчикПериодов);
				Если ИсключитьПериодыБезПлана И КоллекцияСтрок[БудущийПериод[ИмяРесурса]] = 0 Тогда
					Коэффициент = 0;
				КонецЕсли;
			КонецЕсли;
			СчетчикПериодов = СчетчикПериодов + 1; 
		КонецЕсли;
		ИтогоКоэффициенты = ИтогоКоэффициенты + Коэффициент;
		Коэффициенты.Добавить(Коэффициент);
	КонецЦикла;
	
	// Проверка, что итогова сумма коэффицентов по профилю равна 1.
	Если СпособАктуализации = Перечисления.бит_СпособыАктуализации.ПоПрофилю И ИтогоКоэффициенты <> 1 Тогда
		
		ИтогоКоэффициенты = 0;
		ВидУчета		  = ПредставлениеВидаУчета(ИмяРесурса);
		
		ТекстСообщения = НСтр("ru = 'Актуализировать %1 невозможно по причине: в периодах, попадающих в профиль распределения, нет запланированных средств в %2 выражении.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, СтрСоединить(ЧастиИзмерений, ", "), ВидУчета);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;	

	Если Отказ Тогда
		Возврат СуммаИБазаРаспределения;
	КонецЕсли;
	
	// Проверка, что есть база распределения.
	Если ИтогоКоэффициенты = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Актуализировать %1 невозможно по причине: коэффициенты базы распределения нулевые.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, СтрСоединить(ЧастиИзмерений, ", "));	
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат СуммаИБазаРаспределения;
	КонецЕсли;
	
	МожноРаспределить  = Отклонение;
	ТочностьОкругления = ?(ИмяРесурса = "Сумма", 2, 3);
	Результат		   = РаспределитьСуммуПропорциональноКоэффициентам(
							МожноРаспределить, Коэффициенты, ТочностьОкругления);
							
	// Проверка, что результат распределения отрицательного отклонения не будет превышать остаток ресурса в периоде.
	Если Отклонение < 0 Тогда
		ИндексПериода = 0;
		Для каждого БудущийПериод Из БудущиеПериоды Цикл
			ВеличинаОтклонения = - Результат[ИндексПериода]; 
			ПланПериода		   = КоллекцияСтрок[БудущийПериод[ИмяРесурса]];
			Если ВеличинаОтклонения > ПланПериода Тогда
				
				ВидУчета		 = ПредставлениеВидаУчета(ИмяРесурса);
				ЗапланированоСтр = ?(ИмяРесурса = "Сумма", Формат(ПланПериода, "ЧДЦ=2; ЧН="), Формат(ПланПериода, "ЧДЦ=3; ЧН=")); 
				ОтклонениеСтр	 = ?(ИмяРесурса = "Сумма", Формат(ВеличинаОтклонения, "ЧДЦ=2; ЧН="), Формат(ВеличинаОтклонения, "ЧДЦ=3; ЧН=")); 
				ПериодСтр 		 = Формат(БудущийПериод.Период, "ДЛФ=D");
				
				ТекстСообщения = НСтр("ru = 'Актуализировать %1 невозможно по причине: в периоде %2 остаток запланированных средств в %3 выражении меньше отклонения. Остаток плана: %4, отклонение %5.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрСоединить(ЧастиИзмерений, ", "), ПериодСтр, ВидУчета, ЗапланированоСтр, ОтклонениеСтр);	
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);			
			КонецЕсли;
			ИндексПериода = ИндексПериода + 1;
		КонецЦикла;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат СуммаИБазаРаспределения;	
	КонецЕсли;
	
	СуммаИБазаРаспределения.Коэффициенты 	  = Коэффициенты;
	СуммаИБазаРаспределения.МожноРаспределить = МожноРаспределить;
	СуммаИБазаРаспределения.Отказ  			  = Отказ;
	СуммаИБазаРаспределения.Результат  		  = Результат;
	
	Возврат СуммаИБазаРаспределения;

КонецФункции

#КонецОбласти

#КонецЕсли
