#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет наборы значений доступа.
// Параметры:
//  Таблица - ТаблицаЗначений - передает в этот параметр подготовленные наборы значений
//            доступа. Описание колонок см. в функции УправлениеДоступом.ТаблицаНаборыЗначенийДоступа.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
		ЦФО, СтатьяОборотов);
	ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	ДобавитьСтрокуВНаборЗначенийДоступа(Организация, Таблица);
	ДобавитьСтрокуВНаборЗначенийДоступа(Ответственный, Таблица);
	
	// Таблица "БДДС"
	Для каждого СтрокаТаблицы Из БДДС Цикл
		КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
			СтрокаТаблицы.ЦФО, СтрокаТаблицы.СтатьяОборотов);
		ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
		ДобавитьСтрокуВНаборЗначенийДоступа(СтрокаТаблицы.Организация, Таблица);
	КонецЦикла; 
			
	// Удалим дубли
	ПоляГруппировки = "";
	Для каждого Колонка Из Таблица.Колонки Цикл
		ПоляГруппировки = "," + Колонка.Имя + ПоляГруппировки;
	КонецЦикла; 
	
	ПоляГруппировки = Сред(ПоляГруппировки, 2);
	Таблица.Свернуть(ПоляГруппировки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли; 
	
	// СтандартныеПодсистемы.Обновление версии ИБ.
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Обновление версии ИБ.

	НаименованиеТаблицы = НСтр("ru = 'БДДС'; en = 'БДДС'"); 
	Если бит_УправлениеДоступомБФСлужебный.ДоступЗапрещен(БДДС, НаименованиеТаблицы, Истина) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	ДополнительныеСвойства.Вставить("ПроводитьПослеУтверждения", бит_ВизированиеСервер.ПриниматьКУчетуПослеУтверждения(
		Метаданные.Документы.бит_АктуализацияБюджета.ПолноеИмя()));
	
	Если СценарийЭталон <> Сценарий Тогда
		СторнироватьЗависимыеОбороты = Ложь;
	Иначе 
		Если РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.НеФормировать Тогда
			СторнироватьЗависимыеОбороты = Ложь;
		КонецЕсли;
	КонецЕсли; 
	
	// Очистка неиспользуемых разрезов бюджетирования по статье оборотов.
	бит_Бюджетирование.ОчиститьНеИспользуемыеАналитикиСтатейОборотов(БДДС);
	бит_ОбщегоНазначения.ЗаполнитьАналитикуВШапкеДокумента(ЭтотОбъект, БДДС, Отказ);
	Если ЭтоНовый()
		ИЛИ (РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения 
		И ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления")) Тогда
		ЗаполнитьЗависимыеОбороты();
	КонецЕсли;
					
	Если НЕ АктуализацияВыполнена И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		РежимЗаписи    = ?(Проведен, РежимЗаписиДокумента.ОтменаПроведения, РежимЗаписиДокумента.Запись);
		ТекстСообщения =
			НСтр("ru = 'Проведение документа возможно только после установки флага ""Актуализация выполнена"". Документ записан без движений'; 
			|en = 'The document can only be processed after setting the ""Update Executed"" flag. The document is written without movement'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "АктуализацияВыполнена", "Объект", Ложь);
	КонецЕсли;
	
	Если ДополнительныеСвойства.ПроводитьПослеУтверждения Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ОтправленНаСогласование = Истина;
		Иначе
			ОтправленНаСогласование = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() Тогда
		Если ДополнительныеСвойства.ПроводитьПослеУтверждения Тогда
			// Если документ был проведен в системе ранее, без отправки на согласование,
			// при повторном проведении его движения стирать нельзя.
			Если НЕ Проведен ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				РежимПринятияКУчету = 1;
			КонецЕсли;
		Иначе
			РежимПринятияКУчету = 0;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("ЦФО",		   ЦФО);
	ПараметрыНастройки.Вставить("Организация", Организация);
	
	ОтражатьСверхБюджета = НЕ бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету(
									ПараметрыНастройки, Дата);
									
	Если ОтражатьСверхБюджета ИЛИ НЕ СверхБюджета Тогда
		СписатьЛимиты = Ложь;	
	КонецЕсли;		

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступаПриЗаписи(ЭтотОбъект, Отказ);
    ДополнительныеСвойства.Вставить("НаборыЗначенийДоступаЗаписаны", Истина);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект, Ложь);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.бит_АктуализацияБюджета.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ТаблицаИсполнениеБюджета = бит_КонтрольИсполненияБюджета.ПодготовитьТаблицуВозвратЛимита(
									ПараметрыПроведения.ВозвратЛимита,
									ПараметрыПроведения.ИсполнениеБюджетаРеквизиты,
									Отказ);
	
	бит_КонтрольИсполненияБюджета.СформироватьДвиженияКонтрольныеЗначенияБюджетов(ТаблицаИсполнениеБюджета, Движения);
	Движения.бит_КонтрольныеЗначенияБюджетов.Записать();
	
	ТаблицаИсполнениеБюджета = бит_КонтрольИсполненияБюджета.ПодготовитьТаблицуИсполнениеБюджета(
									ПараметрыПроведения.ИсполнениеБюджета,
									ПараметрыПроведения.ИсполнениеБюджетаРеквизиты,
									Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	бит_КонтрольИсполненияБюджета.СформироватьДвиженияКонтрольныеЗначенияБюджетов(ТаблицаИсполнениеБюджета, Движения);
	
	Документы.бит_АктуализацияБюджета.СформироватьДвиженияОборотыПоБюджетам(
		ПараметрыПроведения.ТаблицаОборотыПоБюджетам, ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	Документы.бит_АктуализацияБюджета.СформироватьДвиженияОборотыПоБюджетам(
		ПараметрыПроведения.ТаблицаСторноДоИзменения, ПараметрыПроведения.Реквизиты, Движения, Отказ);

	Документы.бит_АктуализацияБюджета.СформироватьДвиженияБюджетирование(
		ПараметрыПроведения.ТаблицаОборотыПоБюджетам, ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	Документы.бит_АктуализацияБюджета.СформироватьДвиженияБюджетирование(
		ПараметрыПроведения.ТаблицаСторноДоИзменения, ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ); 

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	Если СпособАктуализации = Перечисления.бит_СпособыАктуализации.ПоПрофилю Тогда
		ПроверяемыеРеквизиты.Добавить("ПрофильРаспределения");
	КонецЕсли; 
		
	бит_Бюджетирование.ПроверитьОбязательныеРазрезыСтатейОборотов(ЭтотОбъект, "БДДС", Отказ);
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаполнитьПроверяемыеРеквизиты(ЭтотОбъект,ПроверяемыеРеквизиты);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(),Неопределено);
	
	Если ЗначениеЗаполнено(Сценарий) Тогда
		ИзменениеСценария(Ложь);
	КонецЕсли; 													   
	
	ИмяСправочникаСценарии = бит_ОбщегоНазначения.ПолучитьИмяСправочникаСценарииБюджетирования();
	СценарийФАКТ 		   = Справочники[ИмяСправочникаСценарии].ФАКТ;
	
	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		ВалютаДокумента      = Константы.ВалютаРегламентированногоУчета.Получить();
		КурсДокумента        = 1;
		КратностьДокумента   = 1;			
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(СпособАктуализации) Тогда
		СпособАктуализации = Перечисления.бит_СпособыАктуализации.Равномерно;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ДатаНачалаПланирования) Тогда
		ДатаНачалаПланирования = НачалоГода(ТекущаяДатаСеанса());		
	КонецЕсли; 
	
	Если бит_ВизированиеСервер.ПриниматьКУчетуПослеУтверждения(
			Метаданные.Документы.бит_АктуализацияБюджета.ПолноеИмя()) Тогда
		РежимПринятияКУчету = 1;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РежимЗависимыхОборотов) Тогда
		РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.Автоматический;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкаФормы) Тогда
		ДанныеНастройки = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(НастройкаФормы);
		
		Если ДанныеНастройки.КоличествоРазворачивать > 1 Тогда	
			ТекстСообщения = НСтр("ru='Актуализация может быть проведена только по настройкам с одним разворачиваемым измерением.';
									|en='Mainstreaming can be carried out only by setting one resolvable dimension.'");
			ВызватьИсключение ТекстСообщения;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеНастройки.ИмяРазворачивать) Тогда
			ОсновнойРазрез  = "Контроль" + ДанныеНастройки.ИмяРазворачивать;
			ЭтотОбъект[ОсновнойРазрез] = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	СверхБюджета 			= Ложь;
	СписатьЛимиты			= Ложь;
	РучнаяКорректировка 	= Ложь;
	ОтправленНаСогласование = Ложь;
	
	Ответственный = Пользователи.ТекущийПользователь();
	Если бит_ВизированиеСервер.ПриниматьКУчетуПослеУтверждения(
			Метаданные.Документы.бит_АктуализацияБюджета.ПолноеИмя()) Тогда
		РежимПринятияКУчету = 1;
	Иначе
		РежимПринятияКУчету = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Сохраняет дерево данных в хранилище значения.
// 
Процедура СохранитьДерево(ТабДок) Экспорт

	ХранилищеДерева = Новый ХранилищеЗначения(ТабДок,  Новый СжатиеДанных(9));

КонецПроцедуры

// Извлекает дерево данных из хранилища.
// 
// Возвращаемое значение:
//  ТабДок - Табличный документ.
// 
Функция ПолучитьДерево() Экспорт
	
	ТабДок = ХранилищеДерева.Получить();
	
	Если НЕ ТипЗнч(ТабДок) = Тип("ТабличныйДокумент") Тогда
		
		ТабДок = Новый ТабличныйДокумент;
		
	КонецЕсли; 
	
	Возврат ТабДок;
	
КонецФункции

// Процедура сохраняет настройки построителя.
// 
// Параметры:
//  СтруктураНастроек - Структура.
// 
Процедура СохранитьНастройкиПостроителя(СтруктураНастроек)  Экспорт
	
	НастройкиПостроителя = Новый ХранилищеЗначения(СтруктураНастроек, Новый СжатиеДанных(9));
	
КонецПроцедуры

// Функция получает настройки построителя.
// 
// Возвращаемое значение:
//  СтруктураНастроек - Структура.
// 
Функция ПолучитьНастройкиПостроителя() Экспорт
	
	СтруктураНастроек = НастройкиПостроителя.Получить();
	
	Если НЕ ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
	
		СтруктураНастроек = Новый Структура;
	
	КонецЕсли; 
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Процедура обрабатывает изменение валюты документа.
// 
Процедура ИзменениеВалюты() Экспорт
	
	СтрКурса = бит_Бюджетирование.ПолучитьКурсПоСценарию(Сценарий,ВалютаДокумента,Дата);
	КурсДокумента      = СтрКурса.Курс;
	КратностьДокумента = СтрКурса.Кратность;
	
КонецПроцедуры

// Процедура обрабатывает изменение сценария в шапке документа.
// 
Процедура ИзменениеСценария(ОчищатьДанные = Истина)  Экспорт
	
	Если ЗначениеЗаполнено(Сценарий) Тогда
		Если ОчищатьДанные Тогда
			ОчиститьТаблицы();
		КонецЕсли; 
		ВалютаДокумента = Сценарий.Валюта;
		ИзменениеВалюты();
	КонецЕсли; 
	
КонецПроцедуры

// Процедура очищает табличную часть ЗависимыеОбороты.
// 
// Параметры:
//  Нет.
// 
Процедура ОчиститьЗависимыеОбороты() Экспорт

	ЗависимыеОбороты.Очистить();

КонецПроцедуры

// Процедура заполняет табличную часть ЗависимыеОбороты.
// 
// Параметры:
//  Нет.
// 
Процедура ЗаполнитьЗависимыеОбороты() Экспорт

	УстановитьПривилегированныйРежим(Истина);	
	
	ОчиститьЗависимыеОбороты();
	
	Если НЕ ЗначениеЗаполнено(РежимЗависимыхОборотов)
		ИЛИ РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.НеФормировать Тогда
		// Не формируем зависимые обороты.
		Возврат;
	КонецЕсли;
	
	ТаблицаИсточник = БДДС.ВыгрузитьКолонки();
	Для каждого СтрокаТаблицы Из БДДС Цикл
		Если СтрокаТаблицы.Сумма <> 0 ИЛИ СтрокаТаблицы.Количество <> 0  Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаИсточник.Добавить(), СтрокаТаблицы);		
		КонецЕсли;	
	КонецЦикла;
	
	ПараметыЗаполнения = бит_Бюджетирование.НовыеПараметыЗаполненияЗависимыхОборотов();
	ПараметыЗаполнения.ТаблицаИсточник = ТаблицаИсточник;
	ПараметыЗаполнения.ТаблицаПриемник = ЗависимыеОбороты.ВыгрузитьКолонки();
	ПараметыЗаполнения.Сценарий        = Сценарий;
	ПараметыЗаполнения.ВестиПротокол   = Истина;
	
	ЗависимыеОбороты.Загрузить(бит_Бюджетирование.ЗависимыеОборотыПоИсточнику(ПараметыЗаполнения));
	
	бит_Бюджетирование.ОчиститьНеИспользуемыеАналитикиСтатейОборотов(ЗависимыеОбороты);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСтрокуВНаборЗначенийДоступа(ЗначениеДоступа, Таблица)
	
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = ЗначениеДоступа;

КонецПроцедуры

// Процедура очищает табличные части ФактическиеДанные и БДДС.
// 
Процедура ОчиститьТаблицы()
	
	ФактическиеДанные.Очистить();
	БДДС.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли