#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ОтветАссистента(ЗапросПользователя, Знач Ассистент = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ассистент) Тогда
		Ассистент = Справочники.бит_АссистентыИИ.Робот;
	КонецЕсли;
	
	ПараметрыВзаимодействия = бит_ИскусственныйИнтеллектКлиентСервер.НовыеПараметрыВзаимодействияСМоделью();
	ПараметрыВзаимодействия.Ассистент = Ассистент;
	
	ПараметрыАссистента = бит_ИскусственныйИнтеллект.ПараметрыАссистента(Ассистент);
	ЗаполнитьЗначенияСвойств(ПараметрыВзаимодействия, ПараметрыАссистента);
	
	Если ТипЗнч(ЗапросПользователя) = Тип("Строка") Тогда
		ПараметрыВзаимодействия.ЗапросПользователя = ЗапросПользователя;
	Иначе
		ПараметрыВзаимодействия.ЗапросПользователя = СформироватьЗапросПользователя(ЗапросПользователя);
	КонецЕсли;
	
	Результат = бит_ИскусственныйИнтеллектКлиентСервер.ВзаимодействиеСМоделью(ПараметрыВзаимодействия);
	
	Возврат Результат.ОтветСервера;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьЗапросПользователя(ИсходныйЗапрос)
	
	ТаблицаЗапрос = Новый ТаблицаЗначений;
	ТаблицаЗапрос.Колонки.Добавить("Роль", Новый ОписаниеТипов("ПеречислениеСсылка.бит_РолиВзаимодействияИИ"));
	ТаблицаЗапрос.Колонки.Добавить("Содержание", Новый ОписаниеТипов("Строка"));
	ТаблицаЗапрос.Колонки.Добавить("ОписаниеВложения", Новый ОписаниеТипов("Строка"));
	ТаблицаЗапрос.Колонки.Добавить("ДанныеВложения");
	
	РольПоУмолчанию = Перечисления.бит_РолиВзаимодействияИИ.User;
	
	Если ТипЗнч(ИсходныйЗапрос) = Тип("Массив") Тогда
		Для каждого ЭлементЗапроса Из ИсходныйЗапрос Цикл
			СтрокаДиалога = ТаблицаЗапрос.Добавить();
			СтрокаДиалога.Роль = РольПоУмолчанию;
			Если ТипЗнч(ЭлементЗапроса) = Тип("Строка") Тогда
				СтрокаДиалога.Содержание = ЭлементЗапроса;
			ИначеЕсли ТипЗнч(ЭлементЗапроса) = Тип("СправочникСсылка.бит_ШаблоныПромптовИИ") Тогда
				СтрокаДиалога.Содержание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементЗапроса, "Содержание");
			ИначеЕсли ТипЗнч(ЭлементЗапроса) = Тип("Структура") Тогда
				ЗаполнитьЗначенияСвойств(СтрокаДиалога, ЭлементЗапроса);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗапрос);
	
КонецФункции

#КонецОбласти

#КонецЕсли