#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ (СальдоНаКонецДт ИЛИ СальдоНаКонецКт ИЛИ СальдоНаНачалоДт ИЛИ СальдоНаНачалоКт
		ИЛИ ОборотыЗаПериодДт ИЛИ ОборотыЗаПериодКт ИЛИ ОборотыСоСчетамиДт ИЛИ ОборотыСоСчетамиКт) Тогда
		
		ТекстСообщения = НСтр("en='Not specified output data';ru='Не указаны выводимые данные'");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Отчет.СальдоНаНачалоДт",, Отказ);
		
	КонецЕсли;
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаПроверкиЗаполненияОтборов(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли