
&После("ПередЗаписью")
Процедура УВМ_ПередЗаписью(Отказ)
	//Если ЗначениеЗаполнено(Ссылка) Тогда  
	//	// в форме редактируются одновременно реквизиты и данные регистра
	//	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЕстьФорма") И ЭтотОбъект.ДополнительныеСвойства.ЕстьФорма <> Истина Тогда
	//		ПредыдущиеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Должность,Подразделение");
	//		Если ПредыдущиеЗначения.Должность <> Должность ИЛИ ПредыдущиеЗначения.Подразделение <> Подразделение Тогда  
	//			ЭтотОбъект.ДополнительныеСвойства.Вставить("ЗарегистрироватьКВыгрузке", Истина); 
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры


&ИзменениеИКонтроль("ПриЗаписи")
Процедура УВМ_ПриЗаписи(Отказ)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда
		МодульОрганизационнаяСтруктура = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
		МодульОрганизационнаяСтруктура.ШтатноеРасписаниеПриЗаписи(ЭтотОбъект, Отказ);
	КонецЕсли;

	#Вставка
	//++dar 20221128 (11805)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
	|ГДЕ
	|	КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
	|	И КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию = &ДолжностьПоШтатномуРасписанию";
	Запрос.УстановитьПараметр("ДолжностьПоШтатномуРасписанию", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Узел = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоКоду("851027ec-d2af-4799-bb1e-6aeedfaab22f");
	Пока Выборка.Следующий() Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Выборка.Сотрудник);	
	КонецЦикла;  
	// + СБит 2024-03-12
	//Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗарегистрироватьКВыгрузке") И ЭтотОбъект.ДополнительныеСвойства.ЗарегистрироватьКВыгрузке = Истина Тогда
	//	ОбменДаннымиПереопределяемый.ОбновитьИсториюСотрудниковПоШтатке(ЭтотОбъект.Ссылка);
	//КонецЕсли;
	// - СБит 2024-03-12
	УстановитьПривилегированныйРежим(Ложь);
	//--dar 20221128 (11805)
	#КонецВставки
	
КонецПроцедуры

