#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета.
//
// Параметры:
//   Настройки - Коллекция - настройки отчетов и вариантов отчетов конфигурации.
//   ОписаниеОтчета - СтрокаДерева
//                  - ОбъектМетаданных - описание настроек, метаданные или ссылка отчета.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОборотыБюджетаИОстаткиПоСчетам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Выводит обороты по статьям и остатки по счетам бюджетирования за выбранный период.'");

КонецПроцедуры

// Удаляет врианты отчета.
//
Процедура УдалитьВариантыОтчета() Экспорт

	ВариантыОтчетов.УдалитьВариантОтчета("Отчет.бит_ОборотыБюджетаИОстаткиПоСчетам", Неопределено, Неопределено);
	ВариантыОтчетов.СброситьПользовательскиеНастройки(Метаданные.Отчеты.бит_ОборотыБюджетаИОстаткиПоСчетам);

КонецПроцедуры
 
#КонецОбласти

#КонецОбласти

#КонецЕсли