#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	УстановитьЗаголовкиПолейДопИзмерений();

	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ПоБюджету", Истина);
	
	ПараметрСумма 	  		= бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ВыводитьСумму");
	ПараметрКоличество 	  	= бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ВыводитьКоличество");
	ПараметрНарастающийИтог = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "НарастающийИтог");
	ПараметрДополнятьПериод = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ДополнятьПериоды");
	
	бит_ОтчетыБФСервер.НастроитьДинамическийПериод(СхемаКомпоновкиДанных, КомпоновщикНастроек, ПараметрДополнятьПериод.Значение);

	ПараметрыОтчета = Новый Структура; 
	ПараметрыОтчета.Вставить("Сумма", 	 		ПараметрСумма.Значение);
	ПараметрыОтчета.Вставить("Количество", 	 	ПараметрКоличество.Значение);
	ПараметрыОтчета.Вставить("НарастающийИтог", ПараметрНарастающийИтог.Значение);
	
	ПоказателиОтчета = ПоказателиОтчета(ПараметрыОтчета);
	
	ВсеТаблицы = ВсеТаблицы();
	Для каждого Таблица Из ВсеТаблицы Цикл
		бит_ОтчетыБФСервер.НастроитьПоляВыбора(ПоказателиОтчета, Таблица.Выбор.Элементы);
	КонецЦикла;
	
	// Подготовка расшифровки этого же отчета, выполненная средствами платформы.
	Если КомпоновщикНастроек.Настройки.Структура.Количество() <> 0 Тогда
		НовыеНастройкиКД = КомпоновщикНастроек.Настройки;
		ПервыйЭлемент 	 = НовыеНастройкиКД.Структура[0];
		ПервыйЭлементДетальныеЗаписи = 
			(ТипЗнч(ПервыйЭлемент) = Тип("ГруппировкаКомпоновкиДанных") И ПервыйЭлемент.ПоляГруппировки.Элементы.Количество() = 0);
		
		Если НЕ ПервыйЭлементДетальныеЗаписи Тогда
			ДетальныеЗаписи = НовыеНастройкиКД.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			
			Если ТипЗнч(ПервыйЭлемент) = Тип("ТаблицаКомпоновкиДанных") Тогда
				Группировка = ДетальныеЗаписи.Структура.Добавить(Тип("ТаблицаКомпоновкиДанных"));
				Группировка.Выбор.Элементы.Очистить();
			Иначе
				Группировка = ДетальныеЗаписи.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
				Группировка.Выбор.Элементы.Очистить();
				Группировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			КонецЕсли;
			
			бит_ОтчетыБФКлиентСервер.СкопироватьНастройкиКомпоновкиДанных(Группировка, ПервыйЭлемент);
			НовыеНастройкиКД.Структура.Удалить(ПервыйЭлемент);
			
			ДобавитьРесурсыОбороты(Группировка.Выбор);
			бит_ОтчетыБФСервер.НастроитьПоляВыбора(ПоказателиОтчета, Группировка.Выбор.Элементы);
		КонецЕсли;
	КонецЕсли;

	// Виды субконто
	МаксКоличествоСубконто = Метаданные.ПланыСчетов.бит_Бюджетирование.МаксКоличествоСубконто;
	КоличествоСубконто	   = 0;

	ПараметрВидСубконто = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ВидСубконто");
	Если ПараметрВидСубконто <> Неопределено И  ПараметрВидСубконто.Использование Тогда
		
		Если ТипЗнч(ПараметрВидСубконто.Значение) = Тип("ПланВидовХарактеристикСсылка.бит_ВидыСубконтоБюджетирования") Тогда
			КоличествоСубконто = 1;
		ИначеЕсли ТипЗнч(ПараметрВидСубконто.Значение) = Тип("СписокЗначений") Тогда
			КоличествоСубконто = ПараметрВидСубконто.Значение.Количество();
		КонецЕсли;
		
		Если КоличествоСубконто < МаксКоличествоСубконто Тогда 
			ГруппировкаСубконто = Неопределено;
			НайтиГруппировкуПоПолю(КомпоновщикНастроек.Настройки.Структура, "Субконто" + (КоличествоСубконто + 1), ГруппировкаСубконто); 
			
			Если ГруппировкаСубконто <> Неопределено Тогда
				ГруппировкаСубконто.Использование = Ложь;
				Ид = КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(ГруппировкаСубконто);
				ПользовательскаяГруппировка = КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьОбъектПоИдентификатору(Ид);
				Если ПользовательскаяГруппировка <> Неопределено Тогда
					ПользовательскаяГруппировка.Использование = Ложь;
					КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
				КонецЕсли;
				
				ОсновнойНаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Результат;
				Если ТипЗнч(ОсновнойНаборДанных) = Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных") Тогда
					ТекстЗапросаОстатки = ОсновнойНаборДанных.Элементы.Найти("Остатки").Запрос;
					Для НомерСубконто = КоличествоСубконто + 1 По МаксКоличествоСубконто Цикл
						ТекстСубконто 		= ".Субконто" + НомерСубконто + " КАК Субконто" + НомерСубконто + "," + Символы.ПС;
						ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапросаОстатки, "ОстаткиИОбороты" + ТекстСубконто, "");
					КонецЦикла;
					ОсновнойНаборДанных.Элементы.Найти("Остатки").Запрос = ТекстЗапросаОстатки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ДокументРезультат.Очистить();
	
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета 		  = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 		  = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Параметр = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Бюджет");
	Если НЕ ЗначениеЗаполнено(Параметр.Значение) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,НСтр("ru = 'Бюджет'"));	
	    ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьРесурсыОбороты(ТаблицаОбороты)
  
	бит_ОтчетыБФКлиентСервер.ДобавитьВыбранноеПоле(ТаблицаОбороты, "Сумма");
	бит_ОтчетыБФКлиентСервер.ДобавитьВыбранноеПоле(ТаблицаОбороты, "СуммаНарастающийИтог");
	бит_ОтчетыБФКлиентСервер.ДобавитьВыбранноеПоле(ТаблицаОбороты, "Количество");
	бит_ОтчетыБФКлиентСервер.ДобавитьВыбранноеПоле(ТаблицаОбороты, "КоличествоНарастающийИтог");
	
КонецПроцедуры

Функция ПоказателиОтчета(ПараметрыОтчета)

	Сумма			= ПараметрыОтчета.Сумма;
	Количество 		= ПараметрыОтчета.Количество;
	НарастающийИтог = ПараметрыОтчета.НарастающийИтог;
	
	ПоказателиОтчета = Новый Структура;
	
	// Нач. остаток.
	ПоказателиОтчета.Вставить("СуммаНачальныйОстаток", 		Новый Структура("Использование", Сумма));
	ПоказателиОтчета.Вставить("КоличествоНачальныйОстаток", Новый Структура("Использование", Количество));

	// Обороты.
	ПоказателиОтчета.Вставить("Сумма", 					   Новый Структура("Использование", Сумма));
	ПоказателиОтчета.Вставить("СуммаНарастающийИтог",	   Новый Структура("Использование", Сумма И НарастающийИтог));
	ПоказателиОтчета.Вставить("Количество",				   Новый Структура("Использование", Количество));
	ПоказателиОтчета.Вставить("КоличествоНарастающийИтог", Новый Структура("Использование", Количество И НарастающийИтог));

	// Кон. остаток.
	ПоказателиОтчета.Вставить("СуммаКонечныйОстаток", 	   Новый Структура("Использование", Сумма));
	ПоказателиОтчета.Вставить("КоличествоКонечныйОстаток", Новый Структура("Использование", Количество));
	
	Возврат ПоказателиОтчета;
	
КонецФункции

Процедура УстановитьЗаголовкиПолейДопИзмерений()
	
	Префиксы = Новый Массив; 
	Префиксы.Добавить("Остатки");
	Префиксы.Добавить("Обороты");
	
	бит_МеханизмДопИзмерений.НастроитьПоляДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, "Результат", , Префиксы);
	
КонецПроцедуры

Функция ВсеТаблицы()
	
	ВсеТаблицы = Новый Массив;

	// Поиск данных в дереве без рекурсии.
	Стек = Новый Массив; 
	Для каждого ЭлементСтруктуры Из КомпоновщикНастроек.Настройки.Структура Цикл
		
		Стек.Добавить(ЭлементСтруктуры);
	
		Пока Стек.Количество() > 0 Цикл
			
			ТекущийОбъект = Стек.Получить(Стек.ВГраница());
			Стек.Удалить(Стек.ВГраница());
			
			Если ТипЗнч(ТекущийОбъект) = Тип("ТаблицаКомпоновкиДанных") Тогда
				ВсеТаблицы.Добавить(ТекущийОбъект);
			ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") Тогда
				Для каждого Элемент Из ТекущийОбъект.Структура Цикл
					Стек.Добавить(Элемент);
				КонецЦикла; 
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
	Возврат ВсеТаблицы;
	
КонецФункции

Процедура НайтиГруппировкуПоПолю(Группировки, ИмяПоля, НайденнаяГруппировка)
	
	Для каждого Группировка Из Группировки Цикл
		Если ТипЗнч(Группировка) = Тип("ТаблицаКомпоновкиДанных") Тогда
			
			НайтиГруппировкуПоПолю(Группировка.Строки, ИмяПоля, НайденнаяГруппировка);
			Если НайденнаяГруппировка <> Неопределено Тогда
				Возврат;
			КонецЕсли;
			НайтиГруппировкуПоПолю(Группировка.Колонки, ИмяПоля, НайденнаяГруппировка);
			Если НайденнаяГруппировка <> Неопределено Тогда
				Возврат;
			КонецЕсли; 
			
		ИначеЕсли ТипЗнч(Группировка) = Тип("ГруппировкаКомпоновкиДанных") Тогда
			
			Если Группировка.ПоляГруппировки.Элементы.Количество() 
				И Группировка.ПоляГруппировки.Элементы[0].Поле = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
				НайденнаяГруппировка = Группировка;
				Возврат;
			КонецЕсли;
			
			НайтиГруппировкуПоПолю(Группировка.Структура, ИмяПоля, НайденнаяГруппировка);
			
			Если НайденнаяГруппировка <> Неопределено Тогда
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

УстановитьЗаголовкиПолейДопИзмерений();

#КонецОбласти

#КонецЕсли
