
#Область СлужебныйПрограммныйИнтерфейс

Функция АдресМероприятийПрограммыОбучения(Знач ТаблицаПрограммаОбученияРеквизит, Знач ФормаУникальныйИдентификатор) Экспорт
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПрограммаОбученияРеквизит.Выгрузить(, "Мероприятие").ВыгрузитьКолонку("Мероприятие"), ФормаУникальныйИдентификатор);
	
КонецФункции

Функция АдресЦелейРазвития(Знач ТаблицаПрограммаОбученияРеквизит, Знач ФормаУникальныйИдентификатор) Экспорт
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПрограммаОбученияРеквизит.Выгрузить(, "Цель").ВыгрузитьКолонку("Цель"), ФормаУникальныйИдентификатор);
	
КонецФункции

 
#КонецОбласти
