#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда			
		Возврат;			
	КонецЕсли; 
	
	Если НЕ ЭтоГруппа Тогда 
		ПроверитьПередЗаписью(Отказ);
	КонецЕсли; 
		
КонецПроцедуры
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда			
		Возврат;			
	КонецЕсли; 
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ЭтоГруппа Тогда
		Релиз = "";
		Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьПодключениеКВнешнимБазам") Тогда
			ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
			НастройкаПодключения = Неопределено;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЭтоГруппа Тогда 
		// В проверке заполнения используются данные объекта, изменяемые перед записью.
		// Поэтому проверку надо делать перед записью.
	КонецЕсли; 
	
КонецПроцедуры
 
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И Не ЭтоГруппа Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("Основание") И ТипЗнч(ДанныеЗаполнения.Основание) = Тип("СправочникСсылка.бит_Запросы") Тогда
			ЗаполнитьПоЗапросу(ДанныеЗаполнения.Основание);
		КонецЕсли; 	
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.бит_Запросы") Тогда
		ЗаполнитьПоЗапросу(ДанныеЗаполнения);
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
          
// Функция получает настройки источника.
// 
// Возвращаемое значение:
//  СтруктураНастроек - Структура.
// 
Функция ПолучитьНастройкиИсточника() Экспорт

	СтруктураНастроек = НастройкиПостроителя.Получить();
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Процедура сохраняет настройки источника.
// 
// Параметры:
//  СтруктураНастроек - Структура.
// 
Процедура СохранитьНастройкиИсточника(СтруктураНастроек)  Экспорт

	 НастройкиПостроителя = Новый ХранилищеЗначения(СтруктураНастроек, Новый СжатиеДанных(9));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоЗапросу(ДанныеЗаполнения)

	Если ПустаяСтрока(Наименование) Тогда
		Наименование = Строка(ДанныеЗаполнения);
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_Запросы.Ссылка,
	|	бит_Запросы.Наименование,
	|	бит_Запросы.ТекстЗапроса,
	|	бит_Запросы.ВидИнформационнойБазы,
	|	бит_Запросы.ВидИнформационнойБазы.НастройкаПодключенияПоУмолчанию КАК НастройкаПодключенияПоУмолчанию,
	|	бит_Запросы.Вид
	|ИЗ
	|	Справочник.бит_Запросы КАК бит_Запросы
	|ГДЕ
	|	бит_Запросы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	ТаблицаРеквизитов  = Запрос.Выполнить().Выгрузить();
	Реквизиты = ТаблицаРеквизитов[0];
	
	ВидИнформационнойБазы = Реквизиты.ВидИнформационнойБазы;
	НастройкаПодключения  = Реквизиты.НастройкаПодключенияПоУмолчанию;
	ЗапросБД			  = ДанныеЗаполнения;
	
	Если Реквизиты.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С 
		И ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза Тогда
		
		Построитель = Новый ПостроительОтчета;
		Справочники.бит_ИсточникиДанных.ЗаполнитьПоля(ЭтотОбъект,Построитель);
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПроверитьПередЗаписью(Отказ)
	
	Если ПолучитьФункциональнуюОпцию("бит_ИспользоватьПодключениеКВнешнимБазам") Тогда
		Если НЕ ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза Тогда
			Если НЕ ЗначениеЗаполнено(НастройкаПодключения) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Подключение';en='Connection'"));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "НастройкаПодключения",, Отказ);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	РеквизитыЗапроса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗапросБД, "Вид, ТекстЗапроса");
	Если НЕ РеквизитыЗапроса.Вид = Перечисления.бит_мпд_ВидыЗапросов.ЗапросHTTP Тогда
		
		ПроверитьПередЗаписьюОбщаяПроверка(РеквизитыЗапроса, Отказ);
		
		Если ТипИсточника = Перечисления.бит_ТипыИсточниковДанных.ОтложенныеНалогиМСФО Тогда
			ПроверитьПередЗаписьюОтложенныеНалогиМСФО(Отказ);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПроверитьПередЗаписьюОбщаяПроверка(РеквизитыЗапроса, Отказ)
	
	Если ТипИсточника = Перечисления.бит_ТипыИсточниковДанных.РегламентированнаяОтчетность Тогда		
		Если НЕ ЗначениеЗаполнено(ИмяСлагаемогоРасшифровкиРеглОтчетности) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Имя слагаемого расшифровки регламентированной отчетности';
			                                                                            |en='Name for fiscal reporting breakdown'"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ИмяСлагаемогоРасшифровкиРеглОтчетности",, Отказ);
		КонецЕсли; 
	КонецЕсли; 
	
	СтрокаКонтроль = Поля.Найти(Истина, "Использование");
	Если СтрокаКонтроль = Неопределено Тогда
		Уточнение = НСтр("ru='Должно быть выбрано хотя бы одно поле.';en='at least one field should be chosen.'");	
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список" , "Корректность",,,"Данные", Уточнение);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Поля",, Отказ);
	КонецЕсли; 
	
	// Проверим заполнение параметров запроса.
	Если ЗначениеЗаполнено(ЗапросБД) И НЕ Предопределенный 
		И НЕ бит_ПолучениеДанныхВнешниеИсточникиСервер.ЭтоВнешняяБаза(ВидИнформационнойБазы) Тогда
		
		Параметры = Новый Массив;
		СохраненнаяНастройка = НастройкиПостроителя.Получить();
		
		Если ТипЗнч(СохраненнаяНастройка) = Тип("Структура")  Тогда
			Для Каждого Параметр Из СохраненнаяНастройка.ПараметрыПостроителя Цикл
				Параметры.Добавить(Параметр.Ключ);
			КонецЦикла;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст 	   = РеквизитыЗапроса.ТекстЗапроса;
		ОписаниеПараметров = Запрос.НайтиПараметры();
		ТекстСообщения     = ""; 
		Служебные 		   = бит_МеханизмПолученияДанных.КонструкторПредопределенныхПараметров();
		
		Для каждого ОписаниеПараметра Из ОписаниеПараметров Цикл				
			ИмяПараметра = ОписаниеПараметра.Имя;
			Если Служебные.Найти(ИмяПараметра)<>Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			
			Если Параметры.Найти(ИмяПараметра)=Неопределено Тогда
				ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", ", ") + ИмяПараметра;
			КонецЕсли; 
		КонецЦикла;
		Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
			Уточнение = СтрШаблон(НСтр("ru='Не заданы параметры: ""%1"".';en='Do not set the parameters: ""%1"".'"), ТекстСообщения);
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список" , "Корректность",,,"Параметры",Уточнение);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "ТаблицаПараметры",, Отказ);
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьПередЗаписьюОтложенныеНалогиМСФО(Отказ)
	
	// Соответствие хранит список обязательных полей и признаки того, что они указаны в источнике.
	Служебные = Новый Соответствие;
	Служебные.Вставить("СуммаНУ", Ложь);
	Служебные.Вставить("СуммаМУ", Ложь);
	Служебные.Вставить("СуммаПР", Ложь);
	
	Для каждого СтрокаТаблицы Из Поля Цикл
		Если СтрокаТаблицы.Использование Тогда
			ИмяПоля   = ?(ПустаяСтрока(СтрокаТаблицы.Синоним), "Имя", "Синоним");
			Служебный = Служебные.Получить(СтрокаТаблицы[ИмяПоля]);
			Если Служебный <> Неопределено Тогда
				Если Служебный = Истина Тогда
					Поле = "Поля[%1].%2";
					Поле = СтрШаблон(Поле, Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ="),ИмяПоля);
					Уточнение	   = НСтр("ru='Значение дублируется.';en='Meaning duplicated.'");
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",
										"Корректность", ИмяПоля, СтрокаТаблицы.НомерСтроки, "Данные", Уточнение);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
				Иначе
					Служебные[СтрокаТаблицы[ИмяПоля]] = Истина;
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли; 					
	КонецЦикла;
	
	ТекстСообщения = "";
	Для каждого Элемент Из Служебные Цикл
		Если Элемент.Значение = Ложь Тогда
			ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", ",") + Элемент.Ключ;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
		Уточнение 	   = СтрШаблон(НСтр("ru='Не выбраны обязательные поля: %1';
										|en='Is selected mandatory fields: %1'"), ТекстСообщения);
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список",
							"Корректность",,, "Данные", Уточнение);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Поля",,Отказ);
	КонецЕсли;

КонецПроцедуры
 
#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли