
#Область ПрограммныйИнтерфейс

Функция ВыполнитьВыгрузкуНастроекХраненияСсылочныхДанныхВОбщемМодуле() Экспорт
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
	
	РегистрыСведений.НастройкаПодписиСсылочныхДанных.СохранитьНастройкиВФайл(ВременныйФайл);
	
	ДанныеФайла = Новый ДвоичныеДанные(ВременныйФайл);
	УдалитьФайлы(ВременныйФайл);
	
	Возврат ДанныеФайла;
	
КонецФункции

Процедура ВыполнитьЗагрузкуНастроекХраненияСсылочныхДанныхВОбщемМодуле(Параметры, АдресВХранилище) Экспорт
	
	Результат = РегистрыСведений.НастройкаПодписиСсылочныхДанных.ЗагрузитьНастройкиИзФайла(
		Параметры.УдалитьВсеСуществующие, Параметры.ДанныеФайла);
	
	СтруктураРезультата = Новый Структура("Результат", Результат);
	ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресВХранилище);
	
КонецПроцедуры

Функция ВыполнитьВыгрузкуДополнительныхКолонокСписковЗадач(Колонки) Экспорт
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
	
	Справочники.ДополнительныеКолонкиСписковЗадач.СохранитьКолонкиВФайл(Колонки, ВременныйФайл);
	
	ДанныеФайла = Новый ДвоичныеДанные(ВременныйФайл);
	УдалитьФайлы(ВременныйФайл);
	
	Возврат ДанныеФайла;
	
КонецФункции

#КонецОбласти


