
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоздатьДинамическиеРеквизиты();
	ЗаполнитьРеквизитыФормыИзПараметров();
	
	Если ЗначениеЗаполнено(СтатьяОборотов) Тогда
		Элементы.СтатьяОборотов.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект, "Бюджет");
	
	Если ЗначениеЗаполнено(ТекущийБюджет) Тогда
		ЗаполнитьДанныеБюджета();
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБюджет

&НаКлиенте
Процедура БюджетВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "БюджетРегистратор" Тогда
		СтандартнаяОбработка = Ложь;
		СтрокаБюджета        = Бюджет.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если СтрокаБюджета <> Неопределено Тогда
			ДокументДвижения = СтрокаБюджета.Регистратор;
			Если ЗначениеЗаполнено(ДокументДвижения) Тогда
				ПоказатьЗначение(,ДокументДвижения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Бюджет.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено
		И ТекущиеДанные.ТолькоЧтение Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ         = Истина;
		ТекущиеДанные = Элементы.Бюджет.ТекущиеДанные;
		НоваяСтрока   = Бюджет.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
		НоваяСтрока.Регистратор  = Неопределено;
		НоваяСтрока.Статус       = Неопределено;
		НоваяСтрока.ТолькоЧтение = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСохранитьИзменения(Команда)
	
	Результат = РезультатРедактированияБюджета();
	Если Результат.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьДинамическиеРеквизиты()
	
	ДобавляемыеРеквизиты = Новый Массив;
	Аналитики            = бит_МеханизмДопИзмерений.Аналитики(Истина);
	
	Для каждого ОписаниеАналитки Из Аналитики Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ОписаниеАналитки.Имя, ОписаниеАналитки.ТипЗначения,,
															ОписаниеАналитки.Синоним));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ОписаниеАналитки.Имя, ОписаниеАналитки.ТипЗначения, "Бюджет",
															ОписаниеАналитки.Синоним));
	КонецЦикла;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для каждого ОписаниеАналитки Из Аналитики Цикл
		ЭлементФормы = Элементы.Добавить(ОписаниеАналитки.Имя, Тип("ПолеФормы"), Элементы.ГруппаАналитики);
		ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным    = ОписаниеАналитки.Имя;
		ЭлементФормы.ТолькоПросмотр = Истина;
		
		ЭлементФормы = Элементы.Добавить("Бюджет" + ОписаниеАналитки.Имя, Тип("ПолеФормы"), Элементы.Бюджет);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным = "Бюджет." + ОписаниеАналитки.Имя;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыФормыИзПараметров()
	
	РеквизитыФормы = ПолучитьРеквизиты();
	Для каждого Реквизит Из РеквизитыФормы Цикл
		ИмяРеквизита = Реквизит.Имя;
		Если Параметры.Свойство(ИмяРеквизита) Тогда
			ЭтотОбъект[ИмяРеквизита] = Параметры[ИмяРеквизита];
		КонецЕсли;
	КонецЦикла;
	
	Периодичность    = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "бит_Периодичность");
	ПараметрыДаты    = Перечисления.бит_ПериодичностьПланирования.ПараметрыДатыПоПериодичности(Период, Периодичность);
	ПериодСтрокой    = ПредставлениеПериода(ПараметрыДаты.ДатаНачала, ПараметрыДаты.ДатаОкончания);
	ОкончаниеПериода = ПараметрыДаты.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	УстановитьВидимостьАналитикТЧПоСтатье();
	Аналитики = ПараметризируемыеАналитики();
	Для каждого Аналитика Из Аналитики Цикл
		Если Аналитика = "СтатьяОборотов" Тогда
			Продолжить;
		КонецЕсли;
		АналитикаЗаполнена = ЗначениеЗаполнено(ЭтотОбъект[Аналитика]);
		Элементы[Аналитика].Видимость = АналитикаЗаполнена;
		Если АналитикаЗаполнена Тогда
			Элементы["Бюджет" + Аналитика].Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметризируемыеАналитики()
	
	Аналитики = бит_МеханизмДопИзмерений.Аналитики();
	
	Аналитики.Добавить("СтатьяОборотов");
	Аналитики.Добавить("ЦФО");
	Аналитики.Добавить("Организация");
	
	Возврат Аналитики;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьАналитикТЧПоСтатье()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ИСТИНА КАК Учет_ЦФО,
	|	ЛОЖЬ КАК Обязательный_ЦФО,
	|	ИСТИНА КАК Учет_Организация,
	|	ЛОЖЬ КАК Обязательный_Организация,
	|	СтатьиОборотов.Учет_Количество КАК Учет_Количество,
	|	ЛОЖЬ КАК Обязательный_Количество,
	|	СтатьиОборотов.Учет_Сумма КАК Учет_Сумма,
	|	ЛОЖЬ КАК Обязательный_Сумма,
	|	&ПараметрыУчетаПолей
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
	|ГДЕ
	|	СтатьиОборотов.Ссылка = &Ссылка";
	
	ПоляВыборки      = Новый Массив;
	ШаблонУчета      = "СтатьиОборотов.Учет_%1 КАК Учет_%1";
	ШаблонЗаполнения = "СтатьиОборотов.Обязательный_%1 КАК Обязательный_%1";
	Аналитики        = бит_МеханизмДопИзмерений.Аналитики();
	Для каждого Аналитика Из Аналитики Цикл
		ПоляВыборки.Добавить(СтрШаблон(ШаблонУчета, Аналитика));
		ПоляВыборки.Добавить(СтрШаблон(ШаблонЗаполнения, Аналитика));
	КонецЦикла;
	ТекстВыборкиПолей = СтрСоединить(ПоляВыборки, "," + Символы.ПС + Символы.Таб);
	ТекстЗапроса      = СтрЗаменить(ТекстЗапроса, "&ПараметрыУчетаПолей", ТекстВыборкиПолей);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", СтатьяОборотов);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыУчетаСтатьи = РезультатЗапроса.Выбрать();
	ПараметрыУчетаСтатьи.Следующий();
	
	УчетКоличества = ПараметрыУчетаСтатьи.Учет_Количество;
	УчетСуммы      = ПараметрыУчетаСтатьи.Учет_Сумма;
	
	ПрефиксКонтроляЗаполнения = "Обязательный_";
	ОбязательныеАналитики     = Новый СписокЗначений;
	Для каждого КолонкаРезультата Из РезультатЗапроса.Колонки Цикл
		ИмяКолонкиРезультата = КолонкаРезультата.Имя;
		ИмяАналитики         = СтрЗаменить(ИмяКолонкиРезультата, ПрефиксКонтроляЗаполнения, "");
		Если СтрНачинаетсяС(ИмяКолонкиРезультата, ПрефиксКонтроляЗаполнения)
			И ПараметрыУчетаСтатьи[ИмяКолонкиРезультата] = Истина
			И ПараметрыУчетаСтатьи["Учет_" + ИмяАналитики] = Истина Тогда
			ПредставлениеАналитки = "";
			ЭлементФормы          = Элементы.Найти("Бюджет" + ИмяАналитики);
			Если ЭлементФормы <> Неопределено Тогда
				ПредставлениеАналитки = ЭлементФормы.Заголовок;
			КонецЕсли;
			Если ПустаяСтрока(ПредставлениеАналитки) Тогда
				ПредставлениеАналитки = ИмяАналитики;
			КонецЕсли;
			ОбязательныеАналитики.Добавить(ИмяАналитики, ПредставлениеАналитки);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ПолеБюджета Из Элементы.Бюджет.ПодчиненныеЭлементы Цикл
		ИмяПоля      = ПолеБюджета.Имя;
		ИмяПоля      = СтрЗаменить(ИмяПоля, "Бюджет", "");
		ИмяПоляУчета = "Учет_" + ИмяПоля;
		
		Если РезультатЗапроса.Колонки.Найти(ИмяПоляУчета) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеБюджета.АвтоОтметкаНезаполненного = (ОбязательныеАналитики.НайтиПоЗначению(ИмяПоля) <> Неопределено);
		
		ВедетсяУчет  = ПараметрыУчетаСтатьи[ИмяПоляУчета];
		Если НЕ ВедетсяУчет Тогда
			ПолеБюджета.Видимость = Ложь;
			Продолжить;
		КонецЕсли;
		ПолеБюджета.Видимость = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл отсутствие интерфейсной разметки в типовом модуле.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Бюджет");
	// АПК:277-вкл
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Бюджет.ТолькоЧтение", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона"      , ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл отсутствие интерфейсной разметки в типовом модуле.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "БюджетКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "БюджетСумма");
	// АПК:277-вкл
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Бюджет.Количество", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Бюджет.Сумма", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
КонецПроцедуры

&НаСервере
Функция РезультатРедактированияБюджета()
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаБюджета", "");
	Результат.Вставить("Отказ",          Ложь);
	
	Отказ = Ложь;
	ТаблицаБюджета = Бюджет.Выгрузить();
	ТаблицаБюджета.Колонки.Добавить("СтатьяОборотов", Новый ОписаниеТипов("СправочникСсылка.бит_СтатьиОборотов"));
	
	Аналитики = ПараметризируемыеАналитики();
	Для каждого Аналитика Из Аналитики Цикл
		ЗначениеАналитикиВШапке = ЭтотОбъект[Аналитика];
		Если ЗначениеЗаполнено(ЗначениеАналитикиВШапке) Тогда
			ТаблицаБюджета.ЗаполнитьЗначения(ЗначениеАналитикиВШапке, Аналитика);
		КонецЕсли;
	КонецЦикла;
	
	ТекстОшибкиПоказателя = НСтр("ru='Укажите количество или сумму'");
	Если НЕ УчетКоличества Тогда
		ТекстОшибкиПоказателя = НСтр("ru='Не заполнено поле сумма'");
	ИначеЕсли НЕ УчетСуммы Тогда
		ТекстОшибкиПоказателя = НСтр("ru='Не заполнено поле количество'");
	КонецЕсли;
	
	Для Индекс = 1 - ТаблицаБюджета.Количество() По 0 Цикл
	    СтрТаблицы = ТаблицаБюджета.Получить(-Индекс);
	    Если СтрТаблицы.ТолькоЧтение Тогда
	        ТаблицаБюджета.Удалить(СтрТаблицы);
		Иначе
			Для каждого ЭлементАналитики Из ОбязательныеАналитики Цикл
				ОбязательнаяАналитика = ЭлементАналитики.Значение;
				Если НЕ ЗначениеЗаполнено(СтрТаблицы[ОбязательнаяАналитика]) Тогда
					ТекстСообщения = НСтр("ru='Не заполнено поле %1'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, ЭлементАналитики.Представление); 
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				КонецЕсли;
			КонецЦикла;
			Если СтрТаблицы.Количество = 0 И СтрТаблицы.Сумма = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибкиПоказателя,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Отказ Тогда
		Результат.Отказ = Истина;
		Возврат Результат;
	КонецЕсли;
	
	ТаблицаБюджета.Колонки.Удалить("ТолькоЧтение");
	
	ТаблицаБюджета.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата", , ,
											  Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаБюджета.ЗаполнитьЗначения(Период, "Период");
	
	ПоместитьВоВременноеХранилище(ТаблицаБюджета, АдресБюджет);
	
	Результат.ТаблицаБюджета = АдресБюджет;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеБюджета()
	
	ПараметрыЗаполнения = Обработки.бит_СводныйБюджет.НовыеПараметрыЗаполненияДанныхБюджетаПоАналитикам();
	
	ПараметрыЗаполнения.НачалоПериода    = Период;
	ПараметрыЗаполнения.ОкончаниеПериода = ОкончаниеПериода;
	ПараметрыЗаполнения.Сценарий         = Сценарий;
	ПараметрыЗаполнения.Валюта           = Валюта;
	
	Аналитики = ПараметризируемыеАналитики();
	Для каждого Аналитика Из Аналитики Цикл
		ЗначениеАналитикиВШапке = ЭтотОбъект[Аналитика];
		Если ЗначениеЗаполнено(ЗначениеАналитикиВШапке) Тогда
			ПараметрыЗаполнения.Аналитики.Вставить(Аналитика, ЗначениеАналитикиВШапке);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаРедактирования = ПолучитьИзВременногоХранилища(АдресБюджет);
	Если ТипЗнч(ТаблицаРедактирования) = Тип("ТаблицаЗначений") Тогда
		ПараметрыЗаполнения.ТаблицаИзменений = ТаблицаРедактирования;
	КонецЕсли;
	
	Обработки.бит_СводныйБюджет.ЗаполнитьДанныеБюджетаПоАналитикам(Бюджет, ПараметрыЗаполнения);
	
КонецПроцедуры

#КонецОбласти