#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
	
// Процедура выполняет первоначальное заполнение видов оформляемых документов.
//
Процедура НачальноеЗаполнение() Экспорт
	
	КлассификаторТаблица = ТаблицаКлассификатора();
	Для Каждого СтрокаКлассификатора Из КлассификаторТаблица Цикл
		ЭлементСправочникаПоОписанию(СтрокаКлассификатора);
	КонецЦикла;	
	
КонецПроцедуры

Функция ЭлементСправочникаПоОписанию(СтрокаКлассификатора)
	
	СправочникСсылка = Справочники.бит_ум_ОснованияДляРаботыБезРазрешения.НайтиПоНаименованию(СтрокаКлассификатора.Наименование, Истина);
	
	Если СправочникСсылка.Пустая() Тогда
		
		СправочникОбъект = Справочники.бит_ум_ОснованияДляРаботыБезРазрешения.СоздатьЭлемент();
		СправочникОбъект.Наименование = СтрокаКлассификатора.Наименование;
		СправочникОбъект.НаименованиеПолное = СтрокаКлассификатора.НаименованиеПолное;
		СправочникОбъект.Записать();
		
	КонецЕсли;
		
КонецФункции

Функция ТаблицаКлассификатора()
	
	КлассификаторXML = Справочники.бит_ум_ОснованияДляРаботыБезРазрешения.ПолучитьМакет("ОснованияДляРаботыБезРазрешения").ПолучитьТекст();
	Возврат ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
КонецФункции	

#КонецОбласти

#КонецЕсли