#Область УчетМигрантов

&НаСервере
// + 20240126 БаринбергГМ (165376)
// - 20240126 БаринбергГМ (165376)
Функция ПолучитьКонтролирующийОрган(фОрганизация, фДата, фДействия) Экспорт
	
	фРезультат = Справочники.бит_ум_ГосударственныеОрганы.ПустаяСсылка();
	ИспользоватьОтборПоДействиям = Ложь;
	
	Если ТипЗнч(фДействия) = Тип("Массив") и ЗначениеЗаполнено(фДействия) Тогда
		ИспользоватьОтборПоДействиям = Истина;
	Иначе
		фДействия = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	бит_ум_КонтролирующиеОрганыПоОрганизациямСрезПоследних.КонтролирующийОрган КАК КонтролирующийОрган
	               |ИЗ
	               |	РегистрСведений.бит_ум_КонтролирующиеОрганыПоОрганизациям.СрезПоследних(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И ВЫБОР
	               |					КОГДА &ИспользоватьОтборПоДействиям
	               |						ТОГДА Действие В (&мДействия)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ) КАК бит_ум_КонтролирующиеОрганыПоОрганизациямСрезПоследних";
	Запрос.УстановитьПараметр("Организация", фОрганизация);
	Запрос.УстановитьПараметр("Дата", фДата);
	Запрос.УстановитьПараметр("мДействия", фДействия);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоДействиям", ИспользоватьОтборПоДействиям);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		фРезультат = Выборка.КонтролирующийОрган;
	КонецЕсли;
	
	Возврат фРезультат;
	
КонецФункции

#КонецОбласти