
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
		 	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = Параметры.Ключ.Пустая();
	Если ЭтоНовый И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.ТекстШаблона = "{{ПорядковыйНомер}}";
	КонецЕсли;
	
	ДоступныеОбъекты = Новый Массив;
	// ++ ЕРП
	//ДоступныеОбъекты.Добавить(Метаданные.Документы.бит_ПроектДоговора);
	// -- ЕРП
	ДоступныеОбъекты.Добавить(Метаданные.Справочники.бит_ВнутренниеДокументы);
	ДоступныеОбъектыСистемы = Справочники.бит_ОбъектыСистемы.ОбъектыСистемыПоОбъектамМетаданных(ДоступныеОбъекты);
	Элементы.ОбъектСистемы.СписокВыбора.ЗагрузитьЗначения(ДоступныеОбъектыСистемы);
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПроверитьДоступностьИзмененияШаблона();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ОбъектСистемыПриИзмененииНаСервере()
	
	// ++ ЕРП
	//ОбъектСистемы = Объект.ОбъектСистемы;
	//Если ОбъектСистемы.Пустая() Тогда
	//	Объект.ИмяРеквизита = "";
	//	Возврат;
	//КонецЕсли;
	//
	//Если ОбъектСистемы =
	//	Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(Метаданные.Документы.бит_ПроектДоговора) Тогда
	//	Объект.ИмяРеквизита = "НомерДоговора";
	//ИначеЕсли ОбъектСистемы =
	//	Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(Метаданные.Справочники.бит_ВнутренниеДокументы) Тогда
	//	Объект.ИмяРеквизита = "Номер";
	//КонецЕсли;
	Объект.ИмяРеквизита = "Номер";
	// -- ЕРП
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСистемыПриИзменении(Элемент)
	
	ОбъектСистемыПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВставитьШаблон(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектСистемы", Объект.ОбъектСистемы);
	ПараметрыФормы.Вставить("ШаблонСсылка" , Объект.Ссылка);
	ПараметрыФормы.Вставить("ТипШаблона"   , Объект.ТипШаблона);
	
	Оповещение = Новый ОписаниеОповещения("ВыборШаблонаЗавершение", ЭтотОбъект);
    ОткрытьФорму("Справочник.бит_ШаблоныЗаполненияРеквизитов.Форма.ФормаШаблона", ПараметрыФормы,,,,,Оповещение);
	
КонецПроцедуры

// Процедура обработчик оповещения "ВыборШаблонаЗавершение".
// 
// Параметры:
// СтрокаРезультат - Произвольный.
// ДополнительныеДанные - Структура.
// 
&НаКлиенте 
Процедура ВыборШаблонаЗавершение(СтрокаРезультат, ДополнительныеДанные) Экспорт
	
	Если СтрокаРезультат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаРезультат <> Неопределено Тогда
		
		Элементы.ТекстШаблона.ВыделенныйТекст = СтрокаРезультат;
		Модифицированность 				= Истина;
		ОбновитьОтображениеДанных();
		
	КонецЕсли;                               
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьШаблон(Команда)
	
	Если Модифицированность Тогда
		ТекстСообщения = НСтр("ru='Шаблон не записан. Проверка не выполнена.';en='Pattern is recorded. Check is not performed.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	Результат = ПроверитьШаблонСервер(Объект.Ссылка);	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Результат);		 
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьШаблон(Команда)
	
	Если Модифицированность Тогда
		ТекстСообщения = НСтр("ru='Сохраните шаблон перед назначением.';
							  |en='Save the template before assigning.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Шаблон", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.бит_НазначениеШаблоновЗаполненияРеквизитов.ФормаЗаписи", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьДоступностьИзмененияШаблона()

	Если Объект.ТипШаблона = Перечисления.бит_ТипыШаблоновЗаполненияРеквизитов.Номер Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Шаблон", Объект.Ссылка);
		Запрос.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НазначениеШаблонов.Шаблон
		|ИЗ
		|	РегистрСведений.бит_НазначениеШаблоновЗаполненияРеквизитов КАК НазначениеШаблонов
		|ГДЕ
		|	НазначениеШаблонов.Шаблон = &Шаблон
		|";
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			
			Элементы.ТипШаблона.ТолькоПросмотр    = Истина; 			
			Элементы.ОбъектСистемы.ТолькоПросмотр = Истина;
			Элементы.ИмяРеквизита.ТолькоПросмотр  = Истина;
		    Элементы.Периодичность.ТолькоПросмотр = Истина;
			Элементы.ТекстШаблона.ТолькоПросмотр  = Истина;
			
			Элементы.ГруппаЗапрещеноИзменение.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьШаблонСервер(Знач ШаблонСсылка)
	
	Результат = Справочники.бит_ШаблоныЗаполненияРеквизитов.ПроверитьШаблон(ШаблонСсылка);
	
	Возврат Результат;		 
	
КонецФункции

#КонецОбласти

