#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.Параметр.СписокВыбора.ЗагрузитьЗначения(Параметры.СписокПараметров);
	Элементы.Параметр.СписокВыбора.СортироватьПоПредставлению();
	
	ПараметрПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПараметрПриИзменении(Элемент)
	
	ПараметрПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ЗначениеЗначениеПолей = "";
	ЗначениеЗначение = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если ПолеАдреса Тогда
		
  		ВидКонтактнойИнформацииАдреса = Новый Структура;
    	ВидКонтактнойИнформацииАдреса.Вставить("Тип",
			ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	    ВидКонтактнойИнформацииАдреса.Вставить("ТолькоНациональныйАдрес", Истина);
	    ВидКонтактнойИнформацииАдреса.Вставить("ВключатьСтрануВПредставление", Ложь);
    	ВидКонтактнойИнформацииАдреса.Вставить("СкрыватьНеактуальныеАдреса", Ложь);		
		
		ПараметрыОткрытия = УправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
			ВидКонтактнойИнформацииАдреса,
			?(ЗначениеЗаполнено(ЗначениеЗначение), ЗначениеЗначение, ЗначениеЗначениеПолей),
			Значение);
		ПараметрыОткрытия.Заголовок = Строка(Параметр);
		
		УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия, Элемент);		
		
	ИначеЕсли ЭтоДлиннаяСтрока Тогда
		
		СтандартнаяОбработка = Ложь;
		Оповещение = Новый ОписаниеОповещения("ЗначениеНачалоВыбораЗавершение", ЭтотОбъект);
		ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, Значение, 
			Строка(Параметр));
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбораЗавершение(Знач ВведенныйТекст, Знач ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Значение = ВведенныйТекст;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ПолеАдреса Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Значение = ВыбранноеЗначение.Представление;
	ЗначениеЗначениеПолей = ВыбранноеЗначение.КонтактнаяИнформация;
	ЗначениеЗначение = ВыбранноеЗначение.Значение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Результат = Новый Структура("Параметр, Значение, ЗначениеЗначениеПолей, ЗначениеЗначение");
	ЗаполнитьЗначенияСвойств(Результат, ЭтотОбъект);
	Оповестить("ВыбраноЗначениеПараметраДляЗаполнения", Результат, ЭтотОбъект.ВладелецФормы);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)

	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПараметрПриИзмененииНаСервере()

	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметр, "ТипЗначения, ПолеАдреса");
	
	Если ЗначениеЗаполнено(ЗначенияРеквизитов.ТипЗначения) 
		И ЗначенияРеквизитов.ТипЗначения.Типы().Количество() = 1
		И ЗначенияРеквизитов.ТипЗначения.Типы()[0] = Тип("Строка")
		И ЗначенияРеквизитов.ТипЗначения.КвалификаторыСтроки.Длина > 10 Тогда
		ЭтоДлиннаяСтрока = Истина;
	Иначе
		ЭтоДлиннаяСтрока = Ложь;
	КонецЕсли;
	ПолеАдреса = ЗначенияРеквизитов.ПолеАдреса;
	
	Если ПолеАдреса Тогда
		Элементы.Значение.КнопкаВыбора = Истина;
		Элементы.Значение.РедактированиеТекста = Ложь;
	ИначеЕсли ЭтоДлиннаяСтрока Тогда
		Элементы.Значение.КнопкаВыбора = Истина;
		Элементы.Значение.РедактированиеТекста = Истина;
	Иначе	
		Элементы.Значение.КнопкаВыбора = Неопределено;
		Элементы.Значение.РедактированиеТекста = Истина;
	КонецЕсли;
	
	Значение = ?(ЗначениеЗаполнено(ЗначенияРеквизитов.ТипЗначения), ЗначенияРеквизитов.ТипЗначения.ПривестиЗначение(), Неопределено);
	
	Элементы.Значение.Доступность = ЗначениеЗаполнено(Параметр);
	Элементы.Заполнить.Доступность = ЗначениеЗаполнено(Параметр);
	
КонецПроцедуры

#КонецОбласти