#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Задает расширенные настройки отчета.
//
// Параметры:
//   Настройки - Коллекция - настройки отчетов и вариантов отчетов конфигурации.
//	 ОписаниеОтчета - СтрокаДерева
//                  - ОбъектМетаданных - описание настроек, метаданные или ссылка отчета.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РеестрыПлатежей");
	ОписаниеВарианта.Описание = НСтр("ru = 'Выводит состав ""Реестра платежей"" с реквизитами заявок и платежных позиций.'");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.бит_КомИнт_Казначейство.Подсистемы.Отчеты, "");
	ОписаниеВарианта.Включен = Истина;     
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьЗаголовкиПолейДопИзмерений(СхемаКомпоновкиДанных) Экспорт
	
	бит_МеханизмДопИзмерений.НастроитьПоляДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, "ОсновнойНабор");
	
КонецПроцедуры

// Поключаемая из СКД функция. Число параметров больше 4, что бы не усложнять вызов из СКД.
//
Функция Получатель(ФормаОплаты, ХозОперация, ПеречислениеСотрудникуЧерезБанк, ФизЛицо, Контрагент) Экспорт
	
	// См. Документы.бит_кзн_ПлатежнаяПозиция.ФормаДокумента.УправлениеФормой.
	ПараметрыОтображения = бит_Казначейство.ПодготовитьПараметрыВидимости(ХозОперация);
	ОплатаЧерезБанк		 = (ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные);
	
	Если ПараметрыОтображения.ЕстьКонтрагент ИЛИ (ОплатаЧерезБанк И ПеречислениеСотрудникуЧерезБанк) Тогда
		Получатель = Контрагент;
	ИначеЕсли ПараметрыОтображения.ФизЛицо Тогда	
	    Получатель = ФизЛицо;
	Иначе
		Получатель = Контрагент;
	КонецЕсли;

	Возврат Получатель;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Код процедур и функций

#КонецОбласти

#КонецЕсли