#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	УстановитьЗаголовкиПолейДопИзмерений();
	ПодготовитьНаборыСхемыПоПараметрам();
		
	ДокументРезультат.Очистить();
	
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();     	
	КомпоновщикМакета 		  = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 		  = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьЗаголовкиПолейДопИзмерений()
	
	Отчеты.бит_РеестрыПлатежей.УстановитьЗаголовкиПолейДопИзмерений(СхемаКомпоновкиДанных);
	
КонецПроцедуры

Процедура ПодготовитьНаборыСхемыПоПараметрам()
	
	ИсточникДанныхТабло = Константы.бит_кзн_РежимОтображенияОстатковДС.Получить();
	Если НЕ ЗначениеЗаполнено(ИсточникДанныхТабло) Тогда
		ИсточникДанныхТабло = Перечисления.бит_кзн_РежимОтображенияОстатковДС.ДанныеРегУчета;
	КонецЕсли;

	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	ПоказыватьПланПоступления = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(НастройкиКомпоновкиДанных, "ПоказыватьСуммуПланируемыхПоступлений").Значение;
	
	Наборы = СхемаКомпоновкиДанных.НаборыДанных;
	НаборУчетныеДанные = СхемаКомпоновкиДанных.НаборыДанных.Найти("УчетныеДанные");
	Если НаборУчетныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ИсточникДанныхТабло = Перечисления.бит_кзн_РежимОтображенияОстатковДС.ДанныеРегУчета Тогда
		НаборУпрВыписка = НаборУчетныеДанные.Элементы.Найти("УпрВыписка");
		Если НаборУпрВыписка <> Неопределено Тогда
			НаборУчетныеДанные.Элементы.Удалить(НаборУпрВыписка);	
		КонецЕсли;
		Если НЕ ПоказыватьПланПоступления Тогда
			НаборПланПоступления = НаборУчетныеДанные.Элементы.Найти("ПланПоступления");
			Если НаборПланПоступления <> Неопределено Тогда
				НаборУчетныеДанные.Элементы.Удалить(НаборПланПоступления);	
			КонецЕсли;
		КонецЕсли;
	Иначе	
		НаборРеглУчет = НаборУчетныеДанные.Элементы.Найти("РеглУчет");
		Если НаборРеглУчет <> Неопределено Тогда
			НаборУчетныеДанные.Элементы.Удалить(НаборРеглУчет);	
		КонецЕсли;
		Если НЕ ПоказыватьПланПоступления Тогда
			НаборПланПоступления = НаборУчетныеДанные.Элементы.Найти("ПланПоступления");
			Если НаборПланПоступления <> Неопределено Тогда
				НаборУчетныеДанные.Элементы.Удалить(НаборПланПоступления);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация
	
	УстановитьЗаголовкиПолейДопИзмерений();

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'; en = 'Invalid call of the object on the client.'");
#КонецЕсли
