#Область ОписаниеПеременных

&НаКлиенте
Перем ОбновитьИнтерфейс;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаКадровыйУчет.Видимость = бит_ум_УчетМигрантовПовтИсп.ЭтоУМ();
	
	Элементы.КадровыйУчетУпрощенный.Доступность = 
		ПравоДоступа("Изменение", Метаданные.Константы.ИспользоватьКадровыйУчет);
		
	Элементы.КадровыйУчетПолный.Доступность = 
		ПравоДоступа("Изменение", Метаданные.Константы.ИспользоватьКадровыйУчет);
		
	Элементы.СформироватьКадровыеДокументы.Доступность = 
		ПравоДоступа("Изменение", Метаданные.Константы.ИспользоватьКадровыйУчет);
		
	КадровыйУчет = Константы.ИспользоватьКадровыйУчет.Получить();
	
	Элементы.бит_ум_ВидАдресаПостоянногоМестаЖительства.Доступность = 
		ПравоДоступа("Изменение", Метаданные.Константы.бит_ум_ВидАдресаПостоянногоМестаЖительства);
	Элементы.бит_ум_ВидАдресаМестаПребывания.Доступность = 
		ПравоДоступа("Изменение", Метаданные.Константы.бит_ум_ВидАдресаМестаПребывания);
	Элементы.бит_ум_ВидАдресаФактическогоОрганизации.Доступность = 
		ПравоДоступа("Изменение", Метаданные.Константы.бит_ум_ВидАдресаФактическогоОрганизации);
	Элементы.бит_ум_ВидАдресаМестонахожденияОрганизации.Доступность = 
		ПравоДоступа("Изменение", Метаданные.Константы.бит_ум_ВидАдресаМестонахожденияОрганизации);
	Элементы.бит_ум_ВыводитьИндексВАдресе.Доступность = 
		ПравоДоступа("Изменение", Метаданные.Константы.бит_ум_ВыводитьИндексВАдресе);
	Элементы.бит_ум_УчетПатентов.Доступность = 
		ПравоДоступа("Изменение", Метаданные.Константы.бит_ум_УчетПатентов);
	Элементы.бит_ум_УчетПатентов.Доступность = 
		ПравоДоступа("Изменение", Метаданные.Константы.бит_ум_ПредупреждениеОбОплатеПатентов);
		
	Если бит_ум_УчетМигрантовПовтИсп.ЭтоУМ() Тогда	
		УправлениеФормой(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КадровыйУчетУпрощенныйПриИзменении(Элемент)
	
	ПриИзмененииНастройкиКадровыйУчет();
	
КонецПроцедуры

&НаКлиенте
Процедура КадровыйУчетПолныйПриИзменении(Элемент)
	
	ПриИзмененииНастройкиКадровыйУчет();

КонецПроцедуры

&НаКлиенте
Процедура бит_ум_ВидАдресаПостоянногоМестаЖительстваПриИзменении(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ум_ВидАдресаПостоянногоМестаЖительстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Родитель",
		ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочникФизическиеЛица"));
	ПараметрыОтбора.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("ТекущаяСтрока", НаборКонстант[Элемент.Имя]); 
	ОткрытьФорму("Справочник.ВидыКонтактнойИнформации.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура бит_ум_ВидАдресаМестаПребыванияПриИзменении(Элемент)

	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ум_ВидАдресаМестаПребыванияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("ТекущаяСтрока", НаборКонстант[Элемент.Имя]); 
	ОткрытьФорму("Справочник.ВидыКонтактнойИнформации.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ум_ВидАдресаФактическогоОрганизацииПриИзменении(Элемент)

	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ум_ВидАдресаФактическогоОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Родитель",
		ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочникОрганизации"));
	ПараметрыОтбора.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("ТекущаяСтрока", НаборКонстант[Элемент.Имя]); 
	ОткрытьФорму("Справочник.ВидыКонтактнойИнформации.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ум_ВидАдресаМестонахожденияОрганизацииПриИзменении(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ум_ВидАдресаМестонахожденияОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	СписокРодителей = Новый Массив;
	СписокРодителей.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочникОрганизации"));
	СписокРодителей.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочникФизическиеЛица"));
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Родитель", СписокРодителей);
	ПараметрыОтбора.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("ТекущаяСтрока", НаборКонстант[Элемент.Имя]); 
	ОткрытьФорму("Справочник.ВидыКонтактнойИнформации.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ум_ВыводитьИндексВАдресеПриИзменении(Элемент)

	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ум_ПереноситьДанныеПаспортаИзДокументовФизЛицПриИзменении(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ум_УчетПатентовПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 1, Истина);
	ОбновитьИнтерфейс = Истина;

	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ум_ВариантНаименованияОрганизацииДляФормОтчетностиПриИзменении(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ум_ВидТелефонаОрганизацииПриИзменении(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ум_ВидТелефонаОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Родитель",
		ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочникОрганизации"));
	ПараметрыОтбора.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("ТекущаяСтрока", НаборКонстант[Элемент.Имя]); 
	ОткрытьФорму("Справочник.ВидыКонтактнойИнформации.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ум_ПредупреждениеОбОплатеПатентовПриИзменении(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьКадровыеДокументы(Команда)
	
	СформироватьКадровыеПриказы();			
	ПоказатьОповещениеПользователя(НСтр("ru='Формирование кадровых документов завершено.'"), "e1cib/list/ЖурналДокументов.КадровыеДокументы", "Журнал ""Приемы, увольнения, переводы""");
	
	УправлениеФормой(ЭтаФорма);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.СформироватьКадровыеДокументы.Видимость = Форма.КадровыйУчет = 1 И НеобходимоСформироватьКадровыеПриказы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНастройкиКадровыйУчет()
	
	НаборКонстант.ИспользоватьКадровыйУчет = 
		?(КадровыйУчет = 1, Истина, Ложь);
	
	КонстантаИмя = ПриИзмененииНастройкиКадровыйУчетНаСервере();
	
	УправлениеФормой(ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Если КонстантаИмя <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииНастройкиКадровыйУчетНаСервере()

	РеквизитПутьКДанным = "НаборКонстант.ИспользоватьКадровыйУчет";
	
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат КонстантаИмя;

КонецФункции

&НаСервереБезКонтекста
Процедура СформироватьКадровыеПриказы()
	
	ОбщегоНазначения.ОбщийМодуль("УчетЗарплаты").СформироватьКадровыеПриказы();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитаНаКлиенте(Элемент, ОбновлятьИнтерфейс = Истина)
	
	КонстантаИмя = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	КонецЕсли;
	
	Если КонстантаИмя <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервереБезКонтекста
Функция НеобходимоСформироватьКадровыеПриказы()
	
	Возврат ОбщегоНазначения.ОбщийМодуль("УчетЗарплаты").НеобходимоСформироватьКадровыеПриказы();
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти