
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПеренестиНастройкиПриПереходеНаНовуюВерсию() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УдалитьНазначениеПравилЗаполненияПриТрансляции.Источник КАК Источник,
	|	УдалитьНазначениеПравилЗаполненияПриТрансляции.Приемник КАК Приемник,
	|	УдалитьНазначениеПравилЗаполненияПриТрансляции.ОбъектСистемы КАК ОбъектСистемы,
	|	УдалитьНазначениеПравилЗаполненияПриТрансляции.ПравилоЗаполнения КАК ПравилоЗаполнения,
	|	УдалитьНазначениеПравилЗаполненияПриТрансляции.Приоритет КАК Приоритет,
	|	УдалитьНазначениеПравилЗаполненияПриТрансляции.УсловиеВхождения = ЗНАЧЕНИЕ(Перечисление.бит_Кроме.Кроме) КАК ЭтоИсключение,
	|	ДАТАВРЕМЯ(2000, 1, 1) КАК Период,
	|	ПРЕДСТАВЛЕНИЕ(УдалитьНазначениеПравилЗаполненияПриТрансляции.Источник) КАК ИсточникПредставление,
	|	ПРЕДСТАВЛЕНИЕ(УдалитьНазначениеПравилЗаполненияПриТрансляции.Приемник) КАК ПриемникПредставление,
	|	ПРЕДСТАВЛЕНИЕ(УдалитьНазначениеПравилЗаполненияПриТрансляции.ОбъектСистемы) КАК ОбъектСистемыПредставление
	|ИЗ
	|	РегистрСведений.бит_УдалитьНазначениеПравилЗаполненияПриТрансляции КАК УдалитьНазначениеПравилЗаполненияПриТрансляции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции КАК НазначениеПравилЗаполненияПолейПриТрансляции
	|		ПО УдалитьНазначениеПравилЗаполненияПриТрансляции.ОбъектСистемы = НазначениеПравилЗаполненияПолейПриТрансляции.ОбъектСистемы
	|			И УдалитьНазначениеПравилЗаполненияПриТрансляции.ПравилоЗаполнения = НазначениеПравилЗаполненияПолейПриТрансляции.ПравилоЗаполнения
	|ГДЕ
	|	НазначениеПравилЗаполненияПолейПриТрансляции.ПравилоЗаполнения ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка			 = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			НаборЗаписей = РегистрыСведений.бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектСистемы.Установить(Выборка.ОбъектСистемы);
			НаборЗаписей.Отбор.ПравилоЗаполнения.Установить(Выборка.ПравилоЗаполнения);
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
						
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ПредставлениеЗаписи = НСтр("ru = '%1, %2, %3'");
			ПредставлениеЗаписи = СтрШаблон(ПредставлениеЗаписи, Выборка.ИсточникПредставление, 
									Выборка.ПриемникПредставление, Выборка.ОбъектСистемыПредставление);
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать запись: %1 по причине:
									|%2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПредставлениеЗаписи, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.РегистрыСведений.бит_УдалитьНазначениеПравилЗаполненияПриТрансляции,, ТекстСообщения);
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли