#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьНастройкиПоУмолчаниюПриОбновлении3_1_54_2() Экспорт
	
	Менеджер = РегистрыСведений.бит_НастройкиДоступностиЭлементов.СоздатьМенеджерЗаписи();
	Менеджер.ОбъектСистемы                    = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(
													Метаданные.Справочники.бит_ВнутренниеДокументы.ПолноеИмя());
	Менеджер.Пользователь                     = Справочники.ГруппыПользователей.ВсеПользователи;
	Менеджер.ИмяЭлементаУправления            = "ФормаКомандаОтправитьНаСогласование";
	Менеджер.НеБлокироватьСостояниемДокумента = Истина;
	Менеджер.ВидЭлемента                      = Перечисления.бит_ВидыЭлементовУправления.КнопкаФормы;
	Менеджер.Записать();
	
КонецПроцедуры

Процедура ЗаменитьНастройкиДополнительныхРеквизитовПриОбновлении3_1_44_5() Экспорт
	
	ПрефиксИмениСлужебногоПоляДопРеквизита = "ДополнительныйРеквизитЗначение_";
	ДлинаИмениСлужебногоПоляДопРеквизита   = 104;
	ЧислоЗначимыхСимволовДопРеквизита      = 36; // GUID свойства.
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_НастройкиДоступностиЭлементов.ОбъектСистемы КАК ОбъектСистемы,
	|	бит_НастройкиДоступностиЭлементов.Пользователь КАК Пользователь,
	|	бит_НастройкиДоступностиЭлементов.ПроизвольноеУсловие КАК ПроизвольноеУсловие,
	|	бит_НастройкиДоступностиЭлементов.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.бит_НастройкиДоступностиЭлементов КАК бит_НастройкиДоступностиЭлементов
	|ГДЕ
	|	бит_НастройкиДоступностиЭлементов.ИмяЭлементаУправления ПОДОБНО ""ДополнительныйРеквизитЗначение%""";
	ВыборкаИзмерений = Запрос.Выполнить().Выбрать();
	Пока ВыборкаИзмерений.Следующий() Цикл
		БылиПравки = Ложь;
		Набор = РегистрыСведений.бит_НастройкиДоступностиЭлементов.СоздатьНаборЗаписей();
		Набор.Отбор.ОбъектСистемы.Установить(ВыборкаИзмерений.ОбъектСистемы);
		Набор.Отбор.Пользователь.Установить(ВыборкаИзмерений.Пользователь);
		Набор.Отбор.ПроизвольноеУсловие.Установить(ВыборкаИзмерений.ПроизвольноеУсловие);
		Набор.Отбор.Статус.Установить(ВыборкаИзмерений.Статус);
		Набор.Прочитать();
		Для каждого ЗаписьНабора Из Набор Цикл
			ИмяЭлемента = ЗаписьНабора.ИмяЭлементаУправления;
			Если СтрНачинаетсяС(ИмяЭлемента, ПрефиксИмениСлужебногоПоляДопРеквизита)
				И СтрДлина(ИмяЭлемента) = ДлинаИмениСлужебногоПоляДопРеквизита Тогда
				ИмяЭлемента = ПрефиксИмениСлужебногоПоляДопРеквизита + Прав(ИмяЭлемента, ЧислоЗначимыхСимволовДопРеквизита);
				ЗаписьНабора.ИмяЭлементаУправления = ИмяЭлемента;
				БылиПравки = Истина;
			КонецЕсли;
		КонецЦикла;
		Если БылиПравки Тогда
			Попытка
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор);
			Исключение
				ТекстОшибки = НСтр("ru='Не удалось заменить настройку доступности для дополнительного реквизита %1 по причине:
									|%2'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, ВыборкаИзмерений.ОбъектСистемы,
							ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление ИБ'", ОбщегоНазначения.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли