
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекущийОбъект") Тогда
		// АПК:68-выкл
		ОбработкаОбъект = ДанныеФормыВЗначение(Параметры.ТекущийОбъект, Тип("ОбработкаОбъект.бит_РабочееМестоКазначея"));
		// АПК:68-вкл
		ЗначениеВДанныеФормы(ОбработкаОбъект, Объект);
	КонецЕсли; 
	
	Параметры.Свойство("ЦветБудущий",	  ЦветБудущий);
	Параметры.Свойство("ЦветВыходной",	  ЦветВыходной);
	Параметры.Свойство("ЦветЗапрет",	  ЦветЗапрет);
	Параметры.Свойство("ЦветИнформация",  ЦветИнформация);
	Параметры.Свойство("ЦветОперативный", ЦветОперативный);
	Параметры.Свойство("ЦветПрошлый",	  ЦветПрошлый);

	ЗаполнитьСписокРежимовОстатков(); 
		
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
	ИспользоватьПрогнозы = ПолучитьФункциональнуюОпцию("бит_кзн_ИспользоватьПрогнозыПлатежейИПоступлений");
	
	Если НЕ ИспользоватьПрогнозы Тогда
		Элементы.ВыводитьПрогнозыПлатежей.Видимость = Ложь;
		Объект.ВыводитьПрогнозыПлатежей 			= Ложь;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОстатковПриИзменении(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОстатковОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Информация".
// 
&НаКлиенте
Процедура ЦветИнформацияПриИзменении(Элемент)
	
	ИзменениеЦвета("ЦветИнформация");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Прошлое".
// 
&НаКлиенте
Процедура ЦветПрошлыйПриИзменении(Элемент)
	
	ИзменениеЦвета("ЦветПрошлое");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Настоящее".
// 
&НаКлиенте
Процедура ЦветОперативныйПриИзменении(Элемент)
	
	ИзменениеЦвета("ЦветНастоящее");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Будущее".
// 
&НаКлиенте
Процедура ЦветБудущийПриИзменении(Элемент)
	
	ИзменениеЦвета("ЦветБудущее");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Запрет".
// 
&НаКлиенте
Процедура ЦветЗапретПриИзменении(Элемент)
	
	ИзменениеЦвета("ЦветЗапрет");
	
КонецПроцедуры

//  Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Выходной".
//
&НаКлиенте
Процедура Цвет_ВыходнойПриИзменении(Элемент)
	
	ИзменениеЦвета("ЦветВыходной");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "ВысотаПанелиТекущийДокумент".
// 
&НаКлиенте
Процедура ВысотаПанелиТекущийДокументПриИзменении(Элемент)
	
	ИзмененРазмер = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - действие команды "Готово".
// 
&НаКлиенте
Процедура Готово(Команда)
	
	Отказ = Ложь;
	Если НЕ ПериодЗаполненПравильно(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;

	Если Объект.ВыделятьВыходныеДни И НЕ ЗначениеЗаполнено(Объект.Календарь) Тогда
		ТекстПояснения = НСтр("ru = 'Для выделения выходных дней необходимо выбрать производственный календарь.'");
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ" , "КОРРЕКТНОСТЬ", НСтр("ru = 'Календарь'"),,, ТекстПояснения);	
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Календарь", "Объект", Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 

	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("Команда"      ,"ОК");
	ПараметрыПередачи.Вставить("ТекущийОбъект",Объект);
	ПараметрыПередачи.Вставить("ИзмененЦвет"  ,ИзмененЦвет);
	ПараметрыПередачи.Вставить("ИзмененРазмер",ИзмененРазмер);
	
	ПараметрыПередачи.Вставить("ЦветБудущий",	  ЦветБудущий);
	ПараметрыПередачи.Вставить("ЦветВыходной",	  ЦветВыходной);
	ПараметрыПередачи.Вставить("ЦветЗапрет",	  ЦветЗапрет);
	ПараметрыПередачи.Вставить("ЦветИнформация",  ЦветИнформация);
	ПараметрыПередачи.Вставить("ЦветОперативный", ЦветОперативный);
	ПараметрыПередачи.Вставить("ЦветПрошлый",	  ЦветПрошлый);
	
	Закрыть(ПараметрыПередачи);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьПериод(Команда)
	
	Диалог 			= Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период 	= Новый СтандартныйПериод(Объект.НачалоПериода, КонецДня(Объект.КонецПериода));
	РезультатВыбора = Ждать Диалог.РедактироватьАсинх();

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НачалоПериода = РезультатВыбора.ДатаНачала;
	Объект.КонецПериода  = РезультатВыбора.ДатаОкончания;
	
	УстановитьЗаголовокФормы(ЭтотОбъект); 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокФормы(Форма)

	Объект = Форма.Объект;

	ЗаголовокОтчета = СтрШаблон(НСтр("ru='Рабочее место казначения %1';en='Workplace kaznacheniya %1'"),
		БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(Объект.НачалоПериода, Объект.КонецПериода));
	
	Форма.Заголовок = ЗаголовокОтчета;

КонецПроцедуры

// Процедура заполняет список режимов остатков.
// 
// Параметры:
//  Нет
// 
&НаСервере
Процедура ЗаполнитьСписокРежимовОстатков()

КонецПроцедуры // ЗаполнитьСписокРежимовОстатков()

// Процедура обрабатывает изменение цвета. 
// Выполняется преобразование в HEX и установка полученного значения в реквизит объекта.
// 
// Параметры:
//  ИмяРеквизитаЦвет  - Строка
// 
&НаСервере
Процедура ИзменениеЦвета(ИмяРеквизитаЦвет)

	ИзмененЦвет = Истина;
	
КонецПроцедуры // ИзменениеЦвета()

&НаКлиентеНаСервереБезКонтекста 
Функция ПериодЗаполненПравильно(Форма)

	ЗаполненПравильно = Истина;
	
	Объект = Форма.Объект;
	Отказ  = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Начало периода';en='Start of the period'")); 
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
		#Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
		#КонецЕсли
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Конец периода';en='End of period'")); 
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.КонецПериода",, Отказ);
		#Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.КонецПериода",, Отказ);
		#КонецЕсли
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		Если Объект.КонецПериода < Объект.НачалоПериода Тогда
			ТекстСообщения = НСтр("ru='Период указан неверно. Дата начала больше даты окончания.';
								  |en='The period is incorrect. The start date is greater than the end date.'");
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
			#Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли; 
	
	Если Отказ Тогда
		ЗаполненПравильно = Ложь;
	КонецЕсли;  
	
	Возврат ЗаполненПравильно; 

КонецФункции // ПериодЗаполненПравильно()

#КонецОбласти